{"text": "Name: helen helen E-Mail: helen.helen@gmail.com Address: Hong Kong, Hong Kong Github: https://github.com/helen LinkedIn: https://linkedin.com/helen Phone No. 192094070156 \t\t\t\t\t\t\t Summary of Qualifications: Over Seven (7+) years ofIT Industry experience with Configuration Management, Build, Deploy, Release Management and Quality Assurance. Expertise in DevOps, Release Engineering, Configuration Management, Cloud Infrastructure, Automation. It includes Amazon Web Services (AWS), Ant, Apache Maven, Jenkins, SVN, GitHub, Serena Products, ClearCase, Build Forge, Serena PVCS, CVS, Tomcat, JBoss, and Linux etc. Experience in implementing and monitoring High Availability environment using Veritas Cluster Server, Sun Cluster, Redhat Cluster, HP Service Guard, HP Insight Manager, Smart Start and HACMP. Configured and used Jumpstart, Kickstart, Ignite and NIM to install OS. Extensive experience in design and architecture of application using MQSI (WMB), MQ series (WMQ). Proficient in Networking, configuring TCP/IP, DNS, NFS, NIS, NIS+, SAMBA, LDAP, SSH, SSL, SFTP, SMTP, SNMP. Experience in OpenStack cloud, integrating it with Puppet. Implemented Continuous Integration and deployment using various CI Tools like Jenkins, Puppet, Chef, Hudson, Bamboo and Sonatype Nexus. Experience in Setuptrust between on premise and cloud server using ACS and ADFS in Azure.  Top Quality architecture and development skills using latest technologies including Java, C++, EJB, RMI, JMS, wireless technologies and in-depth knowledge of J2EE. Experience with Build Management tools Ant and Maven for writing build.xmls and pom.xmls respectively. Strong Experience in LINUX/UNIX Administration, Shell Scripting with expertise in Red-hat Linux 4/56, Solaris 8/9/10, VMware ESXi 4.5/5.5, WebLogic and WebSphere. Expertise in branching, tagging and maintaining the version across the environments using SCM tools like Subversion (SVN), CVS andon UNIX and Windows environment. Good understanding of the principles and best practices of Software Configuration Management (SCM) in Agile, Scrum, and Waterfall methodologies. Excellent understanding of source-code management principles and systems, particularly GIT.In-depth knowledge of computer applications and scripting like Shell, Python & Perl. Excellent knowledge of Amazon EC2, Amazon S3, Amazon Elastic Load Balancing and other services of the AWS family. Experience in Configuring and deploying to Application servers WebLogicandWebSphere. Experience in using Tomcat web servers for deployments and for hosting tools. Hands-on experience creating and managing the various development and build platforms, and deployment strategies. Ability in managing all aspects of the software configuration management process including code compilation, packaging, deployment, release methodology and application configurations. Experience working with Oracle 9i/10g. Prior coding skills in PL/SQL, triggers, stored procedures, design and creation of databases, schemas, tables and indexes. Closely worked with development, QA and other teams to ensure automated test efforts are tightly integrated with the build system and in fixing the error while doing the deployment and building.  Extensive experience in all phases of Software Development Life Cycle with emphasis in Designing, Developing, Implementation, Deployment and Support of distributed enterprise scalable, secure and transactional J2EE applications. Worked with different Bug tracking tools like JIRA, Rally, Remedy, HP Quality Centerand IBM Clear Quest. Team player with excellent interpersonal skills, self-motivated, dedicated and understanding the demands of 24/7 system maintenance and has good customer support experience. Technical Competencies: Operating System \tWindows 98/XP/NT/2000/2003/2008, UNIX, LINUX, Mac OS Database\tOracle 9i/10g, SQL SERVER, MySQL, DB2 Versioning Tools \tCVS, Subversion, Clear case, GIT  CI Tools \tHudson, Jenkins, Bamboo, Chef, Puppet Build   Tools\tANT, MAVEN, Makefile Bug Tracking Tools \tJIRA, Rally, Remedy and IBM Clear Quest Languages\tC++, PL/SQL and Java/J2EE Scripting\tShell scripting, Python, Perl scripting Web Technologies\tHTML, Java Script, XML, Servlets, JDBC, JSP Web/App servers \tWeb logic, Web Sphere, Apache Tomcat, JBOSS Professional Experience: Client: \t\tTIAA-CREF, Charlotte, NC\t\t\t\t\t\tJan’ 2015 – Present Role: \t\tSr. DevOps Engineer Roles & Responsibilities: Develop and implement an automated Linux infrastructure using Puppet. Wrote Puppet models for installing and managing java versions. Wrote a Python plugin for collected to write metrics to statsd. Implemented automated local user provisioning in instances created in Openstack cloud.  Deploying the Openstack components on multimode with high availability environment.\\ Worked with the Docker to package an application with all of its dependencies into a standardized unit for Software Development. Participated in the release cycle of the product which involved environments like Development QA UAT and Production. As Jr. Architect& Sr. server developer I was actively involved in architecting various Business Layer and Data Management components of this multi-tiered web based system over J2EE architecture, EAI and TIBCO. Regular Build jobs are initiated using the Continuous Integration tool with Jenkins. Wrote Puppet manifests for deploying, configuring, InstallSheild and managing collected for metric collection and monitoring. Jumpstart & Kick-start OS integration, DDNS, PXE, DHCP, SMTP, Samba, NFS, FTP, SSH, LDAP integration. Coordinate/assist developers with establishing and applying appropriate branching, labeling/naming conventions using GIT source control. Configured Jenkins for doing the build in all the non-production and production environments. Worked extensively on CVS, Subversion as Version Control. Handled Jira tickets for SCM Support activities. Creating user level of access for related GitHub project directories to the code changes.  Performed all necessary day-to-day Subversion/GIT support for different projects. Used Artifactory repository tool for maintaining the Java based release code packages. Provided the assistance for the smooth phase of Release for the Emergency and Expedite Releases by getting the Director Level Approval and coordinating with different teams. Written Shell scripts to apply the Integration label to all the files which needs manual labelling of files. Deployed Puppet, Puppet Dashboard and Puppet DBfor configuration management to existing infrastructure. Owner of Jenkins, GitHub, Puppet, Artifactory, and all internal build systems for the core development team on an enterprise-level Java-based cloud orchestration/automation tool. Strictly enforced ITIL process while pushing builds and deployments to prod and pre-prod environments. Write an install script in Ruby using all of the extra helper functions from Chef Configured the user’s accounts for Continuous Integration – Jenkins, Nexus and Sonar. Gathered all the stakeholder approvals, necessary signoffs while acting as a release manager for two development teams. Environment: Java/J2ee, Puppet, OpenStack, Ant, Maven, Subversion, UNIX, SVN, Bamboo, Nexus Pro, Sonar, Jira, Remedy, Python, Ruby, Shell Scripts, Tomcat, Jenkins Client: \t\tVerizon Wireless, Irving, TX\t\t\t\t\tOct’ 2013 to Dec’ 2014 Role: \t\tSr. DevOps Engineer Roles & Responsibilities: Created and deployed builds to different environments based on requests. Designed and implemented Subversion and GIT metadata including elements, labels, attributes, triggers and hyperlinks. Wrote Puppet models for installing and managing java versions. Chef to aid with our deployment process, and migrating in‐house systems to Amazon Cloud Services. Converted and automated builds using Maven and Ant. Scheduled automated nightly builds using Jenkins. Microsoft Windows Azure queues, storage, database, C# 4.5, jQuery: Product owner for internal 10th Magnitude application development framework. Helped developers and other project teams to set views and environments. Created and applied Baselines and Labels for each Build Artifacts. Created UCM Projects, Development and Integration views for Development and Integration Streams. Using Chef and AWS allowed me to reduce costs for the department and eliminate unwarranted resources. Automated provisioning of cloud infrastructure with Chef. Replaced existing manual deployment and management processes with Chef and AWS OpsWorks stacks across 4 product platforms. Imported and managed multiple corporate applications into GitHub code management repo. Setting up network environments using TCP/IP, NIS, NFS, DNS, SNMP agents, DHCP and Proxy. Created and maintained documentation of build and release processes and application configuration to comply with audit requirements and Industry best practices. Managed GIT and SVN as Source Control Systems Created Pre-operation and Post-operation triggers in UCM. Developed scripts using PERL, BASH and BATCH files for Automation of Activities and builds. Provided level one support for build troubleshooting and production issues. Responsible for the EBFs (Emergency Bug Fixes) to push them to different environments and monitor their status. Performed merges for each build from Development Branch to Integration Branch. Created the Release Management plan with the implementation schedule. Conducted Sanity Testing to verify for the right build is deployed. 24/7 on call support for emergency site maintenance and immediate build and install requests. Worked with the automated scripts for the Build and Deployment of the applications. Responsible for Build and Install Schedules using Unix Cron jobs. Maintained configuration files for each application for the purpose of build and install on different environments. Used Puppet for Continuous Delivery. Managed CI and CD process and delivered all application in rpms. Created the build instructions docs and install (deploy) instructions docs for each application for different environments. Environment: Java/J2ee, Eclipse, Chef, AWS (Amazon Web Services) Ant, Maven, Subversion, SVN, GIT, Python, Ruby, Nexus, Sonar, Jenkins, PERL, BASH, Solaris, UNIX Client: \t\tAmerican National Insurance, Galveston, TX\t\t\tMar’2012 to Oct’ 2013 Role: \t\tBuild &Release Engineer Roles & Responsibilities: Release Engineer for a team that involved different development teams and multiple simultaneous software releases. Designing and implementing for fully automated server build management, monitoring and deployment By Using DevOps Technologies like Chef. Responsible for design and maintenance of the Subversion/GIT, Stash Repositories, views, and the access control strategies. Used ANT and Python scripts to automate the Build and deployment process.  Used maven for few modules. DevOps for load balanced environments & Multi-regional server environments (AWS Regional nodes   managed via Chef Roles and Ohai Attributes) Monitoring each service deployment, and validating the services across all environments.  Deployed J2EE applications to Application servers in an Agile continuous integration environment and also automated the whole process. Build scripts using ANT and MAVEN build tools in Jenkins, Sonar to move from one environment to other environments. Involved in build and deploying SCA modules in IBM Web sphere Process server. Worked on Java/J2ee deployments in web sphere. Prepared Migration logs for every release and maintained the data accuracy. Maintained Defect Fix Deployments and documented the deployed files in the appropriate Environment Migration log. Working with Change Order with current release and implement them in the Production. Created Branches, Tags for each release and particular environments. Merged the branches after the Code Freeze. Created the Deployment notes along with the Local SCM team and released the Deployment instructions to Application Support. Environment: Java/J2ee, Eclipse, Chef, Ant, Maven, Jenkins, GIT, Subversion, WebSphere Application Server (WAS), Apache, PERL, BASH, UNIX, Python Client: \t\tHumana, Herndon VA\t\t\t\t\t\tJan’2011– Mar’2012 Role: \t\tBuild &Release Engineer Roles & Responsibilities: Coordinated with developers, Business Analyst and Mangers to make sure that code is deployed in the Production environment. Deployed legacy applications into JBoss application server. Created shell scripts to automate the server bounce activities for JBoss application server. Documented the deployment process (Migration Doc) of code to production on an Excel Sheet. Installed Jira and confluence on Tomcat server. Processed all the requests from the Developers through Remedy which is an IT process management tool and responsible for managing the code in Subversion (version controlling). Provided Build Scripts for Database Projects to Deploy DB and populate Test data in DB for various environments. Experience in setting Maven repository and pom.xml, Ant build.xml and managed the maven artifacts using Nexus repository. Edited and Modified POM.xml for a few applications that used Maven. Used Ant scripts to perform the builds and wrote a few build.xmls for application development teams. Environment: Java, Hudson, JBoss, Subversion, Ant, Maven, Jira, Shell Scripting Client: \t\tTSX, Bangalore, India                               \t\t\t\tAug’2008 – Dec 2010 Role: \t\tBuild &Release Engineer Roles & Responsibilities: Implement, maintain and support reliable, timely and reproducible builds for project teams. Maintained build related scripts developed in ANT, Python and shell. Modified build configuration files including Ant’s build.xml. Worked with development team to migrate Ant scripts to Maven. I Developed HTML parser and the build the DOM tree with that. Experienced in authoring pom.xml files, performing releases with the Maven release plugin, Mavenization of Java projects and managing Maven repositories. Researched and implemented code coverage and unit test plug-ins with Maven/Hudson. Used Maven dependency management system to deploy snapshot and release artifacts to Nexus to share artifacts across projects.  Configured and maintained Hudson to implement the CI process and integrated the tool with Ant and Maven to schedule the builds. Work with development/testing, deployment, systems/infrastructure and project teams to ensure continuous operation of build and test systems. Environment:  Ant, Java/J2EE, Maven, Hudson, Linux, Solaris, Python, WebSphere, Shell scripting, Nexus. Educational Qualifications: Bachelor’s Degree inComputer Science Engineering(Graduated in 2007) Osmania University, AP, India  References:\tProvided upon request…"}