{"text": "Name: helen helen E-Mail: helen.helen@gmail.com Address: São Paulo, Brazil Github: https://github.com/helen LinkedIn: https://linkedin.com/helen Phone No. 962938091152 Certified Salesforce.Com Consultant (ADM-201, DEV-401) with 7 years of extensive and progressive IT experience in the areas ofAnalysis, Design, Developing, Testing and Implementation of enterprise level applications including over 4 + years of Techno- Functional experience in salesforce.com with proficiency as a Salesforce Developer & Administrator. PROFESSIONAL SUMMARY: • Hands on experience in all stages of software development life cycle(SDLC), ability to independently perform development, testing, implementation and documentation. • Proven Interpersonal, Communicational, Organizational and Project Management skills. •Proficient in dealing with the functionalities related to the Service cloud  and Sales cloud. Also Expertise in Functional and Service cloud Console. • Good Knowledge on Salesforce Lightning experience. Worked on various lightning components for developing dynamic web apps for mobiles and desktop devices. •Experienced using Salesforce Lightning UI. Created Lightning Apps combining Lightning Design System, Lightning App Builder and Lightning Component features. •Salesforce.com Configuration and Design of Service Cloud, Sales Cloud and Force.com solutions, with an emphasis on Service Cloud solutions. • Expertise in SFDC Administrative tasks like creating Objects, Fields, Users, Roles, Profiles, Page Layouts, Approvals, Workflows, Validation rules, Reports, Dashboards, Sandboxes, Permission Sets. • Experience in working on security and sharing rules at object, field and record level for different users at different levels of organization.  • Expertise in developing UI components using Visualforce pages, Visualforce components, Apex controllers, HTML, Java script, CSS, XML. • Expertise in developing and deploying Apex Classes, Controllers, Triggers, Schedulers, Batch Apex, Test Classes, Web services (SOAP, REST), Partner, Enterprise, Apex and Tooling WSDL. • Experience in writing complex SOQL, SOSL queries. • Expertise in Data Migration using Import wizard, workbench and other data integration tools like Jitter bit, Apex Data Loader using BULK API. • Expertise in process integration (Synchronous and Asynchronous) with other platforms using SOAP and REST Web services and Enterprise tools. • Excellent communication and inter-personal skills, accustomed to working in both large and small team environments. EDUCATION SUMMARY:   Bachelors Degree in Electronics and Communication Engineering from  JNTU, India Masters Degree in Computer Information Science from Southern Arkansas University, Arkansas.      TECHNICAL SUMMARY: PROFESSIONAL EXPERIENCE OPTIV - Denver, CO                                                                                                         Dec 17-till date Salesforce Developer and Administrator Description:  Optiv Inc, is an privately owned IT company headquartered at Denver,CO. It is the world's largest  company, the largest provider of information security, and the largest provider of cyber security services in the United States. .  Responsibilities: Created custom objects,custom fields, page layouts, search layouts to organize fields, custom links, custom labels, related lists, and other components on record pages. Configured Salesforce knowledge to manage the creation, publication, and maintenance of knowledge articles. Setup the Salesforce Console for Service and to help support reps work more efficiently. Designed and deployed Custom tabs, validation rules, Approval Processes and Auto-Response Rules for automating business logic. Created workflows using process builder,time-dependent workflows and defined related tasks, email alerts, and field updates. Extensive Experience working in implementation of Case Management in Service Cloud Console. Developed  APEX classes, APEX triggers, APEX test classes, Custom Controllers and Controller extensions. Also modified existing triggers and classes as per the standards to meet the business requirements. Used Force.com web service API for implementing WSDL in the application for access to data from external systems and web sites. Created Lightning Components and Server-Side Controllers to meet the business requirements. Experienced in migrating the standard and custom objects in Salesforce Classic to lightning experience. Used field level security along with page layouts to manage access to certain fields. Deployed the code from sandbox to the production using changesets, Force.com IDE. Worked on various Salesforce.com standard objects like Accounts, Contacts, Cases, Leads and Reports. Created email templates and implemented send mail functionality by using future method in Apex classes and optimized the code to reduce the processing time. Modified all the test classes as per the best pratcies to achieve good organizational test coverage. Used DataLoader to perform bulk insert, update and deletion of records by importing the data from .csv files. Developed Batch apex and schedule apex classes as per the business scenarios. Environment: SalesForce.com, Apex classes, Triggers and workflows, Visual Force, Data Loader, Email services, AppExchange,Mulesoft,Force.com IDE. CNET GLOBAL SOLUTIONS- Richardson, Texas.                                                        Jan 17- Nov 17 Salesforce Developer and Administrator Description:  CNET Global Solutions is  the largest professional services firm in the world located in Richardson, Texas. They provide Heathcare, Insurance, Financial services and other services through their member firms.               Responsibilities: Working on the new business requirements with product owner and freezing the scope to complete within the sprint planning. Supporting the Sales and Marketing business applications and enhancing for better productivity. Implemented integration between Java/Dot net apps with Salesforce. Experience with Service Cloud including Service Console, Case Feed, Knowledge Base and Entitlements. Enhanced all the triggers in the object as one to make it work efficiently under all perspectives and worked on all sort of custom development using Visual Force and APEX. All deployment activities with standards defined in the organization and planning the deliverables based on priorities. Rolled out Salesforce Chatter to all users to improve and accelerate company-wide Communication. Set up Assignment rules, Web-to-Lead and Auto-Response rules. Also configured validation rules based on business requirements. Extensive Experience in Salesforce Integration with in house legacy systems using Web Services API like REST, Bulk and SOAP. Used SOQL & SOSL with consideration to Governor Limits for data manipulation needs of the application using platform database objects. Worked with Email to Case set up and routing the cases to appropriate queues. Designed and modified Approval processes and created Approval steps which used email alerts and field updates. Used Visualforce to consume the SOAP-based Web Service in a Force.com application. Environment: Saleforce.com platform, Code Collaborator, Visual Force, Apex Language, Data Loader, HTML, Workflow & Approvals, Custom Objects, Sandbox management. Rent-A-Center, Plano, Texas\t                                                                                           Apr 16 – Dec 16 SalesForce.com Developer/Admin\t Description:  Rent-A-Center is a furniture, electronics, and appliances rental/sales/rent-to-own company. The project involved reshaping the company’s existing Salesforce CRM application Project involved sales and support functionality, customization of standard objects, Responsibilities: Interacted with Business users for requirements gathering, analysis and development. Worked on various Salesforce.com Standard Objects including Accounts, Contacts, Reports, Dashboards, Events and Tasks. Agile Development Methodology was followed for the implementation. Developed various Apex classes, Controller classes and Apex Triggers for various functional needs in the application. Worked on Salesforce1 Platform to build Mobile App by enabling Lightning Components for use in Salesforce1 mobile platform to make Lightning Application mobile.  Used refined global search in Lightning by developing Apex classes and Controllers.  Developed Cascading Style Sheets (CSS) for creating effects in Visual force pages. Performed Webservice Callout using the RESTful services with the third-party application Broadbean API. Maintained users, roles, profiles, sharing rules and public groups as part of managing security     on SFDC. Developed training plans, materials, and documentation for Salesforce.com users to keep    materials updated. Responsible for creating Sharing rules among all the users in different Roles and Subordinates. Environment: Sales Cloud, Service Cloud, Data loader and Data management, Workflow rules and Approvalprocesses, sandbox, workflows, Custom objects, Reports and Dashboards, Partner Portal, Custom Profiles, Page Layouts, Security Settings, Data Sharing Rules. Commvault  Hyderabad, India                                                                           \tMar 14 to Nov 15  Salesforce Developer Description:  Commvault software is an enterprise-level data platform that contains modules to back up, restore, archive, replicate, and search data. It is built from the ground-up on a single platform and unified code base. Responsibilities: Identified and business requirements and translated them to technical specifications for Force.com. Developed Reports, Dashboards, and processes to continuously monitor data quality and integrity. Developed on Sandbox environments and performed timely deployments on production servers. Developed custom controller classes and extensions to standard controllers using Apex. Implemented Apex Triggers, Apex REST Services and Custom Apex Controllers. Developed Apex web methods in to integrate force.com applications with company’s website. Created Custom Visual force pages and Visual force Templates to customize the user experience. Involved in creating the Tabs, Links and Visual Force pages to configure the application in Salesforce Managed ongoing support requests and administrative needs of users. Maintained users, roles, profiles, sharing rules and public groups as part of managing security on SFDC. Developed training plans, materials, and documentation for Salesforce.com users to keep materials updated. Responsible for creating Sharing rules among all the users in different Roles and Subordinates. Developed and communicated a schedule for future releases/enhancements. Involved in data import into SFDC using Apex Data Loader through CSV files. Created Documents, Presentations and Reports, automatically populating templates with data from any standard or custom object. Environment: Saleforce.com platform, Visual Force, Apex Language, Data Loader, Workflow & Approvals, Custom Objects, Sandbox management, Eclipse IDE Techsol- Hyderabad,India                                                                                     \tJan 12– Feb 14 Jr. Java Developer Responsibilities: Involved in various stages of the project life cycle primarily design, implementation, testing, deployment and enhancement of the application. Involved in designing the system based on UML concepts which include data flow diagrams, class diagrams, sequence diagrams, state diagrams using Rational Rose Enterprise Edition. Designed and developed web pages using JSP, HTML and used JavaScript for client side Validation. Involved in design and development of the application in n-tier fashion based on MVC architecture standards and utilized Struts frame work. Used JDBC for communicating with the database and developed  stored procedures. Responsible for maintenance and production support of the application documented design and functional aspects of the application.  Environment: Java, J2EE, jQuery, JSP, Servlets, Java Beans, JavaScript, Oracle 8i, HTML, Tomcat, XML, Windows XP.  "}