{"text": "Name: frances frances E-Mail: frances.frances@gmail.com Address: Maoming, China Github: https://github.com/frances LinkedIn: https://linkedin.com/frances Phone No. 348968623479 mary.mary@gmail.com Objective Willing to contribute in any IT environment and use my skills to help in the production of a bug-free application and also ensure a work process that meets modern technology and standards. Summary 6+ years of experience in the field of Information Technology with emphasis on Software Quality Assurance, performing Manual and Automated Testing of client/web based server applications. Solution oriented software QA Tester, willing to contribute for a bug-free and quality product. Experienced in writing Test Plan and Test Cases for applications for client/web by using different Automation tool and manually. Experience with all phases of SDLC (Software Development Life Cycle) and Quality Assurance methodologies. Expertise in Claims, Member, Provider, Benefit Configuration modules in Trizetto QNXT claims processing system. Experienced in Functionality testing, System testing, integration, Regression testing, Black-Box, Security testing, Back-end, Sanity, Smoke and minimal performance testing. Experience in preparing test summary reports for manual testing based on User Requirement, and System Requirement documents.  Involved in FACET configuration, Customization, reporting, analysis and enhancement. Extensively worked on EDI transaction like 837, 835,834, 820, 270, 271, 276, 277 and 278. Expert in writing complex SQL queries in order to extract the data from multiple tables and perform data validations in the process of back-end testing.  Worked with various EDI files, understanding of how to Drop, translate and Load them using various EDI editors and web tools. Involved in Facets Output generation, Interface development and Facets Migration Projects. Excellent knowledge of HIPAA standards, EDI (Electronic data interchange), transaction syntax like ANSI X12, Implementation and Knowledge of HIPAA code sets, ICD-9, ICD-10 coding and HL7 Well versed in working as an Interface between the users and the different teams (onsite\\offsite) involved in the application development for the better understanding of the business and IT processes. Experience worked on any requirement upgrade and/or change request while doing UAT. Experience providing primary analysis for business processes running on the EDI (Electronic Data Interchange) standard. Certification in Claim Test Pro  tool. Technical skills Testing Tools:  \t\t\tQuick Test Professional, Soap UI Bug Reporting Tools:\t\tQuality Center, Bug Zero, Test Director, Rational Quest Databases:\t\t\t\tOracle, MS SQL Server Scripting Languages:\t\tJAVA, VB Script and SQL Front End Tools:\t\t\tMS Office Suite, MS Visio, MS Project, MS Outlook, Share Point. Methodology:\t\t\tWaterfall and Agile Operating Systems:\t\tUNIX, 2000, XP/NT, Vista, Windows 7 Programming Languages:\t\t.Net, C++ Professional Work Experience LA Care Health Plan, Los Angeles, CA\t                                                                                     April 2014– Present Sr. Quality Assurance Specialist\t\t\t Description: L.A. Care Health Plan is the nation’s largest publicly operated health plan. L.A. Care’s mission is to provide access to quality health care for Los Angeles County's vulnerable and low-income communities and residents and to support the safety net required to achieve that purpose. Responsibilities: Worked as a QA lead/Oversaw multiple high priority projects. Worked in HP ALM Admin role; granting access to users, troubleshooting issues. Involved in forward and backward mapping from ICD 9 to ICD 10 and vice-versa. Involved in testing efforts in partnership with external vendors confirming the coordination between two cross functional team concludes efficiently and effectively. Identified scope systems that will be modified by the ICD-10 project to accommodate ICD-10 code and /or downstream impacts steaming from ICD-10 codes. Set claim processing data for different QNXT Module. Involved in end-to-end testing of QNXT Enrollment Claim Processing and Member and Provider module. Involved in backend testing, wrote SQL queries in order to retrieve data/validate data from different tables. Also worked on QNXT member’s implementation. Worked on developing the business requirement and use cases for QNXT batch process, automating the billing entities and commission process. Wrote test cases in HP ALM derived from the BRD and generated a Traceability Matrix for testing purposes. Created Traceability Matrix to ensure implementation of all functionalities, identify all test conditions and test data needs. Tested the HIPPA EDI 834 enrollment transactions and EDI 837 Claims according to test scenarios based on companion guide and business requirement and verified the data. Manipulated test data to create retro scenarios for testing making sure the scripts are changing and assigning correct provider. Involved in System testing, Regression Testing and User Acceptance Testing (UAT) manually and Automation tool. Resolved issues with member attributes, enabling multiple rules associated with member lookup process in Facets. Managed defect tracking process, which include prioritize bugs, assign bugs and verifying bugs using ALM. Execute test scripts by using different test check points, break points. Supported change control and other testing efforts for business continuity to manage technology risks Handling/Tracking defect reports in the Quality center and exporting in to Excel by using filter Environment: MS Office Tools, HP ALM, SOAP UI, Oracle, QNXT 5.01, MHC Legacy system, Claim Test Pro,  CareAdvance, web services, SQL server 2012, TOAD, Putty and UNIX. Universal studios, Los Angeles, CA\t                                                                                 Jul 2012- Feb 2014 QA Analyst\t\t Description: Universal Studios is the leading Media and Entertainment Company in the industry. I worked as a Quality Assurance Analyst & worked on web application of Home Video and DVD module that allowed customers to buy the DVD’s and Videos of their choice. The application had a database that kept track of all the DVD’s and Videos available. The application has been developed in HTML and Java Script and Oracle database on a UNIX environment. Responsibilities: Involved in the review of requirements with functional manager and technical specialists of the application Designed and executed Test Plans and Test Cases and generated Test Scripts and Test scenarios. Performed Manual Testing as well as Automation Testing. Created Traceability Matrix to ensure implementation of all functionalities, identify all test conditions and test data needs. Developed Test Script for Functionality, Security, and Regression testing. Involved in System testing, Regression Testing and User Acceptance Testing (UAT) manually and Automation tool. Managed defect tracking process, which include prioritize bugs, assign bugs and verifying bugs using QC. Execute test scripts by using different test check points, break points. Handling/Tracking defect in the Quality center and export in to Excel by using filter. Wrote test plans, test scripts, used Case Scenarios. Assisted in automation development. Documented test process. Tested XML request and responses using SOAP UI and HP Service Test. Ran the scripts on multiple environments (QA, UAT and Production) to ensure that requirements were still met. Extensively worked on any requirement upgrade and/or change request while doing UAT. Performed Back-End Testing to check database integrity by writing SQL queries. Participated in release meetings and also participate in Retrospective session. Environment: Agile, MS Office Tools, Windows XP, Mercury Quality Center, SOAP UI, web services, MS SQL and UNIX. Humana Inc. Louisville, KY\t                                                                                          Sept 2010– June 2012 QA Analyst Description: Humana Inc., headquartered in Louisville, KY, is one of the nation's largest publicly traded health benefits companies, with approximately 9 million medical members.  They used Facets for managing and processing healthcare claims. As a, QA Analyst, I was involved in various kinds of testing of the Facets application modules like Enrollment, Membership and Claims. Responsibilities: Analyzed system requirements and developed detailed Test Plan. Performed Manual Testing as well as Automation Testing for the EDI transactions. Conducted GAP analysis and filling gap according to the format set by HIPAA. Involved in FACETS Implementation, involved end to end testing of FACETS Billing, Claim Processing and Subscriber/Member module.  Involved in validation of the data in 278 transactions in accordance to companion guide. Developed Test Script for Functionality, Security, and Regression testing. Ran the scripts on multiple environments (QA, UAT and Production) to ensure that requirements were still met. Performed Back-End Testing to check database integrity by writing SQL queries. Responsible for creation of test data for testing 278 transactions set. Set claim processing data for different Facets Module.  Tested XML request and responses using SOAP UI and HP Service Test Tested HIPAA regulations in Facets HIPAA privacy module.  Wrote test cases in Quality Center derived from the Design documents and generated a Traceability Matrix for testing purposes. Created Traceability Matrix to ensure implementation of all functionalities, identify all test conditions and test data needs. ICD 9- ICD 10 Conversion Analysis –Worked in the analysis of the ICD 9 - ICD10 codes. Used Quality Center to record documenting information useful in debugging process, evaluating test data. Prepared and maintained the Test Matrix, Requirements Traceability Matrix. Participated in release meetings and also participate in Retrospective session. Extensively worked on any requirement upgrade and/or change request while doing UAT. Worked closely with development team to ensure the application performance and stability and also ensure the application completes the whole end to end process.  Participated in weekly status meeting with Development and Management Teams. Environment: Oracle, MS Windows, IIS, Quality Center, JAVA, SOAP UI, SQL, Facets, MS-Suit Highmark, Pittsburgh PA\t                                                                                              Jan 2009– July 2010 QA Analyst Description: Highmark is one of the largest health Insurance Company in United States. This is a web-based application mainly used by the Administrative Department of Highmark. The application is developed to assign health care programs to employers, add new employers, view employee dependents and all other related information. Responsibilities: Thoroughly analyzed the business requirement documents and create test cases according to it. Implemented Standardized and Unified process throughout the Software Development Life Cycle (SDLC). Actively participated in all the phases of the testing Life cycle (Planning, Designing, Development and Reporting and Results). Developed standardized FACETS testing, implementation and QA processes, and performed Integration testing, system testing. Extensively used SQL in order to retrieve data from the databases by writing Stored Procedures, views, triggers etc. Used Complex SQL queries using joins and sub-queries to test the reports generated by the different modules as a part of back-end testing. Designed, updated and reviewed the Test Cases for member’s information, Providers according to HIPAA. Tested HIPAA regulations in Facets HIPAA privacy module Developed and maintained the test scripts, test data and test cases. Involved with other team members to set up testing tools, implementation and other testing environments. Performed various types of testing, such as functional, regression, user acceptance testing manually. Created the test scripts for both positive and negative testing. Defect Identification and created defect tracking reports till the close of the defect. Preparing Test Metrics using Quality Center. Attended various Functional Walkthroughs and writing high level testing scenarios. Environment: HTML, Waterfall, SQL Server, Quality Center, Facets, QTP, MS Excel, Windows XP, UNIX. Denver Health & Hospital Healthcare\tDenver, CO \t                                                  Dec 2007- Dec 2008 QA Analyst\t Description: Denver Health is Colorado's primary “safety net” institution. The project was undertaken as part of Statistical and Financial Analysis of Colorado Access (CA) for (Medicaid) line of business to Increase Medicaid HMO reinsurance reimbursements. The various parts of project consisted of Preparation of summary and detail worksheets regarding claim activity and utilization, Accumulation of data regarding claim payments, denials and denial reasons out of MMIS extract for Medicaid FFS and Medicaid HMO product, Redesign comprehensive business processes for capturing and analyzing Medicaid/CHP Plus financial data and verification of claims data for eventual HIPAA compliance. Responsibilities: Involved in preparing Test Plan and Test Cases based on business requirements. Wrote Test Cases based on Technical Specifications, Functional Specifications and Business rules for online application system. Authored and executed Test cases manually for Tiered Benefit and mapped from website to PMHS. Responsible for writing the Test Cases and Test Scenarios based on the Functional Specification and Technical Specification in Excel and exported them in Quality Center/Test Director. Performed Integration Testing, System Testing and Regression Testing. Logged errors reported defects, determined repair priorities, did regression testing and close by using Quality Center. Executed Detailed and Risk Based testing for New Functionality.  Documented and tracked Defects in Clear Quest. Retested fixed defects and approved code fixes.  Used SQL Plus to query the oracle database  Conducted functionally and Regression testing during the various phases of the application using Rational functional tester. Environment: Windows, UNIX, Oracle, SQL, Quality Center/Test Director Education Bachelors in Business Administration"}