{"text": "Name: elizabeth elizabeth E-Mail: elizabeth.elizabeth@gmail.com Address: New York, United States Github: https://github.com/elizabeth LinkedIn: https://linkedin.com/elizabeth Phone No. 752138733613 PROFESSIONAL SUMMARY 7+ Years of experience in Analysis, Design, Development, Testing, Customization, Bug fixes, Enhancement,Support and Implementation of various web, stand-alone, client-server enterprise applications using Python, Django in various domains. Experienced with full software development life cycle (SDLC), architecting scalable platforms, object oriented programming (OOPs), database design and agile methodologies. Experience in developing web-based applications using Python 2.7/2.6, Django 1.4/1.3. Good experience of software development in Python (libraries usedBeautiful Soup, numpy, scipy, matplotlib, python-twitter, Pandas data frame, network, urllib2, MySQL dB for database connectivity) and IDEs - sublime text, Spyder, pycharm, emacs. Extensive experience in system analysis, design, development and implementation of web based and client/server application using HTML, Angular JS, Bootstrap, underscore JS, Node JS, CSS, JavaScript, AJAX, JSP, JDBC, XML, XSLT, Python, Django. Good experience in developing web applications implementing MVT/MVC architecture using Django, Flask, Webapp2 and spring web application frameworks. Good Experience with Django, a high-level Python Web framework. Experienced in MVC frameworks like Django, Angular JS, Java Script, JQuery and Node.js. Experienced in web applications development using Django/Python, Flask/Python.In addition,Node.js, Angular.js, DOJO, JQuery while using HTML/CSS/JS for server-side rendered applications. Worked closely with designer, tightly integrating Flash into the CMS with the use of Flashvars stored in the Django models. Also created XML with Django to be used by the Flash. Good Experience in Linux Bash scripting and following PEP Guidelines in Python. Developed consumer based features and applications using Python, Django, HTML, Behavior Driven Development (BDD) and pair based programming. Using Django evolution and manual SQLmodifications was able to modify Django models while retaining all data, while site was in production mode. Experienced in monitoring, developing and transforming data using SQL Server Integration Service (SSIS) and SQL Server Analysis Service (SSAS). Experienced with databases using ORMs/DOMs for integrating with MySQL, Postgres, Neo4J, MongoDB, and Cassandra SQLite. Also, experienced with writing custom queries through database connectors. Expertise in establishing database connections for Java and Python by configuring packages like JDBC, MySQL-Python. Successfully migrated the Django database from SQLite to MySQL to PostgresSQL with complete data integrity. Architecture, size (Capacity planning), Data modeling, implementation and support Cassandra Clusters including install, configure and upgrade DSE v3/4 (Cassandra v 1/2.x) and OpsCenter v 4.x/5.x on Bare metal and Cloud including AWS (Amazon Web Services). Configure backup, alerts, repairs and monitoring of Cassandra clusters, in conjunction with Nagios/Opscenter and custom scripts. Extensive experience in designing MongoDB multi-sharded cluster and monitoring with MMS. Experience with creating script for data modeling and data import and export. Extensive experience in deploying, managing and developing MongoDB clusters. Good Knowledge of web services using SOAP and REST protocols. Used Node.js as a proxy to interact with Rest services and also interacting with Database. Excellent Experience and knowledge in using XML, SOAP, web Service for inter operable software applications. Good knowledge of version control software – CVS, GitHub Efficient in demonstrating all phases of software development life cycle (requirements, design, architecture, development, testing).  Experience in working with deployment tools like Microsoft Azure, Heroku and Jenkins. Deployed production site using Apache 2.0 with mod_python.  Experienced in Agile Methodologies, Scrum stories and sprints experience in a Python based environment, along with data analytics, data wrangling and Excel data extracts. Hands on experience with bug tracking tools JIRA and Bugzilla. Skilled in writing and reviewing requirements, architecture documents, test plans, design, documents, quality analysis and audits. Skilled in debugging/troubleshooting issues in complex applications. Excellent experience with Python development under Linux OS (Debian, Ubuntu, SUSELinux, RedHatLinux, Fedora). Experience in Database Administration, development, design, maintenance and production support of relational databases, business applications, new server setup, MySQL Server installation, upgrade, migration. Reviewed requirement documents with the business and development team to understand the architecture and functionality of the application and consolidated these requirements in appropriate modules in Test strategy. Experienced in Unit testing, Integration testing, User acceptance testing, Functional testing. Experienced in Requirement gathering, Use case development, Business Process flow, Business Process Modeling: extensively used UML to develop various use cases, class diagrams and sequence diagrams. Technical Skills: Primary Languages : Python, Java, C Python Libraries\t: Beautiful Soup, numpy, scipy, matplotlib, python-twitter, Pandas data frame, urllib2 Frameworks\t: Bootstrap, Django, Node.JS, Flask, PyJamas, Pyramid, Hibernate Database\t: Sqlite3, MSSQL, MySQL, Mongo DB, Oracle 11g IDE’s\t:PyCharm, Eclipse, NetBeans, MS Visual Studio, PyDev, RIDE Servers\t:Apache Tomcat, WebSphere, JBoss, WebLogic, XAMPP Deployment tools\t:MS Azure, Heroku, Amazon Web Services (EC2, S3, EBS, ELB, SES) Web Technologies    :  HTML, CSS, DHTML, XML, Java Script Operating systems\t:Windows, Mac, Fedora Linux, Red hat Linux SDLC Methods\t:SCRUM, Agile Testing Frameworks: Junit, TestNG, ROBOT, JXL, JTest Bug Tracking Tools\t: Axosoft, JIRA, Bugzilla, Rational Clear-quest Version Controls\t: VSS, SVN, Github, Git Q2E-BANKING\t\t\t\t\t\t\tAugust 2016 – Till Date Sr. Python Developer Responsibilities:  Implemented user interface guidelines and standards throughout the development and maintenance of the website using the HTML, CSS, JavaScript and JQuery. Developed views and templates with Python and Django's view controller and templating language to create a user-friendly website interface. Refactor Python/Django modules to deliver certain format of data. Managed datasets using Panda data frames and MySQL, queried MYSQL database queries from python using Python-MySQL connector and MySQLdb package to retrieve information. Utilized Python libraries wxPython, numPY, Twisted and matPlotLib. Wrote Python scripts to parse XML documents and load the data in database. Used Wireshark, live http headers, and Fiddler2 debugging proxy to debug the Flash object and help the developer create a functional component. The PHPpage for displaying the data uses AJAX to sort and display the data. The page also outputs data to .csv for viewing in Microsoft Excel. Parsers written in Python for extracting useful data from the design data base. Development of PythonAPIs to dump the array structures in the Processor at the failure point for debugging. Involved in development of Web Services using SOAP for sending and getting data from the external interface in the XML format. Written functional phpunit test cases for DataLayer, and Searchserver classes using Django, Curl, XML, JSON, REST base services, and MongoDB. Creating restful web services for Catalog and Pricing with DjangoMVT, Jersey, MySQL, and MongoDB. Representation of the system in hierarchy form by defining the components, subcomponents using Python and developed set of library functions over the system based on the user needs. Generated graphical reports using python package Numpy and matPlotLib. Usage of advance features like pickle/unpickle in python for sharing the information across the applications. Used Selenium Library to write fully functioning test automation process that allowed the simulation of submitting different requests from multiple browsers to web application. Created Data tables utilizing PyQtto display customer and policy information and add, delete, update customer records. Used Python and Django creating graphics, XML processing, data exchange and business logic implementation. Used Python based GUI components for the front end functionality such as selection criteria. Administration of dedicated collocated RHEL 4 machine and configured complex Apache configuration files. Added support for Amazon AWSS3 and RDS to host static/media files and the database into AmazonCloud. Writing Python scripts with CloudFormation templates to automate installation of Autoscaling, EC2, VPC, and other services. Developed tools using Python, Shell scripting, XML to automate some of the menial tasks. Interfacing with supervisors, artists, systems administrators and production to ensure production deadlines are met. Used third party JQuery based plug-ins like JQueryUI, Datatables etc. Heavily used JavaScript for Form Submit and other UI elements during development. Utilize in-depth knowledge of Technical experience in LAMP and other leading-edge products and technology in conjunction with industry and business skills to deliver solutions to customer. Representation of the system in hierarchy form by defining the components, subcomponents using Python and developed set of library functions over the system based on the user needs. Used REST and SOAPUI for testing webservice for server side changes. Environment: Python 3.4/2.7, Django 1.7, MongoDB, MySQL, AJAX, SOAP, REST, JQuery, JavaScript, Bootstrap, PyCharm, AWS (EC2, S3, RDS). Constant Contact, MA\t\t\t\t\t\t\t\tJan 2015-July 2016 Python Developer Responsibilities: Created Python and Bash tools to increase efficiency of call center application system and operations; data conversion scripts, AMQP/RabbitMQ, REST, JSON, and CRUD scripts for API Integration. Used Celery with RabbitMQ, MySQL, Django, and Flask to create a distributed worker framework. Recording of Scripts (Web, Web Services HTML) using Vugen and SoapUI and script validation through co correlations, parameterizations and other methods. Scripting- web and web services. Application was based on service oriented architecture and used Python 2.7, Django1.5, JSF 2, Spring 2, Ajax, HTML, CSS for the frontend. Created server monitoring daemon with Psutil, supported by Django app for analytics which I created. Also researched big data solutions with Cassandradatabase. Experience with Data migration from Sqlite3 to ApacheCassandra database. Cassandra data model designing, implementation, maintaining and monitoring using DSE, DevCentre, DatastaxOpscenter. Build the Silent Circle Management System (SCMC) in Django, Python, and Node.JS while integrating with infrastructure services. Created a Python/Django based web application using Python scripting for data processing, MySQL for the database, and HTML/CSS/JQuery and HighCharts for data visualization of the served pages. Strong Socket programming experience in Python. Implemented complex networking operations like raceroute, SMTP mail server and web server. Used existing Deal Model in Python to inherit and create object data structure for regulatory reporting. Used standard Python modules e.g. csv, robotparser, itertools, pickle, jinja2, lxml for development. Managed, developed, and designed a dashboard control panel for customers and Administrators using Django, HTML, CSS, JavaScript, Bootstrap, JQuery and RESTAPI calls. Automated RabbitMQ cluster installations and configuration using Python/Bash. Used PandasAPI to put the data as time series and tabular format for east timestamp data manipulation and retrieval. Deployed the project into Heroku using GIT version control system. Improved the coding standards, code reuse. Increased performance of the extended applications by making effective use of various design patterns (Front Controller, DAO). Worked on a large scale distributed computing environment, monitoring data nodes to prioritize jobs for processing functions. Worked extensively with Bootstrap, Javascript, and JQuery to optimize the user experience. Used Python and Django to interface with the JQueryUI and manage the storage and deletion of content. Carried out various mathematical operations for calculation purpose using pythonlibraries. Built various graphs for business decision making using Pythonmatplotlib library. Fetched twitter feeds for certain important keyword using python-twitter library. Used Python library BeautifulSoup for webscrapping to extract data for building graphs. Performed troubleshooting, fixed and deployed many Pythonbug fixes of the two main applications that were a main source of data for both customers and internal customer service team. Executing regression tests on each release and verified bugs found from automation test in Bugzilla. Planning, implementing, and converting manual test cases to automation test cases. Trained extensively in agile methodologies and implemented by participating in scrum standups, Kanban mode, discussing and implementing requirements with clients. Environment: Python, Django, Cassandra, RabbitMQ, Vugen, SoapUI, Node.JS, REST API, Bash, PyDev, Spyder, Agile. EDASSIST, Watertown, MA\t\t\t\t\t\t\tMar 2013-Dec2014 Python Developer Responsibilities: Used Django framework for application development. Developed user interface using, CSS, HTML, JavaScript and Jquery and Django. Assisted in reduction of cost and optimization of supplier selection for the CRM Applications. Also used methods for cross application use using the Class Builder and Object Oriented programming. Generated an API Reference guide to help application developers for creating the software applications to store data using DDN S3 (compatible with Amazon S3 API) or DDN OpenStack Swift API calls. Ensured high quality data collection and maintaining the integrity of the data. Cleaned data and processed third party spending data into maneuverable deliverables within specific formats with Excel macros and python libraries. Used TDD (Test driven development) methodology. Used several python libraries like wxPython, numPY and matPlotLib. Was involved in environment, code installation as well as the SVN implementation. Build all database mapping classes using Django models and Cassandra. Used PandasAPI to put the data as time series and tabular format for east timestamp data manipulation and retrieval. Designed and developed data management system using MySQL. Creating unit test/regression test framework for working/new code. This project also used other technologies like JQuery for javascript manipulations, bootstrap for the front-end html layout. Responsible for debugging and troubleshooting the web application. Developed, tested and debugged software tools utilized by clients and internal customers. Coded test programs and evaluated existing engineering processes. Designed and configured database and backend applications and programs. Performed research to explore and identify new technological platforms. HYATT CORPORATION, ATLANTA, GA\t\t\tOct 2012-Feb 2013 Python Developer Responsibilities: Translated the customer requirements into design specifications and ensured that the requirements translate into software solution. Application was based on service oriented architecture and used Python 2.5, Django 1.5, JSF 2, Spring 2, Ajax, HTML, CSS for the frontend. Designed the front end of the application using Python, Java, HTML, CSS, AJAX, JSON and JQuery. Worked on backend of the application, mainly using Active Records. Involved in the design, development and testing phases of application using AGILE methodology. Developed and designed an API (RESTful Web Service). Used the Python language to develop web-based data retrieval systems. Designed and maintained databases using Python and developed Python based API (RESTful Web Service) using Flask, SQLAlchemy and PostgreSQL.  Developed web sites using Django, Python, XHTML, CSS, and JavaScript.  Developed and designed e-mail marketing campaigns using HTML and CSS.  Tested and implemented applications built using Python. Developed and tested many features for dashboard using Python, ROBOT framework, Bootstrap, CSS, and JavaScript. Created complex dynamic HTML UI using jQuery.  Automated Regression analysis for determining fund returns based on index returns (Python/Excel). Worked on development of SQL and stored procedures, trigger and function on MYSQL. Developed shopping cart for Library and integrated web services to access the payment.  Used Php language on lamp server to develop page. Developed server based web traffic statistical analysis tool using Flask, Pandas.  Implemented and tested python based web applications interacting with MySQL.  Developed dynamic interaction page on .net MSvisualbasic-2014, using SQL developer tools. Simple web app for reviewing sitcoms that gives users the ability to view, add, review, up/down vote, search, etc.  Involved in doing AGILE (SCRUM) practices and planning of sprint attending daily agile (SCRUM) meetings and SPRINT retrospective meetings to produce quality deliverables within time. Environment:Linux, Python, Mod Python, Perl, PHP, MySQL, JavaScript, Ajax, Shell Script, HTML, CSS STRATEOLOGY, Hyderabad\t\t\t\t\t\t\tJan 2011 – Sept 2012 Java /Python Developer Responsibilities: Involved in Design and development of UI screens for Add and Update Lending Application using Struts frame work. Involved in developing the business components using JAVA and JDBC. Design and development of UI screens using JSP. Managing, training and coordinating the team. Developed a new product for the unsecured loans featuring Term Business and personal loans. Developed and implemented the user registration and login feature for the application process from scratch by extending Django user model.  Used Restful web service calls for the validation. Worked with AJAX framework to get the asynchronous response for the user request and used JavaScript for the validation. Developed a fully automated continuous integration system using Git, Gerrit, Jenkins, MySQL and custom tools developed in Python and Bash.  Implemented schema and data migration for the postgresdatabase using South migration tool.  Developed user-friendly modals for the form submissions using simplemodal.js, JQuery,Ajax and JavaScript.  Experience in building the war with help the putty and deployed into cloud environment using the cloud controller and experience in solving the cloud issue. Worked closely with Client managers/Business Analysts of the bank to drive technical solutions, design and provide development estimates for schedule and effort. Worked very closely with product owners, project managers and vendors to satisfy all the business needs.  Designed and developed the UI of the website using HTML, AJAX, CSS, JQuery and JavaScript.  Used Django framework for database application development. Dynamic, hard-working, ability to work in-groups as well as independently with initiative to learn new technologies/tool quickly and emphasis on delivering quality services. Have strong ability to build productive relationships with peers, management, and clients using strong communication, interpersonal, organizational, and planning skills. Environment: Java, Python, Django, J2EE, JSP, Oracle, Eclipse, MySQL, Linux, HTML, CSS, AJAX, JavaScript,  SUNERA TECHNOLOGIES, Hyderabad, India\t\t\t\tAug 2009 – Dec 2010 Java Developer Responsibilities: Developed application service components and configured beans using Spring IOC, creation of Hibernate mapping files and generation of database schema. Implemented modules using Core Java APIs, Java collection, Threads, XML, and integrating the modules. Developed Reporting framework using JAVA and J2EE which will generate daily, monthly and yearly reports and prepared different framework design documents. Created tables, views, Types, triggers, complex join queries, stored procedures, and functions and modifications to existing database structure as required for addition of new features using SQL developer. Involved in web designing using HTML 4/5, XHTML, CSS 2/3, JQuery, JavaScript extensively used Table less Design in CSS for positioning. Used MVC Architecture in spring framework and implemented custom tag libraries. Generated Use case diagrams, Activity flow diagrams, Class diagrams and Object diagrams in the design phase. Used Java/J2EE Design Patterns such as Business Delegate, Session Facade, singleton in the project extensively, which facilitates clean distribution of roles and responsibilities across various layers of processing. Configured Hibernate second level cache using EHCache to reduce the number of hits to the configuration table data. Extensively Used Ant tool to build and configure J2EE applications and used Log4J for logging in the application. Implemented client side validations for Search and Security modules using JavaScript and Validation Framework. Responsible for design and implementation of various modules of the application using Struts-Spring-Hibernate architecture. Automated the HTML and JSP pages indexing process of search module using ApacheAnt tool and singleton design pattern. Tested JSPs and Servlets used in search, security and scheduler modules using Cactus API. Done extensive coding using Java, J2EE for enhancements and bug fixes in agile development environment. Environment:Java, J2EE, JSP, Struts, Hibernate, HTML, Eclipse, Apache Ant, JavaScript, JQuery, Oracle 10g, Windows XP Education: B-Tech/EEE/JNTUH, 2009"}