{"text": "Name: elizabeth elizabeth E-Mail: elizabeth.elizabeth@gmail.com Address: Dongguan, China Github: https://github.com/elizabeth LinkedIn: https://linkedin.com/elizabeth Phone No. 139381111285 Over 8 years of Microsoft Professional experience in Visual Studio.NETusing C# C++, VB.NET, ASP.NET, WCF, WPF, SilverLight, HTML 5, LINQ, XML and SQL Server 2012. Hands on experience in verticals such as, Healthcare, Pharmaceuticals, Public Sector,Banking, Bio-Chemical, Insurance & Manufacturing. Worked in development of the User Interface part of the Web Applications and Windows Applications using HTML, CSS,JavaScript, Angular.JS, AJAX, WPF and SilverLight.  Extensive experience in architecture, design and development of Client-Server and Distributed Web Applications with ASP.NETMVC(5/4.0/3.0),3-Tire and N-Tire Architecture and developed services using WCF (Windows Communication Foundation) technologies with Microsoft Enterprise library and Web service software factory. Thorough knowledge of Design Patterns like MVP, MVC, MVVM Patterns and Singleton Patterns. Expertise in usingSilverLight for better look and feel using controls, Layouts, Styles and Data Binding. Worked on themes and styling for the application Experience in developing presentation layer using Web Forms, Windows Forms, Windows Presentation Foundation (WPF) and Expression Blend 3.0.using WPF and SilverLight with Prism framework. Experience in design and development of XML Web Services, including understanding of XML schema, SOAP and WSDL. Implement Sitecore architecture and develop custom Sitecore controls to facilitate client's CMS needs. Experience in several REST web services supporting both XML and JSON to perform tasks such as remote thermostat and demand-response management. REST web services leveraged by both web and mobile applications. Applying Multithreading techniques for creating high performance applications. Excellent Experience in using scripting languages like JavaScript and AJAX (Asynchronous JavaScript and XML.Designed Applications using UML and Use Cases and Design Patterns, Agile Methodologies. Expertise and broad skills in object-oriented (OO) development including service-oriented architecture (SOA), and development of n-tier Web applications using industry-proven patterns & practices (i.e. MVC, MVVM, Factory pattern, Entity Framework, Singleton, Facade, etc.) including Composite UI and Different Application Blocks. Excellent Experience in writing Data Access Layers using ADO.NET, Entity Frame Work and LINQ to SQL. Extensive experience in MSSQLServer 2016/2014/2012/2008/R2/2005/2000 Business Intelligence in MSSQL Server Integration Services(SSIS), MSSQL Server Reporting Services(SSRS) and MSSQL Server Analysis Services(SSAS). Experience working on MSSQL Server Databases including Database Design, Query Tuning, and Writing Complex stored procedures while working with the large databases. Created Stored Procedures, Functions and Triggers using T-SQL and also expert in tuning complex Queries. Used versioning tools Microsoft Team Foundation Server (TFS), Visual Source Safe (VSS), and Tortoise SVN for version controlling of the Application. Technical Skills: Framework /Architecture:\t .NET Framework 4.5/4.0/3.5/3.0/2.0/1.1, JQuery Mobile, SOA Web Development:\tASP.NETMVC{5/4/3}, ASP.NET 4.0, LINQ, WCF 4.0, WPF, SilverLight 3.0, ASP, XML Web Service, AJAX Scripting Languages:Java Script/Bootstrap, VB Script, Knock out.js Databases:\t\t\tMSSQL Server 2015/2012/2008/2005/2000, Oracle 9i/10g, MS Access XML Technologies: \t\tXSL/XSLT, DOM,XPath, XSD Application/Web Servers:\tMicrosoft IIS 7.0/6.0/5.0 Defect/Bug Tracking: \t\tTest Track Version Control:\t\tTeam Foundation Server (TFS), Microsoft Visual Source Safe (VSS) Reporting Tools:\t\t Crystal Reports, SQL Server Reporting Services (SSRS) 2005 IDE:\t\t\t\tVisual Studio .NET 2010/2008/2005/2003, Visual Studio 6 Other Skills: \t\t\tRequirements engineering, UML, Design patterns, code reviews, testing. OS                                              Windows 10,Vista/XP/2003/2000/NT,MS DOS,UNIX PROFESSIONAL EXPERIENCE: Client:\tTrinity Health Care, Livonia, MI\t\t                                                   Duration: Feb 2015 till date Role: Sr. Dot Net Developer \t Trinity Health is a national, not for profit Catholic health system operating 86 hospitals in 21 States, along with several long-term care facilities, senior living communities, and home health and hospice agencies. Responsibilities:  Participated in the design and development of the software and designed and coded the application components in an Agile environment utilizing a test driven development approach. Translate client's business requirements into systems design and utilize deep understanding of SiteCore solutions to assist in appropriate business decisions. Migrated their old website to Sitecore . Developed the application using C#,C++, ASP.NET 4.6 with MVC5 with Razor View Engine, AJAX, HTML5, JavaScript, CSS3. Designed Frontend with in object oriented JavaScript Framework like Angular.js.  Developed MVC5 pattern using Entity Frameworkof the web application based on .NET and web technologies usingASP.NET, HTML5, CSS,AJAX, JavaScript, JQuery/Bootstrap, Multithreading, Entity Framework.  To implement the functionality for the plugin using C#, WPF, MVVM, WCF and Entity Framework.  Developed spending plan complex MVC Controller (Implemented Angular Controllers to maintain each view data), View Models and Helper methods linked to backend database.  Developed WCF service to send customer data for registration.  Developed WCF service to send the medical records to encryption module.  Implemented Patterns like MVVM in working with WPF. Developed web services using Restful and SOAP protocols.  Restful web service development. Involved in writing application level code to interact with  RESTfulAPIs, Web Services using AJAX, JSON and XML. Used Ajax in communication for consuming RESTfulAPI web services data load.  Developing RESTful WCF Services for each module.  Integrated WebApi help pages (MVC) into a self-hosted WebApi service. Very good experience in Debugging IIS Web Server connection problems and Database connectivity problems. Extensively worked on creating CSS, Master Pages, Theme and Site Definition to enrich the portal using SharePoint Designer. Develop stored procedures, functions, and triggersusing SQL and T-SQL in MS SQL Server for fetching data and binding, created automated Unit Tests and involved in writing Test Plans for user testing. Created custom entities in entity framework to connect data access layers and sql server 2012.  Applying Multithreading techniques for creating high performance applications. Worked in developing Custom Report and different types of Tabular Reports, Matrix Reports, Ad hoc reports and distributed reports in multiple formats using SQL Server Reporting Services (SSRS). Used Microsoft Team Foundation Server (TFS) for all the source code maintenance among the whole team members. Environment: VisualStudio2013/2012/2010, C#, WCF, WPF, .NET 4.0, ASP.NET MVC5, VB.NET.  Visual Basic 6.0, Silver Light, Web API, Entity Framework4 (Code First),XML, Angular.JS, HTML, ASP.NET MVC, ADO.NET, LINQ,Three Tier Architecture, SQL SERVER 2008/2012, SQL Assistant 12.0, SSIS, IIS ,JSON, JavaScript, Crystal Reports, TFS, Windows Server, Agile / Scrum, N-Unit-Test. Client:\tHonda \t,Los Angeles, CA\t\t                                                                 July 2013- Dec 2014 Role: Sr. Dot Net Developer \tHonda is a Japanese Public Multinational Corporation primarily know as a Manufacturer of automobiles, motorcycles and power equipment. Responsibilities: Involved in Interaction with BA team on a by-weekly basis to gather requirements and also involved in creating Business Requirements documents (BRDs) based on Requirements. Managed requirement gathering, development, managed offshore development team and deployment. Sitecore API's were used for building the web site.   Made several enhancements for clients to their existing Sitecore solutions based on the needs of the organization Working with design team to analyze the Requirements, creating Design documents and Technical Definition Documentation.  Trained and worked in Agile/Scrum Development Methodology.  Designing the user interface, writing code for the various layers in the application like Controllers, Services, Business Logic and Repository etc. using ASP.NET MVC and Entity Framework. Worked on Code First approach for the MVC and Entity Framework for designing the models.  Developed the application using C#, ASP.NET with MVC 4 with Razor View Engine, AJAX, HTML5, JavaScript, CSS3. Developed spending plan complex MVC Controller (Implemented Angular Controllers to maintain each view data), ViewModels and Helper methods linked to backend database Designed Web Form Application using Visual Studio C/C++, .NET 4.5 Framework. Involved in developing the application in C#.Net and ASP.NET MVC as the web technology. Developed GUI using ASP.NET, HTML, CSS3, JavaScript, JQuery. Developed applications in SharePoint 2013. Created Web parts in SharePoint 2013 and developed Master Pages by using Office 365. Involved in writing application level code to interact withRestfulAPIs, Web Services using AJAX, JSON and XML. Developed web services using Restful and SOAP protocols.  Developing RESTful WCF Services for each module. Used Ajax in communication for consuming RESTfulAPI web services data load.  Integrated WebApi help pages (MVC) into a self-hosted WebApi service. Worked on AngularJS framework in most of the pages which includes web parts.  Developed service-oriented architecture, APIs, JSON. Develop storedprocedures, functions, and triggersusing SQL and T-SQL in MS SQL Server for fetching data and binding, created automated Unit Tests and involved in writing Test Plans for user testing. Created Schemas, Logins, Tables, Clustered and Non-Clustered Indexes, Views, Functions and Stored Procedures.Used LINQ to SQL, LINQ to Lambda functions, and LINQ to Objects for retrieving the data efficiently and Just in Time manner. Scheduled reports for daily, weekly, monthly reports for executives, Business analyst and customer Representatives for various categories and regions based on business needs using SQL Server Reporting Services (SSRS). Used Microsoft Team Foundation Server (TFS) for all the source code maintenance among the whole team members. Environment: VisualStudio.NET 2012/2010/2008, ADO.NET, WCF, JQuery, Entity framework, C# .NET Framework 4/4.5, Silver Light, XML, Angular.JS, HTML,ASP.NET MVC 5, ASP.NET, ADO.NET, Three Tier Architecture, Tortoise SVN, SQL SERVER 2008/2012,Facets 5.01 & 5.2 Oracle SQL Assistant 12.0, SSIS, DTS, IIS 7.0, JavaScript, Crystal Reports, TFS, Windows Server, Agile / Scrum, NUnit-Test. Client:\tBio-Cryst Pharmaceuticals, Durham, NC\t                                                              Jan 2013 to June2013 Role: Sr. Dot Net Developer \t Bio- Cryst is a pharmaceutical company focuses on orphan &autoimmune diseases, and antivirals. It utilizes strategic partnerships early in the drug identification process through in-licensing of drug tests. BioCryst has also established collaborative relationships for development and commercialization of product candidates to expand its geographic reach beyond the United States. Responsibilities: Used Agile Methodologies for regular adaption to changing requirements and continuous delivery of useful and working software. Managed requirement gathering, development, managed offshore development team and deployment. Sitecore API's were used for building the web site. Involved in the creating Websites using ASP.NET Developed the application using ASP.Net MVC 5.0 with Razor View engine, C#, AJAX, JQuery/Bootstrap,HTML5, CSS3, and Angular JS,java script techniques also developed desktop applications using C# and VB.NET. Designed UI screens and code using Visual Studio 2010/12, WPF, VB.Net, AJAX, XML and CSS with object oriented programming techniques. Used various features of C# and VB.Net. Designing Models, Views and Controllers and implementing them using MVC (CTP 3 & 4) framework. Integrated WebApi help pages (MVC) into a self-hosted WebApi service. Created WCF Services responsible for communicating and providing real time data from integrated server to Client Application.  Used WCF Web Service to consume and bind data to WPF Controls. Developed web services using Restful and SOAP protocols.  Involved in writing application level code to interact with  RESTfulAPIs, Web Services using AJAX, JSON and XML. Used Ajax in communication for consuming RESTfulAPI web services data load.  Developing RESTful WCF Services for each module. Business logic layer is written Using C#, LINQ to SQL. Installed SQL Servers and applied hotfixes and service packs for Production and Development environments.Designed and developed Cloud Service projects and deployed to Web Apps. Generated reports using SSRS and integrated with web application. Used Team Foundation Server(TFS) for Source Code Control, project related document sharing and team collaboration. Environment: Visual Studio, .NET Framework 3.0, IIS, MVC,WCF, WPF, SQL Server 2008 R2, WCF, Silver  Light, MS SQL Server Management Studio 2008, MS Source Safe, Entity Framework, Database, ADO.NET, Windows Server 2008, HTML, XML, XSLT, AJAX, BizTalk 2010, WSB, XSLT, SharePoint, TFS, Agile Methodology. Client:\tFlorida Power and Lights, Juno Beach, FL\t\t                                 Feb 2012 to Dec 2012 Role: Dot Net Developer Florida Power & Light Company (FPL), the principal subsidiary of NextEra Energy Inc. is a Florida based power utility company serving roughly 4.7 million accounts and 9 million people in Florida. Responsibilities: Effectively involved in various stages of the development starting from the Project planning till production and maintenance using Agile Methodology(SCRUM). Designing the user interface, writing code for the various layers in the application like Controllers, Services, Business Logic and Repository etc. using ASP.NET MVC and Entity Framework.  Implemented ASP.NET MVC pattern mechanism to display product catalogs and categories. Used ASP.NET MVC pattern. Implemented views, controllers and providers using C#.  Integrated WebApi help pages (MVC) into a self-hosted WebApi service. Worked extensively on the UI, created Views by utilizing MVC 3, created View models and wrote client side validations using JQuery and Knock out. Developed and used various Web forms, Custom Controls and User controls using ASP.NET, C# and JavaScript. Developed web services using Restful and SOAP protocols.  Wrote SPA (Single Page Web Applications) using RESTFUL web servicesAngular JS.  Implemented UI (User Interface) using ASP .Net 3.5 web server control, JavaScript, HTML, JQuery/Bootstrap and Cascading Style Sheets (CSS). Using soap based WCF service to communicate between the host web application and the client Silverlight application. Experienced in maintaining a session of messages between a client and a service using Windows Communications Foundation (WCF) facilities.  Windows Presentation Foundation (WPF) was used for the in-store desktop applications and for developing GUI. Used Ajax in communication for consuming RESTfulAPI web services data load.  Used and created Language integrated query (LINQ) for getting Lists, arrays and collections. Extensively used ADO.NET, LINQ to SQL and the Microsoft Enterprise Library for in-depth data retrieval, querying and other activities from SQL Server Extensively involved in designing the SSIS packages to export data of flat file source to SQL Server Database. Responsible for automation of build and development of DNN modules using TFS. Environment: VisualStudio2013/2012/2010, C#, WCF, WPF, .NET 4.0, ASP.NET MVC5, VB.NET.  Visual Basic 6.0, Silver Light, Web API, Entity Framework4 (Code First),XML, Angular.JS, HTML, ASP.NET MVC, ASP.NET, ADO.NET, LINQ, Three Tier Architecture, SQL SERVER 2008/2012, SQL Assistant 12.0, SSIS, IIS ,JSON, JavaScript, Crystal Reports, TFS, Windows Server, Agile / Scrum, N-Unit-Test. Client:\tU.S. Bancorp, Minneapolis, MN\t \t\t\t\t                    Dec 2010 to Jan2012 Role: Dot Net Developer \tU.S. Bancorp, is an American financial services holding company based in Minneapolis, Minnesota, that is the parent company of the U.S. Bank National Association, known as U.S. Bank, the 5th largest commercial bank in the United States. Responsibilities: Involved in all phases of the life cycle of the project including requirement study, design, development, deployment and testing. Developed Application using .NET Framework 3.5, Object Oriented Principles (OOP) (C# and VB.NET), and n-Tier Architecture. Development of (MVC) Model, View, Controller framework using C#.  Used ASP.NET MVCPage Controller pattern to add functionality to individual pages such that to accept input from the page request, invoke the requested actions on the mode. Integrated Active Directory with intranet MVC applications. Developed the applications using C#, ASP.NET MVC, AngularJS.  Worked on UI prototypes and screens to build intuitive and rich interfaces. Used Ajax in communication for consuming RESTful API web services data load.  Developed web services using Restful and SOAP protocols.  Designed Graphical User Interface (GUI) for various web pages using AJAX, HTML, CSS, JavaScript, JQuery/Bootstrap and Silver Light.  Involved in maintenance and enhancements of an application using Microsoft .NET Framework 4.0,VB.NET, ASP.NET, LINQ, WCF, AJAX, JavaScript, jQuery, XML, WPF WEBSERVICES.  Using soap based WCF service to communicate between the host web application and the client Silverlight application.  Refactored key components to build and expose their SOA versions for greater accessibility.  Used Microsoft ADO.NET to access data from database in a web application. Develop stored procedures, functions, and triggers using SQL and T-SQL in SQL Server 2008 for fetching data and binding, created automated Unit Tests using Nun it and involved in writing Test Plans for user testing. Developed Unit Test Cases to ensure that the code met its design and behaved as intended. Used TFS for version control during development. Environment: Visual Studio.NET 2008, C#.NET 3.0, VB.NET 3.0,angula ADO.NET, MVC, LINQ, XML, MVVM, SQL Server 2008, TFS, CSS, JavaScript, JQuery, JSON, NUnit, Multi-threading etc. Client:\tBio-Synthesis, Inc., Lewisville, TX\t\t                                              Dec 2009 to Nov 2010 Role: Dot Net Developer \t Bio-Synthesis Inc., is a biotechnology company. It is a provider of custom and catalog peptides, custom Antibodies, Organic Synthesis and Analytical Services. Bio-Medical researches worldwide in universities, biotech companies, private clinics and government agencies use products from Bio-Synthesis Inc. Responsibilities: Implemented 3-layered architecture for separate business, data-access and front end processing. Used VB, C#, PowerShell Script to implement project.  Worked on ASP.NET State management, ASP.NET caching features, configuring ASP.NET optimizations, securing ASP.NET web application with Visual studio(VS) environment. Involved in different phases of the life cycle including requirements, design, analysis, coding, testing and performance testing. Worked with Model View Controller (MVC) Design Framework & AngularJS in developing Single Page Application. Developed User Interface using ASP, HTML, VB Script and JavaScript, JQuery/Bootstrap including code to support both Internet Explorer and Netscape browsers. Created Service Layer using C# and WCF.   Used Ajax in communication for consuming RESTfulAPI web services data load.  Developed web services using Restful and SOAP protocols.  Developed functions to transform XML data using XSL templates. Used ADO.NET Object Model to Interact with SQL Server Database using C#. Wrote T-SQL queries, T-SQL Stored Procedures and Triggers, which will execute against SQL Server 2008 database in order to extract the appropriate data for each report. Developed Tables, Indexes, Stored procedures, Database Triggers and Functions. Involved in the application and database design including writing Technical Design Documents TDD. Environment: VisualStudio2013/2012/2010, C#, WCF, WPF, .NET 4.0, ASP.NET MVC5, VB.NET.  Visual Basic 6.0, Silver Light, Web API, XML, Angular.JS, HTML, ASP.NET MVC, ASP.NET, ADO.NET, LINQ, Three Tier Architecture, SQL SERVER 2008/2012, SQL Assistant 12.0, SSIS, IIS ,JSON, JavaScript, Crystal Reports, TFS, Windows Server, Agile / Scrum, N-Unit-Test. Client: SafeAuto Insurance Company, Columbus, OH\t\t\t\t         May2009-Oct2009 Role: Dot Net Developer \tSafe Auto Insurance is a property and casualty auto insurance carrier. It is a privately held carrier and provider of state minimum private-passenger auto insurance for drivers in the nonstandard insurance market in 17 states across the country. Responsibilities: Interacted with business analysts and worked on the application specifications to develop detailed functional, technical design, and test specifications that fully satisfy business requirements. Developed GUI using ASP.NET and implemented the code. Extensively used ADO.NET to access SQL Server database.  To implement the functionality for the Dovenmuehle Export screen using C#, ASP.NET MVC 3 andSilverlight.  Worked with Model View Controller (MVC) Design Framework &AngularJS in developing Single Page Application(SOA). Expertise in developing web applications using AJAX, HTML, XAML, JavaScript, CSS, XML, Web Services &WCF.  Developed web services using Restful and SOAP protocols.  Created CSS files to be applied to various web forms on the web pages. Involved in building a rich web experiences using JavaScript.  Developing RESTFUL and SOAP based WCF web services for 3rd party clients.  Developed WPF screens for the portal as well as designed them.  Developed .Net Classes and domain objects and successfully utilized available Web services Used XML and XSL Transformations to display content on the website. Developed Web Services invoking them by using XMLSOAP and WSDL tool for creating proxy classes. Used Web Services (SOAP, WSDL) for communicating with other application and components. Created XML File Parsers to retrieve Data using XPATH. Deployed web application on Internet Information ServerIIS for production. Used Ajax tool kit, Multi views, regular expressions, regular expression validates, user search controls. Wrote Data Access Layer Methods (ADO.NET), T-SQL Queries, Store Procedures, and SQL User Defined functions for fetching Transaction details, Customer Details, and Product Configuration data. Written Queries using T-SQL Statements, Views, User Defined Functions, Stored Procedures, Triggers in SQL Server 2008 for inserting/Updating/Deleting the data into the relational tables. Worked with Data Transformation Services (DTS) for the data layer. Environment: Microsoft Visual Studio.NET, C#.NET,MVC,restful;,ADO.NET ,Lead tools, SQL Server 2005, SOAP. Education: Bachelors in Electronics."}