{"text": "Name: margaret margaret E-Mail: margaret.margaret@gmail.com Address: Manila, Philippines Github: https://github.com/margaret LinkedIn: https://linkedin.com/margaret Phone No. 9842474735 SUMMARY Over 7+ Years of IT experience  in development and design of ETL methodology for supporting data transformations & processing in a corporate wide ETL Solution using Informatica 8.x, SQL Server  and Oracle10g. Strong Experience in using Dimensional Data Modeling, Star Join Schema Modeling, Snow-Flake Modeling, FACT and Dimensions Tables. Proven track record in planning, building, and managing successful large-scale Data Warehouse and decision support systems Comfortable with both technical and functional applications of RDBMS, Data Mapping, Data management, Data transportation and Data Staging Extensively worked on Informatica Designer Components-Source Analyzer, Warehouse Designer, Mapping Designer & Mapplet Designer, Transformation Developer, Workflow Manager and Workflow Monitor. Experience in designing and implementing ETL solutions for DataMart and Data Warehouse. Experience in writing UNIX shell scripts to support and automate the ETL process. Knowledge in Data Analyzer tools like Informatica Power Exchange (Power Connect) to capture the changed data. Extensive experience creating procedures in T-SQL 2008. Extensive knowledge in all areas of Project Life Cycle including requirements analysis, system analysis, design, development, documentation, testing, implementation and maintenance. Good Experience in writing, testing and implementation of the triggers, stored procedures, functions, views, materialized views, Cursors at database level using SQL, PL/SQL for Oracle 9i/10G and SQL SERVER 2005,2008. Experience in using the Informatica command line utilities like pmcmd, pmrepserver and pmrepagent to execute or control sessions, tasks, workflows and deployment groups in non-windows environments Extensively worked on Teradata tools & utilities like Fast Load ,Multi Load, TPump, Fast Export,Teradata  Parallel Transporter (TPT) and BTEQ. Automated Informatica flow of loading data by using Autosys scheduler. Expertise in Query Analyzing, performance tuning and testing. Experienced in using database interface tools like Toad and PL/SQL Developer. Ability to meet deadlines and handle pressures coordinating multiple tasks in project environment, excellent communication, interpersonal, analytical skills. TECHNICAL SKILS: WORK HISTORY: PROFESSIONAL HISTORY :\t PROFFESIONAL EXPERIENCE: Pfizer, Peepak, NJ\t\t\t\t\t\t\t\t\tAugust’12– Till Date Description:  \tPfizer is world leader in Drug development. Enterprise Data Ware House (EDW) team deals with the major four systems. Using BI solutions need to create data ware house around the clinical trials. Data from legacy systems and partners are pulled and then loaded into stage tables, further loaded into Dimensions & Facts respectively by matching the corresponding Identifiers. The PatiectCentricView system will provide a single source for all clinical data for users to easily access and use across the enterprise.  Roles and Responsibilities: Created mapping to import DVSO source data(StudyList, PlanList, Milestone, Recruitment) using Informatica Web service. Used advanced transformations like Java transformation and sql transformation. Used Informatica IDQ to check and apply data quality rules. Defined the Source databases and Target databases in Informatica.. Involved in adding Sources and Target databases to Mapping Designer of Informatica. Created the Mappings in Informatica. Worked on several transformations such as Filter Transformations, Joiner Transformations, Rank Transformations, lookup, update strategy, Sequence Generator Transformations, Stored Procedure Transformations, Aggregate transformations and Expression Transformations in Informatica. Involved in creating, editing, deleting and scheduling of the Sessions in Informatica. Involved in preparing the specification documents for individual mapping customization. Creating mappings to extract data from source files, transform the data using filters, expressions and stored procedures and then load to Oracle data warehouse. ENVIRONMENT:  Informatica Power Center 9.5/9.1,Informatica IDQ 9.5, Informatica Metadata Manager, Composite, Test Director, AutoSys, UC4 , Business Objects 4.0 , HP UNIX, Windows NT, Oracle 11g, Erwin 7.2, SQL, PL/SQL, Toad 11.5 and SQL Loader Community Loans of America, Atlanta, GA\t\t\t\t\tJul’11 – Aug’12 Role: Sr. Informatica Developer           Community Loans of America provides short-term loans to persons with bad credit at higher rate of interest.Project description included Extraction and Transformation of data from various sources such as Oracle, SQL Server, XML and Flat files and loading them into the Oracle target database. Responsibilities: Worked closely with business analyst and Data Warehouse architect to understand the source data and need of the Warehouse. Translate customer requirements into formal requirements and design documents. Involved in creating the design and technical specifications for the ETL process based on Functional specifications. Worked extensively to create integration to build DataMarts. Written Informatica mapping for dropping and recreating the indexes of database tables. Development of address cleansing Mapplet and mapping using First logic plug-in. Worked extensively with Extraction, Transformation and Loading of data from Multiple Sources (oracle,Netezza,Taradata, fixed width and delimited flat files) to ORACLE using Informatica. Worked on Scheduling workflows and sessions using Informatica scheduler and have implemented  decision task and email task for tracking the successful completion Handled the creation of tables, views, triggers, stored procedures, functions, sequences in the database using SQL and PL/SQL scripts. Experence in using Taradata tools like Fast Load ,Multi Load, TPump, Fast Export,Teradata  Parallel Transporter (TPT) and BTEQ. Extensively used T-SQL in creating Procedure. Implemented complex mapping such as SLOWLY CHANGING DIMENSIONS (Type II). Worked on various types of transformations like Expression, Joiner, update strategy, Aggregator, Filter and Lookup. Created UNIX scripts for parsing and modifying data and experience in using AUTOSYS job scheduler for automation of UNIX shell scripts and batch scheduling. Facilitate end-user procedures development. Environment: Informatica Power Center 9.0.1/8.6.1 (Power Center Designer, workflow manager, workflow monitor), Oracle 11g,DB2,TARADATA,NETEZZA,XML,SQLServer2008,UNIX,TOAD,AUTOSYS, CONGNOS. Foxconn, San Jose, CA\t\t\t\t\t\t\tSept ’10 – June’11 Role: ETL Developer Foxconn Technology Group is a Taiwanese multinational electronics contract manufacturing company, headquartered in Tucheng, New Taipei, Taiwan. It is primarily an original design manufacturer and its clients include Major American, European, and Japanese electronics and information technology companies.The main objective of this project was to build Data marts for Sales and Marketing Systems, manage historical data about the various products, customers and investors. Responsibilities: Participated in the analysis, design, development, and testing of ETL development projects. Also, was involved in assignments that required Data analysis to help out other team members to prepare new project requirements. Used Informatica Power Center 8.6.1/8.1.3 for Extraction, Transformation, & Loading of data from multiple sources to multiple targets. Extensively involved in developing ETL processes, loading and validating data from source systems into the data warehouse using Informatica and/or Oracle Data integrator (ODI) and Oracle SQL, PL/SQL procedures. Worked extensively using Informatica designer components – Source Analyzer, Warehouse designer, Mapping Designer, Mapplet Designer, and Transformation Developer for defining Source & Target definitions and coded the process of data flow from source system to data warehouse. Worked extensively using T-SQL. Used  Teradata tools & utilities like Fast Load ,Multi Load, TPump, Fast Export, Teradata  ParallelTransporter (TPT) extensively.  Extensively used Informatica functions LTRIM, RTRIM, IIF, DECODE, ISNULL, TO_DATE, DATE_COMPARE in Transformations. Used Error handling strategy for trapping errors in a mapping and sending errors to an error table. Worked Closely to build DataMart and Data Warehouse as a part of regular job. Used AUTOSYS for scheduling the workflow. Converted existing PL/SQL procedures/packages to ETL Mappings using Informatica Power Center. Performed Unit Testing and Integration Testing on the mappings. Involved in Implementing SLOWLY CHANGING DIMENSIONS – Type I & II in different mappings as per the requirements. Environment: Informatica Power Center 8.6.1/8.1.3, Oracle 10g, Teradata,Netezza, MS Access, SQL Server 2008,Sybase,PL/SQL,UNIX,TOAD,COGNOS,AUTOSYS. Morrison Management, Atlanta, GA\t\t\t\t\t\t\tOct ‘09 – Aug’10 Role: ETL Developer Morrison Management is Atlanta-based Company providing food, nutrition and dining services to healthcare and senior living communities. The main Objective of the project is extract data from various legacy Systems and make available in OLAP System for reporting purpose. Responsibilities:       Analyze the source systems data and the current reports at the client side to gather the requirements for the Data Warehouse Data Model. Developed mappings using Source qualifier, Aggregators, Connected & unconnected Lookups, Stored Procedures, Filters, Sorter & Update strategy Transformations using Power Center. Used Lookup Transformation to access data from tables, which are not the source for mapping and also used Unconnected Lookup to improve performance. Responsible for testing the mappings and ensure that the mappings do the transformations as proposed. Involved in Creating tasks, Worklets, workflows to load the data  Scheduled, Run and Monitored sessions using workflow manager and workflow monitor. Troubleshoot problems by checking Sessions and Error Logs. Also used Debugger for complex problem troubleshooting. Used PMCMD commands for stopping and starting workflows and tasks. Worked closely in preparation of technical documentation of transformation components. Participates in design and development reviews Developed UNIX to automate different tasks involved as part of loading process and scheduling. Performed Unit Testing and Integration Testing on the mappings. Involved in maintaining effective relations with co-workers and business People. Environment: Informatica Power Center 8.1.3, Oracle 9i, Data Stage, SQL* Loader, Windows 2000, DB2,Taradata, MS Access, UNIX. Chaudary Group, Nepal.\t\t\t\t\t\t\tJan’08 – Sept’09 Role: ETL Developer Chaudary Group has its hand in multiple businesses. It focuses on Infrastructure, homes, real estate, healthcare, education and power sector. Data are extracted from various data source like Oracle, flat file, SQL Server, DB2 and stored in data mart. Then finally transformed and loaded into a centralized data warehouse for various strategic business reports. Responsibilities: Responsible for business analysis and requirements collections. Prepared the DDL’s for the staging/work tables and coordinated with DBA for creating the                       development environment and data models. Developed ETL mappings, Transformations and Loading using Informatica Power Center 7.1.2. Used PL/SQL with Informatica Power Center 7.1.2 for Oracle 8i database. Performance tuning and bottleneck resolution. Created and Implemented Reusable Sessions like E-mail.  Designed and documented the validation rules, error handling and test strategy of the mapping. Written different varieties of loading scripts for loading the data in to DB and developed scripts to extract data in to files. Developed UNIX shell scripts to automate the Data Load processes to the target DW. Involved in design and creation of Fact tables and Dimensions. Used Informatica tool to handle complex mappings and extensively used various Transformations including Source Qualifier, Aggregator, Lookup, Filter, Update Strategy, Expression, Sequence generator and Sorter. Done various optimization techniques in Aggregator, Lookup and Joiner transformation. Environment: Informatica Power Center 7.1.2., Oracle 8i, TOAD, SQL Server, Flat Files, Windows XP, UNIX, MS Visio. Nepal Bangladesh Bank\t\t\t\t\t\t\tDate: Aug’06 – Dec’07 Role: Informatica Developer Nepal Bangladesh Bank is a public commercial bankengaged in all traditional commercial banking activities, including foreign exchange, telebanking facilities, trade and industry finance, safe deposit lockers, corporate banking with a wide network of agencies and correspondence banking with other major financial institutions in the world. Data residing in SQL Server, Oracle, Sybase, flat files are consolidated onto target warehouse database built on Oracle 8i. Responsibilities: Involved in analyzing the systems and gathering of requirements. Analyzed the requirements to identify the necessary tables that need to be populated into the staging database. Extracted the data from Flat files, SQL Server, Oracle, DB2, and Sybase and load the data into flat files, Oracle and SQL Server using Informatica Power center. Created shortcuts for source and target and also created Reusable Transformations, Mapplets in Shared folder. Created mappings using transformations like Source Qualifier, Aggregator, Expression, lookup, Router, Filter, Update Strategy, Joiner, Union, and Stored procedure, and XML transformations. Performed Data Migration from OLTP to Data warehouse environment. Interacted with the business people on user requirements. Schedule and Run Extraction and Load process, monitor task and workflow using the Workflow Manager and Workflow monitor.  Used Informatica features to implement Type I, II changes in Slowly Changing Dimension tables. Used mapping parameters and variables Extensively worked on UNIX. Effectively involved in user accepting testing and preparing test cases. Periodical Interaction with Client to resolve mapping issues. Environment: Informatica Power Center 7.1.2, Oracle 8i, UNIX Shell Scripts, Flat File, SQL Server 2005,DB2,Sybase,TOAD 8.6 Education Qualifications \tBachelor in Business Studies from University Of Peshawar, Pakistan."}