{"text": "Name: minnie minnie E-Mail: minnie.minnie@gmail.com Address: Pingdingshan, China Github: https://github.com/minnie LinkedIn: https://linkedin.com/minnie Phone No. 384954096001 PROFESSIONAL SUMMARY Overall 8 years of experience in database administration, system maintenance, production support, RAC, performance tuning, standby, replication, space management, installation, migration, backup recovery, cloning and database security. Responsible for creating new databases, installing Oracle binaries, creating backup policies, applying patches and patchsets, and performing database upgrades Experience of working during various phases of Oracle Application's Implementation and maintenance of multiple E-Business Suite instances. Experience with E-Business Suite Product Families like HRMS, Financials, ISupplier, Manufacturing, other Application Modules and Self Service Applications. Provided support to the Database system Infrastructure area that had few critical Business Systems including TR, Bills Order and Tracking, Online Charges. Expertise in using Oracle 11i and R12 E-Business Suite Utilities viz.- Rapid Installer, ADADMIN, ADPATCH, ADSPLICE, ADCLONE, AUTOCONFIG, RAPIDCLONE, etc. Installed and configured Oracle 9i, 10g, 11g, 12c on Sun Solaris, AIX, UNIX/LINUX, HP-UX and Windows environment. Experience in managing the workload of concurrent requests using work Shifts, Custom Concurrent Managers, Request Types etc in Concurrent Manager tuning. Experience in installing 10gAS and Fusion Middleware discoverer and integrating it with Oracle Applications. Expertise in using SQL & PL/SQL and in writing Stored Procedures, Functions, Packages and Triggers. Rebuild Indexes, table partitioning, tuning memory usage and SQL tuning using Explain Plan, SQLTrace, TKPROF and Statspack for best performance. Worked closely with the application, development and middleware teams for bug fixes and escalation of critical issues related with WAS. Employed predefined UNIX scripts to cleanup database files such as outdated archived redo logs and trace files out of bdump, udump and audit directories. Process/workflow analysis, project management from analysis and design for implementation. Extensive knowledge in Database Backup and Recovery concepts using RMAN utilities (scheduling full/incremental/cumulative backups, hot/cold backups writing/editing UNIX Shell Scripts for RMAN). Experience in database cloning with RMAN, Capacity Planning, Database Refresh and Patch management. Handled daily production problems/change requests (DBCRS) with Oracle. Experience in database troubleshoots and problem solving to ensure that the system meets requirements, consistency and availability. Documented all technical details including operations, maintenance and end user application issues. Excellent Communication skills, co-ordination and Communication with system administrators, business data analysts and development teams. EDUCATION AND CERTIFICATIONS Bachelors of Technology – JNTU, Hyderabad, India. Technical Skills: PROFESSIONAL EXPERIENCE Client: Aon Hewitt, Chicago, IL.                                                                                                          May 2016 – Present Role: Sr. Database Administrator Responsibilities: Performed database administrative activities on different databases like Oracle, DB2, MY-SQL along with managing Oracle Retail Applications and troubleshooting its related issues. Installed and configured RAC (2 node) and Performed up-gradation of grid infrastructure and Oracle databases from 11.2.0.1 to 11.2.0.3. Monitoring and managing of Oracle instances using Enterprise Manager Grid Control (OEM grid)  10g /11g/12c. Performed various tasks on ASM, creating a disk group, adding a disk to disk group, making disk online/offline and troubleshooting issues in ASM environment. Maintaining ASM in RAC environment and Monitoring Health checks of OCR, VOTING DISKS and Interconnect for better performance and troubleshooting issues in RAC environment (11GR2). Proactive managed the database to prevent it from poor performance by using the Automatic Workload Repository (AWR) and Automatic Database Diagnostic Monitor (ADDM) to analyze the statistic levels. Perform data refresh at Schema level using EXPDP/IMPDP utility and Refresh of 12c Pluggable database as per Application team's requirement. Using Shell scripting configured alerts for DB health check, monitoring tables space usage, heap usage in application servers and managing rollback segments. Involved in Capacity Planning, Tuning the RAC interconnect, Finding RAC wait events. And Tuning the RAC environment using the Enterprise Manager Grid Control. Performed OBIEE Admin works like new ID creation, Account modification of existing users, Password reset and Deletion of accounts. Provided Database Security and user management by Authenticating, Auditing, encrypting and enterprise security for availability, liability and integrity for the organization. Raising PMR/SR with Support Vendor's to fix bugs/issues on Production databases. ` Environments: Oracle 9i/10g/11g/12c, IBM DB2 UDB 9.7/10.5, MY SQL 5.1, Oracle Retail Application, Oracle Weblogic server, AIX, RHEL, Solaris, ASM, OEM 12C(Cloud Control), RAC 11gR2, RMAN and Data Guard, Explain Plan, DBMS_SCHEDULER, Oracle-Wallet-Management, SQL Developer, Toad for Oracle and DB2, PL/SQL Tuning, Data Pump, SQL Loader. Client: Wells Fargo, Charlotte, NC\t\t                                                             Duration:  Nov‘14 – April’16 Role: Sr. Database Administrator. Responsibilities: Developed centralized monitor database activities, scripts such as space management, alert Log, cleanup, RMAN Backup Jobs, Gather stats for Schemas, Table space monitoring, Disk monitoring, etc. Upgrade of oracle 9i to 1og, 10g R2 to 11g R2 on RHEL. Performed administrative maintenance, monitoring on Oracle database systems in a global 24x7 operational environment. Working Experience with latest TOAD having new features PLSQL & SQL Script Debugger, Database Health Checkup, ASM Manager, Diagnose Extents, Segment Advisor, SGA Trace, Query Builder. Created and Administered the Physical Layer, Business Model & Mapping Layer and Presentation Layer in an OBIEE repository. Planned and Implemented Disaster Recovery databases using Dataguard. Worked with system administrator for setting ports for the Firewall that will work for Oracle, OBIEE and MSSQL. Developed shell scripts for tracing Oracle errors, free space in the table spaces and free disk space in Archive log destination for production databases. Shell Script creation to automate the data loading process. Monitored DR (Data Guard) implementations regarding connectivity issues and \"log shipping\" to failover site. Implemented advanced features of Oracle 10g such as Automatic Database Diagnostic Monitor (ADDM), Automatic Workload Repository (AWR) for monitoring database performance. Modified and updated the Performance tuning scripts. Converted databases from ZFS file system to ASM file system and Supported Oracle Cluster series using ZFS Storage Subsystem. Environments: Oracle 9i/10g RAC on Solaris/Linux, RMAN, Data Guard, UNIX Shell Scripting, Quest Performance Analysis, Quest Space Management tool, DB Artisan, Toad, PL/SQL Developer, OEM. Client: AIG, TX\t\t                                                                                                          Duration:  Oct ‘13 –Nov’14 Role: Database Administrator. Responsibilities: Monitoring of the queries with high response time and high disk reads per execution (Top SQL) and tuning the same using Explain Plan, Auto trace. Responsible for SQL query tuning, optimization. Performance tuning using tools such as Tkprof, STATSPACK, Explain plan and SQL*Trace. Installed OEM 10g grid agent on servers and configured to OEM 10g Grid Control. Rebuild Indexes, table partitioning, tuning memory usage and SQL tuning using Explain Plan, SQLTrace, TKPROF and Statspack for best performance. Refresh databases and schemas from one environment to another using Oracle Data Pump and RMAN cloning methodology. Oracle ASM(Automatic Storage Management) management allocate LUNs, create ASM Disk Groups. Applying Patches 9.2.0.6 and applying Oracle DST Patches on Oracle database. Assist customers configuring front-end applications like JAVA to Oracle RAC database. Day to day activities includes providing Sybase support and troubleshooting of issues like Connectivity, Memory issues, Query performance, Server related, Autosys jobs failures. Install, upgrade and maintain Oracle 10g, 9i on Sun Solaris and Windows 2003, Redhat4. Application Tuning by tuning queries, identifying problematic code, creation of indexes, re-writing queries using an optimized path, creation of materialized Views and gathering necessary statistics on objects etc. Environments: Oracle /10g/9i, Sun Solaris 5.x, HP-UX 11.x , OEM 10g, Oracle 10g RAC, TOAD, putty, STATSPACK, EXPLAIN PLAN, SQL*Trace, Redhat 4. Client: ORBIT Analytics, Hyderabad, India.                                                               Duration: July‘11 – Aug‘13 Role: Jr. Database Administrator. Responsibilities: Created and Managed users, roles, schemas, tables, views, indexes and rebuilding Indexes and granted privileges. Created and managed database objects like table spaces and increase the size of the table space by resizing and adding the data files. Good knowledge on Oracle EBS 11i/R12 application as we got the opportunity to closely work with Application admins. Extensive used Oracle Data pump, Exports/Imports utility for moving data among the servers. Monitoring Growth of tables and undertaking necessary re-organization of database as and when required. Configured authentication schemes in Oracle Access Manager for multiple target resources. Use various performance tuning methods like sql profiles, stored outlines, export-import of stats to fix the performance issues. Involved in taking logical backup using Data pump Exp-dp and Imp-dp Utility. Implementing Database Security, Management of role-based security. Actively working with the developers to tune any custom code and migrate it to various Dev and UAT instances. Environments: Oracle 9i/10g/11g, Red Hat Linux, Cent OS, SQL, TKPROF, STATSPACK, OEM, PL/SQL, Oracle Enterprise Manager Database, SQL*Loader. Client: Elite Technologies, Hyderabad, India.\t\t                                               Duration: Aug’09 – June’ 11 Role: Systems Engineer. Implemented Data guard, creating both logical and physical standby databases in 10g and 11g RAC environment for production database. Installation, configuration and maintenance of Oracle 10g and 11g database on SUN SOLARIS. Worked as Primary team member to provide 24/7 on all production database support Configure, implement 10gR2 RAC with ASM on Sun v890 servers. Setting and Installing Oracle Enterprise Manager (OEM) and Enterprise Backup Utility. Create physical and logical standby database from hot backup of primary database. Scheduling the databases backup using Cron tab and VERITAS net backup. Providing support to the SA team for Oracle RAC compatible hardware configuration. Applied patch set and interim patches whenever required to make the database software up to date. Environment: Oracle 10g, 11g, SQL, Oracle Grid Control, Oracle Enterprise Manager Database Control, TOAD, SQL Developer, SQL*Loader, Sun Solaris, Exports/Imports."}