{"text": "Name: clara clara E-Mail: clara.clara@gmail.com Address: Tai’an, China Github: https://github.com/clara LinkedIn: https://linkedin.com/clara Phone No. 181099834038 PROFESSIONAL SUMMARY 7+ Years of professional experience in design and development of web applications with UI technologies in various domains . Experience in Developing User Interface(UI) Rich Web Applications, and Web Service Applications using Front End/User Interface(UI) Technologies like HTML, HTML5, CSS, CSS3, XHTML, DHTML, XML, Object Oriented JavaScript, Angular JS, JQuery, Backbone JS, Bootstrap, Ajax Concepts, CSS3 Media Queries, nodes JS, Jasmine, Karma, Istanbul. Strong working experience in node JS technologies/modules. Strong experience in node JS framework express. Strong experience in Jasmine Unit Test framework. Hands on experience in Responsive Web Design using Bootstrap. Experience working on scalable environment using Agile/SCRUM, Test driven development (TDD) methodologies. Adapted Model-View-Controller (MVC) frameworks for developing web applications. Extensive experience in system analysis, design, development and implementation of web based and client/server application using HTML5, CSS3, JavaScript, AngularJS, AJAX, jQuery, Java/J2EE, Servlets, JDBC, XML. Have very good knowledge on core java. Conceptual knowledge in RESTful web services. Experience in integration of Social Media Plugins like Facebook, Twitter, Google plus, Linked In. Extensively used Angular JS for client side validation. Developed the custom components using AngularJS custom directives Extensively used Bootstrap for customization of web application. Solid working experience in various IDE’s: Notepad++, Sublime, Komodo IDE, Eclipse, visual studio etc. Well-versed in Object Oriented Programming (OOP) with JavaScript. Developed UI using JQuery and JavaScript Library for Web Application and Mobile Application and extensively developed Rich Internet Applications (RIA) and various UI widgets using jQuery. Skilled at analyzing and solving browser compatibility challenges and possesses ability to maintain consistency and well commented HTML and CSS markup Working knowledge on Adobe Experience Manager (AEM/CQ5) and CMS. Have written store procedures in DB, have good experience with MYSQL, MSSQL and oracle db.  Experienced in deploying applications on Application servers such JSON the Tomcat 3.x/4.x Web server. Excellent working knowledge and thorough exposure on compatibility issues with different versions of browsers like Internet Explorer, Mozilla Firefox, Safari and GoogleChrome. Expertise in using source code control systems such as GIT, JIRA, and Jenkins. A result-oriented professional with good communication, leadership, team management, analytical and co-ordination skills. TECHNICAL SKILLS Education: B.Tech in Electronics and Communications from Jawaharlal Nehru Technical University, India . PROFESSIONAL EXPERIENCE Bridgestone, Aiken, SC   \t\t\t        Feb 2015 – Present Role: Sr. Java/UI Developer Bridgestone Corporation, the world’s largest tire and Rubber Company. BSAM and its subsidiaries develop, manufacture and market a wide range of Bridgestone, Firestone and associate brand tires to address the needs of a broad range of customers. Dealer Information System is a web application for dealer tracking and maintaining the dealer information. The system provides functionality to search, add, view and edit dealer information, organize sale events, track the dealer records, documents and communication.  Responsibilities: Done the design, development and testing phases of Software Development using  AGILE methodology and Test Driven Development (TDD) Involvement in all stages of Software development life cycle including Analysis, development, Implementation, testing and support. Hand-coded HTML5, CSS3, Java Script, AJAX and jQuery to create front-end. Designed and developed the application to be responsive for desktop, mobile and tablets using Twitter Bootstrap (HTML5, CSS, and JavaScript). Extensive usage of BOOTSTRAP and CSS for Responsive design. Developed single page web application using JavaScript framework Angular JS. Bootstrap used along with Angular JS in creating the Application. Defined new validations through Angular.js for the form field validation implemented through HTML5. Designed, implemented and configured WCF service layer.  Worked with XML, XSD and XSLT while implementing WCF. Used XPATH, XSLT for XML transformations and XML Beans for parsing the XML documents. Developed UI using JavaScript, HTML, backbone.js, CSS, JavaScript validations and XML. Worked on MVC Frameworks like Bootstrap, Angular.js, Node.js. Applied JQUERY core library functions for the logical implementation of all the applications at the client side Architected, designed and implemented a SPA (Single Page Application) in Angular JS which consume JSON from a Spring MVC, using Spring Security to secure the Application. Created reusable templates and style sheets based on UI standards and guidelines; Performed functional tasks using specifications and wireframes. Review Click thru prototypes using HTML, CSS, Angular JS, DHTML, with adhering toW3C and browser compatibility standards. Built templates – slicing and coding Photoshop comps using hand coded HTML / XHTML /HTML5 and CSS/CSS3. Used JQuery to make the HTML5, DHTML and CSS3 to interact with the Angular JS functions Developed the Site using the Struts with Spring Integration using the tiles framework Designed data formatted web applications using HTML, DHTML, XHTML and CSS and deploy the script by client side scripting using Angular JS. Developed presentation layer using HTML5, Angular JS, CSS3, AJAX etc. Responsible for checking cross browser compatibility, Responsive Web Design and hence worked on different browsers like Firefox, Google Chrome and Internet Explorer. Extensively used/modified JQUERY to perform AJAX calls for creating interactive web pages on JSON response. Developed the application front-end using Spring framework 3.0 that uses MVC design pattern Used spring framework as middle tier component and integrated with Hibernate for back-end development. Coordinate with Interface Design Architects for meeting accessibility standards at code level. Design and build UIs on Server Platform in team environment. Participating in product development discussions and providing UI related information. Maintained W3C standards. Used log4j to log different types of messages to write on to the proprietary log model. Environment: Agile, HTML5, CSS3, JavaScript, jQuery, JSF, AJAX JSON, Bootstrap, Angular JS, JAVA, JSP, MYSQL, Spring MVC, Hibernate, Eclipse IDE, Tomcat server, web sphere application server, Spring framework 3.0, Struts, log4j. Cigna, Bloomfield, CT\t\t\t\t                                                               June 2014 - Jan 2015 Role: Java/UI Developer Subscription Management services for large service provider customers. Subscription management involves aggregating data from many systems through OSS/BSS integration. This platform provides reporting tools for the service provider to track subscription data. It also provides the ability to react to billing events and schedule changes to subscriber levels of service. Responsibilities: Involved in the complete SDLC – requirement gathering, development, testing, and deployment. Worked with the technical architect to translate the functional requirements into technical specifications. Worked with Core Java Concepts such as Multi-Threading, Inner Classes, String Classes and Exception handling.  Development Java classes for client side modules. Designed and implemented four Agile Scrum teams for product development.  Developed presentation tier using JSP, Java Script,AngularJS,JSF, AJAX,HTML and CSS for manipulating, validating, customizing, error messages to the User Interface. Involved in developing client side GUI using Swings framework. Mobile responsive site built with Bootstrap and jQuery. Involved in the gathering of business requirements and translating them to the report specifications for the conversion of Actuate Reports to Jasper platform. Involved in joint application development sessions with various of on shore and off shore teams. Implemented procedures, packages, triggers, and different Joins to retrieve the data base using PL/SQL, SQL scripts. Created DDL, DML scripts to create tables and privileges on respective tables in the database. Actively involved in writing complex named queries, mapping persistent classes and managing the associations in the mapping files. Involved in creating various Data Access Objects (DAO) for addition, modification and deletion of records using various specification files. Integrated springs framework with Hibernate that is used for Database operations. Generated POJO classes to map to the tables in the database using the JPA-Hibernate integration. Implemented database using Oracle. Involved in writing SQL queries and stored procedures for data manipulation. Updated pages using HTML, CSS in Angular JS framework. Day to day tasks related to website maintenance such as updating the content, the look and the feel etc. Maintain, enhance and recommend solutions that best suit business and technology needs from UI. Used JUnitand Jasminefor unit testing. Used Maven to build and generate code analysis reports.  Eclipse Helios as IDE for the Java development. Efficiently managed the tasks and working and delivering features in a fast paced scrum environment. Environment: Core Java, JSP, AngularJS, HTML, CSS, JavaScript , J2EE, Spring, Maven, Oracle 10g, JDeveloper 10g, REST Web Services, Eclipse, Apache Axis, WebSphere, Jasper Reports. The Kroger Company, Cincinnati, OH                \t\t\t                                 Aug 2013 - May 2014 Role: UI Developer The Kroger Company is an American retailer. It maintains markets in 31 states with store formats that include supermarkets, superstores, department stores, convenience stores, and mall jewelry stores. Kroger-branded grocery stores are located throughout the Midwestern and Southern United States. Kroger also is parent to several “banner” chains, such as Ralphs in California. The Kroger Company now is planning to go into online shopping using e-commerce applications. This project deals with UI part of the e-commerce application. Responsibilities: Involvement in all stages of Software development life cycle including Analysis, development, Implementation, testing and support. Worked closely with system analyst to understand the technical requirements of the projects  Worked with Dreamweaver, Photoshop to develop Web design and application development Designed dynamic and multi-browser compatible pages using HTML4/5, CSS2/3, JQuery, AngularJS,ext.-JavaScript, Flex and AJAX Developed different Carousels using JQuery Carousel and Accordions with the help of JQuery UI for different product categories Implemented MVC architecture, developed controllers and views using AngularJS Worked on creating responsive website for smart devices using responsive design using BOOTSTRAP Used HTML5 autocomplete for form filling Responsible for ensuring the pattern consistency across all pages Responsible for design and development of the web pages from mock- ups Created small web based widgets for their user facing websites using object oriented jQuery Used AJAX and JSON to make asynchronous calls to the project server to fetch data on the fly Improving the performance of the websites Using complex Object Oriented concepts Responsible for creating the screens with table-less designs meeting W3C standards Applied JQuery scripts for basic animation and end user screen customization purposes Worked closely with SQA team in fixing the reported bugs/defects and checking cross platform    compatibility Designed flash plug-ins for including different functionalities and content Implemented best Search Engine Optimization (SEO) techniques for designing webpages Used Clear Quest for defect tracking and SVN for version control. Designed XML files for maintaining contents like video, images and audio to display them in flash application Participated in day-to-day meeting, status meeting, strong reporting and effective communication with project manager and developers. Involved in fixing the bugs on functionality, performance and designing issues with JavaScript and JQuery Environment:HTML4/5, CSS2/3, JavaScript, JQuery, AJAX,J2EE, AngularJS, SVN, Clear Quest, Bootstrap, flex, Photoshop, Dreamweaver, Flash and Tomcat. Banfield Pet Hospital, Portland, OR                                                                                     Nov 2012 – July 2013                                    Role: UI Developer                                                                                 \t\t Banfield Pet Hospital is a privately owned company based in Portland, Oregon, United States, that operates veterinary clinics. A subsidiary of Mars, Incorporated, Banfield owns clinics in the United States, Mexico, and the United Kingdom. Founded in 1955, the company operates many of its 800 plus clinics inside PetSmart stores. Banfield is the largest privately owned veterinary practice in the United States. Responsibilities: Involved in developing the UI pages using HTML, DHTML, CSS, JavaScript, JSON, jQuery, Ajax. Closely worked with business system analyst to understand the requirements to ensure that right set of UI modules has been built Used Agile and Scrum development methodologies. Used jQuery core library functions for the logical implementation part at client side for all the application. Debug the application using Firebug to traverse the documents and manipulated the Nodes using DOM and DOM Functions using Firefox and IE Developer Tool bar for IE. Involved in developing HTML and JavaScript for client side presentation and, data validation on the client side with in the forms.  Developed Page layouts, Navigation and presented designs and concepts to the clients and the management to review.  Involved in writing application level code to interact with APIs, Web Services using AJAX, JSON and XML. Developed web presentation layer using HTML and CSS according to internal standards and guidelines.  Responsible for checking cross browser compatibility and hence worked on different browsers like safari, Internet explorer, Firefox and Google chrome.   Used AGILE development techniques in all the development process and exposed to tools like Jira for tracking bugs and Rally to track the agile development Designed the table less web applications using CSS and with the help of and tags as per W3C standards.  Developed all aspects of the web application including maintaining, testing, debugging, deploying and printing. Environment: HTML 4.x, CSS2.x, JavaScript, JQUERY, AJAX, JSON, XML, APACHE TOMCAT Raymond Group, Hyderabad, India                                                                                     Sept 2010 – Oct 2012 Role: Java/UI Developer Raymond Group is one of India's largest branded fabric and fashion retailers. It is one of the leading, integrated producers of suiting fabric in the world, with a capacity of producing 31 million meters of wool & wool-blended fabrics. Responsibilities:   Analyzed Business Requirements and Identified mapping documents required for system and functional testing efforts for all test scenarios.  Performed Requirement Gathering & Analysis by actively soliciting, analyzing and negotiating customer requirements and prepared the requirements specification document for the application using Microsoft Word.  Developed Use Case diagrams, business flow diagrams, Activity/State diagrams.  Adopted J2EE design patterns like Session Facade and Business Façade. Configuration of application using spring 2.6, Struts 1.3, Hibernate, DAO's, Actions Classes, JavaServer Pages. Configuring Hibernate Struts and Tiles related XML files.  Developed the application using Struts Framework that uses Model View Controller (MVC) architecture with JSP as the view. Heavily used JQUERY UI to create various components such as Tabs, Accordions, Auto-Complete, etc.  Developed presentation layer using JSP, HTML and CSS, JQuery.  Extensively used Spring IOC for Dependency Injection and worked on Custom MVC Frameworks loosely based on Struts.  Designed a REST API based service for the security and identity management.  Developed Servlets and Java Server Pages (JSP), to route the submittals to the EJB components and render-retrieved information using Session Facade, Service Locator (design pattern).  Developed J2EE components on Eclipse 3.5 IDE.  Used JDBC to invoke Stored Procedures and also used JDBC for database connectivity to SQL.  Deployed the applications on WebSphere Application Server.  Used Oracle11g database for tables creation and involved in writing SQL queries using Joins and Stored Procedures.  Writing complex SQL queries and reviewing SQL queries for the other team members.  Developed JUnit Test Cases for Code unit test.  Worked with configuration management groups for providing various deployment environments set up including System Integration testing, Quality Control testing etc.  Environment: J2ee, JDK 1.6, JSP, Struts 1.3, Eclipse 3.5, Hibernate, RSA, SQL Developer, Oracle 11g, Rational Clear Quest, JQuery 1.4, EJB 3.0, JPA 2.0, JMS SQL, UML, MS Visio, Scrum. Neon InfoTech Pvt Ltd, Hyderabad, India               \t                                                       Aug 2008 – Aug 2010 Role: Jr. Java Developer Using Payroll Management System, Payroll can be generated based on employee's job type, pay rate and hours worked. Responsibilities:  Gathered requirements for the project and involved in analysis phase.  Developed quick prototype for the project so as to aid business in deciding the necessary ramifications to the requirements.  Used Waterfall Model for developing the Application. Used Enterprise Java Beans (EJB) to write the business objects for the application. Used Core Java Concepts like Collections, Generics. Developed the n-tier web application using core Java and Struts MVC. Developed web GUI involving HTML, XHTML, JavaScript, CSS, JSP's. Created UML class and sequence diagrams using Rational Rose.    Used strict Object Oriented model to separate the roles of the employees and their specifications to achieve extendibility and clarity.  Installation, configuration and clustering of BEA WebLogic Server on Windows NT platform.  Developed dynamic content of presentation layer using JSP.  Involved in the design of tables in oracle to store the pay information.  Used JDBC to interact with the Oracle database for storage and retrieval of information.  Tested code using JUNIT. Involved in communicating with clients on a daily basis to ensure their requirements are being met.  Deployed application on Tomcat. Environment: JAVA, Java Scripts, HTML, CSS, JUNIT, Web Logic, Tomcat 4.x, Oracle 8i"}