{"text": "Name: virginia virginia E-Mail: virginia.virginia@gmail.com Address: Yichun, China Github: https://github.com/virginia LinkedIn: https://linkedin.com/virginia Phone No. 754496807885 SUMMARY: Business Analyst with over 9 years of experience in the insurance (Life, Property & Casualty, Commercial Garage & Auto Policy) finance and mortgage domain. Hands on experience with solid understanding of Business Requirement gathering, Business Process flow, Business Process Modeling and database/data warehouse experience. Experience in Policy Administration Systems, Claims Systems and Billing Systems. Strong knowledge in Project Planning, Project Design, creating functional specifications and data flow diagrams. Worked on Insurance tools like Guidewire 7.0 (Policy center, Claim center and Billing center).  Strong knowledge of project management skills such as time estimation, task identification, and scope management. Strong knowledge of the Systems Development Life Cycle (SDLC) models such as Water Fall, Agile, Scrum and RUP. Ample experience in using Joint Requirement Planning (JRP) and Joint Application Deployment (JAD) sessions for gathering requirements and brainstorm ideas. Strong experience in working in key phases of the Software Development Life Cycle (SDLC) such as the Planning, Design, Analysis, Development and Testing for the software/system development process. Expertise in preparing Business Requirement Document (BRD), Use Case Specifications and Functional Specifications. Well acquainted with Workflows and Unified Modeling Language (UML) diagrams such as, Use case diagrams, Activity Diagrams and Sequence Diagrams. Experience in Business Intelligence, Data analysis, Data mapping, and Data Migration Used Joint Requirement Planning (JRP) & Joint Application Development (JAD) sessions to converge early toward a design acceptable to customer & feasible for developers & to limit a project’s exposure to change. Experienced in multiple Software Development Lifecycle Methodologies such as Waterfall, Agile, SCRUM and Rational Unified Process. Proficient in writing test cases and test scripts and executing tests. Compelling Multi-Tasking and organizational ability, with the capability to develop and implement strategies. Ability to work cohesively with all Stakeholders to formulate Functional models and prototypes to meet stakeholder expectations, and Workflow optimization Excellent Communication and interpersonal skills, capable of acting as the arbiter between client and developer with respect to project implementation. Extensive experience working with end users to answer their questions and gather feedback for requirements during certain phases of project. Expertise in handling workload for multiple projects. Self-motivated, adaptive and able to work in a team or independently in a deadline-driven environment TECHNICAL SKILLS: Management tools:\tRequisite Pro, Quality Center (ALM), SharePoint, Dragon Business Modeling:\tMS Visio, Rational Rose Defect tracking:\t\tHP ALM/ Quality Center  Languages:\t\t\tSQL, XML Front End tools:\t\tMS Office Suite Databases:\t\t\tMS SQL Server, Oracle   WORK EXPERIENCE Travelers, Harford, CT\t\t\t                                                                    Oct 2016 – Oct 2017 Sr. Business Analyst The Travelers Group Part of Commercial Lines/ Business Insurance group offers a wide range of property and casualty products and services. I was working on a commercial property and casualty insurance project, covering the CGL (Commercial General Liability) and business auto policy forms, excess liability/commercial umbrella and workers, Business Automobile Coverage, Specialty Lines, And Surplus Lines. Worked on a web application, that handles the full business process lifecycle for commercial Property and Casualty Underwriting. This includes name clearance, the recording of submission and quotation information, policy and premium registration, document processing, transaction and cash processing, finance reinsurance.  Responsibilities: Conducted mass user interviews with application user representatives and SMEs. Conducted walkthrough of BRD in the JAD Sessions with users and developers. Collected specific information to include in the Functional Requirements Document (FRD). Performed analysis on enterprise data/report integration & provided functional specification to development team to build Enterprise Reporting Systems. Functioned as the primary liaison between the business line, operations, and the technical areas throughout the project cycle. Involved in creating data models for the data warehouse and specify data mapping documents from specific data sources. Functioned as the primary liaison between the business line, operations, and the technical areas throughout the project cycle. Designed and developed complex Cognos reports using Report studio (list, summary, cross-tab, repeater and drill through reports). Proposed and prepared a template for storing e-mails exchanged by the Product Analysts, Underwriters, & Business Analysts for easy reference and retrieval of information in preparing requirements document. Analyzed Homeowners Business Requirements, Functional Design Documents and Underwriting Rule Manuals that are state specific. Implemented RUP’s iterative approach, which allowed increasing understanding of the problem through successive refinements, helped to incrementally grow an effective solution over multiple iterations. Worked in a fast paced atmosphere SCRUM and studied business processes, legacy application, and the corresponding Guidewire functionality and conducted requirements sessions.\nPrepared Business Context Diagram, Use Case diagrams and corresponding Activity Diagrams using Rational Rose to depict the workflows  Created, refreshed and supported Cognos Transformer models and cubes to support timely report execution. Responsible for the development of a Data Warehouse for personal lines property and casualty insurance. Compared Mainframe Output with Dragon Output for both Homeowner and Auto Insurance.  Developed Data Flow Diagrams and Data mapping agreement, illustrating the flow of data from the front end GuideWire Claim Center into the Application database Tables. Worked on Commercial lines Property and Casualty Insurance including both policy and claim processing and reinsurance. Interacted extensively with Under Writers on training them and getting their requirements.  Designed and developed Use Cases, Activity Diagrams, and Sequence Diagrams to depict the business process workflows. Developed comprehensive system test scenarios and test scripts. Responsible for performing back-end analysis and testing using SQL queries Facilitated the User Acceptance Testing (UAT) and documented any issues or defects and eventually got sign off from the relevant parties. Analyzed and documented Reinsurance Claims, Billing Collections, and Accounting modules of the application. Created business requirement documents and integrated the requirements and underlying platform functionality Collaborated in building a business analysis process model using Rational Rose, RequisitePro, and Visio. Utilized Agile Methodology to configure and develop process, standards and procedures. Designed and developed Use Cases, Activity Diagrams, Sequence Diagrams, OOD using UML Developed strategic partnerships with the business unit to prepare a solid knowledge base of the business line, including the business plan, products, and process’ and revenue streams aimed towards problem solving. Partnered with the technical areas in the research and resolution of system and process problems especially related to Power Builder platform. Provide customer service and support for Property & Casualty risk management needs Facilitated the User Acceptance Testing (UAT) with Business Users and documented any issues or defects and eventually got sign off from the right parties. Environment: Windows, MS Office(MS Word, MS Excel, MS PowerPoint, MS Visio), Agile, Cognos .NET, Oracle, Crystal reports, RUP, UML, SQL, SWOT analysis, GAP Analysis, Win Runner National Grange Mutual Insurance/ Main Street America, Keene, NH \t          Jan 2015- Sept 2016\t                Business Analyst                                                       \t  Silver Plume's PL Rating is a web based comparative rating portal which will integrate with MSA's (Property and Casualty) web based quoting system Main Street Station (One Shield Product) for rating insured risk. After selecting a MSA quote, the policy can be issued and processed via Silver Plume and Main Street Station. Silver Plume's  Rating sends out the request Accord XML which has the entire risk information. MSS rates the risk and sends out the premium for the risk submitted. The Framework is designed to capture the user information provided in Silver Plume, which is invoked through Web Services .The information is captured and processed through XML to create a quote with the given details. Framework sends the quote details to the Main Street Station. Once the quoted details are transformed from Silver Plume and rating is done in Main Street Station the premiums are calculated for end user. All the Transformation is done using a tool named as Dragon Designer. The framework of one shield (Dragon designer) is used to generate the flat file which consists of Business Variables which has been populated using Main Street Station application. This flat file will be deployed in mainframe server. Responsibilities: Participated in analyzing & understanding the requirements and eliciting the same to both Development and Testing teams.  Prepared the mapping document which helps the development team to understand and write the transformations. Good exposure in preparing Use cases & Functional design document (Property and Casualty). Implementing the requirement using Dragon Designer tool (One shield product). Worked on premium, taxes and surcharges calculation requirement using Dragon rating. Conducted functional and technical requirement gathering sessions with Stakeholders, Underwriting Managers and Operations Analysts for the Policy, Claims and Point-of-sale related modules. Drafted Functional requirement specifications (FRS) demonstrating current process and modified procedures for application entry, manual and auto rating processes for various entities to be insured. Created product related presentations, product related presentations, and prepared the demo scripts to be presented to the client. Interacted with SME's from the Underwriting team to validate business rules and setting up edit checks for these rules in the applications. Gathered requirements to implement rules based environment for calculation of discounts and surcharges that would be expanded based on future needs. Responsible for identifying and documenting business rules and creating detailed Use Cases.  Used Guidewire for Claim Center (claim lifecycle), Policy Center (policy lifecycle), and Billing Center (invoicing and payment lifecycle). Evaluated user request for new or modified program to determine feasibility, cost and time required, compatibility with current system and system abilities. Documented and consulted with users to identify current operating procedures and clarify program objectives.  Worked closely with the software design team and product managers to analyze and identify system requirements and produce system specification documents from resulting requirements. Created risk and issue logs and escalated critical breakpoints. Used Rational Clear Quest for tracking issues. Used Guidewire to upgrade the current Claim system to track the claim of the policyholders and third party applications Worked closely with stakeholders and SME’s for requirements gathering. Developed user manuals, presentations and training manuals as per project specifications and timelines, installation and operational procedures. Worked with software development team in using Agile-Scrum, in addition to educating upper management in order to champion the use of Agile/Scrum effectively Provide customer service and support for Property & Casualty (P&C) risk management needs.  Supervised regular status meetings and supply appropriate management reporting. Designed the business requirement collection approach based on the project scope and SDLC Methodology  Handled several projects through the entire life cycle, including initial research, specification, resource planning, milestone tracking, development, testing, and implementation.  Prepare and deliver high quality presentations about trading products and the solutions that can be provided with an aim to close a sale, retain a client, maintain or expand the use of a product and ultimately grow revenue.  Conduct workflow analysis of internal trading systems market data, connectivity, and order execution needs, as well as Used Guidewire policy center for all policy transactions Maintaining quality levels with the use of agile development practices such as automated testing, continuous integration, and refactoring, in addition to regression testing Nationwide Insurance, Columbus OH\t\t\t\t\t              June 2012 – Dec 2014                                     Business Analyst  Nationwide, a Fortune 100 company based in Columbus, Ohio, is one of the largest and strongest diversified insurance and financial services organizations in the U.S. In 2015, Nationwide selected Guidewire Policy Center to consolidate its multiple policy administration systems with one that could help the company increase its customer service capabilities, enable better underwriting risk analysis, and provide the needed flexibility to grow with its business. The Policy Center solution is enabling Nationwide to leverage automated underwriting rules and real-time functionality; Streamline the training of staff as a result of Policy Center’s intuitive interface, and bring new products and product enhancements to market more quickly. My role as a BA was responsible for business and functional requirements definition for policy administration and downstream systems as well as reporting, planning and facilitating UAT testing. Responsibilities: Worked under Agile/Scrum methodology with Sprint based goals. Analyzed As-Is & To-Be Systems during estimation phrase. Drafted Functional requirement specifications (FRS) demonstrating current process and modified procedures for application entry, manual and auto rating processes for various entities to be insured. Interacted with SME's from the Underwriting team to validate business rules and setting up edit checks for these rules in the applications. Coordinate regular status meetings and supply appropriate management reporting. Generated the sequence, state chart, and activity diagrams to enable understanding and representation of the business processes for ease of software system development in Rational Unified Process (RUP) methodologies using Rational Rose.  Designed the business requirement collection approach based on the project scope and SDLC Methodology  Elicitation of requirements with business clients through meetings, one-on-one sessions, and emails. Produced System Diagrams, Business Requirements, Workflows and other documentation as required for Project Analysis, Planning and Design. Documented Business Requirement Document and transformed into Technical Requirement document which was used to implement the solution.      ·   Presented business needs to technical teams and identified impacted Policy Center User Stories.          Prepared Use Case Models based on Business Requirements Documentation gathered through interaction with users.          Prepared Data Flow Diagrams (DFD), Sequential Diagrams in MS Visio.     Prepared and present functional/system requirements to stakeholders before development phase. Responsible for User Acceptance Testing before the final phase out.          Conducted the final user acceptance testing (UAT) and usability testing. Conducted manual data integrity testing using SQL·          Maintained Test Requirements, Test cases, and Traceability Matrix using Quality Center.          Worked closely with the project manager in planning, coordination and implementing the Agile methodology.  The Hanover Insurance Group, Worcester, MA                                                     Aug 2010 - June 2012                                             Business System Analyst\t\t\t\t\t\t       Hanover Insurance Group is a leading provider of Insurance Products. It provides various insurance products like property and casualty insurance to its individual and business customers. A web-based application (APLUS) was developed to allow agents to view underwriting reports on a real-time basis The company also provides third party administration services and disability management. Guidewire Claim Center is the project which was undertaken to upgrade the current Claim System to track its claim for both their owned Policy holders and third party applications.  Responsibilities:  Performed Requirements Gathering and Analysis, interviewed the SME (Subject Matter Experts), and ensured that contributors and all key stakeholders were motivated to complete assigned tasks. Worked on implementation and Guidewire suite integration; Policy Center and Billing Center with interfaces to all related systems. Compared Mainframe Output with Dragon Output for both Home owner and Auto Insurance.  Writing user stories for Business Process Flow, System Integration Testing based on the Configuration requirements of Guidewire Policy Center for Personal Auto LOB. Implemented ITIL Service Lifecycle methodology and best practices aligning IT services with the needs of the business. Designed and wrote technical documentation to enable adoption and usability. Prepared Business Context Diagram, Use Case diagrams and corresponding Activity  Conducted and participated in the JAD session with the SME’s and project team members. Supported different lines of businesses like Personal Auto and Home owners. Managed all the project lifecycle using RUP. Created the rules engine and the laid down the guideline for the smooth flow of the different project elements. The project involved parallel design, development, test case development and testing. Manage the Requirements (Business as well as System requirements), performed requirements analysis along with the creation of Use Case Scenarios. Modeling of the business and application using Rational Unified Processing (RUP) and Unified Modeling Language (UML). Responsible for Documentation in each phase of RUP Methodology, Risk Assessment, and Validation & Verification process. Prepared requirements document for Commercial Auto, Inland Marine, Crime, Worker’s Compensation, Umbrella, Business Owners Policy, Commercial Output Policy, and Commercial Property Package. Developed Billing Center – Policy Center User Stories for various work products Performed Integration testing, System testing, Regression testing and Performance testing of Billing Center, Policy center and Payment manager in Guidewire application based on the business requirements.. Worked on new policy administration, billing and claims platform for its homeowners business Worked on Guidewire Insurance Suite applications Created Process Work Flows, Functional Specifications, and responsible for preparing Software Requirement Specifications (SRS), Functional Specification Document (FSD). Performed Gap Analysis to identify the deficiencies of the current system and to identify the requirements for the proposed system. Worked with the Project Manager on various Project Management activities like keeping track of Project Status, Deadlines, Environment Request, and Compliance Issues.  Performed Defect Tracking and Change Control Procedures using Rational Clear Quest and Configuration Management and Version Control using Rational Clear Case. Created exceptions report which were then submitted to project lead and stakeholders on a regular basis. Participated in the data conversion to a third party vendor completed within schedule and budget. Worked with the development team to make sure that they understood the user requirements and that the system developed met those requirements.  Participated in developing test plans and test procedure templates and guidelines to be used by the project team with detailed screen layouts with regards to various types of corporate actions. Involved in the development of Test Plans, Test Cases and Expected Results, and coordinated the tests with the QA team to verify implementation of new features and enhancements.  "}