{"text": "Name: annie annie E-Mail: annie.annie@gmail.com Address: Jakarta, Indonesia Github: https://github.com/annie LinkedIn: https://linkedin.com/annie Phone No. 458298357554 \t\t\t\t\t SUMMARY Over 7 years of IT professional experience with full project development, implementation and deployment on Windows/Unix using JAVA/J2EE technology. Experience in implementing JAVA design patterns such as MVC, Singleton, Factory, Session Façade and Business Delegate. Experience in Object oriented analysis, design/development methodologies, UML Use Cases, Sequence, Page Flow and Class Diagrams. Experience with both core and advanced Java technologies which includes Java, XML, JSP,JTA, JNDI, Java Beans, JSTL,JDBC, Servlets, JMS, Spring and Hibernate. Strong working experience with Spring Framework, which includes usage of IoC/Dependency Injection and different Spring modules like Core Container, Data Access/Integration, Web and AOP in Web applications Extensive experience with Frameworks in ORM (Hibernate) and Spring (Spring MVC, Spring Context, Spring DAO, Spring ORM, Spring Security). Expertise in design and development of web applications using JSP, JavaScript, HTML5, CSS3, JQuery, AJAX, JSON, DOJO, Flash, XSL, XSLT and AngularJS. Implemented SOA architecture with web servicesusing Restful, SOAP, WSDL, UDDI and XML. Extensive experience in working on projects with Waterfall and agile methodologies such as Test Driven Development (TDD) and SCRUM. Strong Hands on Experience with IBM MQ Series and JMS for communications between middleware components. Hands on experience with various Application Servers and Web Servers including Web Sphere, Web logic, JBoss, Tomcat server with wide variety of development tools such as Eclipse, IBM RAD, My Eclipse and Intellij. Having good RDBMS concepts knowledge and worked with MySQL, Oracle and DB2.  Expertise knowledge in building applications using Rational Unified Process (RUP), UML and OOAD. Experienced in implementing Enterprise Applications with full life cycle of software development. Experience in using Log4J, Version Control using SVN, GIT and CVS. Knowledge on service oriented architecture (SOA), workflows and web services using XML, Test Driven Development (TDD) Environment,SOAP andWSDL. Experience with unit testing using Junit and writing build scripts using ANT,Maven and continuous integration tools like Jenkins. Worked on different OS UNIX (Sun Solaris, AIX), Linux, Windows 7 and Windows XP. Good team player with ability to solve problems, organize and prioritize multiple tasks. Excellent communication and inter-personal skills. EDUCATION Bachelors Computer Science Engineering from the University of Msila, Algeria. TECHNICAL SKILLS \t\t Client:T-Mobile, Atlanta, GA   September 2015 to Present Role: Java Developer Responsibilities: Worked on the development and testing of the infotainment module using Agilemethodologies. Implemented Model View Controller (MVC) architecture using spring Framework. Used AngularJS for Object manipulationwith heavy dataand Angular controllers, directives, services, and filters for various modules in the web application. Designed and developed the UI using HTML, CSS, JavaScript, AJAX and Angular JS. Implemented Spring-ORM for data persistence support for Hibernate as well as the Spring-DAO based declarative transaction management. Used Spring for Dependency injection, Spring Hibernate ORM for Oracle database operations. Wrote complex SQL queries like create tables, select etc. to effectively communicate with Oracle Database. Worked with XML using DOM and SAX parsers for transferring the data between different components. Implemented Batch jobs using spring batch, created various item readers, item writers and item processors. Configured Spring transaction management in the application and used annotation driven transaction management and propagation. Developed Restful clients using Spring REST Template to consume restful services from other systems Setting up Maven dependencies/builds and continuous integration using Jenkins. Installed and configured WebLogic and Eclipse from the application catalogue. Developed Oracle PL/SQL stored procedures and queries for payment release process and authorization process. Used GIT for version control and configuration management. Developed unit test cases using Junitto perform unit testing. Environment: Java/J2EE, Spring MVC, Spring, Hibernate,Servlets, Oracle, PL/SQL, WebLogic, GIT, JUnit, RESTful, Eclipse,HTML, CSS, AJAX, JavaScript,Angular JS, Maven,Jenkins, REST Web Services,Log4j, Windows. Client:Office Depot, Boca Raton, FL                                                            June 2014 to September 2015 Role: Java Developer\t\t Responsibilities: Designed and developed the application using Scrum methodology by breaking down the project to several sprints. Participated in design and architecture meetings to decide on the technology stack suited for the application development. Designed and developed the UI using JSP, HTML, CSS, JavaScript, AJAX and JQuery. Developed web pages using spring tag library, JSP custom tags, JQuery plugins and JQuery UI components. Developed various spring rest controllers for request mappings and created JSP custom tag libraries for the application. Wrote Spring validators for validation and configured dispatcher. Developed Spring REST controllers to develop restful services and exposed data in the form of JSON. Implemented business logic using spring service layer and Spring DAO layer using Spring Framework.  Integrated Spring and Hibernate, configured logging using Log4j and developed exception handling for the application. Wrote Hibernate Criteria queries for data retrievals and have performed the ORM mappings to map java entities to database tables. Wrote JUnit test cases to test the Spring DAO layer and created Batch Services to generate reports using Spring Batch. Used Hibernate for accessing and persisting data between Java objects/classes and a relational database. Configured JMS connection factories and message brokers in JBoss, participated in builds and promoting the applications to other environments. Wrote HQL queries for reports and Criteria queries to get the data in the Data tables using MySQL. Wrote UNIX shell scripts for ftping files and deploying the application to the server. Supported the application on different environments from Test to Production environment.  Analyzed the issues and fixed the defects assigned to me by the users. Environment: Java/J2EE, Spring MVC, Spring,Servlets, REST Web Services, Hibernate, JSON,JSP, HTML, CSS, JavaScript, AJAX, JQuery, JQuery UI, JMS,MySQL, Windows, JUnit, SVN, Log4J,JBoss, Rally, Eclipse,Windows. Client:Nissan Motors, Irving, TXJuly 2013 to June 2014 Role: Java Developer \t\t Responsibilities: Designed and developed the application using Scrum methodology. Wrote Technical design document with the class, sequence, and activity diagrams in each use case. Used Eclipse as IDE and Implemented J2EE design patterns such as Session Facade, Factory, DAO and DTO. Designed and developed the UI using JSP, HTML, CSS, JavaScript, AJAX and JQuery. Implemented the AJAX interactions for better and faster interactive Front-End. Integrated Spring and Hibernate to develop the business layer which serves the data required for JSP. Designed and developed Business components and Integrated with Spring framework. Implemented Hibernate Caching(Query and second level EH Cache) for frequent queries executed against database for reports. Configured Spring declarative transaction manager and implemented transaction management in DAO layer. Used SpringAOP module to handle transaction management services for objects in any Spring-based application. Used Web services for sending and receiving data from different applications using SOAP messages. Used Spring Batch to Build the POJO-based development approach of the Spring Framework. Designed and developed database objects like Tables, Views, Stored Procedures, User Functions using PL/SQL, SQL Developer and used them in WEB components. Wrote JMS message listeners to consume JMS messages coming from external applications. Configured and deployed the application on WebSphere App Server. Wrote notification service that executes daily, sends emails and escalations to participants. Developed Junit test cases for Unit Testing and used Maven as build and configuration tool. Environment:Java/J2EE, Spring, Hibernate, Servlets, SOAP Web Services,JMS, SOA, XML,JSP, HTML, CSS, JavaScript, AJAX, JQueryLog4j,Eclipse,WebSphere, Oracle, PL/SQL, SVN, Maven, Windows. Client:MetLife, Dallas, TXApril 2012 to July 2013 Role: Java Developer \t\t Responsibilities: Implemented J2EE design patterns such as Session Facade, Factory, DAO, DTO and MVC. Used Dependency Injection feature of Spring framework and O/R mapping tool Hibernate for rapid development and ease of maintenance. Implemented logging mechanism using Log4j with the help of Spring AOP frame work.  Designed and Developed persistence service using Hibernate framework. Wrote Hibernate configuration file, Hibernate mapping files and define persistence classes to persist the data into Oracle Database.  Implemented SOA architecture with Web Services using SOAP, WSDL, UDDI and XML. Hibernate used as the ORM mapping tool and worked with Hibernate Query Language (HQL). Worked on advanced Hibernate associations with multiple levels of Caching, lazy loading. Implemented business logic in Middle Tier using pluggable components, which were specified in the customized xml documents using spring framework. Developed Message Driven Beans (MDBs) for receiving and processing data from IBM MQ Series using JMS. Developed various SQL queries and PL/SQL Procedures in Oracle dB for the Application. Worked closely with the testing team in creating new test cases and also created the use cases for the module before the testing phase. Wrote ANT build scripts to compile Java classes and create jar, performed unit testing and package them into ear files. Written JUnit Test cases for the Helper, Gateway and Action classes which support the application. Designed various tables required for the project in Oracle database and used Stored Procedures in the application. Environment: Java/J2EE, Spring,Hibernate,Servlets,JMS,SOAP, WSDL, UDDI, XML, WebSphere, Oracle, PL/SQL, Eclipse, JUnit, CVS,ANT,Log4J, Windows. Client:CVS Pharmacy, Dallas, TXJanuary 2011 to April 2012 Role: Java Developer Responsibilities: Gathering business requirements, analyzing the project and creating use Cases and Class Diagrams. Interacted coordinated with the Design team, Business analyst and end users of the system. Designed and developed the project using MVC design pattern. Implementing Spring/ Tiles based framework to present the data to the user. Developed data access components using JDBC, DAOs, and Beans for data manipulation. Deployed the application inJBoss Server environment using ANT. Designed and developed Caching and Logging service using Singleton pattern, Log4j. Wrote authentication and authorizationclasses and manage it in the frontcontroller for all the users according to their entitlments. Developed and deployed Session Beans and Entity Beans for database updates.   Developed stored procedures and complex queries using PL/SQL and shell programs.  Developed SOAP based Web Services for Integrating with the Enterprise Information System Tier. Design and development of JAXB components for transfer objects. Used JDBC in order to establish and maintain connection with the MySQL database from the Java Spring Data Layer. Implemented MySQL Queries and Triggers using MySQL Server. Configuration and Usage of Apache Log4J for logging and debugging purposes. Used JAXP (DOM, XSLT), XSD for XML data generation and presentation Wrote Junit test classes for the services and prepared documentation. Environment:Java/J2EE , JSP, Servlets, Spring, Tiles,JDBC, JNDI, JAXB, XSLT, DOM, XML, SOAP WebServices,Apache Tomcat,JBoss, MySQL, SQL, PL/SQL,JUnit, CVS, Log4J,Windows. Client: Healthport, Alpharetta, GA                                                              August 2009 to December 2010 Role: Java Developer\t Responsibilities: Development, testing and maintenance process of the application. Designing and Development of various modules like KIOSK, Query Builder and Patient Portal. Responsible for Developing action forms and action classes. Designed and developed the user interface using JSP, HTML and JavaScript. Used Spring IOC and spring's Hibernate Support, transaction management. Developed Hibernate DAO framework with Spring framework. Designed and Developed DAOs, DTOs to interact with the Oracle Database. Used SOAP web services to exchange the data with backend application. Tested and deployed the application on WebLogic Application Server during integration. Producing release builds using ANT based scripts. Created JUnit test cases, and Development of JUnit classes. Configured Log4j to enable/disable logging in application. Responsible to coordinate with QA team and analyzing and fixing the reported application issues / bugs as per the stated severity and priority. Environment: Java/J2EE, Spring, Hibernate,Servlets, XML,JSP, HTML, JavaScript, Eclipse, JUnit,ANT,Oracle, PL/SQL, WebLogic, SOAP Web services, CVS,Log4J,Windows"}