{"text": "Name: annie annie E-Mail: annie.annie@gmail.com Address: Beijing, China Github: https://github.com/annie LinkedIn: https://linkedin.com/annie Phone No. 435398613080 SUMMARY: Highlighted Relevant Skills: More than 6+ years of Healthcare Industry as a Business System Analyst and EDI Analyst.  Good working knowledge of HL7 standards and implementation. Design, development and implementation of an Enrollment Resolution and Reconciliation process for health insurance exchanges. Possess a high degree of expertise in the configuration of business rules that support reimbursement policies and methodologies in a large managed care organization.  Played a key role in the configuration and implementation of new markets and products for CSP (Community & State Platform) Using Facets for various health insurance areas such as enrollment, member, Products and other FACETS related modules. Experience in testing Facets applications and EDI transactions. Analysis of discrepancies in the eligibility reconciliation process for multiple stakeholders. 834 transactions, 820 transactions, X12 transactions. Experience with Trizetto’s Facets Application Groups: Claims Processing, Guided Benefit Configuration, Medical Plan, Provider, Subscriber/Member, and Utilization Management. Premium Payment transactions, Eligibility reconciliation. Training support, QA/Testing experience. Additional Skills: Over 6 years of comprehensive knowledge of Business Analysis methodologies, Software Development Life Cycle (SDLC) using Rational Unified Process (RUP), Waterfall and Agile (Scrum). Extensive experience in SharePoint to collaborate information, sharing documents and project management activities. Experience in QA Analysis/Testing, Implementation of business applications using Client/Server and Internet Technologies. Experience in writing Business Requirements Documents (BRD) and Functional Requirements Documents (FRD). Experience in Gap Analysis and writing analysis recommendations.  Experience in matching requirements with Traceability Matrix.  Experience in conducting Requirement Gathering sessions, Feasibility Studies and organizing the software requirements in a structured way. Expertise in Data Cleaning, Data Archival, Data Migration, ad-hoc reporting and coding utilizing MS Excel.  Interviewing Subject Matter Experts (SME), asking detailed questions and carefully recording the requirements in a format that can be reviewed and understood by business and technical stakeholders. Followed the Agile methodology and extreme programming concepts of project development. Efficient in MS Project/MS Excel for planning/status reporting/writing test scenarios. Excellent knowledge of Medicare (Part A, B, C and D) and Medicaid Health Insurance Policies and reimbursement forms. Extensive experience in Healthcare/Claims adjudication with knowledge of industry compliance standards like HIPAA and EDI X12 transactions (834/835, 837, 820,270/271, 276/277). technical skills EXPERIENCE: Affinity Health Plan, Bronx, NY\t\t\t\t\t\t                 \tMay 2014 –Present Sr. Business Analyst Affinity Health Plan is an independent, non-profit managed care plan that serves the needs of over 210,000 residents of the New York Area and provides healthcare coverage through its family health plus, Medicare & Medicaid programs. Affinity Health Plan implemented Facets Enterprise administrative system, a new core system built by TriZetto, with updated technology to allow for more efficient claims processing, membership enrollment and provider data maintenance & getting access to customer records. HL7, X12 EDI and HIPAA standards were followed throughout the project. Responsibilities: Participated in gathering User Requirements, developing functional specs and configuration summary documents Independently studied ICD-10 requirements and studied the changes to be implemented using the  General Equivalence Mapping (GEM) Performed forward and backward mapping between the two standards and documented the required changes. Worked with 834 (enrollment), 835 (medical claims payments), 837 (medical claims), 270 (eligibility inquiry), 271 (eligibility response), 276 (claim status), and 277 (claim status response). Updated the core consolidated project plans: project schedule, tracking and oversight plans, cost tracking reports, etc., and maintain the project on-line database or site using MS Project. Adhered to existing configuration management procedures and recommended improvements to existing procedures Worked on Waterfall methodology for testing and have used HP Mercury Quality Center Efficiently Completed configuration requests as assigned, based on approved business requirements. Worked on developing the business requirements and use cases for Facets batch processes. Tracked status reports involving multiple projects using MS Project.  Used agile methodology of development for all the project requirements given by the BA Team. Also have regular scrum meeting between BA and Developer team to discuss issues and goals fulfilled.  Created class diagrams, use case diagrams and sequence diagrams to view the system from different perspectives.  Experience working on integration, Data Mapping, XML Facet, And Gap analysis. Gathered requirements for enrollment, eligibility and claims side in the NY HIX system. Checked if the Subscriber has active eligibility under NYCDFHP Plan.  Analyzed the business process that included Sales processes, Rating methodology, different Products, Group Renewals. Eligibility and Enrollment process.  Successfully used Agile/Scrum Method for gathering requirements and facilitated user stories workshop.  Responsible for conducting Joint Application Development (JAD) sessions with the HP & Project managers of Abbott for the requirement gathering of Data migration integration project.  Involved in testing the Member Enrollment, Eligibility Enquiry, Eligibility Response, Claim Status Enquiry, Claim Status Response and conversion of Financial Claims. \nActively participated in designing test plans, test cases and test scripts.  Helped the QA team in writing the Test Plan and conducting the quality assurance phase. Worked with the QA team in testing the application using HP QTP.  Medical Claims experience in Process Documentation, Analysis and Implementation in 835/837/834/270/271/277(X12 Standards) processes of Medical Claims Industry from the Provider/Payer side. Determined the requisite ICD 10 training for both internal staff and Medicaid provider groups and assisted in the development of training materials. Conducted formal stakeholder analysis and used interview process with key stakeholders to deliver high level business requirements documentation. Logged application bugs and was involved in all stages of the bug life cycle.  Chaired Requirement Gathering Sessions (RGS), Joint Application Development (JAD) sessions, and lead the effort to get Business and System requirements baseline (stakeholder approval). Dealt with Project lead, stakeholder and end users regarding any issues encountered during the project. Environment:  MS Project, RequisitePro, Rational Rose, Java, MS Office Tools, Windows 7, Agile-scrum,MS PowerPoint, MS-SharePoint, MS-Word, MS-Excel, IBM Process Modeler, HIPAA 4010-5010.  Celtic Health Insurance, Chicago, IL\t\t\t\t\t \tMarch 2013 – March 2014 Business System Analyst Re-engineering suite of Medicaid management products and creation of a core application called Enterprise. Worked for the team that is responsible for receiving, documenting, tracking and addressing the problems encountered by the customers of Flagship software product EPM (Enterprise Practice Management) while generating 837 Professional, Institutional, and Dental claims, Functional Acknowledgement 999, Claim Status Inquiry/Response 276/277 Unsolicited for their destination direct Payers or Clearinghouses. The product was also integrated with Trizetto's FACETS application for Claims processing.  \n Responsibilities:  Facilitated Joint Application Design (JAD) sessions to collect requirements from system users and prepared business requirement that provided appropriate scope of work for technical team to develop prototype and overall system.  Involved in gathering, documenting and verifying business requirements.  Involved in requirement gathering phase (Provider, Claim components and HIPAA)  Met with report users and stakeholders to understand the problem domain, gathered customer requirements through surveys, interviews (group and one-on-one) along with JAD sessions.  Involved in understanding the current business process, defining scope of the project along with position statement.  Worked on the migration process from X12 4010 to 5010.  Wrote BRD, FRD, use cases, test scenarios, test cases for testing the functional requirement.  Tested the existing ICD 9 and newly loaded ICD 10 codes for Medical Necessity,  Validated business rules and all artifacts with users, got approval and sign off.  Identify processes and systems to enable to trade files with non ICD 10 complaint trading partner.  Followed Unified Modeling Language (UML) methodology using and Rational Rose to create/maintain: Use Cases, Activity Diagrams, Sequence Diagrams, and Collaboration Diagrams.  Involved in all SDLC stages under Agile process in applications including Requirement Analysis, Implementation, Testing, Deployment and Maintenance.  Involved in process analysis and defined executed data migration plans for local data for global applications.  Assisted Design Team in preparing SRS, Software Design Document (SDD), User Interface Design, and Application Architecture & Database Modeling.  Helped in project testing efforts for doing integration tests, regression tests and user acceptance tests.  Mapping of ICD 10 codes to procedure and diagnostic codes in IDX,  Worked on Data mapping, logical data modeling used SQL queries to filter data within the Oracle database tables.  Made sure that the systems complied with the rules of HIPAA and CFR Part 11.  Documented the dimensional models of ETL system.  Led the testing efforts of the data marts in development, coordinated moving/setting up of processes in dev/qa/production. Worked with QA team and UAT team to go over the various test scenarios for different types of loads in the data marts.  Performed stress test on data migration from SQL database.  Used SQL to test various reports and ETL load jobs in development, QA and production environment  Environment: Agile-scrum, Java, MS Office Tools, Windows 7, MS Project, Rational Rose, Clear Case, MS PowerPoint, MS-SharePoint, MS-Word, MS-Excel, IBM Process Modeler, HIPAA 4010-5010.  Keystone Mercy Health Plan, Philadelphia, PA\t\t\t\tAugust 2011 – December 2012 Business Analyst The Mercy Family of Companies provides healthcare solutions (Medicaid) for the underserved. The company owns, operates, and administers Medicaid managed care plans and related businesses throughout the United States. The project goal was to identify the changes required in the HIPAA Transactions and implement the federal mandate HIPAA rules. HIPAA required covered entities to use mandated standards in the electronic transmission of healthcare transactions, including claims, remittance, eligibility, claims status requests, their related responses, and privacy and security standards  Responsibilities: Developed and conducted statewide HIPAA 5010 and ICD-10 awareness program for all AMFC staff in the Philadelphia Campus. Analyzed HIPAA 4010 and HIPAA 5010 standards for 837I/P, 27x’s, 834 and 835 transactions and prepared gap analysis document for each transaction. Introduced Agile and RUP methodologies to reflect liquid nature of front-office improving time-to-market.  Presented the process improvement solutions to the client, performed Project Management Office (PMO) activities.  Conducted meeting with the EDI team and other stakeholders team members to discuss the requirements. Worked closely with the business team, development team and the quality assurance team to ensure that requirements are understood as intended in order to achieve the desired output. Facilitated Joint Application Development (JAD) Sessions for communication and managed Net Meetings.  Analyzed “AS IS” and “TO BE” scenarios, designed new process flows and documented the business process and various business scenarios. Wrote use cases and relevant UML diagrams such as Use Cases, Activity and Sequence diagrams  Participating in all facets of the standard project life cycle and ensured smooth transition of projects to production support Maintained clear understanding of project goals among stakeholders by conducting walkthroughs and meetings involving various leads from BA, Development, QA and Technical Support teams.  Involved in creating mappings for the conversion of EDI X12 transactions code sets version 4010 to 5010 and translation of ICD 9 codes into ICD 10 codes Carefirst, Owing Mills, MD \t\t\t                       \t\t\t                  July 2010 – July 2011 Business Analyst Serves as a liaison between the internal business community (Claims, Enrollment, Billing, and Customer Service) the Mandates team and the IT organization in order to provide technical solutions to meet user needs to support the Patient Protection and Affordable Care Act. Documents business requirements including essential health benefits (EHB), Cost Share Reduction (CSR), Advanced Premium Tax Credits (APTC), and translates them into functional specifications for the IT organization, manages changes to such specifications, and educates the IT organization on the direction of the business. Gathers and documents information about the organization’s work processes and information flows. Responsibilities: Analyzed the requirements from Benefit Plan Matrix document for benefit coverage, copayment, coinsurance, benefit limit, restriction and authorization required. Wrote test plans and test cases based on the requirements and design documents Involved in the processing of the claims on the FACETS and then sharing the test results with the business according to test acceptance criteria during their UAT phase Modified data with appropriate test members, providers, and dates of service prior to being loaded via key word file to the test environment (FAC3Q) Developed detailed test scenarios as documented in business requirements documents Executed test cases for the existing market’s various lines of business. (The test cases covered: Authorization of claims, Benefits, Claim Payment and Pricing, as well as member and provider data updates) Performed Functional, Regression, and system testing for Test Claims data as processed and evaluated in accordance with finalized requirements documents Analyzed trading partner specifications and created EDI mapping guidelines. Involved in the validation of variety of claims detail (i.e. subscriber, provider, procedure codes, diagnosis code etc.) on the Facets. Extracting existing claims from a target claim environment using claims tool; modifying the claims data to suit the testing scenarios for the new market Provided regular status updates to Team Lead on high priority issues and Testing Progress Loaded the modified claims data in target environment for testing Participated in defect review meeting and providing technical expertise on how to resolve the issues related to configuration and/or test scenarios Logged the errors, reported defects, determined repair priorities and tracked the defects until resolution using Mercury Quality Center Involved in HIPAA EDI transactions such as 835, 834, 820, 837 (P, D, I) 276, 277, 278 Conducted RAD sessions for the report users, requestors, and the developers.  Defined input and output data elements to and from the rules processing engine. Analyzed the integration requirements between various tools for Payment Integrity solution Develop test cases from use cases using RUP methodology to validate XML conversion of network conversion Work together with the architects and team responsible for supporting rules processing tools during the project to assist with the required support. Responsible for GUI and Functional Testing, using Black box Testing Techniques. Involved in Regression Testing using Quick Test. St. Jude Children’s hospital, Memphis, TN\t\t\t\t\t\tMay 2009 – May 2010\t Jr. Business Analyst\t\t\t St. Jude's approach is to finding cures for the catastrophic diseases of childhood allow St. Jude patients more efficient access to the latest research findings available. St. Jude is a Research Center for Cancer patients. Responsibilities: Discussed needs of clients, collecting specifications of trading partners as well as information pertaining to connectivity and configurations. Full development life cycle support included: analysis, design, development and testing EDI transactions ANSI X12 and HL7 standards. Validated the translated HIPAA files with the proprietary Common Claim Record implementations. Performed Use-Case analysis using UML to capture the dynamic aspect of the application  Performed Gap Analysis, develop & implement maps for translating inbound and outbound transactions into respective standards. Reviewed the Requirements document for 5010 and prepared the test plan and test cases. Involved in UAT for Membership/Enrollments and Eligibility transactions. Interacted with developers to raise change requests for fixing errors within the maps. Create maps to transform data from EDI to standard XML business documents, provided assessment of business and technical needs. Implemented a structured system development methodology with emphasis on Rational Unified Process (RUP) that dramatically improved productivity and reduced errors.  Authorized, scheduled, supervised and smoke-tested thin code and data migration from development to test environments. Also in charge of code movement within the 4 test environments (2 for system and 2 for UAT) and other higher environments. This included new releases, patches, etc. Analyzed current data stores and generated UML diagrams of logical and physical data.  Developed system and defined metrics to evaluate performance in innovation, customer satisfaction & employee participation.  Analyzed resource utilization using workload parameterization for improving performance of application under development. Analyzed existing procedures and reported them to management to improve productivity.  Performed Business Process Modeling using Visio. Identified, researched, investigated, analyzed, defined and documented business processes. education: MSc - Master of Science in System Engineering & Management                       BSc - Bachelor of Science in Telecommunication Engineering Technology             Minor:  Business Administration"}