{"text": "Name: ann ann E-Mail: ann.ann@gmail.com Address: Guilin, China Github: https://github.com/ann LinkedIn: https://linkedin.com/ann Phone No. 510087515651 CAREER SUMMARY: 18+ years of combined experience in IT/BIZ PROJECT MANAGER & SUPPLY CHAIN PLANNING AND OPERATIONS (Design of apps and Business process modeling for tools and applications, Collaboration on Migrating Plants to ERP Oracle system, Company World Wide Rollout of apps and Users Training, Transferring operations to LCC, Act as Prime IT contact for dedicated Customers for their CRM systems with interfaces to SANM Manufacturing/Assembling and Shipping systems), working in multicultural environments and collaborating in global communities by managing IT projects lifecycle since project conception until post go-live support and worldwide rollout to all company sites (67 plants).  With over 9 years of experience as Project Manager / Product Owner, implementing WEB and IT Infrastructure project such as ePR/eCAR, eCompras, uPPV, CLAIMS, Server Refreshes and Servers move out from physical Owned servers to Outsourced Cloud environments, HP SMO & DMO split projects among other Specialized Systems.  PROFESSIONAL SUMMARY: 9+ years of Project Management: Software design and BPM for systems in IT Services, Supply Chain, Material Purchasing, EDI, Finance, SOX and Finance´s Company internal Compliance, Invoicing 1+ year as Program/Project Manager managing AR/VR retail projects in B2B and B2C domains and Workstreams for Order to Cash, Procure to pay, Forecast to Plan  4+ years of Scrum Product Owner doing backlog management: Backlog review, classification and clean up, Analysis of backlog items: impact to local, region, GEOSs or global. Prioritization of Backlog items together with Supply Chain, Finance and Governance areas. Collect inputs, decide outputs and modeling of business process. Analysis of technical and no technical requirements for every user story 1+ year Financial Industries Analysis knowledge: customer scoring, opportunities forecast and funding, asset Managements during leasing/renting/dispositions, Management of new opportunities based on EOL /EOC. 2+ years in Project Management: SMO/DMO for HP Splitting and Divestiture of companies into legal separated entities in accordance with internal Compliance Financial regulations as well adhered to guarding sensitive and confidential information 9+ years of System Analysis: Eliciting requirements, gather ideas and concepts from business users and translating them into conceptual models and processes, prioritizing product backlog items, validating dependencies, tasks successor and predecessor and definition of critical paths 9+ years in Manufacturing/Supply Chain Operations/Logistics  with strong ability to detect and implement cost reductions opportunities. Material requirements planning, Master production scheduling Sales/Manufacturing forecasting, Product Quoting Inventory and demand planning, Logistics and Warehousing Planning / buying direct materials and indirect commodities & services Direct Order fulfillment and 3PL Order fulfillment. Corporate Vision & Strategic and Operational Planning Project evaluation and cost benefit analysis:  KPI oriented Skilled in managing Global implementations, Multiple initiatives, engaging client participation, managing Vendor Relationships, leading diverse, On-site & Off-site team members and meeting project objectives.  Proficient in PMLC/SDLC: Scope Management, Schedule Management, Project Control Management, Communication Management, Change Management and Risk Management. Managed/participated in several large IT complex projects.  Ability to manage multiple projects simultaneously and drive results. KEY COMPETENCIES & CORE SKILLS: COURSES/CERTIFICATIONS: IO4PM – Project Manager accredited certification 2019 (Cert# 47531591868959) International SCRUM Institute – Scale SCRUM Expert accredited certification 2018 International SCRUM Institute – SCRUM Product Owner accredited certification 2018 Softtek – People-Oriented leadership Certification 2018 Softtek - Green Belt Certified 2018 Softtek - ITIL and ITIS certification 2018 Softtek – Security Awareness certification 2018 Hewlett Packard /DXC – Standard business of Conduct 2017 & 2018 FUNIBER/IPMA – Partial Master Degree on Design, Management and Direction of Projects 2017 SANM University/PMI – PMLC: Best practices of SDLC, 2015 SANM University – Blue and Yellow, Green Belt certified, 2015 SANM University - BSA and PM certification in ERP-MFG Oracle, Level 1,2 & E2E, 2013 SANM University/PMI – PMLC: Procedure & Controls, 2013 SANM University – Program Management diploma, 2012 Proficiency in MS Office: PPT, Word, Excel, Visio, MS PS 2012, ALM, SDLC, PM Plan view among other Agile/Scrum tools: AMS, TFS, Google docs, Skype, SQL MS suite management. Professional Experience: Company:  Great Logics/HCL                                  Client: FB                 Aug 2018 to Current Role: Program / Project Manager Responsibilities: Manage cross-functional Solutions Engineering programs in a matrix organization covering a range of products across Supply Chain Management B2B and B2C workstreams: for Order to Cash, Procure to pay, Forecast to Plan, Reverse Logistics, Refurbishment, and Replenishment Develop and manage end-to-end project plans and ensure on-time delivery Provide hands-on program management during analysis, design, development, testing, implementation, and post implementation phases Perform risk management and change management on projects Provide day-to-day coordination and quality assurance for projects and tasks Drive internal process improvements across multiple teams and functions Interface with Engineering teams and cross-functional partners for project requirements and scope Motivate and focus a large collaboration to reach challenging goals Projects executed: Contract Manufacturer integration a 3PL Global Supplier Direct Shipment from HK warehouse to Global/Regional retailers Amazon,BBY, Synex, etc Reverse Logistics for RMA, Refurbishment, Replenishment, Units rework for connector reconversion       Selected accomplishment:   Eleven consecutives Sprint releases to PROD without any critical bug and none rollback Projects delivered On Time / On Budget for International Product Launching  Company: Softtek            Client: DXC/HPE Financial Services, Houston, TX                Sep 2017 to Aug 2018 Role: Project Manager/Product Owner Responsibilities: Liaison with Business services lines and IT Ensuring projects, features and user stories are aligned to company overall strategies objectives Facilitate workshop sessions with stakeholders to elicit requirements and understand business needs Translate business requirements to system requirements Communicate business requirements for functional and non-functional landscape Conduct risk assessment, change impacts and down streams to interfaces, reports, DBs, tables, other apps and as well to performance impact & data warehousing Create flowcharts. Swim-lane diagrams of current and future state Develop test strategy, test plans, validate test cases and accompany business tester during UAT Get formal Business acceptance tests Manage communications and resolutions of bugs, defects, define repository, ownerships, clear actions, category, severity and SLAs accordingly        Projects executed: L4 Phoenix (Lease mgt, Lease Origination, MDM, SFDC) Flexible Billing (Add ons, VAT exempt flags, Invoicing template GEO/Lang, etc.) WMD – Where is my deal (Android, following by sales users and customers)      Selected accomplishment:   Four consecutives releases to PROD without any critical bug and none rollback  \t Client: Softtek servicing HP/HPE/HPI/DXC, Houston, TX                                                Aug 2016 to Aug 2017 Role: Sr. IT Project Manager Role and responsibilities: Provide project management support on DMO project to split the company into two legal entities  Ensure compliance with SOX Divestiture regulations (Sharing just required info between companies and keeping the corresponding one without access to the other and as well securing storing of confidential data for tracking and legal purpose in secure manner) Manage of project phases by Planning, Controlling and Monitoring Construction, SIT, UAT, Cutover, Warranty, Project Retrospective and final project acceptance from BIZ and Finance teams.  Provide artifacts and evidence for Security Internal Audits for access data management on both sides EG and ES. Adherence to standard use of HPE/DXC methodologies and apps such as SDLC, ALM, MSPS, SPs, PowerBI along with many other internal tools.      Projects executed: SMO: Split HP into HPI and HPE, SAP_ECC_Compass and BW, Lighthouse and Swan apps DMO: Split HPE into Everett and Houston projects (HPE and DXC), EDI Interfact enablement, SAP Compass ECC and BW      Selected accomplishment:  Recognition of Top Level Management on project execution from Finance and BIZ. No critical issues reported during MTP, very reduce minor issues reported during MTP Client: SANMINA-SCI Corporate, Gdl, MX                                                                                    Aug 2010 to Jul 2016 Role: Sr. Technical Project Manager/ SCRUM Product Owner. Responsibilities: To get clear ownership and engagement by Sponsor To get clear understanding of project deliverables and scope Define Team roles & responsibilities and setting the right expectations Confirm KPIs to measure success Identify escalation path (BIZ and IT) Responsible for documenting, communicating, and managing adherence to BIZ, SOX and finance compliance through life of the project. Following consistent and adhere to the project management methodology Responsible to find a way to succeed: challenge the excuses Publish plans to team members and stake holders Set up communication meetings & working meetings Following to tasks beginning and completion Schedule meetings, prepare them with clear agenda and keep team focused! Following issues list with std methodology: Clear understanding of the issue, Owner, due date, expected deliverable Work with SQA team to test for success and also to detect false positives and negatives, full regression testing and reporting status accordingly. Review test cases and test scenarios Coordinate go / No-go meetings Provide training and conduct UAT to users, create training material and documents Provide post go-live support and deliver the project to final users “keys on hand”    Projects executed: eCAR and ePR enhancements Migration from WEB to Web Oracle platform of eCAR and ePR Unified PPV tool (Purchase price variance) SOX remediation project for Finance and MRO DBs and apps,  Claims Tracker tool,  VRS for SANM campuses No-DOD plants. (Visitor Register Systems) Participation on Plants migration system from SAP to Oracle EPR Platform (Colombia, Brazil, El Paso, Juarez, Reynosa, Monterrey, Milpitas CA, Foot Hill Rach CA) Selected accomplishment:  All Projects successfully implemented in all Regions and plants Build excellent relationships with Biz Stakeholders Client: SANMINA-SCI, Gdl, MX                                                                                                April 2008 to July 2010 Role: Program Manager Fulfillment 3PL     Responsibilities: Migrate Program from competence in Monterrey city to Gdl, MX Follow project plan, design plant distribution, warehouses and process shipping areas Receive training from Customer on SAP transactions for E2E operations as SME. Focus business efforts on delivering end customer’s solutions across end to end functions since:  Inventory analysis to maximize order completion Monitor receiving,  incoming/sampling, warehousing, staging, testing, configuration, rack-assembly,  Pick pack and ship, oversee traffic process.  Prioritize orders expediting all along the process, order swapping, splitting and re-combining to make them flow smoothly as possible.  Calculate & measure yield rates to work with customer procurement dept., test engineering and SQE’s teams to reduce missing products and shortages on orders.   Detect tests/inspections failure trends and advise to procurement to request replacements and SQEs to consider product purges.  Coordinate Sanmina’s and customers areas to request product engineering/quality information updated to be available and inspection criteria is standardized and being met.       Projects executed: Direct Order Fulfillment for Alcatel-Lucent Selected accomplishments:  Reduce order cycle time from 5 to 2 working days in 95% of orders being processed Develop and built Matrix processes by customer, product and processes to facilitate decision making on        processing deliveries. Increase of families of products being managed on the project from 4 to 9 that triplicates operation volume increasing customer sales quarterly up to 170% Client: Construmart (Corporation Elever), Gdl, MX                                                  August 2006 to March 2008 Role:  BIZ planning & ops     Projects executed: Day to day Operations  Responsibilities:  As business planner in charge of participate on public and private bids I handled multiple administrative activities to make the purchase orders were managed efficiently, improving client service and making revenue growth by planning direct deliveries from the manufacturer’s facilities to the building site in the most economical way. Purchasing of materials and tooling, price negotiations with customers and suppliers based on volume analysis Inventory replenishment with set points determination based on ABC classification and suppliers lead times.  Dynamic quoting of key materials such as iron, floors and imported machinery.  Creation and revision of various reports such cash flow, pending and due collection, expenses reports, backlog, etc. Selected accomplishments:  • Processes developed to professionalize the position from a familiar company to a well-structured company selling to medium-large construction companies and also local and state government offices • MRP implementation to integrate and manage sales orders, purchase orders, inventories with accuracy improvement from 65% to 98%, AP and AR.  • Pass from balance point to yearly revenue growth of 200% to make the company to be sellable. Hewlett Packard, Omaha, NE- Gdl, MX                                                                                        Oct 2005 to Jul 2006 Role: Business Project Manager. & Transition Manager     Responsibilities: Create project Plan along with IT project manager: Scope, schedule Plan resources: Project team hiring, Hiring Local Human resources for new operations, Systems: SAP, voice, data, system and email account creation and accesses Estimate budgets Map processes to detect gaps on procedures and training material, create it if necessary Create training and transferring plan Validate KT Create communication plan – Create meeting calendars (Sponsors, Stakeholders, project team, transference team) Manage of acquisitions, vendors supplies, HR contract agencies, etc  Request for project SharePoint and knowledge base repository Define project success criteria with transfer team and stakeholders Conduct trainings Risk assessments: risks validations Risk management: Create audit team, acknowledge and recognition of achievers and retraining on delinquencies, layoff underachievers and plan for replacements Complete project documentations in accordance to company internal governance: Document KPIs, Store project acceptance, processes fully documented, budget review, lessons learnt, project closure Hold on in key positions roles until new hired manager receives position       Projects executed: Migration of Public Sector USA operations for  SLED, FED (DOD, CIA, NASA, ARMY, FBI, Etc) and Government Contractors Northrop, Lockheed Martin such as Order Management, Customer Support, Oder Fulfillment, Claims systems among other diverse service areas to LCC in MX Migration of Enterprise (Fortune 500) sector from USA to LLC (MX) operations for OM, Customer Support, Fulfillment and Claims   Selected accomplishments:  Project successfully implemented accordingly to plan, timeframe and Budget Successful Project Ramp Up of project with readiness for Government Harvest Season Creation of audit team to standardize a wide range of tasks and minimize errors during ramp up and training time. KPIs maintained in green 95% of the time on main indicators after ramp up Minimizing operation timing with improvements on productivity from 70 to 100% on 3 months. Reduce Fulfillment backlog from 3,000 line/items to 20, maintaining KPI metrics in green for over 3 consecutive quarters. Reduce team headcount after Harvest Season in 80% without processes affectation; Relocation of surplus team members in key positions on different projects and areas. Hewlett Packard, Gdl, MX                                                                                                                Feb 2004 to Sep 2005 Role: Biz Project Manager & SC transition Manager     Projects executed: Migration of operational areas of USA for  LATINOAMERICA Supply Chain planning and operation executions to Mexico and Brazil Migration of operations for Server integrations for LADO orders to MX / Creation of Mexico center for Functional Testing, Integration and SW image loading Migration of Supply Chain Finance operations for LADO to MX LADO Supply chain Planning and Operation execution as transition Manager until Delivered Key on Hands Responsibilities: Project Plan creation Create Project schedule Receive training on new roles, sit in driver´s seat Create training documentation Transfer the new roles to LLC or hold on in role position until new hires receives project key on hand Ramp up project Create project retrospective Selected accomplishments:  Projects successfully implemented during timeframe and within Budget Creation of cut off dates calendar with excellent accuracy for all the Americas region to get revenue recognition during EOQs according to SOW, SLAs and Customer Segmentation. Dramatic reduction of OCT from 22 to 10 days on end to end OTD maintained on green (98%) during 4 consecutive quarters Get full control of escalations, reduction/elimination of penalizations on government/public deals (Sria Gob. CFE, Comisión Bancaria y de valores, Banamex, BBVA Bancomer, etc)      Client: GRUPO VITRO (Vigusa) Guad, Ja,                                                                                                            2000-2003      Different contract schemas     Role: MX Largest Mexican glass bottle manufacturer Responsibilities Responsible of yearly and quarterly master production plans Create by-weekly production scheduling plan Driving the production staff meetings to coordinate production inputs such as raw material, sands, silicates, sodas, recycled glass, molds, tooling, product blueprints, packing and specs.  In charge of dynamic planning to optimize production cold side requiring special set ups: labor's teams, equipment, materials, physical spaces and electrical and pneumatic facilities.  Monitor ovens and machineries productivity and efficiency to validate orders completion and calculate better timing to perform quick and less expensive exchange of die and molds.  Selected accomplishments:  Cost reduction on manufacturing of 3% by minimizing yearly runs of repetitive products also with reduction on exchange die total time. Reduce inventory by improving exact time of orders completions and re-negotiate with customers to consume/absorb inventory excesses Specialize product lines by family optimizing raw materials, energy and fuel on 1.5% yearly Outsource of the packing assembly area with saving up to 40% in labor costs. Development for standardized packing on high volume products for Coca-cola and Pepsi-cola with savings of 12% in cardboard and increase of 17% of product per pallet achieving load stabilization during managing, storage and shipping (Volumetric improve on warehousing and transportation). EDUCATION: INDUSTRIAL ENGINEERING DEGREE – UNIVA -4 years degree 1990-1994 Specialty on Logistics and Material Management,  ITESO 1996 Diploma at statistical quality for continuous improvement, UNIVA 1997"}