{"text": "Name: mary mary E-Mail: mary.mary@gmail.com Address: Moscow, Russia Github: https://github.com/mary LinkedIn: https://linkedin.com/mary Phone No. 541476198075 SUMMARY Having 7+ years of experience in Network Engineering and Administration. Experience in installing, configuring and troubleshooting of Checkpoint Firewall and Juniper SSG series. 5+ years working with and migration checkpoint Juniper, and Palo Alto Firewalls Experience in adding Rules and Monitoring Checkpoint Firewall traffic through Smart Dashboard and Smart View Tracker applications. Implementation of Juniper Firewall, SSG Series, Netscreen Series ISG 1000, SRX Series. Worked on Juniper Netscreen Firewalls like, NS50,SSG 550M, SSG520M, ISG 1000, ISG 200. Configured Client-to-Site VPN using SSL Client on Cisco ASA 5520 ver8.2. Configured ASA 5520 Firewall to support Cisco VPN Client on Windows 7/XP/Vista. Expertise in installing, configuring, and maintaining Cisco Switches (2900, 3500 ,7600, 3700 series, 6500 series)Cisco Routers (4800, 3800, 3600, 2800, 2600, 2900, 1800, 1700, 800) Expertise in installing, configuring and troubleshooting Juniper EXSwitches (EX2200, EX2500, EX3200, EX4200, EX4500, EX8200 series) Juniper Routers ( E,J,M and T-series) Administration and diagnostics of LAN and WAN with in-depth knowledge of TCP/IP, NAT, PPP, ISDN and associates network protocols and services. Expert Level Knowledge about TCP/IP and OSI models. Extensive experience with Cisco IOS, Windows client/server operating systems and Linux Enhanced level of knowledge with PPP, ATM, T1/T3 Frame-Relay. Experience with Putty, Exceed and Secure CRT. Experience with Shell Scripting and Perl Expert knowledge of cable connectors and replacement as RJ-11, RJ-45, V.35, RS-449. Knowledgeable in understanding of the ITIL framework Excellent communication skills to interact with team members and support personnel, acting as a mentor to less experienced personnel. Demonstrated success record in: Managing multiple tasks with proven ability to meet deadlines and proactively identifying the problem to solve complex technical issues. Highly enthusiastic, creative team player, project implementation, analytical, interpersonal and communication skills. Experience with F5 load balancers and Cisco load balancers (CSM,ACE and GSS). Experience on load balancing strategies/techniques, expertise in application switching/traffic management, knowledge of persistence and SSL certificates. Basic and advance F5 load balancer configurations, including migrating configurations from Cisco ACE to F5 and general troubleshooting of the F5 load balancers. Experience with Cisco ASR’s, Catalyst 6500 series switches, 2800 series, 3800 series. 2900 series, and 3900 series routers. Thorough understanding of alarm correlation, route cause orchestration and platform scaling metrics for different platforms. TECHNICAL SKILLS: LAN Technologies\t: VLAN, VTP, Inter-Vlan routing, STP, Workgroup, Domain, HSRP, DHCP,                                             Static, VLAN, STP, VTP, Ether Channel, Trunks. WAN Technologies\t: Frame Relay, ISDN, PPP, ATM, MPLS, Channel & Leased lines Routing Protocols\t    :  RIP, IGRP, EIGRP, OSPF, BGP, IS-IS, HSRP, IPv6, VRRP, GLBP, LACP,                                                        PAGP, DNS, SMTP, SNMP, FTP, TFTP, LPD/TDP,WLAN,802.11/802.11e,                                                                                                                          WEP, POP3 LADP. Routed Protocols\t: TCP/IP, IPX/SPX Network firewall & VPN\t: NAT/PAT, VPN, Filtering, Load Balancing, IDS/IPS, IPSec, ACL  Infrastructure Services\t: DHCP, DNS, SMTP, POP3, FTP, TFTP,  Network Managements\t: SNMP, SSH, Telnet, ICMP IP Telephony\t: VOIP, FXO/FXS/E&M/T1/ISDN/ PRI, Call manager Express. Comm. Protocols\t: ARP, Wi-Fi, WiMAX, CDMA, 3G Operating Systems\t: Windows Vista/XP/NT/2003, MS DOS, UNIX, Linux Languages/ Tools\t: C, C++, PERL Assembly 8085 and 8951/2, MIPS. Firewall &Security         : Cisco ASA, Checkpoint, Palo Alto PROFFESSIONAL EXPERIENCE: Western Union, San Francisco, CA\t\t\t\t                   May 2016 – Till date Sr. Network/Security Engineer Responsibilities: Implementing the necessary changes such as adding, moving and changing as per the requirements of business lines in a data center environment. Involved in Switching Technology Administration including creating and managing VLANS’s, Port security, Trunking, STP, Inter-VLAN routing, LAN security etc. Deploying Layer 2 security in Server Farms by configuring switch for 802.1x port based authentication. Monitoring the network traffic with the help of Qradar and Cisco IPS event viewer. Remediation of firewall rules from checkpoint firewalls to Cisco ASA firewalls and their implementation. Worked on Aruba Wireless LAN Implementation for 11n Infrastructure Across the Corporate Network. Managing and implementation of PORs (port open requests) based on the requirements of various departments and business lines. Implementing and troubleshooting (on-call) IPsec VPNs for various business lines and making sure everything is in place. Installing and configuring new cisco equipment including Cisco catalyst switches 6500, Nexus 7010, Nexus 5548 and Nexus 2k as per the requirement of the company. Worked primarily as a part of the security team and daily tasks included firewall rule analysis, rule modification and administration. Configuring & managing around 500+ Network & Security Devices that includes Juniper (Netscreen) Firewalls, F5 BigIP Load balancers and 3DNS, Blue Coat Proxies and Plug Proxies. Adding and modifying the servers and infrastructure to the existing DMZ environments based on the requirements of various application platforms. Working closely with Data center management to analyze the data center sites for cabling requirements of various network equipments. Experience with F5 load balancers and Cisco load balancers (CSM, ACE and GSS). Implement the firewall rules using Netscreen manager (NSM). Implementation of UTM and IDP in SRX, SSG and ISG Firewall. 24x7 on-call escalation support as part of the security operations team. Working configuration of new VLANs and extension of existing VLANs on/to the necessary equipment to have connectivity between two different data centers. Managing and providing support to various project teams with regards to the addition of new equipment such as routers switches and firewalls to the DMZs. Adding and removing checkpoint firewall policies based on the requirements of various project requirements. Implementing IPsec and GRE tunnels in VPN technology. Supporting project test teams in analyzing the bandwidth utilization. Managing and upgrading IOS image files and taking configuration back-up. Handling enterprise outages effectively and driving towards the resolution. Coordination of fault escalations in conjunction with the 1st high-level technical management of high priority or technically complex calls. Working with Capacity management on network bandwidth utilization reporting of the sites WAN link and vendor co-ordination for new site turnovers / WAN links. Preparing Metrics report detailing on SLA performance of tickets and process quality report to analyze team performance & discussion on the improvement areas (By monthly). Providing training to new comers and effectively working towards a process quality improvement in the Team. Excellent Troubleshooting Skills and Customer Centric approach.  Strong Knowledge in working with F5 Load Balancers and their Implementation in various Networks. Environment: Cisco 2948/3560/4500/3560/3750/3550/3500/2960 6500 switches and Cisco 3640/12000 /7200/3845/3600/2800 routers , Cisco Nexus 7K/5K/2K, Cisco ASA5510, Checkpoint, Aruba Controllers 6000, 3600, 3400,650: windows server 2003/2008: F5 BIGIP LTM. Wells Fargo, Minneapolis, MN\t\tMarch 2014– Apr 2016 Sr. Security/Network Engineer Responsibilities: Working in high availability Nexus Environment and provide Level 3 Network Support. Configuring, upgrading and verifying the NX-OS operation system. Converting PIX rules over to the Cisco ASA solution. Basic and advance F5 load balancer and Cisco ACE configurations, general troubleshooting of the F5 load balancers. F5 3DNS Load balancer GTM Providing Level 3 support to customers, resolving issues by attending to conference calls. Providing Level 3 Engineering and Support to other internal network engineers and contractors. Designing and installing new branch network systems. Resolving network issues, running test scripts and preparing network documentation. Translating Cisco IOS Route maps to Cisco IOS XR Routing policies. Working with Cisco Nexus 2148 Fabric Extender and Nexus 5500 series to provide a Flexible Access Solution for datacenter access architecture. Ensuring problems are satisfactorily resolved in a timely manner with focus in providing high level of support for all customers. Working with BGP, OSPF protocols in MPLS Cloud. Establishing VPN Tunnels using IPSec encryption standards and also configuring and implementing site-to-site VPN, Remote VPN. Working with Juniper JUNOS operating system and working on M and MX series routers. Providing daily network support for national wide area network consisting of MPLS, VPN and point-to-point site. Configuring HSRP between the 3845 router pairs of Gateway redundancy for the client desktops. Configuring GLBP, VLAN Trunking 802.1Q, STP, Port security on Catalyst 6500 switches. Responsible for service request tickets generated by the helpdesk in all phases such as troubleshooting, maintenance, upgrades, patches and fixes with all around technical support. Configuring, Monitoring and Troubleshooting Cisco’s ASA 5500/PIX security appliance, Failover DMZ zoning and configuring VLANs/routing/NATing with the firewalls as per the design. Converting Cisco IOS to Cisco IOS XR configurations. Migration checkpoint Juniper, and Palo Alto Firewalls. Configuring BGP, MPLS in Cisco IOS XR. Configuring Virtual Device Context in Nexus 7010. Configuring multiple route reflectors within a cluster. Working on HP open view map for Network Management System and Ticketing. Working on a broad range of topics such as routing and switching, dedicated voice access, planning and implementation, large-scale high-visibility outages, change management coordination, proactive monitoring and maintenance, disaster recovery exercise and core network repairs. Involved in L2/L3 Switching technology administration including creating and maintaining VLANs, Port security, Trunking, STP, Inter Vlan Routing, LAN security. Working on security levels with RADIUS, TACACS+. Configured CIDR IP RIP, PPP, BGP and OSPF routing. Involved in the configuration & troubleshooting of routing protocols: MP-BGP, OSPF, LDP, EIGRP, RIP, BGP v4. Configured IP access filter policies.  Configuration and management of NEXUS network in the existing network infrastructure. Created LAB setup with 7k and 5K NEXUS switches for application testing.  Hands-on experience with WAN (ATM/Frame Relay), Routers, Switches, TCP/IP, Routing Protocols (BGP/OSPF), and IP addressing. Configuring STP for switching loop prevention and VLANs for data and voice along with Configuring port security for users connecting to the switches. Ensure Network, system and data availability and integrity through preventive maintenance and upgrade. Involved in L2/L3 Switching Technology Administration including creating and managing VLANs, Port security, Trunking, STP, Inter-Vlan routing, LAN security. Environment: Cisco 3750/3550/3500/2960 switches and Cisco 3640/12000 /7200/3845/3600/2800 routers, Cisco ASA5510, Checkpoint, Aruba Controllers 6000, 3600, 3400,650, Cisco Nexus7K/5K,Palo Alto  Bright Horizons, Denver, CO                                                                                          Nov 2011- Feb 2014 Sr Network Engineer\t\t\t\t\t Responsibilities: Involved in Configuring and implementing of Composite Network models which consists of Cisco7600, 7200, 3800 series routers and Cisco 2950, 3500, 5000, 6500 Series switches. Basic and advance F5 load balancer configurations, including migrating configurations from Cisco ACE to F5 and general troubleshooting of the F5 load balancers. F5 Networks BigIP Load Balancer. Designed and implemented VLAN using Cisco switch catalyst 1900, 2900, 5000 & 6000 series. Modified internal infrastructure by adding switches to support server farms and added servers to existing DMZ environments to support new and existing application platforms. Built site-to-site IPSec VPNs over Frame-relay & MPLS circuits on various models of Cisco routers to facilitate adding new business partners to new and existing infrastructures. Analyzed customer application and bandwidth requirements, ordered hardware and circuits, and built cost effective network solutions to accommodate customer requirements and project scope. Configured routers and coordinated with LD Carriers and LECs to turn-up new WAN circuits. Configuring, Maintaining the Routers and Switches and Implementation of RIP, EIGRP, OSPF, BGP routing protocols and trouble shooting. Experience with Project data and voice documentation tools & experience with developing network design documentation and presentations using VISIO Possess good experience in configuring and troubleshooting WAN technologies like MPLS, T1, T3, DS3 and ISDN. Responsible for implementing QOS parameter on switching configuration. Involved in Design and Implementation of complex networks related to extranet clients. Troubleshooting the Network Routing protocols (BGP, EIGRP and RIP) during the Migrations and new client connections. Manage operational monitoring of equipment capacity/utilization and evaluate the need for upgrades; develop methods for gathering data needed to monitor hardware, software, and communications network performance. Worked towards the key areas of the project to meet SLA’s and to ensure business continuity. Involved in meetings with engineering teams to prepare the configurations according to the requirement. Creating change tickets according to the scheduled network changes and implementing the changes.  Configuring STP for switching loop prevention and VLANs for data and voice along with Configuring port security for users connecting to the switches. Ensure Network, system and data availability and integrity through preventive maintenance and upgrade. Responsible for configuration and maintenance of a collapsed core network of 90 switches and routers along with maintenance of existing Wireless network. Configuration and maintenance of the routers running on existing EIGRP and BGP protocol with 7200 router and 6500 core. Also configured route filtering using distribute list with route maps and ACL’s.  Configured BIG IP F5 load balancer for cluster / server farm load balancing to increase resource availability and provide redundancy. Configured network access servers and routers for AAA Security (RADIUS/ TACACS+) Regularly performed firewall audits around Checkpoint Firewall-1 solutions for customers Provided tier 3 support for CheckPoint Firewall-1 software to support customers Environment: Cisco 7200/3845/3600/2800 routers, TACACS, EIGRP, RIP, OSPF, BGP, VPN, Ether Channels, Fluke and Sniffer,F5 Load Balancer, Cisco ACE,RIP,EIGRP,BGP,OSPF,Checkpoint IT Info Group, Hyderabad, India                                                                  Feb 2011 – Oct 2011 Network Engineer Responsibilities:  Responsible for designing and implementation of customer network infrastructure Negotiate hardware and software circuit contracts, Network Migrations Redesign office copper and fiber cable plant scalability. Configuring Cisco and Juniper devices (Router & Switches) Dynamic routing protocol configuration (RIP, RIP V2). Nat and IPsec configuration on Cisco Routers. Involved in configuration of IP SLA. Commission and de-commission network links and network hardware. Planning, Implementation and servicing the Network Infrastructure.  Project Management for New Setup, Upgrade and Expansions. Installation, configuration and troubleshooting for HP Proliant servers across US region with the help of location teams and remote-in tools. Implemented and configured routing protocols like EIGRP, OSPF, BGP Troubleshot the issues related to routing protocols Preparation of proper network cabling diagrams prior to installations and supervision of the LAN cabling contractor for compliance to industry standards for Ethernet.  Responsible for maintenance and utilization of VLANS, Spanning-tree, VTP of the switched multi-layer backbone with catalyst switches  Remote support with the help of VPN and Citrix applications. Responsible to create, maintain and document the process and support procedures. Handled the security patch management for servers and desktop environment. Net metric Solutions, Hyderabad, India\t\t\t\t                  Jun 2010 - Jan 2011 Jr.Network Engineer Responsibilities: Configuring and troubleshooting multi-customer ISP network environment. Involved in network monitoring, alarm notification and acknowledgement. Implementing new/changing existing data networks for various projects as per the requirement. Troubleshooting complex networks layer 1, 2(frame relay, ATM, Point to Point, ISDN) to layer 3 (routing with MPLS, BGP, EIGRP, OSPF and RIP protocols) technical issues. Providing support to networks containing more than 2000 Cisco devices. Performing troubleshooting for IOS related bugs by analyzing past history and related notes. Carrying out documentation for tracking network issue symptoms and large scale technical escalations.  Managing the service request tickets within the phases of troubleshooting, maintenance, upgrades, fixes, patches and providing all-round technical support. Commissioning and Decommissioning of the MPLS circuits for various field offices. Preparing feasibility report for various upgrades and installations. Installation and maintenance of new network connections for the customers. Configuring all the required devices and equipment for remote vendors at various sites and plants. Installing new equipment to RADIUS and worked with MPLS-VPN and TACACS configurations. Installing and maintaining local as well as network printers. Validating existing infrastructure and suggesting new network designs. Working on creating new load balancing policies by employing BGP attributes including Local Preference, AS-Path and Community, MED. Installing and maintaining Windows NT Workstations and Windows NT Server. Providing technical support to LAN & WAN systems. Monitoring Memory/CPU on various low end routers in a network. Design and Implemented OSPF and EIGRP on various sites for routing enhancement, high availability, and  reducing administrative overhead  Co-ordinate with ISP on each step of designing BGP to understand their restrictions and our needs Redesigned IP scheme to improve existing summary routes, CPU process, memory utilization and convergence time Played a major role in designing, co-ordination and support while migrating from Verizon to Sing Tel on all sites Designed templates for offshore team for Cutover; guided and distributed responsibilities for the same."}