{"text": "Name: anna anna E-Mail: anna.anna@gmail.com Address: Delhi, India Github: https://github.com/anna LinkedIn: https://linkedin.com/anna Phone No. 423930812988 PROFESSIONAL SUMMARY: Network Engineer with 7+ years of working experience in Network Infrastructure, Security which includes designing, deployment and providing network support, installation, configuring, implementation and troubleshooting of complex networking system. Experience in set up, configuration and management of Cisco ASA Firewall in various domain such as Internet, DMZ, Business-Partner and Remote-Access VPN etc.  Experience in installing, configuring and administration of Firewalls including Palo Alto, Cisco ASA, Checkpoint and Load Balancers like Big-IP F5 (LTM and GTM). Hands on experience in Deploying and Troubleshooting Cisco 2900,2960, 3560, 3750, 4500, 4900, 6500 series including Nexus2248, 5548 and7010 switches. Experience configuring Virtual Device Context in Nexus 7010. Proficient in Cisco IOS for configuration and troubleshooting of routing protocols likeBGP, OSPF, LDP, EIGRP, RIP, BGP. Good knowledge in ACL, NAT/ PAT, Ether Channel, IP Sec and VPNs. Experience in Troubleshooting for connectivity and hardware problems on Cisco Networks. Advanced knowledge, design, installation, configuration, maintenance and administration of Checkpoint Firewall R55 up to R77, Secure Platform Installation, VPN. Knowledge in implementing and configuring F5 Big-IP LTM load balancers for load balancing and network traffic management for business applications. Hands on Experience in configuring F5 objects,components and provisioning various modules like LTM, GTM, ASM, APM. Configure all Palo Alto Networks Firewall models (PA-3000, PA-5000) as well as a centralized management system (Panorama) to manage large scale firewall deployments. Experiences in Deploying and Troubleshooting policy management on Web Proxies.  Strong hands on experience on PIX Firewalls, ASA (5540/5550) Firewalls. Implemented Security Policies using ACL, Firewall, IPSEC, SSL, VPN, IPS/IDS, AAA (TACACS+ & RADIUS). Experience setting up IPSEC VPN between Cisco ASA Firewall and Juniper SRX and Cisco routers. Good experience with Security Incident and Event Management (SIEM), Intrusion Detection and Prevention Systems (IDS/IPS) and log management and database activity monitoring. Implementing, maintaining and troubleshooting switching tasks such as VLANs, VTP, VLAN trunking using ISL and 802.1Q, STP, RSTP, PVST+, Ether channel using LACP and PAGP, Inter-VLAN routing, CEF and DCEF. Experience with network security protocols such as IPSEC tunnels, GRE tunnels, NAT (Configuring static NAT, dynamic NAT, inside Global Address Overloading), PAT, ACLs and VPN. Experience working with Palo alto GUI Panorama and orchestration tools i.e. Appview x and central management tools like Algosec, Tufin, Sol Soft. Experience with APM and ASM modules dealing with policy mangers and WAF policy deployment in transparent to active mode. Experience with “MacAfee” and “Splunk” SIEM tools for log analysis and threat management analysis. Generating Presentation and Usage report for users accessing external sites on Web proxies to compile with Security Compliance. In depth knowledge and experience working with other protocols like TCP/IP, OSI model, DHCP, DNS, SMTP, IMAP, FTP, LDAP, NTP, SNMP and various network protocols. Experience in Network monitoring using and alerting Solar winds to Operation Center (NOC) from a network management perspective. Experience in writing iRules for load balancing applications / policy mangers on LTM, GTM, APM, ASM modules for various TMOS version i.e. 10.x - 12.0. Experience with device management/inventory and device upgrade and maintenance of various vendor products i.e.Cisco, F5, Palo Alto, bluecoat, Websense, ASA, juniper Pulse VPN. Efficient at use of Microsoft VISIO/Office as technical documentation and presentation tools. TECHNICAL SKILLS: CERTIFICATIONS: CISCO CERTIFIED NETWORK ASSOCIATE (CCNA) CISCO CERTIFIED NETWORK PROFESSIONAL\t(CCNP) WORK EXPERIENCE: SECURITY/F5 ENGINEERAPR 2016 – TILL DATE FEDEX, Memphis, TN\t\t\t\t RESPONSIBILITIES: Responsible for reviewing and creating the FW rules and monitoring the logs as per the security standards in Palo Alto Firewalls.   Migration from Cisco firewalls to Palo Alto firewalls platforms PA 5000 and PA 500 and PA 200 firewalls. Worked with Palo Alto firewalls PA250, PA3020, PA5020 using Panorama performing changes if required. Successfully installed Palo Alto PA 3060 Firewalls to protect Data Center and provided L3 support for routers/switches/Firewalls. Configuring rules and maintaining Palo Alto Firewalls and Analysis of firewall logs. Configure IPsec and SSLVPN configuration on firewalls. Worked on Security Information and Event Management (SIEM), Intrusion Detection and Prevention (IDS / IPS), sniffers and malware analysis tools. Implemented Zone Based Firewalling and Security Rules on the Palo Alto Firewall. Extensive knowledge on wildfire feature of Palo Alto firewalls. Configured application load balancing using F5LTM, VIP, Pools on F5 LTM and worked with iRules management on LTM. Worked with F5 Load balancing, IDS/IPS, Bluecoat proxy servers and Administrating. Working configuration of new VLANs and extension of existing VLANs on/to the necessary equipment to have connectivity between two different data centers. Provide Tier III Load Balancer expertise on F5 Big-IP Local Traffic Managers (LTM), GTM and APM Modules. Responsible for solving logging issues of the F5 load balancer and how it works with the syslog servers making sure the communications go through the switches and routers. Deployed F5 LTM load balancer and experience in virtual server configuration, high availability, load balancing, iRules, and SSL profiles. Configured Nexus 2000 Fabric Extender (FEX) which acts as a remote line card (module) for the Nexus 5000 to connect servers and storage devices. Managing and providing support to various project teams with regards to the addition of new equipment such as routers switches and firewalls to the DMZs. Cleanup and Optimizing thefirewall rule base and database along with Reordering rules for optimal firewall performance.  Troubleshoot Firewall connectivity issues between Servers and Users as well as various third party, DMZ and internet zones. Troubleshoot connectivity issues and Monitor health of the firewall resources as well as work on individual firewall for advanced troubleshooting. Implementing rules in Visual Policy Manager to allow and restrict access as per customer requirement. Environment:PA250, PA3020, PA5020, PA 3060, PA 5000, PA 500, PA 200, Nexus 2k/5k, F5 Big-IP, LTM, GTM, APM, VLAN, iRules, SSL profiles, IPsec, Frame-relay. NETWORK SECURITYENGINEERMAY 2015 – MAR 2016 ELAVON, Atlanta, GA\t\t\t\t\t\t\t RESPONSIBILITIES: Design and implement a secure network in compliance with all PCI regulations. Upgraded the remote access (VPN) and firewall environment for the entire organization to ensure that day-to-day Security Operations run smoothly. Performing troubleshooting on slow network connectivity issues, and Performance on F5 and CISCO ASA Firewalls.  Involved in the configuration and troubleshooting of routing protocols likeOSPF, BGP and IP access filter policies.  Migrated 10.2.x version to 11.5.1 version and troubleshooting configuration change issues. Deploying and decommissioning Cisco switches/Firewalls and their respective software upgrades. Generating RCA (Root Cause Analysis) for critical issues of layer1/layer2/layer3/Layer7 problems. Involved in upgrading NX-OS to version 6.1 on the Cisco Nexus 7010. Experience configuring Virtual Device Context in Nexus 7010.  Configuration and troubleshooting of Firewalls ASA 5520, ASA 5510. Performed upgrading of load balancers from Citrix to F5 Big-IP load balancer to improved functionality, reliability and scalability in the system. Managed the F5 Big-IP GTM/LTM appliances to include writing iRules, SSL offload and everyday task of creating WIP and VIPs. Upgradesof F5 TMOS and Hot-fix installations depending on need. Worked on F5 BIG-IP LTM 3900, configured profiles, provided and ensured high availability. Worked on troubleshooting and resolving issues escalated by the NOC and internal systems, including developing, implementing and deploying emergency hot fixes within a global network. Administrating on F5 LTM, GTM, APM on series. Created an automated backup procedure for all F5 load balance appliances. Perform log analysis using SIEM Tool and generate reports for user exceeding a bandwidth on Websense. Performing the ACL requests change for various client’s requests given by application or business team. Handled LAN environment involving HSRP, VLANs, Trunking and Spanning Tree protocol. Work with IP for any vulnerabilities /ACLS and remediate as needed. Change management and third level incident management being the primary responsibility, participate directly as well as take escalations from the team members as and when required. Created Visio Dean / Visio Documentation to give complete picture of network design for each building. Hands on Experience in Troubleshooting IOS related bugs based on past history and appropriate release notes. Environment:Cisco 2948/3560/4500/3560/3750/3550/3500/2960 6500 switches, Cisco 3640/12000/ 7200/3845/3600/2800 routers, Cisco Nexus 7K/5K, Cisco ASA5510, 5520, windows server 2003/2008,  F5 BIGIP LTM. NETWORK ENGINEERSEP 2013 – APR 2015 TEREX CORP, WESTPORT, CT\t\t\t\t RESPONSIBILITIES: Managed operations of juniper SRX and cisco ASA firewalls as per design.  Configuring Virtual Chassis for Juniper switches EX-4200, Firewalls SRX-210.  Monitoring firewalls using Algosec Firewall Analyzer. Configure pools, profiles and manage clients web server traffic using F5Big-IPLTM load balancer. ConfiguredF5 Viprion chassis 4400s for GTM and LTM modules. Wrote iRules and policies in accordance with the application design. Upgraded F5 load balancers from TMOS9.0v to 10.0.1v. Deploy F5 VE on VM ware using vSphere client for lower level environment. Installed high availability Big IP F5 LTM and GTM load balancers to provide uninterrupted service to customers. Worked on daily tickets on firewalls, routes, load balancer requests. Configured and monitored Nginx web proxy server for better inspection of http requests.  Conducted web penetration test for web pages inside network to find out any vulnerabilities using “Vega” inLinux. Moved connections from cisco catalyst 6500 to nexus 7000 series. Implemented all standard and non-standard ISDN and IP-VPN changes to company customer support connections. Worked extensively in Configuring, Monitoring and Troubleshooting Cisco's ASA5500/PIX securityappliance, Failover DMZ zoning &configuring VLANs/routing/NAT with the firewalls as per the design.  Configure AAA using TACACSand Remote User Authentication using an RSA Secure ID (Two Factor Authentication). Wrote ACL’s for different server applications inside network.  Involved in Network Designing, Routing, DNS, IP Subnetting, TCP/IP protocol.  Participate in all technical aspects of LAN, WAN, VPN and security Internet Service projects including, short and long term planning, implementation, project management and operations support as required. Environment:Juniper switchesEX-4200, Firewalls SRX-210, F5 Big-IP LTM, Cisco's ASA 5500, Cisco catalyst6500,TACACS, NAT, TCP/IP. NETWORKSUPPORT ENGINEERDEC 2012 – AUG 2013 HANES BRANDS, WINSTON-SALEM, NC RESPONSIBILITIES: Configuring Static, IGRP, EIGRP, and OSPF Routing Protocols on Cisco 1600, 2600, 2800, 3600, 7300 series Routers. Deployed on Nexus7000, 5000 and 2000 series with V-Block servers and Cisco UCS E-series.  Experience in working with Cisco Nexus 2148 Fabric Extender and Nexus 7010, 5000 series to provide a Flexible Access Solution for datacenter access architecture.  Experience in configuring, upgrading and verifying the NX-OS. Expansion and implementation of current data center for different phases of migration.  Perform extensive testing around the upgrade, migration and configuration functionality of our software.  Responsible for entire company network infrastructure that includes Cisco Switches, Routers, Firewalls, Access Points, Servers. Design, Implement and troubleshooting of Juniper switches, routers and Firewalls EX-2200, EX-4200, EX-4500, MX-480, M Series, SRX210, SRX240, SRX 3600/650. Configuring and implementation of Juniper Firewall, SSG Series, Net screen Series ISG 1000, SRX Series.  Implementation of Site-to-Site VPNs and DMVPN over the internet usingIKE Phase 1 and IKE Phase 2 based on traffic with ASA 5500 series Firewalls.  Configure various LAN switches such as CISCO CAT 2900, 3550, 4500, 6509 switches and Access layer switches such as Cisco 4510, 4948, 4507 switches for VLAN, Fast Ether Channel configuration.  Configuration and troubleshooting of CSM, integration with ASA devices.  Experience in migration of VLANS and Configured VLANs with 802.1q tagging, Ether channels, and Spanning tree for creating Access/distribution and core layer switching.  Creation of firewall rules on Checkpoint Smart Dashboard and install policies.  Developed various Splunk search scripts to process and filter network data as per the requirements. Management of corporate Checkpoint Firewall implementing security protocols and alleviating network attacks.  Executed manual testing, protocol testing and system testing.  Deployed Palo Alto Firewalls for web filtering and application control.  Designed and implemented DMZ for Web servers, Mail servers and FTP Servers using Cisco ASA5500 Firewalls.  Environment: Cisco 1600, 2600, 2800, Nexus 7010, 5000, ASA 5500 series Firewalls, Juniper switches, CISCO CAT 2900, 3550 SWITCHES,VLAN. NETWORK ENGINEEROCT 2010 – NOV 2012 INFINITY INFO SOLUTIONS, INDIA.\t\t RESPONSIBILITIES: Installation, testing and troubleshooting of Switches, Servers and Firewalls. Installed and configured 6500 Cisco Catalyst Switch, creating VLANs and assigning ports to the VLAN, configuration of routing protocols such as OSPF, EIGRP and RIP, BGP. Upgrading the IOS on the 6500 switch and saving the old system configuration and running configuration. Configured EIGRP, RIP, OSPF, BGP and static routing, MPLS WAN connectivity, Frame relay WAN Connectivity. Performed Troubleshooting, upgrades, and administered multiple vendor systems platform and maintaining system applications. Implemented WAN network technologies like MPLS and Frame Relay, switching technologies like STP, switch and VLAN security on L2 and L3 layer switches. Provided BGP routing protocols for implementing multi-homing connection between two ISP’s and providing traffic flow to certain areas. Carried out Route-redistribution between different routing protocols like OSPF, BGP, and EIGRP for increased efficiency. Provided an IP Addressing scheme using VLSM and maintained VLAN table, and implemented DHCP server for assigning IP address to various connecting devices. Managing and troubleshooting Wireless LAN connectivity issues. Implemented Static NAT and PAT for internet users. Designed and Implemented DMZ for FTP, Web and Mail Servers with CISCO ASA5540/PIX 525 and PIX515E. Configured NAT and PAT on the Cisco PIX Firewalls for the Internal Systems. Extended support and troubleshooting for the field technicians at the remote sites. Supported remote location with site to site VPN, Remote access VPN such as IPSEC. Designed and developed organization production network involving configuration of devices like Cisco2821, 2811 routers, Cisco 3750 switch as well as carrying out their IOS upgrade. Provided Site-Site VPN and remote access for the clients and internal users. Setting up internal network by configuring the center’s routers with EIGRP over DMVPN at the hub router to establish connectivity with other Location. Opening and following up troubleshooting tickets with ISPs and corporate users to resolve problems with circuits. Environment:VLAN, OSPF, EIGRP and RIP, BGP, MPLS and FRAME RELAY, NAT, PAT, VPN, VLSM. SYSTEM ENGINEERJUL 2009 – Sep 2010 ING VYSYA, INDIA.\t RESPONSIBILITIES: Migration of RIPv2 to OSPF routing protocols. Configured EIGRP for lab environment. Implemented ISL and 802.1Q for communicating through VTP. Working with Client teams to find out requirements for their networks. Used various Network sniffers like Ethereal, Sniffer capture, TCP dump, etc. Real time monitoring and network management using Cisco Works LMS. Configuring of IP Allocation and sub netting for all applications and servers and other needs throughout company using FLSM, VLSM addressing. Created VLAN and Inter-VLAN routing with Multilayer Switching. Providing technical consultancy for better application response using QoS. Installed wireless access points (WAP) at various locations in the company. Real time monitoring and network management using Cisco Works LMS. Maintaining the exchange server and office 365. Maintaining user data backup and server backups on regular basis. Designing solutions for frozen requirements using Cisco Routers and Switches. Deploying the network infrastructure to meet the requirements. Having Data Center Design Experience, installing and Configuring Network Devices in a Data Center including patching the cables in the Patch Panel. Design and implemented network infrastructure and configured the entire network Infrastructure devices including Network Printers and Registers. Environment: Cisco routers, switches, Firewalls, Routing protocols, VLAN, VLSM, FLSM, QoS, VTP. EDUCATION:Bachelor of Technology in Electrical & Electronics Engineering."}