{"text": "Name: virginia virginia E-Mail: virginia.virginia@gmail.com Address: Chenzhou, China Github: https://github.com/virginia LinkedIn: https://linkedin.com/virginia Phone No. 145344453318 Professional Summary: A highly enthusiastic and energetic software professional with 7+ years of experience as PHPdeveloper on web development analysis, development, documentation and implementation. Extensive experience in system analysis, design, development and implementation of web based and client/server application using HTML, CSS, JavaScript,AJAX, XML and SEO technologies. Strong experience in developing UIapplications using HTML, CSS, JavaScript, AJAX, JQuery, Angular JS, Bootstrap. Designed and developed applications in the major versions of the PHP 4/5x and worked with WAMP(Windows, Apache, MySQL, PHP), lamp (Linux, Apache, MySQL, PHP) environments. Very good experience in web services usingSOAPprotocols and on REST API. Experience as web developer and designer with complete understanding on OOPconcepts, designingSQLdatabases, maintaining code using version control tools like GIT and subversion and troubleshooting repositories. Developed custom themes in Drupal 6/7 using AJAX, JQuery, HTML 5, CSS3. Good knowledge on model view controller (MVC) architecture based web application development such as Zend, CodeIgniter. Solid on working with CSS backgrounds, CSS layouts, CSS positioning, CSS animations, CSS table, pseudo classes and pseudo elements, to create pages using CSS webpage layouts and having knowledge in usability and accessibility concepts.  Experience in content management system Drupal (7/8). Strong in converting html designs to Drupalthemes and templates overriding using preprocess functions. Extensive working experience with content management tools such as Drupal6and Drupal7, Joomla, WordPressand Magento. Familiarity with large multi-server Drupalenvironments, administration, and integration with various third-party sites with open APIs. Used Angular JS containing authoring complex directives, services, controllers, and filters.  Experience in AngularJS, NodeJS,Knockout JS and Bootstrapframework for developing UI. Good knowledge on model view controller (MVC) architecture based web application development such as Zend, Cakephp, and CodeIgniteras well as e-commerce web environments such as Magento. Experience in e-commerce platforms like Magentoandalso in setup and installing sample data luma template for Magento. Experience in relationalMySQL database design and maintenance, and writing sub queries, stored procedures, triggers, cursors and functions. Use and expansion of the Magento ecommerce platform, to an advanced level, on all editions; enterprise and community. Experience in web and mobile testing using emulators, mobile devices and browsers like Safari, Chrome, Firefox, IE, andOpera. Familiar with NOSQLdatabase design, analysis and development like Mongo db. Strong expertise in web application development using PHPwith OOPS, SVN, MySQL, MS SQLserver, JavaScript, NodeJS, PHP, JQuery, AJAX, CSS, flash ActionScript3.0 andXML.  Worked with woo-commerce MagentooscommerceZen cart, encrypting data between browser and server, and using SSL encryption for payment gateway. Customize and deploy Magentoextensions and themes, develop new and enhance existing functionality for our Magentoonline stores. Experience in internet, intranet, client/server, CMS, E-Commerce andwebapplicationsdevelopment with active involvement in all the phases of SDLC. Experience in web development tools like PHP Storm, Adobe Dreamweaver cs3, spring tool suite, Eclipse. Excellent troubleshooting & problem solving skills with client-server applications & web applications. Well versed with complete software development life cycle (SDLC) process. TECHNICAL SKILLS: Work Experience: Client:Unilectric, TXFeb2016-Till date Role: SrDrupal/PHP Developer Responsibilities: Worked on HTML5, JavaScript, CSS and their integration within a PHP environment. Designed in HTML 5, DHTML, CSS3, JavaScript and JQuery for making website more attractive. Designed theme using HTML/XHTML, CSS, used JavaScript, jQuery for user interactions in pages. Used JQuery core library functions for the logical implementation part at client side for all the applications and worked on Adobe Photoshop for editing and optimizing the images and logos. Development of Frontend pages with Java Script frameworks like Angular and bootstrap. Designed dynamic and browser compatible pages using HTML5, CSS3, JQuery and JavaScript (including AngularJS, React JS, and NodeJS). Used filters while coding in Angular JS. Worked on an open-source CMS Drupal to build website using Drupal 8. Expertise in all PHP-related projects technical aspects like design, development, project documentation and product maintenance. Experienced in developing web-based applications using PHP 5.x, MySQL, XML, CSS, HTML, DHTML, XHTML, JavaScript, JQuery and AJAX Technology. Experience in Drupal tool, like View Tools, UberSearch, Drupal Theme Viewer to create powerful and flexible web applications. Worked on analysis, design, development and implementation of web applications using PHP, ZendFramework, Oracle and MySQL. Experience in Using PHPMyAdmin to handle the administration of MySQL. Significant experience in web development tools like PHP Storm, Adobe Dreamweaver CS3, Spring Tool Suite, Eclipse, and Firebug. Designed, developed, and maintained Drupal PHP modules, HTML pages, various applications, and tools in a Drupal content management system (CMS)-based web site environment. Wrote modules, components and Themes for Drupal. Worked on Stack ZendPHP, Apache Web Server, SVN, Oracle, JavaScript, jQuery. Extensively used XML documents with XSLTand CSS3 to translate the content into HTML to present to GUI. Worked on development of Drupal modules which connect to external REST Web services and API to import data into Drupal. Implemented SEO based Drupal modules optimizing the search function all over the site. Worked on coding optimized SQL queries, PL/SQL Stored Procedures, Functions, Packages and Triggers on databases like MySQL, MSSQL and Oracle. Strong expertise in web application development using PHP with oops, SVN, MySQL, MSSQLserver, JavaScript, JQuery, CSS, flash ActionScript 3.0andXML. Expert knowledge in open source Frameworks/CMS such asMagento, Joomla, WordPress, Drupal 8, Symfony, CodeIgniterand more. Worked with LAMP stack, NOC and IT operations. Used Linux command line environment and other tools related to the LAMP stack. Build AJAX pages using PHP to display current server time Environment: Drupal, JQuery, Zend2, PHP, CSS, MySQL, Google map, Html, CSS, JavaScript. Worked on customizing modules, themes using API's and core Drupal 8modules. Experience in Optimizing sites for usability, search engines and accessibility, and updated existing sites and content management systems. Worked with teams in designing and developing server optimization techniques like caching, output stream compression, Memcache, Drupal module updates and releases etc. Environment:PHP5, MYSQL, JavaScript, bootstrap, Angular JS, JQuery, CMS, JSPs AJAX, HTML5, DHTML, CSS3, Linux, Agile, React JS, REST, XML, MVC, Drupal7/8, Zend Framework, Adobe Photoshop, LAMP. Client: Bright Horizons, CODec2014-Jan2016 Role: Sr Drupal/PHP Developer: Responsibilities: Designing webpage's in HTML, DHTML using CSS and JavaScript. Developed and implemented search feature using PHP 5 and AJAX. Worked on DrupalCMS creating nodes, blocks, CCK and custom themes. Responsible for creating efficient design and developing User Interaction screens using HTML5, CSS3, JavaScript, JQuery,AJAX and JSON. Integrated the Drupal Modules with Bootstrap based Theme for responsive UI. Developed application using Angular JS and Node JS connecting to MySQL on the backend. Built and managed the mobile site project and integrated the frontend with backend using JQuery mobile frameworks. Working knowledge with GIT and also SVN for version control and used JIRAfor bug tracking and issue tracking. Analyzed existing administrative work flow, identified time-consuming processes, and developed generic web based solutions using MySQL, JavaScript, PHP and CSS customizing them for individual departments as required. Worked on an open-source CMS Drupal to build website using Drupal7. Worked with teams in designing and developing server optimization techniques like caching, output stream compression, Memcache, Drupalmodule updates and releases etc. Creating Reporting Dashboards consuming RESTful API data. Used Dreamweaver, Photoshop, Flex for implementing application and designing graphics and images. Conceived and designed database tables in MYSQL5. Developed Single page application and structured the JavaScript code using Angular JS. Maintain high volume availability demands using open source tools such as Linux, Apache, PHP, and MySQL. Worked on managing, editing and deleting the site content and publishing and un-publishing them in Drupal. Involved in back-end development with PHP, MySQL, XML and light database design. Modified, Improved & corrected HTML, CSS/SASS, JS structure. Used various Drupal hooks like view template preprocess for customization of fields. Used GIT based version control for migration. Helped to explore available tools, plug-ins, and extensions and support the implementation of such enhancements within our web-based products. Developed user interface using PHP, bootstrap, Ajax, JQuery, HTML, CSS. Created and developed custom modules in Drupal like Favorites Modules, Modules for creating custom post types, Gallery modules for popping up images, Flash module for videos and also modified existing modules to look more attractive. Worked with the Database Schema design and normalization for database accessed by the procedural PHP pages. Modify existing code and resolve errors, allow it to function in new operating environments or by improving the performance of web application. Environment:JQuery, Zend, Linux, Bootstrap, Angular JS, PHP, JSON, Drupal7, Eclipse, JavaScript, Linux, MVC, MVVM, HTML5, CSS3, LAMP, AJAX, Bootstrap XML, XHTML, MySQL. Client:Express Scripts, NJJune2013-Nov2014 Role: PHP Developer: Responsibilities: Defined and developed the application's presentation layer using HTML5, CSS3, JavaScript and JQuery Scripting. Developed and enhanced Web interactions using JavaScript and frameworks like JQuery. Implemented AJAX and JQuery on Front-End to make the web page more dynamic. Developed the middleware software components for the implementation of the Data Entry GUI for creating and editing medication instances using client side technologies viz. HTML, CSS, JavaScript. Experience in Object Oriented Programming (OOP) concepts using PHP5. Used Angular JS for making restful API calls and data binding. Handled Twitter Bootstrap framework i.e., the concept of Grids, making use of advance components like Navs, Navbars, Pagination, Alerts, Progress bars etc. Advocated best practices with a focus on consistency, efficiency and usability with the Drupal platform. Created custom PHP framework with modules for different set of permissions and roles. Worked on media consulting with AdobePhotoshop. Developed custom modules by integrating Web Services like REST and SOAP. Developed Contact Fill Application using Drupal and installation and integration of the Application online. Extensively worked on efficient Drupal websites and Drupal development technologies such as Drush, Features, Panels, Services, and Context. Designed and modified Drupal sites for customers to include installation of websites, adding and configuring associated plugins/widgets, etc. Created DOM for datasets. Worked with datasets in JSON format. The datasets are collected from back end server PHP file using API and these datasets are then rendered on front end using HTML, DHTML and CSS/SASS. Created Images, Logos and Icons that are used across the web pages using AdobeFlash and Photoshop. Thorough understanding of Object Oriented Principles and Agile and Scrum Development Methodologies. Building the website from scratch in Aptana and Used JavaScript to make interactive site. Responsible to handle frontend side of application to make it high performance, rich and user friendly. Worked on Restful API's for integrating ecommerce services with third party application. Updating Drupal and plugins to new version across all sites. Custom frontend development with PHP, HTML, CSS, JavaScript and wrote PHP to interact with third party JSONservices. PHP-MySQL connectivity was used to access the required data from the database. Worked with the Database Schema design and normalization for database accessed by the procedural PHP pages. Developed PHP based server side API using Zend framework and implemented MVCarchitecture. Build AJAX pages using PHP to display current server time. Environment:  PHP 5, HTML5, DHTML, JavaScript, JQuery, JSON, Bootstrap, AJAX, CSS/SASS3, MYSQL, Mantis, REST, SOAP, Drupal, Agile, Zend, WordPress, MVC,Adobe Flash, Photoshop. Client:Active Logic Labs, KansasDec2012-May2013 Role:PHP Developer Responsibilities: Developed compatible User Interface functionality using JQuery, Ajax, JavaScript& other libraries. Designed mockups, GUI layouts by using HTML, DHTML, XHTML, XML, CSS and JavaScript. Produced content pages with CSS layout and style markup presentations and also used JavaScript methods and properties. Used JQuery slide menu, easing plugin to implement the front end. Built responsive website using Bootstrap that fits devices of different visual sizes. Used the Model View controller (MVC) framework to build modular and maintainable applications. Created custom PHP framework with modules for different set of permissions and roles. Performed SQL queries and stored procedures optimization using MySQL database. Created HTML and CSS from Photoshop mockups. Using complex Object Oriented concepts in improving the performance of the websites. Designed, built, tested and implemented stand-alone modules for Magento, including payment and shipping modules. Customized Magento's inherent features based on client needs. Wrote PHP codes to interact with the third party JSON services to provide an easy to configure web service server interface. Debug and troubleshoot front-end and backend issues throughout all Magento E- Commerce Community and Enterprise versions. Implemented various Validation Controls for form validation and implemented custom validation controls. Written SQL queries and stored procedures to fetch and store the data using MySQL database. Built PHP applications to meet product requirements and satisfy use cases using MVC architecture, CodeIgniter Framework. Responsible for customizing our local feature modules in Magento framework like sales event, sale category. Strong experience with Magento Commerce (creating modules, extending out-of-the-box functionality, layout creation and theming), user interface and interactive concepts regarding Search Engine Optimization. Strong expertise in Web Application development using PHP with OOPs, CVS, SVN, MySQL, MS SQL Server, PHP,JQuery, AJAX, CSS, FlashActionScript3.0 and XML. Maintained 24/7 high volume availability demands using open source tools such as Linux, Apache, PHP, and MySQL. Developed code to call the web service/APIs to fetch the data and populate on the UI using JQUERY/AJAX. Worked with PHP, MYSQL, CSS, JavaScript, AJAX and XHTML to build a fully Web 2.0 compliant networking website around online HD streaming video. Written AJAX driven JSON consuming JavaScript functions to save user selections such as video button, drop-down menu selections into a cookie. Maintain SQL server database and reporting tools updating PHP script. Environment: PHP, MYSQL, Oracle, JavaScript, JQuery, CSS, PHPMyAdmin, MVC, HTML, DHTML, XML, CSS,MS Excel, Magento, MSWord, Microsoft Visio, LAMP, JQuery, SQL, AJAX, Adobe Photoshop.  Client: Regency Info Tech, IndiaSep2011-Nov2012 Role: PHP Developer Responsibilities:  Developed web pages using HTML5, JavaScript, DOM, JSON, JQuery and AJAX. Created Front-End views for new applications and features using HTML5, CSS3, JavaScript and JQuery. Built PHP applications to meet product requirements and satisfy use cases using MVC architecture, CodeIgniter framework and WordPress CMS. Embedded PHP, HTML, and JavaScript Validations. Designed Custom frontend for the website using various web designing applications such as PHP, CSS3 and JavaScript. Wrote SQL queries to fetch and store the data using MYSQL database. Produced content pages with CSS3 layout and style markup presentations and also used JavaScript methods and properties.  Created Images, Logos and Icons that are used across the web pages using Adobe Flash and Photoshop.  Involved in the designing the templates and customizing the CMS WordPress. Developed the middleware software components for the implementation of the Data Entry GUI for creating and editing medication instances using client side technologies viz. HTML, CSS3, JavaScript. Modification and customization of the Drupal and WordPress themes. Developed new modules call schedule by using jQuery full calendar and AJAXfor front-end and back end. Designed and developed multiuser,3-tier MVC web-application (Apache, PHP, JQuery, JQueryUI, JavaScript/JSON) for describing whole infrastructure. Integrated existing WordPress modules as well as create custom theme, module, views, functions and hooks.  Diagnosed and troubleshoot WordPress site problems and applied solutions to increase customer efficiency.  Wrote PHP codes to interact with the third party JSON services to provide an easy to configure web service server interface.  Cleaned up and rewrote front end HTML and CSS3 to meet validation requirements. Coordinating with other programmers in the team to ensure that all the modules complement each other well. Environment: PHP, HTML5, MySQL, CSS3, JavaScript, WordPress, apache, GIT, JSON, AJAX, JQuery, adobe flash, Html, CSS3, CodeIgniter, MVC. Client:Soft Solutions Inc, IndiaNov2010-Aug2011 Role: PHP Developer Responsibilities:  Designing webpage's in HTML, DHTML using CSS and JavaScript. Responsible for front-end development using HTML, CSS, JavaScript, AJAX as well as back end support using PHP and SQL. Implemented the presentation layer with HTML, XHTML, Ajax, and CSS, jQuery other libraries. Produced and consumed Rest Web Services, developed DAO's and DTO classed for services and consumed through Angular factory service calls from front end. Developed schema in MySQL to get data from database depending on user role. Wrote SQL queries to fetch and store the data using MYSQL database. Developed code to call the webservice/APIs to fetch the data and populate on the UI using JQUERY/AJAX. Implemented PHP session variables and cookies. Implemented various Validation Controls for form validation and implemented custom validation controls using Object Oriented JavaScript. Used Linux to maintain and configure Apache web servers. Used PHP / MySQL in WAMP (Windows, Apache, MySQL and PHP) environment for Creating dynamic data driven and interactive web pages. Hands on experience with adding widgets, plugins, tools and posts through WordPress. Followed MVC architecture (Zend Framework) for the development. Designed Page caching, RSS feeds, printable versions of pages, news flashes, blogs, search, and support for language internationalization using Joomla. Worked with Visual Studio for converting web pages from .NET to PHP. Created tables, stored procedures, triggers and views for data access and manipulation.  Wrote PHP codes to interact with the third party JSON services to provide an easy to configure web service server interface. Environment: Eclipse, PHP 5, XML, HTML, WordPress, ZEND Framework, LAMP, AJAX, CSS, VPN, MySQL, JQuery, Joomla, JSON, CodeIgniter, JavaScript.          Client: RecursiveSoft Tech, IndiaJul2009- Oct2010  Role: PHP Developer Responsibilities:  Designed dynamic and multi-browser compatible pages using HTML, CSS, JQuery, JavaScript.  Built AJAX pages using PHP and created various asynchronous web applications. Used JavaScript to make interactive site. Responsible to handle frontend side of application to make it high performance, rich and user friendly.  Building and modifying PHP websites using PHP Joomla and WordPress.  Created Custom search routines to query MySQL database and return a result of contacts from the database.  Wrote PHP codes to interact with the third party JSON services to provide an easy to configure web service server interface.  Updating content using HTML and CSS on Joomla and flat PHP/HTML sites. Designed Page caching, RSS feeds, printable versions of pages, news flashes, blogs, search, and support for language internationalization using Joomla.  Worked on applications and developed them with XML, JSON.  Improve and update older Joomla template design and bring current with a responsive design.  Designed and developed multiple RESTful web services and APIs in the development of various mobile applications.  Implemented business logic with PHP scripts to interface with a SQL database. Assigned the responsibilities of troubleshooting problems with PHP and other web technologies. Experienced in Optimizing sites for usability, search engines and accessibility, and updated existing sites and content management systems. Interaction with Client APIs to retrieve client specific information using SOAP services. Environment:PHP, HTML, JavaScript, MYSQL, SVN, PHPMYADMIN, Joomla, Visual Source Safe, MS Excel, jQuery, JSON, XML. Education:Bachelor of technology, India."}