{"text": "Name: margaret margaret E-Mail: margaret.margaret@gmail.com Address: Fuyang, China Github: https://github.com/margaret LinkedIn: https://linkedin.com/margaret Phone No. 385376246572 Summary  Over 7 + years of experience in the field of Information Technology with solid experience in Data Analyst, Design and Hotels, Retail industry.support to various Data Warehousing, Data Integration, Business Intelligence(BI) projects and Extensive experience in ETL source to target mapping. Database Design, development and deployment of large-scale enterprise applications products like SSRS, SSAS, and SSIS. Managed business process, requirements gathering and transformation of functional requirements into technical specifications for solution design such as requirement elicitation, analysis, design, development and testing for the clients in Hotel, travels & retail industry Strong understanding of financial modeling, risk management, capital budgeting and other finance terminologies. Managed project budgets, risk analysis and mitigation, issue management, root cause analysis, project schedule development and tracking using MS Project. Using Facets for various health insurance areas such as enrollment, member, Products and other FACETS related modules Experience in testing Facets applications and EDI transactions Experience working on 4010 and 5010 HIPAA implementation guides relate to Claim Testing and Medical Billing. Knowledge of the EDI transaction sets such as 837, 834, 835, 270, 271, 276, 277, 999 Understanding of HIPAA Standards and Compliance issues, HIPAA Privacy policy, opt in/opt out policy. Experienced working with Excel Pivot and VBA macros for various business scenarios. Developed Test Cases, Test Scripts and SQL to perform Unit Testing, System Testing and Load Testing. Worked with Operations and Platform teams to migrate ETL Code and DB objects from Development to Testing, UAT and Production. Proficient with Statistical and analytical tools like MS Excel, VBA, MS Access, and SQL to solve business problems. Extensive experience with Data Warehousing, Extraction, Transformation and Loading (ETL) and Business Intelligence (BI) tools. Executed SQL queries and documented them as part of validating the Business Object reports  and for testing purposes  Experience in working with various data sources like Sequential file, Oracle, SQL Server, Teradata and Flat Files in Datastage designer.  Experience in creating SQL queries to facilitate UAT and perform data validation. Experience in methodologies like Agile, Waterfall Model and Data Modeling; Creating Process mapping, Use Cases, Sequence diagrams, Activity diagrams Excellent experience in troubleshooting test scripts, SQL queries, ETL jobs, data warehouse/data mart/data store models. Solid understanding of Membership, Claims Processing, Billing, Benefit/Eligibility, Authorization/Referrals, COB, and have experience in HIPAA standards and corresponding EDI transactions. Facets support systems were used to enable inbound/outbound HIPAA EDI transaction in support of HIPAA 834, 835, 837 270/271 transactions. Proficient in conducting System Testing, Functionality Testing, Regression Testing, User Acceptance Testing (UAT) and training of users Involved in maintaining Test Matrix and Traceability Matrix and performing GAP analysis Technical Skills Database Tools\t SQL Plus, SQL Loader, SQL Developer, TOAD, Autosys, Zone, Serena ETL Tools:\tTeradata ,ETL,Data Stage/Quality Stage, SAS Data Flux Informatics Data Quality Programming Languages             SQL, PL/SQL, UNIX Business Intelligence shell Scripting, VBScript, PERL, AWK, SED Reporting Tools:\tSQL Server Reporting Services (SSRS) 2000/2005/2008/2008R2, Crystal Reports, Report Builder Databases:   \tOracle 11g/10g/9.x, DB2 UDB 8.x/7.x Operating Systems:                       Windows /XPDOS, UNIX, Linux RDBMS:\tSQL, Oracle, and MS Access Utilities/Application:\tMS Project, MS Visual, MS Office 03/07 (MS-Word, MS-PowerPoint MS-Excel, MS Access/Excel/VBA  applications,MS-Outlook) Professional Experience Project Description: Hyatt Hotels Corporation is an American international company and operator of hotels including brands like Grand Hyatt, Andaz, Park Hyatt, Hyatt Regency, Hyatt Residence Club, etc. Roles & Responsibilities: Requirement Gathering and Business Analysis Schedule and facilitate daily stand up meeting at same time and same location each day in accord with the scrum fundamentals. Conducted data analysis using SQL & Excel as part of requirements analysis and to assist data quality teams. Transformed non-Agile team to agile team by consolidating the ad-hoc work requests to prioritized monthly backlog, reducing testing cycle by the automation of regression testing. Contributing to software process-reengineering efforts aimed at evolving current software development practices to adopt Lean/Agile and Scrum practices. Implementing agile development best practices and moving to monthly releases from point releases.  Provide AGILE project management controls, project plans, timeline schedules, Understood basic business analysts concepts for logical data modeling, data flow processing and data base design. Competent in analyzing and creating Narrative User Stories, Data/Flow/Navigational flow diagrams using UML Tools like MS Visio and BPMN. Created the ETL mapping document by mapping the data from source to target databases. Played the role of an Agile Scrum Master coordinating Sprints, from Iteration Planning through daily scrums, and Iteration Reviews and Retrospectives Managed user stories, Product and Sprint backlog. Worked as a Release Managers with the list of backlog items being released to production with the upcoming sprint. \t Managed weekly Project Status and Task Review meetings Develop and maintain sales reporting using in MS Excel queries, SQL in Teradata, and MS Access. Developed data mapping documents for integration into a central model and depicting data flow across systems Participation throughout the entire SDLC for application customization and business process improvement.  Executed test scripts for performance, usability and acceptance testing on business process improvements and quality assurance.   Follow ups with QA leads and developers for defect resolution. Developing Test Plan with a Test Strategy for the System testing.  Environment:  Data Stage , Windows , Linux, DB2, UNIX, IBM Mainframe AGILE methodology, Windows, XML, HTML, H Project Description: Marriott Hotel Group (MHG) is a part of the Marriott Worldwide family of companies. The primary objective of the current project was to enhance the e-commerce application, the Central Reservation System (CRS) for MHG. The functionality of existing CRS has to be enhanced to maintain the capabilities of the current Marriott Hotels and Resorts (MHR) reservation system – Opera Reservation System (ORS). Roles & Responsibilities: Assisted in designing and developing of project document templates based on SDLC methodology.  Conducted interviews and focused group discussions to gather high level requirements. Worked closely with SME’s for CRS and ORS to provide functional specifications for CRS evolution.  Maintained meeting minutes, meeting agenda and communicated them with the SMEs and the stakeholders on timely manner using MS Word, MS PowerPoint and created reports using MS Excel.  Performed extensive Gap analysis between CRS and ORS and identified functional gaps between them. Documented business requirements and functional requirements for product development using agile methodology.  QFD was applied to transform voice of customer into functional requirements. Created Use-cases, activity diagrams, sequence diagrams and class diagrams using Rational Rose. Interacted with the developers to identify and document possible impacts to the enhanced CRS system Participated in User Acceptance Testing (UAT) for the product using Rational Clear Quest. Executed multiple queries in SQL using Toad Application. Working with clients to better understand their needs and present solutions using structured SCRUM approach Involved in Analysis, Design and flow of user interface in web application Worked with the DBA and Database developers to convert the functional specification to technical specification and generate the data model. Worked on maintenance of model using the Complete Compare and Update Model features. Performed Data Analysis using procedures and functions in PL/SQL. Used MS Visio to represent system under development using case diagrams, activity diagrams and workflow diagrams. Participated in Code and Design Reviews for the ODS project for backend Data population and reporting system. Consulted with SMEs and core team about the requirement and technical issues. Worked on generating various data modeling reports and publishing model in various formats. Conducted review meetings with development, QA and data team to communicate business requirements. Environment: Erwin  Oracle, PL/SQL, MS-SQL Server , Agile/Scrum, DB2, UNIX, MS-Office, MS-Visio, SAML, Windows NT Project Description: Baptist Memorial Hospital MS is chain of hospitals located at multiple locations in U.S. This online application was developed for adding new patient appointments, scheduling appointments and rescheduling appointments. When customer calls the hospital, basic patient information like Name, Address and insurance details of patient is captured as part of initial appointment. The project involved data migration sync process from Oracle database into SQL Server database. I was responsible for data synching, source to target mapping and data validation. As an ETL Developer I was responsible for implementing Best Practices, Performance Tuning, and Error Handling along with development. Roles & Responsibilities Involved in requirements gathering, Analysis, Design and Develop and maintenance Phases. Wrote advanced SQL queries to extract, manipulate, and/or calculate information to fulfill data and reporting requirements including identifying the tables and columns from which data is extracted.  Provided Assessment Survey deliverables along with the recommendation based on the survey results to the FHHS management team Involved in the planning phase with respect to Business areas and created Work Breakdown Structure” for them (Claims, Customer Service, Operations, Medical Management) Analyzed and documented the changes in the compliance rules for adverse action redesign. Used Data warehousing for Data Profiling to examine the data available (Data Analysis) in an existing database Extensive experience in ETL processes in extracting data from Operational and Legacy Systems to Data Warehouse using Informatics. Used Data stage Manager for managing Data stage repository (view and edit), define custom routines & transforms, Import and export items between different Data stage systems or exchange metadata with other data warehousing tools. Ensure day-to-day EDI transmission, Reject tracking and Reconciliation. Run EDI Reconciliation reports daily and document in MS Excel. Utilized SQL server’s reporting services SSRS and SSIS to support reporting requirements.  Used SQL tools like TOAD to run SQL queries to view and validate the data loaded into the warehouse. Proven experience to write complex functions and conditional statements to interpret raw data in useful business information. Highly capable in scripting VBA code, creating Pivot Tables, using Worked closely with the Enterprise Data Warehouse team and Business Intelligence Created data for dashboard, reports, analysis datasets, and graphs using SAS. Performed extensive task which include Data Quality Analysis, Data lineage and Data Standardization data structures, data base design, data warehouses, business  Worked in Teradata to make sure completeness of table structures, data and reference table data. intelligence/analytic tools, SQL, ETL tools, and data integration methods Managed all the requirements, making requirements available to all team members. Worked on SQL Server concepts SSIS (SQL Server Integration Services), SSAS (Analysis Services) and SSRS (Reporting Services). Extensively worked on SQL tuning used Explain plan TK Prof, Bulk collect and also ETL Tuning. Create VBA programs to automatically update Excel workbooks, encompassing class and program modules and external data queries. Created requirements analysis and design phase artifacts using Requisite Pro and MS Visio. Data mapping, logical data modeling, used SQL queries to filter data within the Oracle and Sybase. Responsible for co-coordinating business meetings and generating monthly status reports etc. Used the Agile methodology to build the different phases of Software development life cycle. Used extensive SQL for data profiling/analysis to provide guidance in building the data model Environment: IBM Ascential Data Stage MS SQL, Windows XP, PL/Toad SQL, business intelligence Business Objects XIR2, Teradata ,ETL Tools Informatics, SSIS, SSRS, Crystal Reports Requisite Pro, Clear Case, SAS, Micro strategy UML, MS Access ,MS power point, MS Excel, VBA, MS Word Business Objects, , MS Project, MS Excel Project Description Tri-County Memorial Hospitals is a network provider of healthcare services including hospital, primary care, long term, home health, mental health, dental, and chemical dependency services. The application maintains a database containing patient, doctor and employee information. The website uses this information along with other related content to provide online services to the community and network., health plan groups while generating 837 Professional, Institutional, and Dental claims, Acknowledgement 997, Claim Status Inquiry/Response 276/277, Remittance Advice 835, Eligibility Inquiry/Response 270/271, Prior Authorization 278, Drug/Pharmacy rebates and reimbursements, etc.  Roles & Responsibilities Worked on design and development in   Data stage vto develop  ETL code including :  Support for creation and documentation of the ETL Detailed Design. Modified existing program logic to improve overall system performance. Work with SSIS to load individual table and work with SSRS to generate reports. Construction and test of incremental data movement code (extract, cleanse, validate, transform, and load) Extensively used Data stage Enterprise Edition (Parallel Extender) to develop various jobs to extract, cleanse and load the data and also involved in migration from DS to versions. Used Data stage Director to schedule, monitor, cleanup resources and run job with several invocation ids.  Expert in Advanced Excel and its features like Pivot Tables, Charts, Functions, Scenarios, Excel/VBA and MS Access Implemented, developed, and supported various applications. Created Sequence jobs to control the flow of jobs and their dependencies Involved in extensive DATA validation by writing several complex SQL queries and Involved in back-end testing and worked with data quality issues. Handled Source to Target Data Mapping, Technical Specs documentation, and ETL  Designed and developed matrix and tabular reports with drill down, drill through and drop down menu option using SSRS.  Used FACETS Analytics for fast and easy retrieval, display and grouping of information for performing queries and generating reports. Translating process/technical solutions for business during defect analysis  Worked With HIPAA compliant ANSI X12 837 formats for both professional claims and institutional claims. Experience in calling a Web Service, through SSIS Package through the  Used TOAD, PL/SQL developer tools for faster application design and developments transformation, and wherein you declare a variable with its URL link  Analyzed the mainframe reports for member/eligibility/claims and mapped the fields with FACETS batch jobs and reports. Working through the phases of SDLC using the Agile methodology Worked closely with Development team on ETL process, data infrastructure, data modeling, business intelligence reporting and dashboards Responsible for Data mapping testing by writing complex SQL Queries using WINSQL Reviewed ETL and Business Objects defects and proposed fix for defects as per the scheduled timeframe Configured SSIS packages to incorporate slowly changing dimensions for tracking historicaldata \nExpert in TSQL, creating and using Stored Procedures, Views, User Defined Functions, implementing Business Intelligence solutions using SQL Server.  Dealt with the EDI transaction 835 claims payments and remittance advice, which deals the payment from payer to provider.  Worked on different modules of Facets such as Members/subscriber, commissions, provider, billing, plan and Case management. Used SharePoint web application platform for content management, document management file management, business intelligence and process integration. Scheduled reports for daily, weekly, monthly reports for executives, Business analyst and customer representatives for various categories and regions based on business needs using SQL Server Reporting services (SSRS). Worked with Waterfall methodology during the beginning of the project then transitioned to Agile methodology Environment: IBM Information infosphere, Teradata, Informatica, SSIS, SSRS, COGNOS, Windows XP Toad for Oracle Version , SQL Developer, Agile, Waterfall, Oracle , MS Office tools, Facets, HP Quality Center, Windows , SharePoint, MS Visio. Project Description Massachusetts Health and Human services is responsible for the Medicaid program, child welfare, public health, disabilities, veteran’s affairs, and elder affairs increasing the nation-leading access to care. The project provided a platform, which collects and synchronizes information of each person all in one place, including medical claims, lab results, self –reported data and other relevant information and also in an efficient and effective manner.\nRoles & Responsibilities:  Involved in gathering requirements as per the consensus meetings between Humana and providers.  Ensuring all the PLC and PM deliverables are developed in compliance with company policies. Created domain models and made them an integral part of multiple FRDs that I created for various aspects of the project. Worked on the EDI 834-file load to Facets through MMS (Membership maintenance sub-system) Developed Use Case diagrams and process flow diagrams using Rational Rose and MS Visio.  Actively prioritized and managed requirements throughout SDLC with all key stakeholders Negotiated and managed multiple priorities, project plans, time frames and trade-offs while ensuring the clinical and administrative staff understood the final results of the projects, sharing detailed vision of cost-benefit analysis. Worked on solving the errors of EDI 834 load to Facets through MMS. Provide input to estimates for project management and change management activities through analysis of requirements effort, resources, and technology.  Worked on EDI 834, 835,837 as per HIPPA guidelines. Performed the detail comparison between 4010A and 5010 especially in regard to EDI 837. Used the Rational Unified process methodology for the application development and created Use cases, activity diagrams and drafted UML diagrams using the Rational Rose. Worked closely with the Business Intelligence (BI) team to define standards for report. Worked on cross-functional team to deliver software systems as per the customer expectations.  Played a key role in data analysis and data modeling (model design, development, and model implementation) using SAS. Updated the requirements and prepared comprehensive Business Requirements Document (BRD) that provided the appropriate scope for the users and management to make appropriate decisions. Developed associated project documentation, schedule, design specifications, test plan, test scenarios/scripts, performed gap analysis, and test tracking reporting/monitoring for all phases of testing including B2B user acceptance testing.  Created data for dashboard, reports, analysis datasets, and graphs using SAS. Played a key role in planning UAT and implementation of system enhancements and data migration and conversions. Environment: Microsoft Visio, Windows XP, Facets, MS Office, Rational Requisite, Rational Rose ,HP Quality Center, TOAD SQL. Teradata SQL, SAS,Unix."}