{"text": "Name: ruth ruth E-Mail: ruth.ruth@gmail.com Address: Qujing, China Github: https://github.com/ruth LinkedIn: https://linkedin.com/ruth Phone No. 937871761765 \t\t Professional Summary: Having 7 years of IT experience in analysis, design, development, implementation, testing and documentation windows and web based applications.  Proficiency in Software Development Life Cycle (SDLC) and Agile methodologies of development process such as requirement analysis & definition, prototyping, proof of concept, designing, coding, testing and implementation.  Expert in Microsoft.Net Framework developing Web based applications, Web forms, Win forms, Web Services using C#.Net, VB.Net, ASP.Net, ADO.Net, IIS, HTML, XML, XSLT.  Creating web based application using technologies like, AJAX Toolkit, JavaScript, HTML5, CSS3, JQuery, JSON, AngularJS and Bootstrap.  Good experience in Win forms and Extensive hands on experience with Web Services. Involved in development of Data Access, Business and Application layer using C#.Net.  Experience in developing and implementing WCF, XML Web Services using SOAP and WSDL.  Hands on experience with Visual Studio and Team Foundation Server (TFS).  Developed Applications using VB.NET, C# with SQL Server, Oracle and Microsoft Access as databases using ADO.Net and LINQ Components.  Experience in C# 4.0, VB.NET 10.0, ASP.NET MVC, ASP.NET 4.5/4.0/3.5, WCF, LINQ, ADO.NET, Ajax, VB6.0, SQL Server R2, MySQL, Oracle 11g.  Good Experience on Selenium and creating Scripts in selenium.  Good knowledge in Android development.  Experience in designing and branding Master Pages utilizing Server Controls, User Controls, Data Grid control, Form Validation controls, Custom controls and CSS.  Experienced in handling queries using .Net 3.5 ADO.Net, LINQ components.  Proficient in T-SQL Queries, Views, Joins, Functions, SQL Stored Procedures, Database Triggers, Cursors, Performance Tuning and Query Optimization.  Used of XAML to describe WPF objects, controls and documents in WPF application.  Experience in working with Visual Source Safe (VSS), Visual Team System (VTS) and Concurrent Versions System (CVS). Expertise in DB2 and also extensively worked with Oracle 11g/10g/9i/8i, SQL Server 2008, MySQL, Oracle ADF relational database management systems. Working knowledge in XML based applications, XSL, XSLT, XML Schema, and XPATH. Worked extensively with ADO.NET objects such as Data Adapter, Dataset, and Data Reader to interact with databases like SQL Server.  Developed data object models like Language-Integrated Query (LINQ) and Entity Framework to retrieve and modify data.  Created efficient and interactive ASP.Net Web Form with Visual Studio and C# that works across all popular browsers.  Experience in deploying, configuring and maintaining the web sites and services on IIS.  Experience in securing web applications using ASP.NET authentication and authorization mechanisms in Single Sign-On.  Experience in Configuration Management, setting up company Version policies, build schedule using Team Foundation Server 2010 and Visual Source Safe (VSS), Perforce, Accurev.  Experience in database related work primarily creating complex stored procedure, DTS packages, Views, Triggers, Functions, using PL/SQL, T-SQL.  Very good experience with BI Tools such as SQL Server Reporting Services (SSRS) and SQL Server Integration Services (SSIS).  Expertise in following agile methodologies (SCRUM) and Test Driven Development (TDD).  Skilled at assessing project needs, problem solving, strategic thinking and excellent communication skills. Software Skills: Professional Experience:  CSAA Insurance Group, San Jose, CA                                                                                    June 2015 - Till date Sr.Net Developer   Description:  CSAA Insurance Group, AAA Insurer is a values-based company. Quite simply, AAA brand, with its reputation for trustworthiness, is AAA most valuable asset. As a member of our Policyholder Service & Support team you will be a vital part of a 100-year-old commitment to deliver peace of mind for AAA members. AAA Insurance Customer Service Associates receive incoming calls to assist AAA members with insurance policies, including payments and policy changes. AAA offer world-class service for auto, homeowners, renters and umbrella policies.  Responsibilities:  Developed UI using ASP.NET 4.5 with master pages, themes, profiles, CSS, web server controls and user controls.  Involved in Discussion Board for Client Interaction for the change requests and follow-ups.  Involved in developing of business logic used in Enterprise Library.  Worked in with the client team to design and implement the advanced technologies WCF, WPF, SOA, and ASP.NET with the application logic in C #according to the user requirements.  Created different web services/web methods to implement business rules.  Create automated test cases for the web application using Selenium. Used AJAX along with JavaScript for interactive and dynamic web interfaces for the applications.  Worked with different JQuery plug-ins and implemented client-side functionalities such as paging, table sorting/data tables and sliders.  Used Selenium Core for test framework for web applications written completely in JavaScript and DHTML. Involved in SDLC of an application developed using AGILE methodology.  Used IIS along the duration of the project and configured the websites.  Extensively used WPF user controls to provide page documents along with native support of XML paper specification documents. Worked on Selenium IDE Tool.  Worked on Database design and development using triggers, Stored Procedures, UDFs, views and indexes  Exploited enterprise web strategies to address issues involved in creating web content using ASP.NET web forms and server controls to display dynamic data obtained through the use of Microsoft ADO.NET and data binding.  Used TFS(Team Foundation Server) as a source control  Created User Controls and Custom Controls for common purpose in the whole application.  Created unit test classes using Visual Studio 2012.  \n Environment: Visual Studio 2012, ASP.NET, C# .NET, Framework 4.5, ADO.NET, WPF, Selenium, WEB SERVICES, JAVA SCRIPT, AJAX, JQUERY, SQL Server 2012, IIS, Windows 8   CIGNA Healthcare, Windsor, CT                                                                                            Feb 2014 – Apr 2015 .Net Developer  Description:  Cigna is a global health service company, dedicated to helping the people improve their health, well-being and sense of security. In my project, which consists of 10 applications, I supported 7 applications among which four are distributed standalone applications and the remaining three are web applications. These applications are used to maintain provider's data, direct deposit EFT information, Credentialing data of the providers, Network marketing and Business rules and National Provider Identifier (NPI) information. \n \nResponsibilities:  Involved in business meetings for all the requirements to give the estimates of the effort for the changes to be made.  Performed analysis in different stages of SDLC in order to support development.  Prepared Technical Design Specifications(TDS) for every requirement on the basis of the user stories given in functional specifications.  Extensively worked with Visual Basic(VB6) in four Distributed applications.  Understanding business logic description under close supervision of senior programmers and experienced software professionals.  Experience in using Selenium for automation testing by C#.  Learning development of proper VB code, VB scripts and use of ActiveX controls and objects while programming  Participated in updating the existing programs, and making changes in the existing systems.  Working with DLL and EXE files and understanding VB development in the .Net framework  Used Mainframe transactions to get data from the DB2 database using COBOL programs.  The backend resided on mainframe DB2 tables which interfaced with VB via DLL called CICSctrl, which uses Mainframe Transactions.  Utilized version control and synchronized code through SourceSafe.  Used Microsoft SQL server 2012 as a backend database for Distributed and Web applications.  Working knowledge in web applications having VB.net with DB2 backend and C#.net with SQL Backend.  Performed security testing of the application and web services involved, using Selenium Web Driver and SOAPUI. Involved in Development using WPF, CAB, Prism Framework, WF rule engine, Linq and sql server.  Worked with a view-only web application developed in Classic ASP and VB Script.  Deployed code to different environments whenever a change is made to any application, as a part of a release.  Extensively worked with the stored procedures in SQL Server 2012.  Team Foundation Server 2013 and 2015 are used as version control for the web applications.  Used IBM DB2 client for configuring Db2 database, Command editor and Query editor.  Involved in few migrations tasks i.e. migrating windows SQL servers from W2K3 to W2K12 and also migrating some of the web servers. \n  Environment: Visual Studio 2015, ASP.Net 4.5, C# 5.0, VB.net, VB6, Classic ASP, Selenium, VB Script, XML, WPF, JavaScript, and SQL Server 2012, IIS 7.5, Citrix, Web Services, TFS, Toolkit Control., TFS 2013/2015, DB2 PNC BANK, Pittsburgh, PA                                                                                                      Sep 2012 – Jan 2014 .Net Developer   Description:  Pittsburgh National Corporation (PNC) is top ten Financial Corporation in United States, business including mortgage, loan, credit, personal banking. PNC provides acquisition, development and permanent financing for commercial and multifamily real estate clients including a new term loan program and treasury management and capital markets services. Educational Loan Financial Management System is a web based comprehensive software package supporting Student Financial Aid Administration, Loans and Reports. The system is modular and organized to support all of the functions of the Financial Aid Office like need analysis, evaluation, packaging, notification, disbursement, funds management, tracking, verification and reporting. This application completely web enabled the process of loan applying to loan repayment of a customer. \n \nResponsibilities:  Developed application under .Net and Microsoft MVC 4.0 framework together with Entity Framework, creating controller and action methods.  Used 3 Tier Layer and developed the data layer class, using Entity Framework, which is reusable for data transactions of entire project.  Used Entity Framework Code First for database table creating, data access logic, querying and manipulation data.   Implement data grid/tables using Bootstrap, JQuery and Angular JS for front-end client facing of the Single Page Application (SPA).  Written Power shell scripts that are customized for a particular dataset  Designed and developed the databases in SQL Server 2012 and also involved in writing and maintaining SQL Queries, Stored Procedures using T-SQL, Triggers and Views, User defined function.  Used Ajax Controls in WebPages for quick response and to avoid full page post-back and make the application more users interactive.  Querying the databases using the Power shell scripts.  Performed both Manual and Automated testing (unit & functional testing) by writing and executing test cases and also prepared weekly status report.  Designed and developed cross-browser semantic website using HTML, CSS3.  Used Microsoft Team Foundation Server (TFS) for the purpose of version Control and source control code maintenance needs.  Worked on TFS for version control, Code Review and for automatic builds and continuous Integration.  Worked on views, common shared views for user interface using JQuery and JSON.  Designed and developed parameterized reports, linked reports, matrix and tabular reports with drill down, drill through and drop down menu option using SSRS.  Worked in AGILE Scrum environment regularly attending the Status Meetings and updating status to Scrum Master and involved in Code Review meetings, Implementing User Stories etc. \n  Environment:  .Net Framework 4.0, JSON, MVC 4.0, C#4.0, SQL Server 2012, Entity Framework, JSON, Power shell, AJAX, IEV 3.0, HTML5, CSS3, jQuery, Angular JS, JavaScript, Bootstrap, TFS. Great West Financial, Denver, CO                                                                                        Dec 2010 - Aug 2012                                                                               .Net Developer Description:  Great-West Financial is a leading provider of employer-sponsored retirement savings products and services for public, corporate and nonprofit employers, as well as private-label recordkeeping and administrative services for other providers of defined contribution plans. They also provide individual retirement accounts, individual life insurance and annuity products and executive benefits products. \n \n Responsibilities: Involved in requirements gathering, Problem Analysis, Design, Development, Testing and Maintenance of the System.  Worked on Agile Methodology to meet timelines with quality deliverables.  Designed and developed the application using MS Visual Studio 2010, ASP.Net 4.0, AJAX and                 C #advanced feature forms authentication.  Developed stored procedures using T-SQL and built the data access layer using ADO.NET. Experience programming and troubleshooting in C#, ASP.NET, VB.NET, VB6, Web Services.  Designed and developed master web pages using ASP.NET 4.0 web form controls, Custom user Controls and Ajax controls in C#.  Involved in manual testing, prepared Unit Test Cases and Unit test plan and performed Unit testing for the Developed functionalities.  Worked with jQuery to traverse through HTML elements, manipulate web page content, handle events, and working with AJAX using jQuery.  Utilized NUnit in ASP.Net MVC and Jasmine in AngularJS  for unit testing.  Used Entity Framework Database first approach to design Database schema.  Designed data access layer using SQL Server 2008 and the Entity Framework in the data tier with queries being written with LINQ to Entities.  Used Team city tool for continuous integration and build management.  Experience in using LINQ in Web pages to retrieve and modify data.  Worked on SQL Server Data Tools (SSDT) and Power shell Scripting. Experience in using JavaScript framework Angular JS.  Extensive working knowledge on Configuring and version controlling with Team Foundation Server (TFS), Visual Source safe (VSS).  Involved in unit and manual testing of the application.  Performed builds across different environments using Team City for continuous integration.  Used AngularJS HTTP methods to retrieve employee task data from entity models. Created new model classes in Web API to hold data.  Used HTML5 for developing the WebPages.  Created new SSIS packages for populating data into MS SQL database.  Used WCF to provide various Services like authentication, User Definition, Logging, Configuration and Data Access to the applications.  Have experience implementing Service Oriented Architecture (SOA) with XML Web Services using SOAP. Responsible to deploy code solutions and run Power Shell scripts.  Used VB.NET in MVC framework for front-end development  Used UML, Win Forms and C# to design and develop the code analyzer  Created Stored Procedures to perform automated rules, updating to related tables using SQL Server 2008.  Performed unit testing using NUnit testing framework.  SSRS is used as the reporting tool for the financial status and the Annual Status reporting. Environment:  .NET, VB.NET , C#, WCF, LINQ, VB6, Angular JS, ASP.NET , ADO.NET,  Responsible to deploy code solutions and run Power Shell , AngularJS, Visual Studio 2010, MVC, Web API , SOAP, SOA, Win Forms, HTML5, SQL Server 2008 , Windows Server 2008 R2/2008, Web Sphere MQ, TDD, TFS, VSS, LINQ, Refactoring, NUnit. Cog node, Houston, TX                                                                                                            Sep 2009 – Sep 2010                                                                                                                    .NET Developer Description: Cog node.com is an internet portal for maintaining the information of patients of each provider with their insurance information, sending the claims to the insurances in the form of EDI (Electronic data Interchange). Banners are displayed on page depending on Roles. Responsibilities: Analyzed business requirements and software specification documents. Implemented the project modules with Agile Methodology in a timely manner Created UML diagrams(Use Case, Class and Sequence Diagrams)  using Visio, as a part of Object Oriented Analysis and Design (OOAD). Created WCF services that imports data into the system for customers and products. Created classes and core modules in C#.NET for implementing business layer Implemented validations on the client side using the Validation Controls and JavaScript. Designed & developed interface using Win Forms, ASP.NET, Lotus Notes, ADO.Net, .Net and C#.Net. Converted existing web services to WCF services for Web application. Implemented State Management using Application, Session, and View State Variables. Grid View: Used Template Columns. Implemented Paging, Sorting and Caching concepts. Implemented business rules in WCF duplex communication. Incorporated the enhancements in the existing WINFORMS application(s) using C#. Configured Web Config file for the configuration of the entire Web Application. Developed ASP.NET pages to meet the business requirements and also involved in replace ASP pages with redesigned ASP.NET pages. Wrote the SQL statements using T-SQL executed and tested stored procedures on SQL Server. Developed Win Form application with significant business logic Designed and developed the system using MVC Pattern. Used Visual Source Safe and Team Foundation Server for application code repository and versioning. Implemented Unit Testing, Integration Testing, and Regression Testing and also tested using various test cases. Environment:\nNET Framework 3.5, MVC, C#.NET, ADO.NET, Win form, JavaScript, XML, WCF , Web Services."}