{"text": "Name: emma emma E-Mail: emma.emma@gmail.com Address: Houston, United States Github: https://github.com/emma LinkedIn: https://linkedin.com/emma Phone No. 821359607489 \t\t\t\t\t\t\t\t\t\t                                                                                                                                             SUMMARY Over 7+ years of IT experience in all phases of software development life cycle (SDLC) - Project Analysis, Requirements, Design, Development, Testing, and Deployment and Documentation. Extensive experience in .NET Framework 4.5/4.0/3.5/3.0 Web based application development using Microsoft.NET technologies including ASP.NET, C#, ADO.NET, WCF, WPF, Silver light, AJAX, ADO.NET, XML, COM, COM+, DCOM, VB, Java and VB scripts and ASP.  Experienced in a fast-paced Agile Development Environment including Extreme Programming, Test-Driven Development (TDD) and Scrum.  Knowledge of Risk management principles and practices. Understanding of current Risk management tools and techniques. Have expertise in technical design documentations using UML modeling, OOP analysis, design, and design patterns (Singleton, Abstract Factory and Observer, MVC) to standardize the application architecture. Solid command in Object Oriented concepts (OOPS) using C#. Developed Data Access Layer (DAL), Business Logic layer (BLL) also in implementing Business Processes, Abstract factory as part of Service Oriented Architecture (SOA) using C#. Development experience with JavaScript and C# for implementing client side/server side code in ASP.NET applications. Experience in Go Lang. Have done various projects in Go Lang. Experienced in developing REST web services and Go based Rest clients for consuming the rest services in  Go Language.   Experience in SharePoint Technologies, SharePoint Portal Server 2010/2013, Microsoft Office SharePoint Server (MOSS) 2007/2010/2013, SharePoint Designer 2010/2013, InfoPath Designer 2010/2013, WSS 3.0 and  .NET  Designed dynamic web applications and websites using DHTML, HTML Custom controls, CSS, XML/XSLT. Excel in achieving Service Oriented Architecture (SOA) goals with Windows Communication Foundation (WCF) and developing applications using Windows Presentation Foundation (WPF) technologies and XAML. Extensively used Entity Framework and ADO.NET to implement the data layer to communicate with different databases. Created Entity classes, relationships between entity classes using LINQ (Language Integrated Query) to SQL, LINQ to objects and LINQ to XML to manage relational data as objects. Hands on experience in using Web Server – IIS, Team Foundation Server, Visual SourceSafe, Data Transformation Services (DTS). Worked on designing the Database Schema, which represents an ownership context for a Microsoft SQL Server2012/2008R2/2008/2000 and Oracle10g/9i database object. Created complex Stored Procedures to extract data for generating reports by using SQL Server 2008/2005 Reporting Services (SSRS), Triggers, Indexes and Views for performance tuning and retrieval of data and BI. Expertise in implementing BI Packages like SSIS, SSRS to Perform automated Batch Processes. Implemented Reports using SQL Server Reporting Services, Crystal Reports by using stored procedures implemented in the SQL Server 2008/2005 and Oracle 9i/10g. Performed unit testing with VSTS and NUnit, use of a standard build process using NAnt, and implementation of configuration management. Used Web Content Management System (WCMS) for website authoring, collaboration, and administration tools which allows users to create website content TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE Client: Southwest Airlines, Dallas, Texas                                                                             July’ 2016 to Present                                                                                                                Role: Sr.Net Developer Responsibilities:  Involved in total development life cycle (SDLC) of the application including Analysis, Design, Development, Source code management, build management, and Testing of application. Participated in designing and developing different modules using .Net framework 4.5, ASP.NET, C#, ADO.NET, XML, XSD, SQL server 2012, and Visual Studio 2012. Done Multithreading using C#. Implement Agile & Scrum methodology in application development. Designed Web pages using ASP.NET including master page, custom control. Worked with HTML, CSS, AJAX, Bootstrap, AngularJS and jQuery to improve look and feel of the ASP.NET4.5 web page.  Involved in successful migration of C based architecture to GO (Go Language) worked in distributed systems and server sided software.  Developed Micro services to utilize Go Language, REST web services in the client's environment.  Class libraries containing code for business and data access logic coded using C#.NET. Designed databases and wrote Queries, Stored Procedures, Trigger in SQL 2012. Used ADO.NET framework such as Connection, Command, Data Adapter and Data Reader to consistent access and manipulate the SQL data sources. Used SSRS for SQL Server reporting and SSIS for SQL Server data migration. Created DAL (Data Access Layers) to establish database connectivity and data manipulation.  Implementation of client side Validate form inputs, customize selections, Confirmation using JavaScript, JQuery and Ajax. Used WCF Service Contract for validating the user input.  Coding for various Modules Error Handling using ASP.NET features such as Exception Handling, and Custom Error Messages. Used Team Foundation Server (TFS) for source control, integration, maintenance, data collection, reporting, project tracking and Security of code.  Performed unit testing using VSTS. Performed code review, worked close to team member to ensure consistence to code standards. Documented and coding Technical artifacts and developed test plans. Used WPF in creating different animated scenes using the combination of transforms, animation controls (storyboard, double animation) and color effects. Implemented WPF in creating custom controls. Led company through successful launch of Web redesign, coordinating all content and layout with Web design team. Ensured Web content accuracy and taxonomy through development and analysis of end-user feedback channels Environment: Net Framework 4.5, ASP.NET, C#, WCF, WPF, ADO.NET, SSRS, SSIS, AJAX, JavaScript, Go Language, T-SQL, HTML, JQuery , AngularJS , Elastic Search Internet Information Services (IIS) 8.0, SQL Server 2012, Visual Studio 2013 IDE, VSTS, and Team Foundation Server (TFS) 2013. Client: Citizens Bank, Providence, Rhode Island\t\t\t                        August’ 2015 – June’ 2016 Role: Sr.Net Developer\t Responsibilities: Designed and developed various abstract classes, interfaces, classes to construct the business logic using C# Developed the reusable framework for the application using the ASP.NET MVC Framework 3.0. Designed and developed Graphical user interfaces using Silver light XAML and C#. Extensively used Silver Light Data Grid, Items Control and many other controls with Paging and Sorting for displaying various data on to the page. Used JavaScript to perform validations and catch the events on client’s browser.   Involved in developing web Pages with rich UI, AJAX, JQuery using ASP.NET. Worked with Web Services, Caching features, configuring optimizations and securing the web application. Conducting detailed risk assessments by analyzing documents, statistics, reports and market trends. Developed module which deals with validating user, changing passwords and searching of information depending upon priority of user in site Using ASP.NET. Developed system services SOA application platform for use by all web applications utilizing WCF services and the ASP.NET provider model.  Used Data Contract as the standard mechanism in the WCF for serializing .NET object types into XML. Designed WCF Service Contract for validating the user input credit card type and its validation. Used WPF and WCF to communicate between DAL and other business components. Developed Web Services and invoking them by using XML SOAP and WSDL for creating proxy classes. Experience with Managed Metadata Service within SharePoint 2013 Extensively used technologies like AJAX for a rich UI experience. Effectively used JQuery a concise JavaScript Library for traversing HTML document, event handling and AJAX interactions. Extensively used Third Party tools like Dev Express for developing rich user interfaces.  Used LINQ to SQL, LINQ to Objects for retrieving the data efficiently and Just in Time manner. Implemented Data Access Layer using Entity Framework and LINQ. Extensively used Report Wizard, Report Builder and Report Manager for developing reports and deploying reports in SSRS. Created different chart reports helped in analyzing perform counters using SSRS 2005.  Implemented Unit Testing using VSTS and involved in Integration Testing and Regression Testing. Used Microsoft Team Foundation Server for version Control and source code maintenance needs. Increased associate sales close rate 20% by partnering with business stakeholders to write, organize and publish Intranet sales support content. Achieved 25% reduction in content input process by organizing company's first Subject Matter Expert (SME) network.  Environment: ASP.NET 4.0/3.0, C#, Visual Studio 2010/2008, ADO.NET, COM, COM+, IIS 7.0/6.0, WCF, WPF, Silverlight 4.0/3.0, LINQ, NUnit, .NET Framework 4.0/3.5, Java Script, SharePoint 07/10 Multithreading, Crystal Reports 10.0/9.0, MTFS, SQL 2008/2005, Windows Server 2003. Client: BCBS, Chattanooga, TN\t                                                                                         May’ 2014 - July’ 2015 Role: Sr.Net Developer\t Responsibilities:\t Interacting with client for requirements, discussing the feasibility of requirements, designing the layout of web pages, Architecture and participating in the development. Involved in designing, trading and documentation of application flows and developed functional diagrams using Visio, worked on presentation layer for developing GUI and developed various Web forms using ASP.Net.  Designed large numbers of Windows Presentation Foundation (WPF) Forms, Custom Controls and User Controls using XAML language for UI and Dynamic Web Parts for personalized content which allows Change, Edit, Move the content on pages as per users' own choice. Used WPF built-in set of data controls to bind and manipulate data within applications. Developed ASP.Net Custom controls and User Controls. Involved in Developing Master Pages using Style Sheet and for providing uniformity among the pages using ASP.NET (3.5). Worked on Service Oriented Architecture (SOA) for developing application. Worked with ASP.NET Web Forms, Web Services, and State Management, Caching features, configuring optimizations and securing the web application. Developed Web Services and invoking them by using XML SOAP and WSDL tool for creating proxy classes. Used Web Services (SOAP, WSDL) for communicating with other application and components. Worked on AJAX frame work for interactive web application and used Enterprise Application Library functions to enhance the application performance. Used Microsoft ADO.NET to access data from database in a web application. Extensively used the LINQ feature in .NET 3.5 for querying collections and integrating with SQL. Used SQL server 2008 for writing Stored Procedures, Views and Triggers. Developed web pages with data bound controls like Data Grid, Data List and Data Repeater using the methods Data Binding and Data Tem plating. Extensively used Report Wizard, Report Builder and Report Manager for developing reports and deploying reports in SSRS. Client and server side validations using JavaScript and Validation Controls and performing the tasks related Database issues.  Testing the application for performance issues and data integrity using NUnit. Experienced in Software Configuration Management, setting up company Version policies utilizing Team Foundation Server (TFS). Environment: ASP, ASP.Net, Visual Studio 2008/2005, ADO.Net, C#.Net, Microsoft IIS V.6, CSS, AJAX Controls, WCF, Web services, XML, XSLT, SOA, ASP.NET MVC 2.0, NUnit, SharePoint 2007 SQL Server 2005, SSRS. Client: Bed Bath & Beyond, NJ\t\t\t                                                              Oct' 2012 - Dec' 2013\t                    Role: Sr.Net Developer \t\t\t Responsibilities: Involved in requirement analysis, design and prototype development, effort estimation and team management. ADO.NET objects such as Data Set, Data View, Data Reader and Data Adapter are used in the Data Access layer to communicate with the database to access, update data in the database. Developed presentations layer using CSS, Master Pages & Themes to create user interfaces using web pages and controls. Developed UML use case diagrams and design patterns for easier code changes and for reusable solution.  Used C# for ASP.NET server side state management features such as application state, session state and profile properties. Responsible for applying JavaScript on Web Forms for client-side validation. Used AJAX extensively for creating User Controls and speed up web applications by providing partial page updates. Worked with SharePoint backup solutions using SQL Server and PL/SQL.  Used LINQ, LINQ to SQL and ADO.NET to interact with the databases. Configuration and Version Control by Microsoft Team Foundation Server (TFS). Provide strategic solutions to the business and technical teams to ensure ICOMS/PPS and PULSE operations run seamlessly.  Implemented a.NET Web services to upload millions of customer records to SQL Server 2005 database from Oracle 10g database.  Continuously implement new design (plans) and modify existing telecom VAS (Value Added Services). Performed User Acceptance testing (UAT) and System Integrated testing (SIT) to handle deployments in test and production stages. Handled production issues during the deployments and effectively managed client change requests Environment: C#. NET, ASP.NET,ADO .NET,TFS, SQLServer2005, JavaScript, AJAX, Visual Studio 2008, Windows XP, Oracle 10g, Team Foundation Server, Client: HDFC Bank, Mumbai, India\t\t\t                                                 Jun' 2010–Sep' 2012 Role: Jr .Net Developer Responsibilities: Responsible for gathering business requirements from business users and designed prototypes as per requirements. Used various ASP.NET web server controls that included Site Map Path, Menu, Tree View, Grid View to develop web forms. Created event driven Web Forms using ASP.NET and implemented form validation. Developed the Win Forms for UI controls. Designed User Interface with CSS, and HTML. Used Master pages to give a consistent layout to all pages.  JavaScript and AJAX was written for Client side validations and used new validation controls in VS 2005.  Used JQuery and bootstrap to make the User interface look richer and possess effective responsive  Created and deployed Web Services using C#, XML to login to the application. Developed Stored Procedures and Triggers in SQL Server 2005. Performed User Acceptance testing (UAT) and System Integrated testing (SIT) to handle deployments in test and production stages. Implemented version controlling using Microsoft Team Foundation Server. Experience in using the Enterprise library for writing data access and logging blocks. Environment: ASP.NET 2.0, C#. Net, ADO.NET, XML, Web services, HTML, JavaScript,JQuery,IIS 6.0, CSS, Ajax Toolkit, TFS, Visual Studio 2005, SQL Server 2005."}