{"text": "Name: margaret margaret E-Mail: margaret.margaret@gmail.com Address: Xingtai, China Github: https://github.com/margaret LinkedIn: https://linkedin.com/margaret Phone No. 25948852271 \n___________________________________________________________________________\nA proficient Business Analyst  with over 9+ years of Information Technology experience in the  Financial Services Industry, with in depth knowledge of the Software Development Life Cycle  ) in Support of MS SQL Server in Production, Test, Development and Replication & Cluster Server Environments\nProfessional Summary: Strong Fixed Income and Financial Derivatives exposure while working in top bulge bracket banks and financial firms. Highly experienced in financial instruments within investment banking and brokerage (Derivatives, Fixed Income, Hedge Funds, Capital Markets, Energy trading, FX, Futures, Options, Commodities, Debt, Equity and Structured Products, Mutual Funds, Swaps, Asset Backed Securities) and wealth management environments.  Well versed with Risk Management (BASEL - Credit, Market, Operational), Sarbanes Oxley (SOX); Portfolio Risk (Credit Risk; Market risk across all assets, Obligor Risk Rating, Facility Risk Rating, Statement Forecasting, Stress Testing, PD); Trading (Trade lifecycle, Straight through Processing and SWIFT) concepts. Working Experience with systems like TriOptima, Colline, GV Collat, Algo, RADAR, WINS, Remedy, DTCC, Market wire, ICE as well as trade booking systems like SUMMIT, CALYPSO, FINDUR, MUREX used by various Investment banks.  Multi-discipline experience spanning Project/Program Management, multiple areas in             Compliance and Risk domain, strong database and application development skills.  Strong Murex knowledge specializing in user access rights. Strong Business and implementation skills in building compliance models spanning Trade Surveillance, Fraud (Payments) and Client On-Boarding compliance platforms. Assisted in identifying BSA/AML/OFAC compliance risk and ensures that proper controls, procedures, processes and training are in place to mitigate these risks. Worked closely with project stakeholders, SME & staff to understand requirements and specifications for new applications along with re-engineering the existing application. Strong writing skills in preparing Business Requirement Documents (BRD), System Requirement Specifications (SRS), Software Requirement Specifications (SRS),Use Case Specifications, Functional Specifications (FSD),Requirement Traceability Matrix (RTM)  and Technical Design Document (TDD). Excellent understanding of Technical Project milestones, risk identification, risk mitigation, resource allocation, budgeting, QA and other dependencies on the project. Strong experience in MS SQL Server 2008/2005 with BI in SQL Server Integration services (SSIS), SQL Server Reporting services (SSRS) and SQL Server Analysis services (SSAS). Extensively involved in Backend testing of SQL Queries using Oracle & SQL Server  Adept in data modeling, creating star/snowflake schemas and fact/dimension tables in addition to designing E-R models, both logical and physical, using Erwin Data Modeler. Proficient in conducting User Acceptance Testing (UAT), verifying performance, reliability, and fault tolerance issues.  Extensive experience in writing SQL and PL/SQL scripts to validate the database systems and for backend database testing. Moderate to high proficiency in SQL Queries and MS Excel. Wrote complex SQL scripts in DB2 for testing data quality and validation.  Technical Skillset: MS Office (Excel, Word, PowerPoint, Project, Visio, Access, Publisher, FrontPage, Outlook, Communicator/Lync), MS SharePoint , Lotus Notes, VB 6.0, Mainframes, SWIFT, Rational Suite (Rose, RequisitePro, ClearQuest), Rally, SSIS, SQL Server, Toad, Oracle 9i/10g, Adobe CS3/CS2 (Photoshop, Illustrator, Acrobat, Dreamweaver), HP Quality Center 9.2, Atlassian JIRA v3.12, Serena, IRise, Mobius. PROFESSIONAL EXPERIENCE SSgA Financials, Boston, MA  \tBusiness Analyst\t May-2012-Sep-2014\nState Street Global Advisors (SSGA) is the division of State Street Corporation. The company services financial clients by creating and managing investment strategies for non-profit foundations. Worked on a trading application for Capital Markets and Asset Management. The system included Fixed Income, Equities, and Derivatives – Options, Futures and OTC market. The trading application was used to create client Accounts, Capture Trades, and Execute Trades for the clients by Portfolio Managers and Traders. Maintained records of client’s portfolio.  \nResponsibilities: Involved in requirement gathering, Business process analysis and meeting with various stakeholders. Coordinate with Project SMEs/Functional experts with stakeholders and Technical team. Led client facilitation meetings to gather Interface and Business Process Requirements from SME in trading shares, equities and fixed incomes like bonds, and converted them into functional requirements by implementing the RUP methodology, authored the same in Business Requirement Document (BRD). Analyzed and reviewed commission charges on fixed income assets, mutual funds and options. Played a leading role to coordinate with Technical team, SMEs, Stakeholders Leads as Project Manager. Heavily involved with different Senior Level Management/ SBU heads for project execution from ITSM perspective. Responsible for UAT coordination with large stakeholder teams with an approximate count of around 150 people for the same purpose. Involved in configuration and customization for implementation of Murex, understanding user requirements, reconciliation of reports, tables. Performed Fixed Income Analysis (Pricing, Risk, Yield, Duration and Recommended Strategy) in Excel to support trading, and reviewed with portfolio manager and traders. Worked closely with Fixed Income Managers to implement Eagle Pace hub and portfolio management system. Worked on their e-Banking Module. E-banking is primarily the process of enabling clients operate his/her account completely online (Without having reach for a branch). Gathered requirements for wire frames and prototypes for online banking screens. Addressed all aspects of online banking business. Conducted training sessions for Murex Order Management, Portfolio Management modules, Agile SDLC, Murex , M reports, creating user defined views. Involved in implementation of Eagle Pace system that would analyze Fixed Income portfolio as compared to benchmark. Performed Fixed Income Analysis (Pricing, Risk, Yield, Duration and Recommended Strategy) in Excel to support trading, and reviewed with portfolio manager and traders. Generated periodic reports based on the statistical analysis of the data using SQL Server Reporting Services (SSRS) & developed ad-hoc reports using SAS/SQL queries and MS Access and Excel.  Prepared change orders/change requests (CR), define goals/scope of project changes, project deliverables, necessary resources, timelines and prepare the project plan using Clarity PPM. Reviewed changes in CAB meetings. Responsible for creating the HLEs, DE’s, Implementation and backout plan, Impact Analysis document and other project documents (Clarity PPM). Coordination with Off-Shore Technical Team in regular basis as required from project perspective. Created the SQL scripts for demonstrating the prototypes and verifying the result sets Responsible for preparation of different UML diagrams and coordinate with project technical team. Closely worked with Project Manager for successful execution of the Project. Delivered subject-matter expertise for the IT Incident Management. Worked with different interfaces of the application (GSD) and the respective technical team as required from migration perspective. To understand the business requirements and coordinate with testing team for QA execution purpose on regular basis. Intuit Financial Services, Mountain View, CA      Business Analyst       May-2010-Apr-2012\n Intuit Financial Services has several Client applications including web portals and Applications namely BILL Pay, AUTH and DEBIT web application. Each application has a unique functionality to serve their clients and customers. Worked on Murex MX3 Implementation and Environment, Configuration and Release for all phases of the project and post go live. Responsibilities Managed the requirements and prepared the Project Charter, Business requirements document, Functional Specification Document, Gap Analysis, Use Cases, UML diagrams, Test Plans, Test Cases, Test Scripts, Gap Analysis, and QA Signoff Document. Managed RFI (Request for Information) and RFP (Request for Proposal), Vendor Selection and Vendor Management processes. Provided End of Day (EOD) monitoring support on Production for Murex. Facilitated Fixed Income projects and tasks included Process transfer, changing vendor feeds from multiple vendors to two, various pricing valuations, vendor coverage, price compare scope and aims. Led escalations point for multiple vendors and internal customers regarding troubleshooting any system related issues and user training for the Murex system. Created requirements for all user groups setup in the derivatives management system, Murex, while ensuring proper segregation of duties were in place. Assisted the Program Manager with getting updated status, risks and issue complied and ready for reports. Used Clarity PPM to update track and monitor risks, issues, action items. Gathered Mortgage and online suite requirements from business users and analyzed them. Defined criteria and develop requirements for RFI and RFP. Expert in facilitating Request for Information and Request for Proposal. Expert in MS Office Suite (Visio, Project, Outlook, SharePoint, PowerPoint, Excel, Access, Word and Note). Owned and maintained the project deliverables, finances, resource allocations, time management and status’ on CA Clarity. Review the PL/SQL codes from the point of data accuracy and performance before deploy those codes in production. Delivered the Business Logic, User Requirements to develop UML diagrams and Use Case Scenarios, Test plans Test cases. Backup users databases and perform database restore and run consistency checks from SQL Server and application. Created wire frames and prototypes for Front End User Interface. Worked with business functions to understand product maturity and contractual terms such as delivery, payment, and future obligations. Wrote SQL-script logic for database deployment on customer computers Performed Fixed Income Analysis (Pricing, Risk, Yield, and Recommended Strategy) in Excel to support trading and reviewed with portfolio manager and traders. Performed Gap Analysis to identify “As-Is” and “To-Be” Scenarios. Studied and analyzed competitor’s applications and brainstormed to gather effective requirements for a quality product. Identified and gathered requirements on a mortgage application and its online access. Implemented business modeling, data modeling, and object modeling using MS Visio to develop the business architecture for the application. Assisted QA Team in writing test cases, test plans and tested the final application for usability testing to verify whether all the user requirements were catered to by the application. Actively trained Business Users involved in User Acceptance Testing (UAT) and helped them understand UAT procedure Interviewed clients and defined functional and non-functional requirements and carefully recorded the requirements in a format that can be understood by both business and technical teams. Used UML/Object-oriented design to gather and document business and system requirements; prepared entity relationship diagrams, class diagrams, and activity diagrams to supplement written documentation State Street Bank, New York, NY  \tBusiness Analyst\t\tMay-2008-Mar-2010\t\t \nState Street Bank, The project aimed development of multiple applications starting from trade capture, OTC derivatives, compliance, risk management, and investment accounting. The end user will accurately assess the risk of potential credit losses, both on the counterparty and portfolios levels. In addition, web based application should be developed to reflect client responses related to trading decisions of their stocks. \nResponsibilities: Analyzed the Capital Market businesses to understand the architecture of the various processes and participated in a strategic decision making process about what applications needs to be decommissioned to reduce the cost. Interacted with the fixed income investment broker officers and understood their need in fixed income trading on behalf of the clients. Worked on brokerage application for trading risk management and processing, wrote BRD & FRD by gathering from SME’s using Murex Mx Asset Manager, to build up Interacted with Cash Management Division and Compliance Office to review the AML (Anti Money Laundering) requirements and provide Positive Pay service to reduce check fraud Responsible for gathering and analyzing Business and system functional requirements and for understanding and translating these needs into Business Requirement Specification (BRS) and System Requirement Specification (SRS) documents.  Worked on generating ad hoc reports, tables and graphs for presentations and data modeling using SAS Web Report Studio Created Use-Cases after accessing scope of the project and understanding the business processes Integrated RequisitePro with Rational Rose to provide all teams visibility and maintain traceability among requirements, use cases and change requests Worked on brokerage application for trading risk management and processing, wrote BRD & FRD by gathering from SME’s using Murex Mx Asset Manager, to build up Design and implementation of Performance Tuning and Maintenance plan for consistency checks, backup/restore.  Create and maintain SQL Server procedures, functions, views and triggers. Coordinating the process for users which analyzed their current business practices, user needs, and then used that information to define functional requirements and a RFI’s and Request for Proposal (RFP) for a new system. Prepared the UML Use Cases using Rational Rose.  Created use case scenarios and documents work flow and business process. Supported IT unit creating functional specification documents for the design, development and implementation of project. Conducted and lead JAD sessions to allow different stakeholders to communicate their perspectives, proposed solutions, shared concerns/disagreements, resolved outstanding issues and came to an agreement.  Prepared the Functional Specifications Documents for the Data Modelers and the ETL Teams.  Collaborated with analysts to decide the ETL methods and overall data flow architecture.   Interacted with the Users by interviewing them, preparing questionnaire and getting feedback.  Generated periodic reports based on the statistical analysis of the data using SQL Server Reporting Services (SSRS) & developed ad-hoc reports using SAS/SQL queries and MS Access and Excel.  Worked extensively with the end users team in understanding the business rules and writing requirement specs, technical specs and mapping documents from staging to data mart, cubes and reporting needs to the end user community which includes underwriting, claims, finance, technical accounting, reinsurance and actuarial departments.  Developed Use Case diagrams, business flow diagrams, Activity/State diagrams and Sequence diagrams using Rational rose to easily convey the projects process and requirements to developers and other stakeholders.  Created and executed complex SQL queries to the Oracle Database to validate and test data using TOAD. Build ad-hoc reports using SQL Server Reporting Services (SSRS), Excel. Responsible for vendor relationship management, requesting RFP's from multiple vendors, participating in the selection process and negotiating terms for purchase, including price negotiation and service levels. Met with Executive Finance Committee to justify costs on new / additional equipment Developed the test plan, test scenarios and test cases to be used in testing based on business requirements and loaded the test cases to the Quality center. Wrote test cases and test scripts for the User Acceptance Testing. Also, performed some parts of testing. Wrote Structured Query Language (SQL) statement against Claims, Claim Status and updating Personal Information modules by Joins, Unions and Aggregate Functions  National City Corp., Cleveland, OH      Business Analyst     Mar-2006-Apr-2008 Project Description: The new Online Banking System was aimed at enhancing the business processes as per the changing business environment.  In this online banking system, customers can access their savings account, checking account and credit card account through the Internet.  Customer has the option to transfer funds between different accounts, check their transaction details, schedule payments, pay bills and apply for credit cards.  Responsibilities: Understood and articulate business requirements from user interviews and then converted requirements into functional specifications. Elicited and gathered user and business requirements through open ended discussions, brainstorming and prototyping.  Created detail process flow documentation based on the input from system users and understood the system architecture. Assisted the Project Manager in managing project resources and project timeline using MS Project and Excel. Designed the Functional Specification Document (FSD) based on the project scope and SDLC methodology. Facilitate issue resolution of defects uncovered through testing. Participated in ad hoc testing of system interfaces with Program Participants.  The successful deployment of CA Clarity PPM with a cross functional team that worked with a sense of urgency, reduced the customer fulfillment process by 15% and delivered a solution ahead of plan. Utilized Rational Unified Process (RUP) to configure and develop process, standards and procedures. Conducted JAD sessions for communicating with the all Project directors and stakeholders and created Process Workflows. Worked closely with the Project Manager in handling the scope creep and analyzing its effects. Monitored version control and defect tracking activities using Rational Clear Case and Rational Clear Quest. Facilitated User Acceptance testing (UAT) for the application as a Business User. Conducted training sessions for the Customer Representative Team. \n"}