{"text": "Name: stella stella E-Mail: stella.stella@gmail.com Address: Yongzhou, China Github: https://github.com/stella LinkedIn: https://linkedin.com/stella Phone No. 134785983357 SUMMARY: Over 7 years of JAVA/J2EE and CMS Application Development experience in client/server  and web based n-tier architecture systems. Hands on experience in development of content management solutions using Adobe CQ5 / AEM WCM tool.  Hands on Experience of Adobe CQ 5.6/AEM6.X, JCR, SLING, OSGi, Templates, Components, Dialogs. Expertise in developing integrated business applications using Hibernate, Spring framework (Spring Core Framework, AOP, Spring Integration, Spring Batch, Spring MVC, Spring Web flow and Spring Security), Struts, JSF Framework and Web Services (JAX-WS, JAX-RPC, JAXP, JAXB). Proficient-in-using HTML5, DHTML, XHTML, CSS3, JavaScript, DOM, jQuery, and Ajax that follows with Web Content Accessibility Guidelines (WCAG) and ability to apply W3C web standards and are browser compatible. Expertise in building strong websites confirming Web 2.0 standards using jQuery, HTML, XHTML, DHTML & CSS to develop valid code and table-free sites. Experience in Software Development Life-Cycle (SDLC) preparing Requirement Specification documents, design documents, Test cases and Analysis, User Training documents and Technical Help documents. Expertise in XML processing with SAX, DOM, JDom and dom4j technologies. Good experience on JMS, MDB and Message Oriented Middle Server IBM MQ Series. Good Exposure to testing tools like Junit. Experience in working with source control and versioning tools like Clearcase, GIT and CVS. Expert in HTML5/CSS3 development and have experience in Backbone.js, Require.js, Node.js Expert in designing web applications and web contents utilizing various Search Engine Optimization (SEO) techniques. Worked on Agile PLMmethodology. Good Experience working on TOAD, PL/SQL Development for database access. Experience with Service Oriented Architectures(SOA). TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE: Client: Union Bank, San Francisco, California\tOct 2015 – Till Date Role: CQ5/AEM Developer Responsibilities:  Involved in design and development using Java, J2EE, Web 2.0 technologies Involved in design and development of reusable components. Worked extensively on Version One for requirements/story tracking. Providing CQ5.5 consulting services for integrating all web application, database Used OSGi to deploy dynamic libraries Developed Servlets to handle requests from the client in an OSGi bundle Content authoring and maintenance for test environments Testing of components and templates; Cross-browser/MacOS/Windows Developing templates/components using CRXDE Implemented templates to be used by various pages such as product, department and device pages  Implemented server side service components using Apache Felix framework and apache sling Implemented components to utilize services through sling service calls and JSP tags Implemented client libraries useful at page, global and component level using CSS and JavaScript files Performed administration tasks to activate, replicate and package the changes to publish as well to be consumed by other environments  Environment: J2EE, Spring, Adobe CQ 5.6/ AEM6.x, CRXDE, Servlets, jQuery, Hibernate, JMS, JSTL, Maven, Log4J, Eclipse, SVN, JIRA, JBoss Client: Verizon, Atlanta, Georgia\t\t\t\tDec 2014 - Sept 2015 Role: CQ5/AEM Developer Responsibilities:  Designed and developed, CQ5 building blocks including templates, components, dialogs, widgets, workflows. Developed more than 2 applications that uses JCR content repository in CQ to store information and query the JCR for display and reporting purposes.  Developed custom components, customized forms for Internet and Intranet sites of the company.  Proficient in Adobe CQ foundational concepts, including the CRX repository, the CQ platform, the use of core frameworks such as Apache Sling and Apache Felix.  Development of static web pages, landing pages, category landing pages using content management system, Adobe CQ5. Designing and developed the static and dynamic forms through Adobe Live Cycle designer products. Maintaining OSGI java classes for assets import, validation processes, and to fetch the data from CQ repository obtained from different providers. Provide estimates, designs, and specifications for CQ5 templates, components, and workflows. Built various web pages using HTML, CSS, Java Script and JQuery.  Solid understanding of all Adobe CQ building blocks and the CQ development and deployment process.  Experienced on creating dialogs for both Touch/Classic in AEM 6.0/6.1 Worked on CQ5 Forms customization by developing the custom form fields, writing the custom constraints for form fields and specifying the global validation resource type at the form level. Offer solutions on top of the Adobe WCM, CRX/CRXDE, CQ WCM, DAM. Environment: JDk1.6, J2EE, Adobe CQ 5.5 CRXDE, JCR 2.0, Sling, JSP, CSS, HTML 5.0, Servlets, Ajax, Global Search, JQuery, ExtJS, Maven Client: Ford Motor, Detroit, Michigan\t\t\t\tNov 2013 - Nov 2014 Role: CMS Developer (Java, J2EE, Adobe CQ) Responsibilities: Design and implement components for the Adobe CQ platform Diagnose and solve technical problems related to content management implementation. Access control put in place for content, components and workflow stages. Design, develop and support WCM components, integrations and applications Developed components that include fetching the content dynamically based on tags Implemented templates to be used by various pages such as product, department and device pages        Implemented server side service components using Apache Felix framework and apache sling Implemented components to utilize services through sling service calls and Jsp tags Implemented client libraries useful at page and component level using CSS and JavaScript files Performed administration tasks to activate, replicate and package the changes to publish as well to be consumed by other environments  OSGi has been used to deploy dynamic libraries Implemented Sling servlets to provide Ajax handling Exported/imported packages to deploy on test servers Developed Servlets to handle requests from the client in an OSGi bundle Content authoring and maintenance for test environments Environment: Java 1.5, J2EE (JSP, Servlets), Java, Servlets, JSP, XML, Java Beans, spring, CRX, JavaScript, JQuery, web services, Adobe CQ5.5, CRXDE, JCR 2.0, OSGi (Apache Felix), REST, CVS, Apache Sling and Windows 7 Client: Citi Bank, Irving, TexasJan 2012 - Oct 2013 Role: CMSDeveloper Responsibilities:  Proficient in Adobe CQ foundational concepts, including the CRX repository, the CQ platform, the use of core frameworks such as Apache Sling and Apache Felix. Setup and configure Authoring and Publishing environments, replication agents, CQ5 dispatcher to cache the landing pageshtml and serve as the static pages from Apache Developed UI using JSP, JSTL, Custom Tag and Spring tag libraries. Used Java Script, jQuery for Client-side scripting. Implemented AJAX for asynchronous backend calls. Used Spring IOC to achieve dependency injection. Implemented Struts framework for building the application with Model View Controller design pattern. Used Factory, Singleton design patterns in implementing the application. Used JDOM and XSLT for parsing the XML documents that are retrieved upon consuming the Web services. Used XML Schemas (XSD) for defining XML elements and attributes. Experience in MS SQL Server database queries, procedures, and functions. Used Maven for building the application. Environment: Java, Java, EJB, Swing, JSP, IBM MQ, Servlets, JDBC, Applets, Servlets, EJB, XML/XSL, Visual C++, SAX, Log4J, ClearCase. Client: Quad One Technologies Pvt. LtdJun 2010- Dec 2011 Role: Web/UI Developer Responsibilities:  Assisted in designing, creating and developing web portals.  Created graphics including Icons, Images and logos using Adobe Flash Catalyst.  Created appropriate concept models, site organization prototypes, navigation, page layouts and interaction.  Developed HTML prototype documents with CSS Style Sheets.  Designed dynamic client-side JavaScript codes to build web forms and simulate process for web application, page navigation and form validation using jQuery and JavaScript.  Worked closely with the programmers for project requirement analysis.  Created new static model pages with cross browser compatibility features.  Created and implemented SQL Queries, Stored procedures, Functions, Packages and Triggers in SQL Server.  Created required Views, Indexes and Clusters.  Designed report previews for PDF and Excel using SQL Stored Procedure.  Created triggers for calendar based database events.  Created packages to do complex aggregations on large volume of data and loaded the aggregated data into reporting tables in data marts.  Wrote UNIX shell scripts to automate the batch process.  Environment: HTML, DHTML, XHTML, DOM, CSS, JavaScript, jQuery, JSON, AJAX, Adobe Flash, Dreamweaver, PL/SQL and Oracle. Client: Pitti Laminations Ltd, India                                              Jan 2009 - May 2010 Role: Web Developer Responsibilities:  Involved in gathering the requirements from users to develop the application from the scratch. Involved in working with analysts for gather more information on data flow designs that required for the project to develop. Highly skilled in creating database objects like tables, views, procedures using Oracle tools like PL/SQL, SQL*Plus. Developed Basic APEX applications to generate reports for easy management. Developed Stored Procedures to maintain details of the vendors and maintained them in Packages. Designed database tables using various Normalization techniques and database rules. Developed reports as per the requirements collected from the users using Discoverer and Oracle Reports 10g. Good Experience working on TOAD, PL/SQL Development for database access. Generated and maintain Keys, Constraints and Relationships between the tables for OLTP & OLAP instances. Developed complex SQL queries to perform the back end testing of the Oracle database using SQL and UNIX shell commands. Created Shell Scripts for automating the execution process. Involve in migrating applications to the new release versions Environment: Oracle 10g, Oracle Forms10g, Oracle Reports10g, Discoverer, PL/SQL TOAD, UNIX."}