{"text": "Name: helen helen E-Mail: helen.helen@gmail.com Address: Dallas, United States Github: https://github.com/helen LinkedIn: https://linkedin.com/helen Phone No. 240017339553 Professional Summary: 5 + years of expertise in design, development, and deployment of Android application. Extensive programming experience in Android SDK based application development. Strong knowledge of Android Activity/Service lifecycle. Good Experience in creating and sending HTTP GET and HTTP POST requests and parsing the response in different formats. Working Experience in Scrums and Sprints for Day-to-Day activities. Proficient with common Android framework APIs (Location, Camera, Notifications, Map API). Capable of adapting to whatever technology is required for an effective job execution. Expertise knowledge and working experience in Android SDK, Eclipse IDE, JavaScript, HTML, CSS, AJAX, Android Studio, Application Stack and Android Architecture. Experience working under Agile Methodologies. Professional understanding of Software development life cycle (SDLC). Always curious to learn new skills and technologies. Highly capable in handling multiple tasks, prioritizing, and meeting deadlines. Good interpersonal and communication skills, self-motivated achiever. Applications published in the Google Play Store. Technical Skills: Certification  Certified Scrum Master (CSM) (International Scrum Institute)\t Professional Experience: Shreeji Enterprise Inc. Powhatan, VA       \t    December 2015 – Till Date Android Developer   It is for doctors and patients where they can communicate via chat and schedule their appointment. You can also able to keep history of diagnosis. You can ask a FREE question about any health or fitness query and get multiple helpful answers from the best doctors within a few minutes. You can also find doctors across all major specialties and can either consult them online instantly or book an appointment to visit the clinic at your preferred time! Responsibilities: Communication with client to understand the requirements for development. Developed the application to adapt to various orientation support and resolutions based on the device. Used web views, list views& populated lists to display the lists from database using Simple adapters.  Responsible for development of all Application components (such as Activities, Broadcast Receivers, Services, Content Providers) and UI resources.  Performed testing on different physical devices like android phones and tablets of various size and various android versions also performed testing on AVD emulator.  Integrated Google Map’s API for users to find nearby Health Care Services. Worked location-based and motion-based applications.  Developed the SQLite database to store data. Coach and coordinate team to implement Agile development environment such as Scrum Methodology. Work for managing PDF and Music files into database as well as in User’s Device. Responsible for executing the code, deploy application and fix the bugs. Experience with Client Server interaction with REST and communicated with SOAP, JSON and XML response and their parsing Environment: Java, Android SDK4, SVN, SQLite, RESTFul, XML Parsing, Json Parsing. Dish Network Corp, CO\t\t\tJune 2014 – November 2015 Android Developer   Worked on DISH Anywhere app for Dish Network LLC. With this app, you can watch every TV channel you get at home on your Android device. Enjoy your favourite live or recorded programs anytime, anywhere. Also, manage your home television with full- featured DVR manager and a searchable program guide.. Responsibilities: Designed screens related to Categories and Detail description for Tablet for both 7 inch and 10 inch devices by customizing views as per mockup.  Worked in all phases of the project including design, development, testing and deployment. Updated backend validations to meet tablet specific requirements.  Worked with the UI team to design the appropriate icon and display for the screens.  Used application components such as Activities, Services, Content Providers and Broadcast Receivers along with their life-cycles to define the applications overall behavior Provided subsequent releases which included feature changes, enhancements and bug fixes.  Work closely with the web application development team to ensure proper integration between mobile application and web application.   Constructing http requests, fetching server response and parsing feeds wherever required.  Analysis of mobile application code for re-engineering. Environment: Android SDK, Java, REST API (XML), SQLite, PHP, MySQL, HTML5, JQuery, CSS & Eclipse IDE. Link: https://play.google.com/store/apps/details?id=com.sm.SlingGuide.Dish&hl=en Enterprise Rent a Car Clayton, MO\t\t\tApril 2012 – May 2014 Android Developer   Enterprise Car Share is a membership-based car-sharing program that allows you to rent a vehicle when you need it - by the hour, day or overnight. In order to use the app, you will need to be an Enterprise Car Share member. With this app you can use your current location to find Enterprise Car Share vehicles in your area, create, modify, and cancel reservations, vie upcoming and current reservations, extend your reservation while on rent, and submit a fuel receipt.  Responsibilities: Participated in complete Software Development Life Cycle (SDLC) for proper analysis, development, testing, deployment and enhancement of the code.  Played a key role in writing application logic using Eclipse IDE and Android SDK.  Implemented the required GUI by making modifications to the XML files. Designed complex User Interface screens using custom views.  Responsible for consuming the REST services, getting JSON response and parsing them using to get the required information.  Integrated location based services using Google Maps API to display locations of the nearest stores. \nEnabled GPS/Wi-Fi to detect user location from where to begin searching.  Implemented SQLite databases to monitor the data of a member.  Followed Agile with SCRUM for implementing this project.  Handling XML data using efficient parsing techniques such as DOM parser.  Tested the app across different versions of Android and different Android phones to assure quality and performance.  Environment:Android  SDK 2.2(API 8), SQLite 3.6, Eclipse IDE 3.5, Android API’s, ADT plug-in, JDK 1.6, XML, JSON,REST services HTML, GPS service Link: https://play.google.com/store/apps/details?id=com.ehi.csma  .Net Experts Solutions (India)\t\t\tJanuary 2011 – February 2012  Software Developer Help Desk System is web based application like Customer Support System which is help ful for the Customer forgetting quick solutions for their different types of category query through online communication with the Technicians and all the procedure are managed by the Administrator. Responsibilities: Analyze client requirements and translate them into Technical Requirements. Involved in writing various DB Objects like User defined functions, Instead of triggers, Usage of Indexes. Created SSIS Packages from various heterogeneous source systems like Oracle, SQL Server, Flat Files and Excel Spreadsheets into the destination databases for Dashboard Reporting on a daily basis. Created databases and schema objects including tables, indexes, views and applied constraints. Developed quality control activities such as integration testing and code reviews. Created function specifications coded comments and other Technical documentation. Implemented Mail System within the system. Created Chat based Application. Provide Google map Service in the system. Environment: .NET 4.5, C#, MS SQL 2012,  XML, HTML, CSS, ASP .NET MVC, WEB API, , IIS 8, Agile, Ajax Tool Kit 3.5,Rich Text Box(Third Party Control). Education Bachelor of Computer Applications Master of Science in - software Technologies"}