{"text": "Name: anna anna E-Mail: anna.anna@gmail.com Address: Giza, Egypt Github: https://github.com/anna LinkedIn: https://linkedin.com/anna Phone No. 577303892575 SUMMARY Over 7+ years of Experienced  Business Analyst and functional design, coordination, testing, reporting, acceptance, and Agile Scrum methodology.Integrated EDI and XML applications and Enterprise Application Integration (EAI) the Qlikview /Tableau dashboards with relational and multi-dimensional databases including Extensive knowledge of Object Oriented Analysis and Design (OOAD) using UML and Rational Unified Process (RUP).   Thorough Knowledge of implementing RUP in all the phases Inception, Elaboration, Construction and Transition of a project.  Worked on Scrum Methodology as well as on SDLC procedures in the implementation of Tableau Proficient in identifying, documenting and analyzing business requirements specifications (BRS), System Design Specifications (SDS) and Software Requirement Specification (SRS).  Experience in developing collaboration applications and integrated portal solutions using SharePoint products and technologies. Strong understanding of various SDLC methodologies such as RUP, Waterfall and Agile with hands on experience in all of them Strong Knowledge on claim processing  and EDI transactions i.e. Claims Inquiry and Response (276/277), Receipt and Verification of claim forms(837), Claim Payment and advice(835), Eligibility Inquiry and Response(270/271), Certification Request and Response(278), Benefit Enrollment(834), Order and Payment Remittance(820), Functional Acknowledgement(997/999). Work collaboratively across geography with business stakeholders and cross-functional team to deliver projects as per Scrum’s Rules, Roles, Artifacts and Events.  Created companion guides for EDI transactions for both 4010 and 5010 versions and also created crosswalks and also experience in using EDIFECS Specbuilder. Experienced in documenting requirement using Unified Modeling Language (Use Case and Activity Diagrams). Also building business Process Flow, Context Diagrams, Sequence Diagram, Activity Diagrams, Class Diagrams using Rational tools and Microsoft Visio Knowledge in the ETL (Extract, Transform and Load) of data into a data ware house/date mart and Business Intelligence (BI) tools like Business Objects Modules (Reporter, Supervisor, Designer, and Web Intelligence). Proficient in BI Reporting Tools like SSRS & Qlikview Used Tableau Desktop for blending databases and creating different interactive views and dashboards. Extensive exposure in business and systems analysis roles identifying problems and/or opportunities and defining solutions through direct involvement in all facets of the software development project lifecycle and thorough experience in client interaction Proficient in creating UML diagrams including Use Case Diagrams, Behavioral Diagrams (Sequence Diagrams, Collaboration Diagrams, Activity Diagrams and State Chart Diagrams), Class Diagrams and Data Flow Diagrams (DFD). Detail oriented and strong project management skills coupled with excellent knowledge of SDLC, Agile Processes and SCRUM. TECHNICAL SKILLS Business Skills: Business Process Analysis & Design, Gap Analysis, Impact Analysis, JAD/JRP Sessions Requirement Gathering, and Use Case Modeling, Qlikview, Tableau Scrum Master / Agile Project Manager, UML, Visio, RUP, Waterfall Languages: C, C++, SQL, PL/SQL, HTML and XML Management Tools: Clear Quest, Clear Case, MS Visio, Rational Rose, and Requisite Pro Testing Tools: HP Quality Center, Win Runner , Clear Quest Rally, SSIS Database: DB2, MS SQL Server, My SQL, MS-Access, ETL & Data Warehousing Operating Systems: Windows Vista, Windows 95/2000/XP/7, and MS-DOS Microsoft tools: MS Office Suite (Word, Excel, Power Point, Outlook), MS SharePoint, MS Visio, MS Project, and MS FrontPage PROFESSIONAL PROFILE Tenet Healthcare Corp of Business Analyst. I was employed   for the enhancement on the Wire Watch reports and UI as rules and. Used qlikview BI tool for Business Analysis.Tableau Database Migration from sources  Responsibilities:  Provide AGILE project management controls, project plans, timeline schedules, facilitate RAD sessions, and review software defects. Responsible for providing business requirements within an AGILE software development SCRUM environment.  Involved in implementation of Business Intelligence Applications using Cogon’s and Business Objects, building Data Marts and enterprise wide Data Warehousing. Coached teams in their efforts to adopt advanced methods for the effective application of the Scrum framework. Contributing to software process-reengineering efforts aimed at evolving current software development practices to adopt Lean/Agile  As Agile Scrum coordinated Sprints, from Iteration Planning thru daily scrum, and Iteration Reviews and Retrospectives.. Responsible of the UAT process and global users support for the Multifactor Authentication application. Conducted interviews, JAD sessions with the Business & Corporate team, Predictive analytics team to understand the reporting and integration functionalities of SAS (Predictive Modeling) , Tableau (Data Modeling, Qlikview Visualization and BI) and created the FRD.  Worked on EDI transactions, HIPAA standard transaction codes including EDI 837, 835, 834, 277CA and performed analysis and testing of such transactions. Developed Test Plans, Test Cases, Test Scripts, Test Scenarios, Test Beds and Traceability Matrix. Worked with OLAP tools such as ETL, Data warehousing and Modeling. Created X12 Test files using Ultra Edit and checked for HIPAA Compliance using Edifices for all transactions. Work with business representatives to understand data marts requirements, data models, data flows, Facets on-line, priorities and ensure that IT works is appropriately aligned. Involved in processing claims in FACETS and validating the full cycle process to make sure the checks are generated and 835’s are generated. Created data files for EDI 835,837,270 and 271 transactions using ICD9 codes Used BI tool Tableau to visually analyze data and create reports. Also, assisted in creating concise and actionable dashboards that are not only analytical tools, but were also be intuitive to use and visually appealing. Wide-ranging experience in using methodologies such as UML (Unified Modeling Language), Agile, RUP (Rational Unified Process) & Waterfall using rational tools and Microsoft Suite. Transfer projects from Waterfall to Scrum are major responsibility. Built and designed business intelligence / data visualization dashboards in QlikView Coordinated project activities across multiple & geographically dispersed functional teams to ensure accurate data modeling, construction & validation of the data warehousing solution & report remediation to support organizations BI and analytical needs Involved in troubleshooting and performance tuning of reports and resolving issues within Tableau Server and Reports Experience with data migration (ETL development), document data manipulation processes and scripts. \nEnvironment: HIPAA, NCPDP  FACETS ,UML, EDI ,Agile Scrum, Rally, Tableau ,Qlikview Visualization ,ETL Testing Rational Requisite Pro, Rational Clear Quest, MS Office, Toad, Data warehousing, HTML, Business Objects, Business Intelligence, Report Mercy Health Systems, CA. Business Analyst. Using Qlikview /Tableau Desktop created Interactive reporting dashboards by combining multiple views. Company deployed a new intranet site based, ETL Processes Data Warehouse Testing  Responsibilities Executed project using waterfall model and practiced Agile Project Management & performed the Scrum role for specific projects/requirements as appropriate. Used Rally for Agile project management Helped department to improve online database of records, administration, analytics and payment systems across the boundaries of multiple institutions.   Facilitating Scrum Events (Daily scrum meetings, spring planning, spring review, and spring retrospective).  Worked with providers and Medicare or Medicaid entities to validate EDI transaction sets or Internet portals.  This includes HIPAA 4010; 837, 835, 270/271, and others.  Provided healthcare provider problem resolution.  Work as a medical coding SME, including ICD-9, HCPCS  Procedures and diagnosis testing Facilitated Requirements gathering sessions with QA and Dev to efficiently design the system to create the reports using reporting tools – Qlikview/Tableau Created EDI Export and Import processes and work with EDI Trading Partners, Payers or Vendors.  Perform a range of telecommunications processes, including FTP, Dial-up, TCP/IP, Web transfers Expertise in broad range of technologies, including business process tools such as Microsoft Project, Primavera, MS Access, MS Visio, technical assessment tools, Data Warehousing concepts and web design and development. Developed detailed test plans and test methodologies based on technical specifications and product design requirements provided by business units for mobile products Include claims and enrollment testing as well as NPI and medical coding and ICD-9 EDI testing. Experience in developing, implementing and testing EDI ANSI X12, XML/XSLT applications. Manipulated data in X12 files using EDIFECS Specbuilder to add valid qualifiers and also check for HIPAA edits. Utilize data-driven and compartmentalized test automation practices using Mercury Interactive Test Suite and Compuware Products. Tested the ETL Informatics mappings and other ETL Processes (Data Warehouse Testing) Gathered and prepared data from various sources for QlikView, Tableau reporting tool to create the dashboard Created ensuing use cases, report requirements/templates, scope documents, issue tracking and project plans in an Agile environment Developed SQL scripts and wrote stored procedures to validate the flow of data from Legacy source to target application database and ability to perform data validation (of ETL processes, schema and DDL check, data flow from data warehouse to application databases, data marts, return marts, referential data, repositories). Taking daily SCRUM and progress meetings with all the teams and update the MS- Projects. Excellent knowledge on Data warehousing concepts - Star schema, Snow-flake Schema and worked on both OLAP and OLTP databases.  Elped senior management team to view and customize their dashboard and daily progress reports using BI tool Qlikview. Publish the developed dashboard on the Tableau Server so that the end users having access to the server can view the data. Completed several HIPAA 4010 and 5010 Projects, included Medicaid and Commercial entities.  Projects include claims and enrollment testing as well as NPI and medical coding and ICD-9 EDI testing Used Agile’s scrum framework, for managing the software application development project. Environment:, Waterfall, Qlikview ,Tableau ,Agile (Scrum)framework J2EE, MS Visio, Microsoft Project, GUI, Excel, SOA, Word, HP Quality Center. IBM Mainframe, ETL The project was to make enhancements to the existing Business Analyst to store the patent information, drug details, research and development and sales information. The basic objective of this project was to migrate to a new system that offers the opportunity to clean up the system-remove redundancy, separate or combine repositories, update object models, taxonomy and security, and review data anomalies. The project followed Agile Scrum methodology. Responsibilities Actively developed the project with agile methodology using Scrum and Extreme Programming.  Created and managed Product and Sprint backlog.  Provided AGILE project management controls, project plans, timeline schedules, facilitated RAD sessions, and reviewed software defects Responsible for providing business requirements within an AGILE software development SCRUM environment.  Designed use cases and sequence diagrams using Rational Rose. Involved in gathering requirements and translated the business details into the functional specification documents that described the different types of processes. Provided coaching on Agile values and practice to other teams within the company. Created business process, and activity diagrams using Visio. As well as leading client JAD sessions to ensure validation and usability with the new technological platforms. Obtained detailed understanding of data sources, Flat files and various schemas and modeling. Extensively worked with Facts and Dimension tables - architecture to produce source to target mappings based upon business specs. Assisted JAD sessions to identify the business flows and determine whether any current or proposed systems are impacted by the EDI X12 Transaction, Code set and Identifier aspects of HIPAA.  Conducted working sessions to gather and document high level business requirements and detailed level business requirements for different business units impacted by ICD 10 such as EDI Claims Intake, FACETS- Claims Adjudication, Medical Management- Utilization Management, Case management and Provider Reimbursement- Provider Payment. Developed test plans, test scripts and use cases for testing of workflow automation tool in conjunction with business users and IT development staff. Reviewed necessary technical specifications, requirements and work breakdown structure documents using Visio. Prepare Functional requirement specification documents which includes flow charts, formulas, definitions, sample tables with real data, well designed color Graphs including drilldown views and mockup screens. Used EDI and ETL with Sybase and DB2 to manipulate data in 2 data warehouses on both Unix and Linux boxes Strictly followed the change control methodologies while deploying the code from development, Quality Assurance and Production. Analyzed business requirements and segregated them into high level and low level Use Cases, Activity and State diagrams using MS Visio, suggested and managed improvements in the process. Coordinated Sprints, from Iteration Planning through daily Scrum, and Iteration Reviews and Retrospectives. Environment: HTML, Rational Software  Agile, UML, MS Visio, MS Project, Windows , MS Office, Oracle, SQL, Erwin, Quality center. HCA Inc, Nashville, TN provides customers with employee benefits and services that improve the health, well-being and productivity of their employees, Responsible for the project management activities of a web application including Responsibilities Aided management in standardizing Web applications by preparing GUI standards and recommending alternatives for incorporation in phased, iterative manner. Produced functional specifications and led weekly meetings with developers and business units to discuss outstanding technical issues and deadlines that had to be met. Creating the as is and to be business process model to redesign to eliminate manual operations. Structured the Database and Wrote requirements for designing Data Marts that were used as the source for the various reporting systems in the company. Responsible for the project management activities of a web application including call center application, data warehousing, customer relationship management, Involved in mentoring specific projects in application of the new SDLC based on the Agile Scrum and Rational Unified Process, especially from the project management, requirements and architecture perspectives. Prepared interview questionnaires for the users and gathered requirements to writing specifications and shaping the software development process. Participated in the recording and analysis of the business requirements for the COB project  Involved in GAP analysis to identify AS-IS process and TO-BE process Prepared and maintained Requirement Traceability Matrix (RTM) including both functional and non-functional requirement  Ensure that the ICD-9-CM diagnosis and procedure codes & CPT codes requirements are appropriately incorporated in the COB systems. Used FACETS Analytics for fast and easy retrieval, display and grouping of Managed change requests by conducting impact analysis, and formulate the implementation plan Prepared change request form to provide description of the change requests, the results of the impact analysis, workarounds, if changes are not feasible, and the additional efforts required Using Shared Containers and creating reusable components for local and shared use in the ETL process. Worked with FACETS, Facets are extended enterprise of Trizetto's solution to assist payer organizations in staying ahead of trends in the employer benefits market.  Coordinated with all stakeholders of the projects to update them about the progress of the project, reviewed the developments, discuss change requests, and obtained approvals Environment: MS Projects, MS Visio, MS Word, MS Excel, MS PowerPoint, MS Outlook, UML, Windows , SQL, Rational Rose Horizon BCBS is the   leading Healthcare provider of the region. The web based application is related to bending the cost of care curve while improving the health and wellbeing of the people. This allows its clients to meet the requirements of Affordable Care Act mandates, to implement member engagement and retention strategies, customized benefit packages  as per to the needs of groups and individuals. My role involved in creating a test plan and test strategy for online enrollment application including: market data analysis, workflow, file management, image management, Web page layout and security.  Responsibilities:   Prepared Test Plans for each release, written Test Cases and executed them as part of Functional Testing. Prepared Test Reports and Deliverables and submitted for version releases. Performed analysis, review, and estimation of client requests; prepared and reviewed system requirements and client documentation. Primary liaison between Business users, the Technology group during the redesign of the processing for sales, resulting in process understanding and cooperation during testing and approval stages. Analyze business rules to develop wireframes for pages in HTML to assist in UI design. Performed Gap Analysis of the As-Is and To-Be process within the organization to analyze and fill the existing gaps in the business processes.  Conducted  Onsite-Offshore Status Meetings on regular basis  and co-ordinate to perform BRD related activities Documented the Use Cases and Activity diagrams using MS Visio to understand the requirements and communicate them to the development team.  Implemented an integrated RUP solution with complete line of traceability for all the artifacts of web development projects.  Involved in the creation and maintenance of the Workflow plans and artifacts. Designed workflows for the new corporate tool (COTS product) based on the capability project for the initial release and to see that the minimum business requirements were met Performed requirements analysis for a large-scale, highly-available, COTS-based infrastructure Tracking system Prepared Business Process Models that includes modeling of all the activities of the business from the conceptual to procedural level. Followed top down, leveled technique for building Business Process Models.  Involved in reviewing complex SQL queries, views, functions and stored procedures and spotting issues before/during code migration.  Worked with the UI team to create the User Interface screenshots to be presented to the Business.  Reviewed, analyzed and modeled Test plans and Test procedures based on RUP methodology.  Performed Gap analysis for the modules in production, conducted feasibility study and performed impact analysis for proposed enhancements.  Verified the functional aspect as per the Business Process and validated the interfaces with the other systems and data conversion from the legacy system.  Involved in walkthroughs and meetings with development team to discuss related issues.  Used Rational Rose to visually determine the proper structure, key elements and optimal design for the database and to aid efficient creation of tables and storing procedures.  Wrote clear, concise and detailed system requirements specification (SRS) documents and user documentation in accordance to guidelines and standards of a level where developers can interpret, design and develop the application with minimum guidance. Performed User Acceptance Testing (UAT) to test the functionality of the application. Environment: Windows, MS Access,  UML, Quality  Center Use Case Analysis, SAS MS Visio, Rational Rose, Team Foundation Server, SOX, SOA, Java, Java  Script, MS  Office  Suites, MS Excel, "}