{"text": "Name: elsie elsie E-Mail: elsie.elsie@gmail.com Address: Seoul, South Korea Github: https://github.com/elsie LinkedIn: https://linkedin.com/elsie Phone No. 612564002747 Business System analyst and Certified Scrum Master with 8+ years ofexperience in Finance as well as Telecom Industries. Worked closely with Project Manager, SME and other related staff to understand Business Process Flows, Case Tools, Business/Requirement Analysis, Quality Assurance, Content Management, Development, Database design and administration, Report Writing and finally Support and Installation. Practice in the Development of Client-Server, Web-Based Applications and also in Data Warehousing projects. To take a challenging post for understanding business needs, assessing the impact of those changes, capturing, analyzing and documenting requirements and then supporting the communication and delivery of those requirements with relevant parties. Professional Profile Imaginative person capable of forming, maintaining positive and productive team environments and integrative thinking skills. Exceptional ability to learn and adapt to new industries and business processes quickly. Proficient in requirement gathering, performing appropriate analysis and business processes management with a strong knowledge of System Development Life Cycle (SDLC) using Waterfall, Agile methodologies. Extensive experience in creating As-Is and To-Be process models, conducting Gap Analysis to understand areas of improvement and analyzing the risks involved through SWOT, Value Stream Mapping, Feasibility Analysis and Impact Analysis, and eventually proposing an appropriate mitigation plan to overcome those risks. Experience in conducting Joint Application Requirement (JAR) sessions, withSMEs and stakeholders. Highly experienced in creating the requirements Artifacts, Business Requirement Document (BRD), System Requirements Specifications Document (SRS), Use-casesand appropriate use-case diagrams, Functional Requirements Document (FRD), Technical Requirements Document (TRD) and Change Requests Planning (CRP). Experience in creating Key performance indicators (KPI), Enterprise Risk Management, Business Continuity Planning (BCP),Change Management, and dealing with changes in an assertive manner or with due diligence. Excellent knowledge in Microsoft systems like SQL Server, SSIS and Data Analytical tools like Informatica, Tableau, R studio,SQLqueries. Created reports through SSRS and Crystal Reports like Canned reports and Ad-Hoc reports. Worked closely on Data Modelling activities and ETL processes for various Data warehousing projects. Strong knowledge of system, network security, log analysis, and intrusion detection technologies,superior knowledge of TCP/IP, firewalls, routers, and network protocols and technologies,excellent communication, organization, and troubleshooting skills Efficient with Stored Procedures, Cursors, Views and Triggers in SQL, for various Data warehouse Projects. Highly expertized in tracing requirements throughout the development process and verifying adherence to Requirement Traceability Matrix (RTM). Extensively used tools such IBM Web Sphere, JIRA and Rally. Significant experience in reviewing Test Procedures and creating Test Cases, Test Scripts and Test plans for Manual as well as Automated Tests, to test several dependencies among the automated modules of the projects Extensive knowledge in data collection, analysis and evaluation, analytical problem solving, decision making and interpersonal skill with ability to interactand understand among different individuals at all levels of the project. Involved in scripting business logic in the web methods of Web Services and documenting the Web Service Level Agreement (WSLA) document through XML into the business engine rule of the application. Strong Business Process Management skills and experience including Process Mapping & Modeling, Process Visualization, Business Process Analysis, Business Process Frameworks & Methods, Business Rules, and Business Process Standards such as BPMN, BPEL, BPDM, BPR Acted asa interface between business and IT Support team and facilitatedrequirement analysis with business for any enhancement /release or upgrade review for operational performance of the support team. Experience on Ecommerce application development with Oracle Endeca Experience Manager Technical Skills:  \t PROFESSIONAL EXPERIENCE: Day & Zimmermann, Philadelphia, Pennsylvania \t\t\t\t\tProject Budget: $1.5 Million Crystal Reports Business Analyst\t\t\t\t\t\t\t\tDec 2016 – Till Date Project Description: Day & Zimmermann is a major Betterment Company founded over a century ago. They specialize in construction & Engineering, staffing and defense – helping leading corporations and governments make the world a better place. Project involved in automating the process of parsing the data from SAP into Crystal Reports. Previously the user had to manually parse the data from SAP into excel. One of the major task was to identify the possible roadblocks and obstacles and propose new solutions for the same. Role & Responsibilities:  Provide support to the end-users in designing and troubleshooting problems with Business Intelligence deliverables and data extractions from an Oracle data warehouse to generate the Fringe data. Create data models for universes and data mapping documents from source to target system, and with the Crystal Reports Enterprise 2016 making the entire process of report generation to get automated. Gather and analyze requirements and specifications for Fringe Data and Credit unions reports. Provide support to end-users in designing and modifying reports, depending upon the requirement of the data. Conduct meetings and training with team members while providing a broad range of subject matter expertise relating to the data conversion of all the Fringe Reports and Credit Union Report releases on weekly basis. Collaborated with higher level management to provide the proper training to understand and translate business requirements of the artifacts for use in a major ERP implementation. Trained the team members on designing as well as mapping the data from source to target in Crystal Reports Modify the existing reports by adding new logic and deleting existing logic as the line of Business changes periodically. Migrate reports from Devregulator Production to send out the reports to appropriate credit unions Generate reports with parameters, sub reports, cross tabs, charts using Crystal Reports Scheduled the report using Schedule Manager in Crystal Management Console to run on a periodic basis. Developed database connections, SQL joins, loops, views, aggregates on the fringe data of credit unions. Drive pricing process excellence within department (productivity, consistent methodologies and skill development) through the implementation of continuous improvements which improved efficiency by 25%. Streamlined the entire proposal process resulting in a 95% on time delivery of proposals to the customer. Conduct JAD sessions to finalize the Billing system design, scoping of functionality to be implemented per release and design changes needed in Middleware services for Billing and Retail systems. Identifying the Support tasks that would be needed for each release from Billing and CRM systemsperspective. Tuning the SQL statements provided by development and deploying the data fix Developing User Requirements Specifications (URS, Functional Requirements Specifications (FRS), Role Based Access Control (RBAC) and Business Owned Application Manual (BOA). Project Environment:Agile methodology, Kanban, Lean, Microsoft Office Suite, Microsoft Visio, Microsoft Project, SQL, JAVA development, DB2 database, AEM, endeca Orion Systems, New Brunswick, New Jersey\t\t\t\t\t\t Project Budget: $1.35 Million Sr. Business Systems Analyst\t\t\t\t\t\t\t\t\tApril 2015 – Dec 2016 Project Description:Orion Systems is one of themajor IT firm in providing Data analytics and Business Intelligence solutions. Project involved development of a Web based application which was a part of the financial services to provide Financial Advisors with an asset/portfolio analysis system/tool. The user could log in and add or manage his/her financial assets and conduct analysis on the assets creating scenarios in the application. The application supported financial instruments and also integration of different analytical tools. Role &Responsibilities:  Interacted with business owners to identify business system needs, evaluated solutions for business problems and proposed alternate methods to increase efficiency and provide feasible solution to the project. Accumulated customer requirements from various end through JAD session, interviews and translated them into system requirements, for the developers about the requirement specification with respect to the project. Migrated data from various databases like MS Access, Informix to SQL server by applying transformation, lookups, indexes concepts. Developed Use Case diagrams, Activity flow charts and Class / object diagrams, Sequence Diagrams using Rational Rose to help better explain the business process flow to various stakeholders of the project.  Developed data flow diagrams, illustrating the flow of data from the legacy systems into the Application database tables, along with checkpoints for testing / verification for several modules. Recognized various web services with the help of UDDI and implemented a complete web orchestration, including both the internal as well as external web service to the organization and worked on associated SLA. Worked closely on Data Modelling and using various Linear models, Forecasting, Simulations for iterations, Regression for various variables and their relations withdimensional tables and fact tables within the project. Experience in development of procurement related documents including RFP and evaluation criteria. Worked closely with the development and testing team in a Test Driven Development environment (TDD). Used HP Quick Controlfor Automation, Regression, and System Integration Testing for the project. Modified old and created new reports and subreports using Crystal Reports XI and Crystal Reports 2008. Created a \"current state\" business process model in ARIS analyzing the pain points within the current system coupon creation and coupon management processes Constantly decreased or removed downtime during troubleshooting and well-timed repairs, ensured authorized access to files by revoking access, investigating unauthorized access, and reporting violations Create Functional and Technical Requirements to implement Fringe Data in Credit Union Billing, Oracle Service Bus, IVR, and Product Catalog. Project Environment:Agile methodology, Kanban, Lean, Adobe AEM, Microsoft Office Suite, Microsoft Visio, Microsoft Project, SQL, JAVA development, DB2 database, SAfe Farm Credit Bank of Texas, Austin, TX\t\t\t\t\t\t\t   Project Budget: $2.4 Million Sr. Business System Analyst/Scrum Master\t\t\t\t\t\t\t Nov 2013 – Mar 2015 Project Description:The project was created to serve the Non- Commodity Trade Finance business. The web application handles the credit workflow process of the bank. In addition, the application is used for risk management purposes. The application monitors and manages client limit, group limit and country limit values along with bank’s exposure to different set of clients. The application is used by all set of users- Front Office, Middle Office and Back Office. Roles & Responsibilities: Gathered Analyzed, validated, Managed and documented the stated Requirements by conducting one on one interviews and JRP sessions with the stakeholders for current as well as future references of the project. Conducted market analysis, Impact Analysisand feasibility studies& developed the project Initiation plan. Created functional requirement specification documents such as UML diagram, use case diagram, scenarios and activity flow diagrams to help better understand the business flow of the project. Integrated with stakeholders for verifying the requirements, managing change control process, updating existing documentation& Project Tracking with respect to user stories using project management tool JIRA. Organized and facilitated sprint planning, daily stand-up meetings, reviews, retrospectives, release planning, demonstration and other Scrum-related meetings, leading to enhancement of application development. Worked intensively on the Crystal Management Console and produced monthly report. Engaged in multinational Agile AEM WCM implementation leading stakeholders on and offsite in technical requirements gathering, technical project management, road mapping, documentation, website design site development, deployment monitoring, and operational support. Developed and conducted a two-day accelerated business process modeling training session for the local business analysis team Adhered to and enforced corporate policies regarding network security, data, and software usage Process re-engineered business protocols to meet the high demand of a changing business environment Created several crystal commands the produced reports containing collateral and assessment information based on shared variables. These reports also displayed a pie chart containing repossession summaries. Created manual Test Cases in HP QC/HP ALM for various User Stories based on Release and Sprint Plan. The iterative and incremental development practice gave rise to Continuous Integration (CI) – the practice of checking-in code often, with each “chunk” tested and integrated into a shared “trunk” several times a day. Further making the entire software available for release withContinuous Delivery (CD)implementing the software in a DevOps environment. Used JIRA project management software for developing the sprint burn down and burn up charts, velocity charts throughout the sprints to track velocity as well as determine capacity of the development team and update the user stories and tasks that are completed in various sprints into the product backlog artifact. Created UAT/QA test plans, strong manual, functional, system Integration and regression testing in an agile development environment for different business users and product owner within the organization. Executed test cases and test scripts for manual and automation testing. Defects are raised in the HP Quality Center/HP ALM for logging, tracking and reporting bugs in the application. Environment:Microsoft Office Suite, MS Visio, MS Project, Windows XP, Adobe AEM/ CQ5 Dreamweaver, SQL, PLSQL, XML, VB, ASP.Net, Crystal Reports, Adobe Photoshop, Mercury Test Director, Win Runner, Safe, Endeca Disney, Orlando, FL\t\t\t\t\t\t\t\t\t Project Budget: $2.69 Million Sr. Business System Analyst\t\t\t\t\t\t\t\t\t Nov 2012 to Oct 2013 Project Description:Disney has diverse capabilities across products and distribution channels. Disney was in need of a centralized data storage system that would store data routed from multiple operational systems, from within the organization as well as external source systems. Disney was required to develop an enterprise-wide data warehouse that would convert the client’s heterogeneous corporate data, derived from legacy systems, into an integrated, user-friendly information system beneficial for strategic decision-making.  Role &Responsibilities: Identified the requirements from the stakeholder’s keeping in mind their need for the application and prepared theBusiness Requirements Document and Functional Specifications Document for the project. Instructed core Agile principles of collaboration, prioritization, team accountability and visibility; ensured consistent application of scrum methodologies across the team and also the organization. Worked with the engineering managers to identify cross-team dependencies and manage inter-team tasks, also worked 24*7 with the production and support system team during releases of the project. Involved in designing and developing Data Martsfrom disparate data sources that support the Business Intelligence Data Warehouse pertaining to different databases within the project using ETL Informatica.  Worked closely with the development team on transformation logicsand data validations in the staging area for the several data collected from different sources of the operational databases of legacy applications. Performed Data mapping and logical data modeling also prepared ER diagrams for the system. Widely used SQL (Stored procedures, Triggers, Views, Cursor) toextract data from different sources. Conducted ETL testing process for data quality, data integrity, data transformations and data validations. Conducted requirements gathering sessions to capture requirements for migration from existing Digital Asset Management solution to AEM Requirements to capture include asset metadata definition, user               roles/groups/permissions, workflow definitions to account for various manual processes Worked closely with the QA team for draftingtesting requirements, test plans andworked on documenting RTM (Requirement Traceability Matrix) to map every test case to an appropriate use case. Create high level and detailed system designs for Enhancements.Working on Oracle Endeca configuration for products and pricing in Experience Manager Primary role involved analyzing and evaluating enterprise e-commerce solutions provided by leading software vendors like SAP, oracle, endeca and analyzing the feasibility of porting these solutions on different mobile phone platforms including iPhone OS X, linux mobile (LiMo), symbian, windows mobile, android. Performed market surveys of security related products and evaluated their suitability for integration with security architecture.Developed standard security-related device configurations, intrusion detection system. Provided integration solution architectures focused on CMS/Portals, Adobe CQ5/AEM, and Sitecore. Experience working with different SAP modules like SAP SD, SAP QM for certain modules of the application. Responsible for tracking and analyzing all digital marketing and advertising activities – click-through rates, conversion rates, cost-per-click, and cost per acquisition. Project Environment:MS SQL Server 2012, SQL server Reporting Services 2012, SQL Integration Services 2012,  Microsoft Visual Studio 2010, SQL Server Management Studio 2010, MS Excel, T-SQL.endeca Birla Sun Life Mutual Financial, Bangalore, India \t\t\t\t\t Project Budget: $2.54 Million Business Financial Analyst \t\t\t\t\t\t\t\t Feb 2011 – Oct 2012 Project Description: Data on fixed income, stock securities were not being replicated properly and this resulted in a loss of business for the client. The project consisted of analyzing the current situation and purposes a solution to the problem. The result was increase in functionality of the system to a workable level and an increase in efficiency by 80% which resulted in profit for the company. Role &Responsibilities:   Gathered requirements and prepared business requirement documents (BRD), System Requirement Specification (SRS) by interviewing Brokers, users and SME’s, stakeholders. Conducted GAP analysis to understand the shortcomings of the existing system and evaluated the benefits of the new system with respect to the enhancements in the new system being developed. Used the guidelines and artifacts of the Rational Unified Process (RUP) to strategize the Implementation in different iterations and phases of the Software Development Life Cycle. Transformed requirements into high-level and low-level use case diagrams, activity diagrams / state chart diagrams, class diagrams using MS Visio thus defining the data process models  Developed High Level Business Flows using Microsoft Project Visio to understand the project. Used SQL scripts to pull the data and depending on that also verify the integrity of the database.  Monitored client expectations and conducted user interviews to improve quality of the Application.   Project Environment:Agile methodology, Kanban, Lean, Microsoft Office Suite, Microsoft Visio, Microsoft Project, SQL, JAVA development, DB2 databases. HDFC Bank, Mumbai, India\t\t\t\t\t\t\t\t Project Budget: $1.75 Million Business Analyst\t\t\t\t\t\t\t\t\t     Sept 2009 – Jan 2011 Project Description:The Business need for this project was to develop an automated web based system for the process of recording and maintenance of reports from the credit card companies. The system generates Credit reports of individuals based on the data provided by the various agencies. The system also maintains a record of any information obtained to an individuals report and updates the database. Role &Responsibilities: Participated in gathering user requirements, developedfunctional and non-functional requirements. Developed use cases/diagrams, conceptual model, behavior diagrams (sequence, collaboration, state chart, Activity), using MS Visioin order to get a clear picture of the process. Responsible for working with the manager and other users and creating Work flow diagrams. Responsible for the delivery of Business Requirements Documents (BRD) within project timelines. Performed unit testing, functional testing, integration testing, stress testing, system integration testing and code inspection review to make sure the deliverables are match with business requirement. Delivered Proof-Of-Concept POC based on testing, configuration, and implementation of various portal Integration Platform technologies against detailed requirements including: ECM, Liferay 6.1 EE, Adobe CQ 5.6/AEM, WebSphere Portal 8, and eXo Enterprise Platform 4. Project Environment:Agile methodology, Kanban, Lean, Microsoft Office Suite, Microsoft Visio, Microsoft Project, SQL, JAVA development, DB2 database Axis Bank, Mumbai, India\t\t\t\t\t\t\t\t    Project Budget: $1.2 Million QA – Functional / Automation Tester\t\t\t\t\t\t\t\tJun 2008 –  Aug 2009 Project Description:The project was building an CRM application using Siebel CRM. The tool had main functionality of working on company’s database and to pull out data responding to various customer details. The CRM software was to be used in multiple company office around the globe and was released sequentially with integration and preference to location specific data. Functional testing involved cross browser, Black-box, Component, Integration, System, Regression and Smoke testing activities.   Role &Responsibilities: Performed Quality Assurance activities for CRM tool on Seibel CRM framework. Created Complex Test Cases, Test Case Review and Defect Review. Tracked defects in JIRA found at various software release phases and develop negative test data as well as updating regression test suite to check the impact of new changes on the previous data. Planned and executed regression test suite and automated regression test scripts in HP QTP. Produce, maintain and communicate project status report and testing deliverables with teams. Handled Responsive website testing on different mobile devices and different OS/browsers. Handled content migration testing of the CRM tool and database. Project Environment: Agile methodology, Kanban, Lean, Microsoft Office Suite, Microsoft Visio, Microsoft Project, SQL, JAVA development, DB2 databases. EDUCATION                                                                                \t\tCERTIFICATIONS Bachelor Engineering in Information Technology\t\t\tScrum Master Accredited Certification"}