{"text": "Name: frances frances E-Mail: frances.frances@gmail.com Address: Jining, China Github: https://github.com/frances LinkedIn: https://linkedin.com/frances Phone No. 761195827275 \nSUMMARY 8+ years of IT/ BI experience with Tableau and OBIEE in the field of Business/Data analysis, Report Development, ETL Development and Data Modeling. Have strong experience in Business Intelligence, Data Warehousing and Data Mining applications in Entertainment, Health Care and Financial industries. 4+ years of solid experience working with Tableau Desktop, Server, Reader, Online, Public, and Mobile in different versions of Tableau 9.x, 8.x, and 7.x In depth knowledge of SDLC phases such as Requirement analysis, design, development, implementation, deployment and maintenance with strong understanding of methodologies like Waterfall, Iterative& Incremental, Evolutionary prototyping and Agile. Excellent understanding of Business Requirements Gathering, Translating Requirements into Specifications and Application Design. Expertise in designing and creating various analytical reports and Dashboards to help users to identify critical KPIs and facilitate strategic planning in the organization.  Proficient in Building compelling visualizations, interactive dashboards in Tableau that answer key business questions.  Skilled in Tableau Desktop for data visualization through various charts such as bar charts, line charts, combination charts, pivot table, scatter plots, pie charts and packed bubbles and also use multiple measures for comparison such as Individual Axes, Blended Axes, and Dual Axes. Experience in developing interactive reports and dashboards by making use of LOD expressions, actions, local and global filters, calculations, calculated fields, groups, sets, hierarchies and parameters Tableau. Experience in designing stunning visualizations using Tableau software like Pareto, Waterfall, bar graphs (Stacked & Side- by- Side), lines (Continuous & Discrete) and Geo maps (Symbol & Filled), scatter plots, pie-charts, histograms, bullets, geographic visualizations, heat maps and highlight tables, etc. Administered user, user groups and scheduled instances for reports in Tableau. Strong experience in Business and Data Analysis, Data Profiling, Data Cleansing, Data Migration, Data Integration and Metadata Management Services. Good experience in Data Modeling with expertise in creating Star & Snow-Flake Schemas, FACT and Dimensions Tables, Physical and Logical Data Modeling using Erwin. Hands on experience in configuring and developing the analytics/OBIEE repository, which involves Schemas Import, Dimensional Hierarchies, Level Based Measures.  Experience in development of the three layers (Physical layer, Business Model and Mapping layer & Presentation layer) of an OBI Metadata repository using BI administration tool.  Experience in RPD development, configuring and changing RPD as per the requirement. Outstanding experience in creating Source to Target (Data Mapping) documents, writing data extract scripts/programming of data conversion and researching complex data problems and generating analytical reports/dashboards. Possess strong knowledge of database management in writing SQL queries using complex joins, grouping, aggregation, nested subqueries, and resolving key performance issues. Analytical, methodical and resourceful approach to Problem Solving, Root-Cause Analysis, Impact Analysis and providing corrective actions to meet business requirements. Focused troubleshooter and a team player with excellent interpersonal and communication skills. Ability to work cohesively with developers, other team members, and testers. TECHNICAL SKILLS PROFESSIONAL EXPERIENCE AMC - Kansas City, KS\t\t\t\t\t\t\t          \t      Oct 2015 - Present Sr. Data Analyst  The Business Intelligence data warehouse system was implemented to handle the increasing data volumes generated by the companies growing active client base, while improving customer service levels. The project involves maintenance of warehouse of AMC by means of integrating data from different feeder systems and build analytics using Tableau.    Responsibilities:  Gathered user requirements, reporting requirements and Involved in designing Physical Data Model.  Designed Physical Data Model in Repository according to the Business requirements with necessary logic that involved creating the physical, BMM and the presentation layer. Also created hierarchies, variables, and poll strategies in the repository.  Implemented security at the data and object levels as per the business user requirement.  Used appropriate filters, column filters, prompts, dashboard prompts and calculations in reports.  Enabled usage tracking in production to track usage of dashboards and for the maintenance and performance of the application  Developed Stored Procedures, Functions, Packages and SQL Scripts using PL/SQL.  Developed SQL scripts for Referential Integrity check, which checks validity of incoming data with master tables in database.  Performance Tuning of Dashboards/Reports and made recommendations for changes to database by implementing the materialized views and aggregate tables.  Performed SQL and PL/SQL tuning and Application tuning using various tools like TKPROF, AUTOTRACE and DBMS_SQLTUNE.  Environment: Tableau (Desktop/Server) 9.2/8.3, Informatica 8.1, Oracle 11g, SQL, PL/SQL, SQL Developer, TOAD, SQL*plus, UNIX. McKesson - Charlotte, NC                                                                                            Aug 2014 - Sep 2015\nSr. Data Analyst McKesson Pharmaceutical Distribution supplies branded, generic and over-the-counter pharmaceuticals to more than 40,000 customers in three primary segments: retail chains, independent retail pharmacies and institutional providers such as hospitals, health systems, integrated delivery networks and long-term care providers. McKesson works with its customers on solutions - including supply management technology, world-class marketing programs, managed care and repackaging products and services - that help them meet their business and quality goals. The project is to implement Business Intelligence reporting solutions by creating reports, dashboards, and scorecards in Tableau. Responsibilities: Involved in full project lifecycle of SDLC and coordinated with all project teams. Interacted with Subject Matter Experts & End Users to gather business requirements. Acted as liaison between Business Intelligence and Business User groups to relay change requests. Performed extensive GAP analysis in the project as there were numerous ‘As-Is’ and ‘To-Be’ conditions. Analyzed requirements for various reports, dashboards, and scorecards.  Designed and developed a business intelligence dashboard using Tableau Desktop, allowing executive management to view past, current and forecast sales data. Mentored business power users to create reports/dashboards using tableau desktop. Designed and developed various analytical reports from multiple data sources by blending data on a single worksheet in Tableau Desktop Developed key indicators and the appropriate tracking reports with graphical and written summations to assist in the quality improvement initiatives. Involved in creating interactive, parameterized dashboards by extracting data from different sources using data blending and applying actions - filter, highlight and URL. Created dashboard from scratch that included drill-through, filters, Heat/Geo/Tree maps, Pie/Bar charts, Circle views, Line/Area charts, Scatter plots and Bullet graphs. Utilized Data story telling in tableau to provide more dynamic and more effective stories from the hidden insights locked in the data. Created prompts, customized calculations, conditions and filters (Local, Global) for various analytical reports and dashboards. Created and modified interactive dashboards and developed guided navigation links within interactive dashboards. Created Table of Contents (TOC), a common navigation page which had all the links to various reports and dashboards. Published the developed dashboard, reports on the Tableau Server so that the end users having access to the server can view the data. Scheduled frequency and time to refresh data when sources are published or extracted to server.  Played an important role in coordination with the entire team and managing the time estimates for the entire project. Used SQL tools like Toad and Teradata SQL Assistant to run SQL queries and validate the data in the warehouse and data marts. Ensured on-time and on-budget performance of the assigned efforts to the mutual satisfaction of the business partners/ sponsors.  Oversee the performance of design to develop technical solutions from Analysis documents. Provided post implementation production support. Environment: Tableau Desktop/ Server, MS Project, DB2, Teradata, Teradata SQL Assistant, SQL, PL/SQL, SQL Developer, Informatica Power Center, SQL Server, Control-M. Genentech, South San Francisco, CA\t\t\t\t\t           Sep 2013 to July 2014 Sr. Data Analyst Genentech is one of the world's oldest and most successful biotechnology companies. The firm has a number of successful cancer therapies based on its antibody technologies. The project was to integrate data from multiple source spend systems (Clinical trials, Events, Travel related) and provide consolidated reports which are used to disclose any reportable spend/transfer of value (TOV) to reportable recipients such as Physicians and Teaching Hospitals to state and federal regulators. Responsibilities:  Developed and administered interactive data visualizations updating content used in standardized dashboards.  Built compelling, interactive dashboards in Tableau that answer key business questions.  Generated insights out of voluminous and complex datasets and built story lines.  Produced complex table calculations, use of parameters, actions, filters and other advanced options in Tableau.  Involved in tableau Server installations, configuration, creating users, groups, and projects.  Designed excellent tableau dashboards and presented correct decisions independently based on what different kind of visuals would make sense for the business.  Prepared Business Requirement Document and then converted business requirements into Functional Requirements Specification.  Worked closely with business power users to create reports/dashboards using tableau desktop.  Designed and developed various analytical reports from multiple data sources by blending data on a single worksheet in Tableau Desktop.  Developed filters, reports, dashboards and also created chart types, visualizations and complex calculations to manipulate the data.  Used multiple Measures like Individual Axes, Blended Axes, and Dual Axes.  Effectively used data blending, filters, actions, Hierarchies feature in Tableau.  Using Calculations in Tableau like Creating and Editing Calculated Fields.  Using the Calculations and Aggregations & Aggregating Dimensions in Calculations.  Using the Record Level Calculations for Date Conversion.  Analyzed unstructured data sources (HDFS) and transformed the data into a structured format using Apache PIG Latin (Big Data Hadoop)  Imported and Exported data on to data warehouse system HIVE using Apache SQOOP.  Created schemas in Apache HIVE and loaded data.  Connect to Hive from Tableau server and build the dashboards.  Involved in Unit testing the SQL Scripts for report development, Tableau reports, Dashboards and handled the performance issues effectively.  Environment: Tableau (Desktop, Server), Informatica, Oracle 10g, MS Excel, Toad, MS SQL Server, HDFS, PIG, SQOOP, HIVE, HP Quality Center. Norfolk Southern - Atlanta, GA\t\t\t\t\t             \t Oct 2012 - Aug 2013 Sr.Data Analyst  Norfolk Southern (NS) is the largest rail shipper of automotive products in North America. NS transports auto parts to assembly plants and after-market distribution centers and delivers finished vehicles to market. The project is about analyzing CTMS-NG (Commodity Transportation Management System - Next Generation) data and build dashboards utilizing Tableau. Responsibilities:  Worked with functional and technical leads, business groups to identify, analyze, and document business requirements.  Build interactive Tableau dashboards and publish Tableau reports utilizing parameters, calculated fields and table calculations, user filters, action filters and sets to handle views more efficiently  Created actions, parameters, Filter (Local, Global) and calculated sets for preparing dashboards and worksheets using Tableau.  Created multiple connection pools, imported physical tables and then created aliases  Developed hierarchies, variables, joins, time series objects, aggregate navigation and event poll strategies in the repository  Implemented Security (Object Level, Column Level) by setting up users, groups with access privileges and query privileges  Created various reports in multiple views such as Pivot Table, Charts, Tabular, View Selector, configured Global Filters and Prompts; these reports were placed under various dashboards based on the subject areas that were used for managerial decisions  Created global filters, complex queries, prompts and reports (charts, tables, graphs) in Answers  Created reports using data blending instead of joining  Used OBIEE 11g New features  Worked in Multiuser Development Environment (MUDE) Using Oracle BI Administration Tool.  Prepared Design Specification documents based on functional requirements and also involved in the preparation of Technical Design Documents.  Built the Physical Layer /Business Model and Mapping Layer/ Presentation Layer of a Repository by using Star Schemas.  Restricted data in tableau using different filters quick, context, data source and extract filter.  Generated guided navigation links for Interactive dashboards in Tableau.  Utilized advance features of Tableau software like to link data from different connections together on one dashboard and to filter data in multiple views at once.  Created init blocks, session variables and used them in front end to set these variables.  Defined the Primary, Foreign keys and created Simple and Complex joins between various Dimension and Fact Tables.  Created Time Series measures using AGO, To Date and Period Rolling functions in RPD & Reports.  Modified Dynamic Session Variables used for Data Visibility, Configured Security at the repository level, Catalog level & the OBI Application level.  Created Presentation catalogs, and Folders in Presentation Layer in Oracle BI Administration Tool.  Enabled Usage Tracking Table and Dashboards.  Implemented row-wise Initialization configured Bridge and Helper tables  Created custom CSS classes and styles, java scripts and HTML scripts to enhance the dashboard functionality and produce reports that meet user requirements.  Involved in Performance Tuning of reports by identifying the indexes required on the backend tables and also from the data available in the Cache.  Environment: OBIEE 11.1.7.1, Tableau 8.x, Teradata, Teradata SQL Assistant, ERwin, SVN, Talend, JavaScript. TIAA-CREF Financial Services - Charlotte, NC\t\t\t                Aug 2011 - Sep 2012 Data Analyst/ OBIEE Developer Teachers Insurance and Annuity College Retirement Equity Fund (TIAA-CREF) Financial Services is a full-service financial services group of companies that has dedicated itself to helping those in the academic, medical, cultural, and research fields for over 90 years. TIAA provides a wide amount of annuity options to persons enrolling for annuity options. The project involves maintenance of data warehouse by means of integrating data from different feeder systems and Business Intelligence, using OBIEE Data is presented in a user-friendly format to the higher management. Responsibilities:  Involved in analysis, requirements gathering, function/technical specification, development, deploying and testing.  Involved in Creating and Administering the Physical Layer, Business Model & Mapping  Layer and Presentation Layer using Oracle Business Intelligence Admin tool.  Designed repository, with complex Time Series Calculations, for prior months/ quarters/ years.  Created connection pools, physical tables, defined joins and implemented authorizations in the physical layer of the repository.  Created Dimensional Hierarchy, Level based Measures and Aggregate navigation in BMM layer.  Managed security privileges for each subject area and dashboards according to user requirements.  Created groups in the repository and added users to the groups and granted privileges explicitly and through group inheritance.  Developed custom reports/Ad-hoc queries using Oracle Answers and assigned them to application specific dashboards.  Developed different kinds of Reports (pivots, charts, tabular) using global and local Filters.  Created proactive agents iBots and interactive Dashboards using answers, KPIs and scorecard.  Created BI Publisher Reports using Data source and BI Answers as per requirements.  Extensively worked on complex BI Publisher reports, Data Models and creating complex RTF templates using BI Publisher Templates.  Handled Full load and refresh load via staging tables in the ETL Layer.  Worked on OBI Apps Financial Analytics reports like General Ledger reports, GL Cash flow summary report.  Customized Business Intelligence Applications (OBIA) prebuilt Oracle Financial Analytics delivers implemented for the financial services  Involved in Design and Data Modeling using Star schema.  Developed several mappings to load data from multiple sources to data warehouse.  Environment: OBIEE 10.1, BI Publisher, BI APPS 7.9.6, DAC 10g, Siebel 8.0 Applications, Oracle 10g, SQL Developer, Informatica 8.x Bayer - Wayne, NJ\t\t\t\t            \t\t\t \t     Jan 2010 - Jul 2011 Data Analyst/ OBIEE Developer Bayer HealthCare Pharmaceuticals is the pharmaceutical division of Bayer HealthCare AG and having products in more than 100 countries and generated sales of almost 11 billion Euros in 2010. As a success to their business, Bayer HealthCare has complete solutions to the end user by providing weekly and monthly based call activity & sales data of their products by each division within HealthCare unit.  Responsibilities:  Worked on various IMS data feed provided by vendor and populates the data on to the required tables. Involved in the monthly & weekly data loads activities.  Worked on implementing the Health care module which is part of the OBIA.  Worked on the various change request and tickets based system.  Responsible in creating various reports for the end-user and deploying the reports across various environments.  Worked on the disconnect analytics application and remote issues addressed by end-user  Involved working on the data related issues on various data feed.  Designed Star schema (RPD) which meets the reporting requirements.  Designed customized answers views and charts, create and save filters, creating the dashboard, prompts & dashboard links and Pivot tables.  Worked on the different layer of Administration tools like dimensional hierarchies and level based measures, calculation measures and applying logics on the BMM layer based on the requirement.  Worked on the upgrading version of Oracle BI.  Responsible in maintaining the complete infrastructure Oracle BI Applications.  Environment: OBIEE 10g, SQL, Oracle 10g, TOAD, MS- office, Windows XP, UNIX.\n ADP Technologies - Hyderabad, India \t\t\t\t               May 2008 - Dec 2009 BI Analyst  ADP is a comprehensive global provider of Human Capital Management (HCM) solutions that unite HR, payroll, talent, time, tax and benefits administration, and a leader in business outsourcing services, analytics and compliance expertise. The goal of this project Serge Financial was to provide a customized reporting system for the finance applications of the company using the Siebel Analytics.  Responsibilities:  Actively involved in gathering requirements from end users, involved in modifying various technical & functional specifications.  Involved in Creating and Administering the Physical Layer, Business Model and Mapping Layer and Presentation Layer in a Siebel Analytics Repository.  Configured analytics repository with logical dimensional modeling using Star Schema (Facts and Dimensions)  Configured and created repository using Siebel Analytic Admin Tool.  Developed different kinds of reports/Ad-hoc queries using Siebel Answers and assigned them to application specific dashboards.  Created connection pools to retrieve data from Siebel OLAP layer, real time Siebel OLTP data and data from Oracle Database.  Managed day to day. rpd, scheduler, and iBots.  Managed security privileges for each subject area and dashboards according to user requirements.  Involved in setting up Delivers to configure iBots based on the threshold value to the users.  Developed UNIX and PL/SQL scripts for pre & post session processes to automate daily loads.  Created ibots and Delivers to send Alert messages to subscribed users.   Worked on various Informatica mappings as per business requirement.  Worked extensively on Unit testing, Integration testing and fixed bugs during the UAT phase.  Environment: Siebel Analytics 7.7.1, Informatica Power Center 6.1, Oracle 9i, TOAD, UNIX"}