{"text": "Name: lillian lillian E-Mail: lillian.lillian@gmail.com Address: Luanda, Angola Github: https://github.com/lillian LinkedIn: https://linkedin.com/lillian Phone No. 685475024248 SUMMARY: Having 7.5+ Years of experience on Microsoft technologies like Visual studio 2008/2010, C#, ADO.Net, ASP.Net, SOA, XML, WCF, SSIS, SSRS, Web Services and ASP.Net MVC. Extensive experience in WPF with all the programming and technologies integrated into ASP.NET 3.5 and 4.0 C# framework. Proficient in System analysis and design, development experience in C/C++ and C#.NET, VB.NET   with in-depth knowledge of OOA, OOD and OOP concepts. Experience in using HTML5, DHTML, XML, CSS, Java Script, JQuery, and Ajax. Experience in almost all the phases of Software Development Life Cycle (SDLC)-requirements definition, design, documentation, development, integration, testing and troubleshooting, implementation and maintenance. Expert level programming skills in VB, C#, VB.NET, ASP.NET, Visual Studio 2010/2008, MS SQL Server 2008/2005. Extensive experience in RDBMS database design and experience in writing SQL scripts, Stored Procedures, User Defined Functions and Triggers for SQL Server 2000/2005/2008 and Oracle 11i/10g. Good experience with Crystal reports and SQL Reporting Services (SSRS). Experience in COM Interoperability, Web Forms, .NET Web services, SOAP, WCF and WPF. Designed and developed web services using Windows Communication Foundation (WCF). Experience on Unit testing, Integration testing , automated and System testing before the application was deployed. Expertise in N-tier Web Development analysis, implementation, data migration, interfacing/ reporting, and troubleshooting. Experience in developing Web Forms, Win Forms, Web Services, and Object Oriented Applications using .Net technology. Working experience on MVC architectural design pattern and used MVC in integration with Java Script framework. Experience in Preparing UML design documentation and design patterns, use cases and Team Foundation Server(TFS). Good experience in Agile Methodology environment with scrum meeting, daily task sheet and project execution in iterative manner. Self-motivated individual with capability of working in multiple projects, excellent communication skills, ability to work independently or part of a team and able to adopt new skills. TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE: Wells Fargo Bank, Rochester, MN                                                            Mar 2013 – Till Date .Net Developer  Project:Sales Forecasting & Budgeting System The project is to track the potential growth of the business in various divisions. This system interacts with various other Enterprise systems using XML web services to fetch the contracted revenue and prepares the baseline forecasting. Responsibilities: Worked with Business Analysts in understanding business requirements and analyzing use cases. Performed actively in the Development and Testing phases of SDLC life cycle and monitored day to day project activities to ensure the deadlines were achieved as per client expectation. Developed custom controls and server side components using VB.Net. Involved with the client team to design and implement the advanced technologies WCF, SOA, ASP.NET with the application logic in C# according to the user requirements. Involved in front end Application development using in ASP.NET, AJAX using C#, and back end in SQL Server 2008. Developed Web forms in   ASP.net with VB.net and C#. Extensive development using ASP.NET, WebForms using AJAX, Master Pages, Themes, Web Parts, Provider Model, Java Script. Also involved in proof-of-concept using ASP.NET Model-View-Controller, MVC pattern. Designing Client/Server, Web applications using VB.Net, HTML, CSS and JavaScript. Designed and developed static and dynamic pages validating client side and Server side scripts. Developed dynamic ASPX web pages for Application using ASP.NET, C#.NET, XML, HTML, Java Script and AJAX including JQuery library. Planning to rewrite windows application into web application wherein involved in creating POC in technologies like HTML5 or ASP.net 4.0 with MVC. Consumed some external Windows Communication Foundation (WCF) Services to write logs to the database. Used the Object Oriented Programming (OOP) techniques and created classes (C#.NET) for database access. Involved in front-end development using Visual Studio 2010, ASP.Net, and CSS. Used JQuery, ASP.NET AJAX toolkit controls and CSS to enhance the performance and richness to the user interface. Developed User controls using ASP.Net and C# and used them dynamically in the web pages using Master pages and CSS. Designed MVC design pattern for ASP.NET application development using the ASP.NET MVC framework. Used ASP.NET web server controls like Grid View, List View and Repeater for displaying the required information. Involved in designing Web forms using server controls, validation, user controls using .Net framework. Used Web Services to enable effective communicate between different layers in the Application. Implemented the application logic using Object Oriented Programming (C#). Developed Web Forms using ASP.NET and SQL Server as back end for databases. Developed Web Services to interact with remote business objects and different suppliers systems using SOAP, HTTP/XML, WSDL Expertise in developing various custom controls to retrieve values from the reference tables and provide multilingual support to the pages using VB.Net. Created packages using SSIS for extracting data from MS Excel files, OLEDB, MS Access to SQL Server database. Unit tested the application using error tracing and debugging. Actively involved in providing the technical support and production software operations through troubleshooting to resolve the issues. Environment: .Net Frame Work  3.5, MS Visual Studio 2008/2010, VB.NET, C#.Net, ASP .NET, ADO.Net, SQL Server 2005/2008, SSRS Reporting Services, SSIS, CSS, XML, J Query, Java Script, Windows Servers 2008, VSS, Ajax Toolkit Controls,  Oracle, Web Services, SOAP/WSDL/ WCF, WPF, HTML5. All Scripts Health, Boston, MA\t\t\t\t\t      Sep 2010 – Feb 2013 .Net Developer Project:  Revenue cycle Management. Revenue Cycle Management Solutions meets the needs of all types of health care providers. It is one solution from patient registration thru payments & remittances of claims. Application provides the leading edge tools necessary to make the revenue cycle an unobtrusive and pervasive component of the patient cycle, promoting compliance, billing & collections accuracy, and revenue cycle optimization through workflow automation.   Responsibilities: Responsible for Development team interaction and understanding the documents written by the business analyst. Defined High Level Design and Architecture framework of the application Involved in development of viewer module, migration of data module and Patient claim Worksheets module. Designed and developed front-end screens using Java Script, AJAX, CSS, and HTML. Participated in the entire Software Development Life Cycle (SDLC) of the project Implemented the code using C# as code behind and ADO.NET for connecting to the SQL Server database Developed application as N-tier application with UI in the presentation layer using VB.NET and data service activities in the backend using SQL Server 2008. Developed business logic using C# and connect to WCF services to get data. Implemented MVC architecture using C# .NET, ASP.NET. Designed and Developed win forms using ASP.NET, VB.NET and Java Script for the GUIs using code behind class technique. Used TFS (Team Foundation Server) for version control. Involved in Writing Stored Procedures to validate the data at backend and to execute the desired result at front end. Designed and developed WCF Web Services and configured our WCF Services with appropriate endpoints for consuming them in the web application. Used LINQ to SQL to query database and made use of LINQ to objects and lamda expression. Used SQL Server Management Studio extensively for querying the database for additions and modifications Implemented page level error handling using Custom Error pages and Error logs Implemented Code analysis rules and check-in policies for maintaining coding standards. Involved in the Design of the Application using ASP.Net, WCF, Entity Framework, Linq to SQL. Performed Unit Testing, Integration Testing and Regression Testing of the application Actively involved in BugFixing during the build and deployment process and debugging. Responsible to provide system support once the code is migrated to Test, QA or Production environments. Environment: Visual Studio 2008/2010, NET Framework 4.0, VB.NET, C#, ASP.NET, ADO. Net, Web Forms, Object Oriented Programming, UML/Visio, SOAP, Web service, WCF, HTML, XML, Java Script, SQL Server 2008, SSRS, SSIS, Visual Source Safe 7.0, Team Foundation Server., LINQ Accenture, India                                                                                                   Mar 2008 – June 2010 .Net Developer The Website contains a forum which facilitates the users to exchange information related to education, entertainment, recreational activities etc. It allows the user to register for posting and interact with other users in a thread. Responsibilities: Designed and developed front end. Developed user interface using ASP.NET server controls, HTML. Used code-behind files to separate the user interface from the server-side code. Used Java Script for input validations. Configured ASP.NET Web. Config file for the entire web application. Developed WCF services to enable effective communication between SOA. Designed and developed various interfaces, classes to construct the business logic using C#, ADO.NET and XML. Designed and created database objects. Designed the web pages using HTML and CSS Implemented the backend functionality in SQL. Participated in frontend and backend of website design. Developed web forms, User Controls using ASP.NET and Visual Studio.NET Implemented the Backend functionality using MS SQL Server 2005. Used JAVA SCRIPT for the user side validation.  Environment: C#, ASP.NET, HTML, CSS Visual Studio.NET 2008 and SQL Server 2008, Java Script, Oracle, UML. Indian Airlines, India                                                                                             May 2006 – Feb 2008 .Net Developer Cargo Management Systemproject deals with cargo shipment and customer reservations. A bill-to-bill concept was added with receipts and payments processing for CIF customer. In addition to accounting, daily, fortnightly summary reports were submitted showing summary of Stock reports. Responsibilities: Involved in the requirements gathering, analysis, design, code review and development stages Developed Multi –Tier Application in .NET using 3 layers approach. Presentation layer was developed using Win forms, business layer developed using C#, and data access layer developed using ADO.NET in C#. Developed reusable UI widgets such as the navigation menus. Design and developed static and dynamic pages validating Client side and Server side scripts. Used AJAX controls & techniques while designing the Summary page to present data    dynamically and to allow interaction. Worked intensively on User Interface. Developed CSS and involved Master Pages to user interface uniformity. Deployed triggers for e-mail confirmations. Wrote Stored Procedures, Transactions, Triggers and SQL-Statements to access data from SQL Server Database. Environment: C#, ASP.Net, ADO.Net, Web Services, SQL Server 2000, IIS, HTML, CSS, Ajax, Visual Studio 2003, Windows2000.  EDUCATION: Bachelor’s in Technology, India."}