{"text": "Name: elizabeth elizabeth E-Mail: elizabeth.elizabeth@gmail.com Address: Huai’an, China Github: https://github.com/elizabeth LinkedIn: https://linkedin.com/elizabeth Phone No. 271743275654 SUMMARY: A proactive, self-driven IT professional with almost 7 years of experience including Full life cycle of Software Development (SDLC) including Business Requirement Gathering & Analysis, System Study, Application Design, Development, Testing, Implementation, System Maintenance, Support and Documentation. Proficient in Data warehouse design and modeling including, Star and snowflake schema design, Facts and Dimensional modeling. Has a very extensive hands on experience in using various Informatica Power Center components like, Designer, Workflow Manager, Workflow Monitor, Repository manager. Worked extensively with scheduling tools like Cisco Tidal, Autosys, and Informatica Scheduler. Knowledge on OBIEE as a Business Intelligence tool and Data Extraction using Informatica as ETL tool. Worked exclusively with various types of source and target systems like EBS, Flat File (including XML, CSV and DAT), relational data sources like Oracle, and DB2. Worked very well in Performing Unit testing, regression testing, sanity testing, and system integration testing Very extensive knowledge of migration process to different environments and in preparing the migration documents. Worked very closely with deployment team to deploy code in different environments. Has very strong Knowledge of OLTP and OLAP Concepts and very proficient at understanding and usage data warehousing methodologies. Very good at designing and developing complex mappings, mapplets, transformations, workflows, worklets. Expert at Error Handling and Troubleshooting techniques using various methods. Very good at Performance Tuning tasks like, identifying and resolving performance bottlenecks at various levels. Very good team facilitator and good experience in mentoring the other team members wherever necessary. Possess excellent written and oral communication skills with a very good ability to communicate and work with people appropriately in business and technical situations at all levels. TECHNICAL SKILLS: ETL Tools\t\t              : Informatica Power Center 9.5/9.1/8.6/7.1, MDM 8/9. Data Modeling Tools\t\t: Erwin data modeler 3/4 Scheduling Tools\t\t: Cisco Tidal, Autosys, Informatica Scheduler Reporting Tools\t\t: OBIEE 10G RDBMS\t                             : Oracle 11g/10g/9i/8i, SQLServer2005/2008, MS Access RDBMS Utilities\t\t: TOAD, SQL Loader, SQL* PLUS, SQL Developer Operating Systems\t\t: Windows NT/98/95/2000/XP, UNIX (Sun Solaris) Scripting/Programming  Languages\t: SQL, PL/SQL, C, expose to Java/J2EE, Unix Shell scripting PROFESSIONAL EXPERIENCE: Independent Health, Buffalo, NY   \t\t\t\t\t\t       Feb 2017 - Till date Informatica ETL Consultant\t\t\t\t\t\t\t Independent Health is not-for-profit health plan that continually aims to provide our community with innovative health-related products and services, which enable affordable access to quality health care. One of the highest-ranked health plans in the nation for all lines of business – Commercial, Medicare and Medicaid – according to the National Committee for Quality Assurance (NCQA).The main objective of the project is pulling all the information from the different source system and loading in to the oracle database which is the internal warehouse. If any new customer comes adding to the warehouse or existing customer information will be updated from the daily extraction. Responsibilities: Involved in identifying all the Data Models for all the applications. Effectively worked on Healthcare Data Repository. Involved in creating reusable control table driven ETL Architecture. Created Technical Specifications document based on functional specifications. Developed complex ETL mappings that involve parallel processing of multiple instances basing on certain parameters in control table. Created complex Mappings using different Transformations like Filter, Router, Joiner, Connected & Unconnected Lookups, Sorter, Aggregator and Sequence Generator to pipeline data to Data Warehouse. Extracted data from heterogeneous sources like flat files, Oracle, db2 and loading the same into oracle and flat files. Implemented various match and merge rules based on the requirement to generate master data. Created post-sessions and pre-sessions for all the sessions to update the etl_process table which is used to understand the current status of ETLs. Involved in performance tuning on Informatica ETL mappings analyzing them thoroughly. Involved in identifying various bottle necks at different levels (database, mapping, session, and workflow) and came up with solution to improve the performance. Created table partitions for each of the country, operating company and period combination which enables faster retrieval of data. Created Oracle Stored Procedures to implement the ETL Process control logic. Designed Oracle views that generate these extracts for upstream applications and created ETLs to read these views and drop them in a file. Created a model for Audit mechanism and included the Audit counts in each of the ETLs to verify the source and target counts and sums. Identified various extracts needed for upstream reporting applications and planning applications and designed structures for the same. Documented all the ETL and Oracle Procedures developed. Created Unit Test plans for various ETLs developed. Performed Unit Testing and Integration testing for the ETL’s. Reviewed the Code, Design and Test plans as appropriated throughout project lifecycle. Environment: Informatica Power Center 9.5/9.0.1, Oracle 11g, Toad for Oracle, DB2, SQL, PL/SQL, Windows 7/XP, UNIX Guthy-Renker, Pune, India\t                                                                                         July 2015 to Dec 2016 Informatica ETL Consultant\t\t\t\t\t\t\t Guthy-Renker is one of the world #39s largest direct response television companies with sale of nearly $2Billion per year. Originally launched as a television direct marketer but vertically- integrated company has since broadened its focus into every area of electronic retailing, making quality products available to U.S. and international consumers through broadcast television, cable and satellite, as well as internet, telemarketing, direct mail, and retail channels related, emissions tests. Responsibilities: Analyzing business requirements and preparing technical documentation and application process and writing test cases. Working on Designing and Creating tables for new setup database, writing sub routines as per the business requirement. Analyzing and evaluating data sources fields to match the target fields for moving the data from denormalized legacy system to normalized New Setup database. Developed mappings to load the date from different sources like oracle, flat files. Enhancement of existing complex ETL processes to support additional design, development and deployment of new and enhanced ETL processes to production and support new load strategy. Involved in Data loading to staging tables and from staging tables to Target tables i.e. Data loading from Siebel (source) to OBIEE (target) Database. Created variables in Expression transformation to compare current record with the previous record and combine the data for these records based on the same claim numbers Responsible for creating shared and reusable objects in Informatica shared folder and update the objects with the new requirements and changes. Loaded the data in to MDM base objects for generating the master data after the etl process is completed. Used MDM to find out the master data related to the clients associated with more than one product or service. Implemented various match and merge rules based on the requirement to generate master data. Writing UNIX scripts to ftp files, cleaning the data, other required functionalities and place them in the proper source/target directories for processing. Worked on Change Data Capture data sources. Wrote SQL, PL/SQL codes, stored procedures and packages for dropping and re- creating indexes, to generate oracle sequences, procedures that cleans up the base automatically in case the mapping already ran, the procedure that will logically expire existing records and update specific Code, packages to incorporate business rules to sometimes eliminates transformation dependency Improving the SQL query performance, and updating the technical documents. Used FileZilla and WINSCP tool to create and view the parameter files and other source files in UNIX in DEV, Testing and Production Environments. Extensively used pmcmd commands on command prompt and executed Unix Shell scripts to automate workflows and to populate parameter files. Responsible for providing consolidated daily and weekly status reports to the management and team lead. Environment: Informatica Power Center v 8.6/7.1, Oracle 9i/10g, OBIEE, CSV Files, Excel files, SQL,PL/SQL, Autosys, Unix Shell scripting, Windows XP, SQ Developer. Gosys InfoTech. Bangalore, India \t\t\t\t\t\t  July2012 to May 2015 Database PL/SQL Developer The System was responsible for taking in raw data from flat files and Oracle processing those creating invoices for the customer. The Data warehouse was created in Oracle 8i, Informatica was used for ETL and Business Objects was used for Analysis and reporting purposes. The projects aim was to take all required feeds from OLTP system, transform and load the data into a centralized data warehouse. Responsibilities:  Integrating functional knowledge of the client’s Business with technical requirements. Perform database tuning, monitoring, loading and back up. Used SQL LOADER to load data from csv files into Oracle tables. Creating prototype reporting models, specifications, diagrams and charts to provide direction to system programmers. Developed procedures and functions using PL/SQL. Created number of database Triggers according to business rules using PL/SQL. Developed SQL for loading Meta data from Excel spread sheet to the database using SQL LOADER. Extensively used PL/SQL to implement cursors, triggers and packages. Developed SQL script for loading data from existing MS Access tables to Oracle. Create record groups for manipulation of data, Perform unit and system integrated testing. Involved in database design, development of database, tables and views. Provide support during User Acceptance Testing (UAT) of project. Environment:\tOracle 8i, PL/SQL, TOAD, SQL*Loader, MS Access, Excel spread sheet, Windows NT. Education: Bachelor of Technology in Information Technology, Manipal University, India"}