{"text": "Name: emma emma E-Mail: emma.emma@gmail.com Address: Ahmedabad, India Github: https://github.com/emma LinkedIn: https://linkedin.com/emma Phone No. 20548826701 PROFESSIONAL SUMMARY: Over 8 years of experience in delivering enterprise solutions in multiple domains like E-commerce, Finance, Telecom, Insurance, Health and other related domains. Expertise in conceptualizing, designing and coding technical solutions using Java/J2EE and UI technology stacks to satisfy complex business problem statements. Expert in Various Agile methodologies like SCRUM, Test Driven Development(TTD), Incremental and Iteration methodology, Pair Programming, Agile Development &Testing using Software Development Life Cycle. Experienced in Full stack UI technologies using Gruntjs, Gulp Server, Yeoman generator for Angular. Expert level skills on JSON, HTML, DHTML, CSS, Tiles, Tag Libraries and UI frameworks - Twitter Bootstrap, Materialize CSS, jQuery Mobile. Experience with jQuery, Ajax, JavaScript, Nodejs, ReactJs, BackboneJs, AngularJs, Angular 2.x/4.x and Client-side validations. Experienced in Java Web-based, Desktop Based Development with Concepts of Object Oriented Design (OOD), Object Oriented Analysis (OOA), Object Oriented Programming (OOP) and its implementation. Expertise in the implementation of Core Java concepts of Java, J2EE Technologies: JSP, Servlets,JSF, JSTL, EJB transaction implementation (CMP, BMP, Message-Driven Beans),Struts, Spring, Swing, Hibernate,iBatis, Java Beans, JDBC, XML, Web Services, JNDI, Multi-Threading, Data structures. Experience in Spring Modules Spring MVC, AOP, IOC, Spring Boot, Spring Microservices, Spring REST, Spring Eureka, Spring Ribbon, Spring Netflix, Spring Hystrix, Spring Dashboard, Spring Zuul, Spring Security. Experienced in developing web-applications using various design patterns, including session facade, MVC, Data Access Object, Singleton and Factory Pattern. Experience of Bamboo, Atlassian crucible and fisheye, Chef, Vagrant, Gradle script. Proficient in using Amazon Web Services (AWS). Extensive experience focusing on services like EC2, Elastic Beanstalk, CloudWatch, CloudFront, CloudFormation, IAM, S3, RDS, ElastiCache, SNS, SQS, AMI. Experience with Docker containers, leveraging Linux Containers and AMI's to createDocker Images/ containers. Experience with messaging systems like Kafka, Kafka event sourcing. Worked on (JMS) MQ's like Rabbit MQ, IBM MQ and Active MQ. Expertise with employment of Spring Kafka and Zookeeper apart from JMS as messagingservice. Good Working Experience in Apache Frameworks like Apache CXF, Apache Cameland Apache Velocity. Experienced in building Web Services using SOAPandRESTFUL. Expertise in XML technologies such as DTD/Schemas, DOM, SAX, XSLT, XPATH, Castor. Experience in configuring and deploying the applications on Tomcat 5.x/4.x/3/x., GlassFish, WebSphere6.x/5.x/7.0,  WebLogic 9.x/8.x/7.x/6.x, and JBoss Servers. Experienced in developing UNIXshell scripts for batch processing. Experience in database modeling, design and development of PL/SQL stored procedures,packagesin relational databases: Oracle 9i / 10g / 11g, SQL Server 2005/2008, DB2, PostgreSQL and MySQL. Strong experience with MongoDB development (reports, schema design, map reduce functions) and migrations from SQL relational databases to NoSQL databases like MongoDB, Cassandra and CouchDB. Good Experience in software configuration management using CVS, GIT and SVN. Experienced in performing unit testing using JUnit, TestNG, Mockito,integration and deployment of applications using tools such as ANT, Maven, Gradle, Jenkins & debugging through log4jand Splunk. Created Test automation framework using Cucumber and Selenium web driver. Knowledge of writing rules directly in the Drools Rule Language (DRL), and decision table. Expertise on UI testing with Karma, Mocha, Jasmine and Chai. Experience using secure authentication mechanisms like LDAP, SASL and Kerberos v4. Good knowledge on dependency management tools such as NPM and Bower. Developed Interactive graphs using D3.js with JSON data. Knowledge on tools like BigF5, Gomez. TECHNICALSKILLS: PROFESSIONALEXPERIENCE Client: Fidelity Investments, Durham, NC \t\t\t\t\t\t         Feb 2016 – Till Date  Role: Sr.Java Full Stack Developer Description: Fidelity Investments is a multinational financial service. For Worldwide customers E-service online project designed. The Online Reports application to provide customers an online view into their mandatory as well as optional reports. Users can request access to the Online Reports tool including the ability to view/export/print specific mandatory and/or options reports. The Online Reports tool receives and loads reports into eService database. Responsibilities: Involved in various phases of Software Development Life Cycle (SDLC) of the application. Developed applications using Angular2,Java8 and new features of java (lambda expressions). Developed screens using HTML5, CSS3, SASS, JavaScript, jQuery and AJAX. Design and developed the application using framework Angular 2 with HTML5, CSS3 and Typescript. Developed UI components using Angular 2 dependency Injection, Models, data binding and controllers. Implemented Angular 2 Router to enable navigation from one view to another. Used Protractor to perform End to end testing for single page application developed using Angular 2. Developed Application to asses JSON and XML from Restful web service from consumer side using Angular 2. Experience with Responsive Web Design, Bootstrap and Plygrid framework. Developed various generic JavaScript, Angular functions to implement client-side validations. Involved in developing Thread Safe blocks for multithread access and distributed transaction management. Created and injected spring services, controllers and DAOs to achieve dependency injection. Heavily used Spring Inheritance, Auto-wiring, Core Container, Security, AOP,Spring Quartz for scheduling tasks to generate reports and emails to clients.  Developed Persistence layer using Spring Data to interact with the Database.  Used Bamboo as build tool for continuous integration and continuous deployment, and configure the project to build whenever a new code commits in SVN. Developed Spring Restful/Microservices and implemented Spring Restful/Micro Services and implemented Spring Eureka, Netflix, Ribbon as part of Services Discovery using Apache Axis. Implemented Spring MVC flow to interact with different modules and extensively used Spring AOP and Dependency injection during various modules of project. Developed Microservices with Spring Eureka to retrieve API routes for the entire cluster. Using this strategy each Microservice in a cluster can be load balanced and exposed through one API gateway. Used Micro service architecture withSpring Bootbased services interacting through a combination of REST and Apache Kafka message brokers. Implemented Spring Circuit breaker pattern, integrated Hystrixdashboard to monitor Spring micro services. Implemented Authentication & Authorization with Site Minder and Spring security. Implemented REST based web services using JAX-RS annotations, Jersey provider and consumed using HTTPservices from angular 2 modules.  Used Amazon Web Services (AWS) like EC2, S3, cloud watch and Elastic Bean Stalk for code deployment. Writing Entities in Java, Play Framework along with named queries to interact with database. Experience in Updating, Modifying queries in Oracle 11g. Composed and executed MongoDB scripts to insert and update NoSQL database and reporting. Used GWT and Amazon AWS (EC2/S3/EBS) for prototyping and subsequent evaluation. Developed quality code adhering to Scala coding Standards and best practices. Worked with Kafka Cluster using ZooKeeper.Developed Applications using Rule Engines-Jboss Drools 4.x, Work flows, Human tasks to implement Business rules validations. Developed data transformer for converting legacy data from Source tables to avro format and fed into Kafka usingCamel. Worked on creation of custom Docker container images, tagging, pushing images, integration of Spring boot. Created the Docker containers and Docker consoles for managing the application life cycle. Worked with the Node package manager along with Karma, Jasmine, Grunt and Bower for test and build. Smoke Test and Acceptance Testing is performed with Selenium in multiple Java platforms. Worked with the automation team to understand the Selenium scripts and review the code, run the tests and review the results and provide inputs to the team. Used Maven and Jenkins to automate the build and deploy process and Git was used for project management and version management. Environment: Java 8, Spring MVC, Spring Boot, Angular 2, HTML5, CSS3, JSON, JavaScript, Node.js,Spring Data, Protractor, Mongo DB, Oracle 11g, IntelliJ IDEA, Junit 4.4, Bamboo, Mockito, Git, Selenium, Scala, Spark, Drools, AWS, Docker, Spring Cloud, RESTful web services, Apache Tomcat, Apache Kafka, Camel,Maven, Jenkins, Karma, Jasmine. Client:\tArgo Group, Richmond, VA\t\t\t\t\t\t\t         July 2015 – Jan 2016 Role: Sr. Java Full Stack Developer Description: Argo Group is a Bermuda based international underwriter of specialty insurance and reinsurance products in the property and casualty market.Price simulate tool is a web application which is responsible for updating quote price and provides existing user claims information, profile information and account information. Users get their messages from integrated apps and will be visible to them. Responsibilities: Responsible for React UI and architecture. Building components library, including Tree, Slide-View, and Table Grid. Responsible for Building applications using React.js which allowed us to render pages on both the client and server using the same codebase. Implemented React.js code to handle cross browser compatibility issues in Mozella, IE 7, 8, 9, Safari and FF.Used Babel plugin tool for conversion of ECMA versions to support all type of browsers. Developed the flux pattern by using Redux framework as a core dependency. Integrated Redux data store allowing React components to have access to data resulting in highly maintainable code. Used React-Router to turn application into Single Page Application. Used Java-J2EE patterns like Model View Controller (MVC), Business Delegate, Data Transfer Objects, Data Access Objects, factory patterns. Designed and developed the End Points (Controllers), Business Layer, DAO Layer using Hibernate and Spring IOC (Dependency Injection). Extensively used MVC, Factory, Delegate and Singleton design patterns. Developedmicro services architecture using Rest APIs, spring boot and pivotal cloud foundry. Developed REST Web Services clients to consume those Web Services as well other enterprise wide Web Services. Designed and Developed Presentation Tier using Spring MVC and JSP integrating Custom Tags, JSTL, JSP Expression Language and AJAX. Used Hibernate framework for back end development and Spring DI for middle layer development. Used Spring MVC Transaction Management and Hibernate cache concepts.  Modified the Spring Controllers and Services classes to support the introduction of spring framework. Creating Docker containers leveraging existing Linux Containers and AMI's in addition to creating Docker containers from scratch and developing Docker images to support Development, Testing Teams and their pipelines, distributed Jenkins, Selenium and JMeter images, and Elasticsearch, Kibana and Log stash. Installed Pivotal Cloud Foundry (PCF) on EC2 to manage the containers created by PCF.  Used Docker to provide virtualize deployment containers and push the code to EC2 cloud using PCF. Experience in working with big data platform with a combination of Hive MQ, Cassandra and Spark. Worked with high volume and complex PL/SQL stored procedures and packages using TOAD. Experience in data structure design, Data Modelling in Cassandra. Developed JUnit, Chai, Mocha and Gulp test cases for unit, integration, and functional tests.  Ran Log aggregations, website Activity tracking and commit log for distributed system using Apache Kafka. Used Log4j to print logging, debugging, warning and info on server console. Debugged the MAVEN scripts for building entire web application. Implemented Cucumber for behavioral testing of application Developed reusable UI components using ES6, Handlebars and Webpack. Environment: React.js,Node.js, Babel, Redux, Bootstrap, Docker, Jenkins, Pivotal Cloud Foundry (PCF), Docker, Cassandra, JUnit, Chai, Mocha, Gulp, Spring Boot, Spring MVC, Hibernate, Apache Kafka, Log4j, MAVEN, Cucumber, Webpack, Babel. Client: BJC HealthCare, St. Louis, Missouri\t\t\t\t\t\t      Nov 2014 – June 2015 Role: Java/J2EE Developer Description: BJC HealthCare is a non-profit health care organization based in St. Louis, Missouri. This project was initiation of BIG DATA implementation for BJC HealthCare. Data Services provided common platform for all the healthcare applications like HIS, Monitoring, and various kinds of EMR/EHR. Data Services played a key role in defining the data model adhering to the FHIR standards and provided REST based web services for interacting with the defined data mode. Responsibilities: Involved in the design and development phases of Agile Software Development.  Analyzed current Mainframe system and designed new GUI screens.  Developed the application using 3 Tier Architecture i.e. Presentation, Business and Data Integration layers in accordance with the customer/client standards.  Used FileNet for Content Management and for streamlining Business Processes.  Created Responsive Layouts for multiple devices and platforms using foundation framework.  Implemented printable chart report using HTML, CSS,jQueryandJavaScriptfor client-side validation.  Worked on UNIX to move the project into production environment. Created Managed Beans for handling JSF pages and include logic for processing of the data on the page.  Used Object/Relational mapping tool Hibernate to achieve object to database table persistency. Worked with Core Java to develop automated solutions to include web interfaces using HTML, CSS, JavaScript and Web services.  Developed web GUI involving HTML, Java Script under MVC architecture.  Creation of WebLogic domains and setup Admin & Managed servers for JAVA/J2EE applications on Non-Production and Production environments.  Involved in the configuration of Spring Framework and Hibernate mapping tool.   Monitoring WebLogic/JBoss Server health and security.   Creation of Connection Pools, Data Sources in WebLogic console. Implemented Hibernate for Database Transactions on DB2.  Involved in configuring hibernate to access database and retrieve data from the database. Written Web Services (JAX-WS) for external system via SOAP/HTTP call.  Used Log4j framework to log/track application.   Involved in developing SQL queries, stored procedures, and functions.  Creating and updating existing build scripts using ANT for deployment Tested andUsed Rational Clear Case for Version Control.  Environment: FileNet, IBM RAD 6.0, Scala, Java 1.5, JSP, Servlets, Core Java, Spring, Swing, Hibernate, JSF, ICE Faces, Hibernate, HTML, CSS, JavaScript, NodeJs, UNIX, Web Services- SOAP, WAS 6.1, XML, IBM WebSphere 6.1, Rational Clear Case, Log 4j, IBM DB2. Client: T-Mobile, Bakersfield, CA                                                                                                  Sep 2013 – Oct 2014 Role:  Java Developer Description: T-Mobile is a leading Telecom Domain company based in USA. T-Mobile Equipment Installment Program (EIP) team works with clients to help their customers finance their Mobile devices from various available installment plans, introduce new plans and calculate down payment and monthly Installment using Credit Information of an end user. Also helps them Return or Exchange their Mobile Device and upgrade to a new mobile device using jump Upgrade Option.  Responsibilities: Worked as a Java Developer and involved in analysis of requirements, the design, development, integration, deployment and testing. Developed the application under J2EE architecture using JSP,spring, JavaBeans, and iBATIS. Used AJAX in user validation and suggestion list and to display dialog boxes. Involved in preparing the High Level and Detail level design of the system using J2EE. Developed Web Interface using Java Script, HTML and CSS. Involved in the development of model, library, struts and form classes (MVC). Used Spring Framework and created the Dependency injection for the Action classes using ApplicationContext.xml.  Worked on MQ with J2EE technologies on the WebSphere MQ. Used display tag libraries for decoration and used display table for reports and grid designs.  Worked on core java, using file operations to read system file (downloads) and to present on JSP.  Providing fixes to the issues identified in testing phase. Implemented SOA architecture with web services using SOAP and XML. Analyzed, designed and implemented DAO pattern for accessing Database using connection pool. Used PL/SQL stored procedures for applications that needed to execute as part of a scheduling mechanisms. Involved in configuration of XML flat file and parsing the XML file using the SAX Parser. Worked on diverse ways to increase performance of the Application through use of methodologies like asynchronous calls to database, stored procedures in place of Dynamic SQL, etc.  Used Rational Clear Case for version control and JUnit for unit testing. Implemented JReportfor annual report generation with charts. Provided troubleshooting and error handling support in multiple projects. Worked on Reconciliation, which involves in providing root cause analysis and data fixes. Configured Glassfish Application server and deployed the web components. Extensively involved in designing UI, reporting and specification documentation. Responsible for the user module, setting rights and permission to users through the keywords set with database and testing. Environment: JDK1.5, JSP, JSF, Struts, iBATIS, Spring, HTML, JavaScript, AJAX, CSS, XML, EJB, PL/SQL, Glassfish, JUnit, SOAP, SAX Parser. Client: Goldman Sachs, NY                                                                                                                    Sep 2011 – Aug 2013 Role: Software Developer  Description: Goldman Sachs Execution and Clearance (GSEC) Risk technology team is responsible for developing systems for monitoring and managing portfolio risk of the prime brokerage clients in the margin lending business. These provide coverage for both intraday risk using real-time trades and EOD portfolio level risk. Responsibilities: Worked as a Java Developer and involved in analysis,design, development, deployment and testing. Implemented MVC-Model 2 architecture using Struts and other J2EE design patterns for the application development. Used Struts Framework along with JSP, HTML, CSS and JavaScript to construct the dynamic web pages. Designed DTDs, XML Schema for data transmission and XSL style-sheets. Adopted J2EE design patterns like Singleton and used DTO’s transfer the data. Designed, developed and maintained the data layer using the ORM frame work called Hibernate. Involved in the development of SQL queries to get data from MySQL. Used ANT for building and deploying NBT application to servers. Extensively worked on Object Oriented Programming aspect of Java using JDK1.5 for collections along with comparator, Multithreading, thread synchronization. Used Hibernate to persist the Data into the Database. Used Maven build script for building and deploying Bluestone application. Using Eclipse IDE for bluestone application development of Java related classes and components. Involved in Agile development process. Deployed the application on Tomcat 6/5.5 and used shell scripting for maintaining servers. Production supported after release. Used Mercurial Version Control. Worked with offshore and ensuring on time delivery of deliverables. Deployed the NBT application in WebLogic, Tomcat servers on Solaris and Windows environments. Developed Unit Tests and Test Suites using JUnit.  Environment: java1.6, Struts2.0, Spring2.5, JSP 2.0, Ajax, XML, HTML, ANT, CSS, JavaScript, JBuilder, custom JSP tags, JSTL, Mercurial, FTP, UNIX (AIX), Hibernate3, MySQL, WebLogic, Continuum, Tomcat6.0/ 5.5, Windows XP. Client:\tBrainWorks IT Solutions., India\t\t\t\t\t\t                     July 2010 – Aug 2011 Role: Jr. Java/J2EE Developer Description: An application is developed to automate the Sales Order Transactions of company. This application keeps track of the information pertaining to the sales transactions such as Customer details, Product or Item description and their Pricing Schedule, Purchase Order details and View and Enquiry of the Order Screens. Designed and developed the Order Processing Module. Involved in the design and coding of this module. The system checks the database for availability and an invoice is prepared. Responsibilities: Developed PL/SQL queries to generate reports based on client requirements.  Developed Servlets and Java Server Pages (JSP).  Enhancement of the System according to the customer requirements. Created test case scenarios for Functional Testing. Used Java Script validation in JSP pages. Helped design the database tables for optimal storage of data. Coded JDBC calls in the servlets to access the Oracle database tables. Responsible for Integration, unittesting, systemtesting and stress testing for all the phases of project. Prepared final guideline document that would serve as a tutorial for the users of this application.  Environment: Java, Servlets, J2EE, JDBC, PL/SQL, HTML, JSP, Eclipse, UNIX."}