{"text": "Name: alice alice E-Mail: alice.alice@gmail.com Address: Kinshasa, Congo (Kinshasa) Github: https://github.com/alice LinkedIn: https://linkedin.com/alice Phone No. 185250233337 PROFESSIONAL SUMMARY: Over 8 years of experience in analysis, design, implementation and testing of Object Oriented Applications in Client/Server environments using Java/J2EE and front-end technology stack. Experience working with various methodologies based on Agile, Scrum, Waterfall Model, TDD, Iterations. Expertise in Object Oriented and Multi-threaded/Concurrent Programming using Java/J2EE related technologies. Experienced in front End technologies such as HTML 5, CSS 3, JQuery, JavaScript, ReactJs, NodeJs, AngularJS, ExtJS, BackboneJS, Bootstrap, VBScript, Perl, AJAX, JSON, XSD, XSTL, Tiles, Tag Libraries.  Experienced in Middleware persistence framework like Hibernate/JPA, JDBC, iBatis for mapping Java POJO classes/Objects with database and using Hibernate Query Language (HQL).  Experienced in Full stack front end technologies using Grunt js, Glup Server, Yoman generator for Angular. Experienced in Client-side validation, Client-Server data interaction using Ajax in Nodejs. Experience in developing Mobile web applications using JQuery Mobile and phonegap for Smartphones & Tablets. Experience in working with Service Oriented Architecture(SOA) which includes Universal Description and Discovery Integration (UDDI) lookups and WSDL, JAX-WS and JAX-RS using res protocol. Extensively used different Tag Libraries like JSF Tags, Struts Tags, JSTL, Spring Tags, DisplayTag, XML/XSD. Experienced in frameworks: Spring MVC, Jakarta struts framework, JSF, spring and Hibernate. Strong experience in Spring Framework modules such as Spring MVC, Spring IOC, Spring AOP and Spring Heroku, Spring Integration, Spring Security, Spring Boot, Spring Netflix, Spring Zuul with Thymeleaf. Good experienced in building service-oriented solutions and RESTful Microservices. Developed applications using latest technologies like EJB3.0, Spring2.x/3.x/4.x, Hibernate3.2/4.x, and REST based Web services (axis2.0, JAX WS 2.0), Rule Engines (Drools4.1, ILOG), XML API and tools. Experience in implementing Java EE design patterns such as MVC, Singleton, Factory, Session Facade, DAO, DTO, Command and Business Delegate in the development of Multi-Tier distributed Enterprise Applications. Experience in configuring and deploying the applications on Tomcat, WebSphere, WebLogic and JBoss Servers. Good Experience in designing Java, J2EE applications using Amazon Web Services and have good knowledge of AWS services like EC2, S3, Elastic Beanstalk, ELB, VPC, Direct Connect, Route53, SNS, SQS, Cloud Watch. Experience in making the devops pipelines using OpenShift and Kubernetes for the Microservices Architecture. Experienced in working with multiple databases like Oracle 10g/11g/12c, SQL Server, MySQL, DB2, NOSQL DB like Mongo DB, Cassandra and written complex SQL queries, procedures, Triggers and Stored procedures. Experience in debugging and logging using the log framework - log4j and analysis and reporting with Splunk. Experienced in application build tools like ANT, Maven, Jenkins, Kubernetes and Docker.  Strong experience in TDD, using the JUnit frame work with Mockito, Power Mockito & SpringJunitRunner. Good experience in unit testing using Karma, Jasmine and JUnit, Automated Testing Selenium (IDE/Web driver), Integration testing using Selenium, Hudson, Jenkins and Apache Camel. Experienced in development, testing and deployment of enterprise applications on Windows & UNIX platforms using IDE's such as Eclipse, Rational Application Developer (RAD), Netbeans, Spring Tool Suite (STS), Intellij. Experience in using version controlling/tracking systems Subversion, CVS, SVN, GIT, and Rational Clear Case. Having knowledge on (JMS) MQ's like Kafka, Rabbit MQ, IBM MQ and Active MQ. TECHNICAL SKILLS: \t\t\t  WORK EXPERIENCE: Client:\tCVS Health, Buffalo Grove, IL\t\t\t\t\t\t\t     Dec 2017 - till date Role: Sr. Java/J2EE Developer Responsibilities: Involved in JAD sessions with clients for gathering the requirements and involved in Analysis meetings and designed components for the project based on requirement, followed Waterfall and Agile methodologies.  Developed user interfaces using Angular 4, HTML, DHTML, JavaScript and CSS.  With Angular 4, was able to develop SPA's with high SEO and Debugging made easier with use of Source maps. Used Angular 4 new feature View Engine which can have less code of components and reduced bundles. Implemented module wide routing in the application using Angular router and also created various Route guards. Developed the application under J2EE Architecture using Spring, Hibernate, Servlets, Web logic and JSP. Spring Boot Microservices were developed with microservice architecture using REST and Apache Kafka. Developed Open stack API to Integrate with Amazon EC2 cloud based architecture in AWS, including creating machine Images. Used AWS Lambda to run the code in the AWS (Amazon Web Services) and Deployed Spring Boot based micro services Docker container using Amazon EC2 container services and using AWS admin console.  Designed & developed webservices in MVC pattern spring framework and used Apache Tomcat for the deployments.  Involved in doing the process Documentations and also audit compliance on UNIX and Linux servers. Implemented Continuous Delivery pipeline with Docker, Jenkins and GitHub, whenever a new GitHub branch gets started. Jenkins, our Continuous Integration server, automatically attempts to build a new Docker container from it. Utilized Kubernetes and Docker for the runtime environment of the CI/CD system to build, test deploy. Moving data in and out of an instance using import sets and transform maps and also auto import of data into service now. Integration of service now with LDAP for authentication. Worked closely with QA team and fixed QA bugs as well as production issues with a quick turnaround time. Developed unit test cases using Mockito and Power Mockito framework for testing accuracy of code. Created stored procedures to extract data from various data sources like Flat Files, XML Files and SQL server. Efficiently handled periodic exporting of SQL data into Elasticsearch. Modified SQL, PL/SQL procedures and triggers to obtain optimize output and also worked with Cassandra. Highly used MQ Visual Edit and MQ Visual Utility tools for connecting to remote queue managers.  Involved in Migrating the project from Ant to Maven build tool to achieve more functionality for build process. Used Dimensions and GitLab as version management, JIRA for defect management system and IDE as Eclipse. Environment: Java 8.0, Spring 4, Hibernate, JavaScript, Angular 4.0, HTML 5.0, CSS3, Jenkins, Apache Tomcat, log4j, Mockito, Power Mockito, XML, SQL Server, Cassandra, Maven, Eclipse, MQ Visual Utility, MQ Visual Edit. Client:\tChange Healthcare, Nashville, TN\t\t\t\t\t\t\t   Aug 2016 – Dec 2017 Role: Sr. Java & Web Developer Responsibilities: Implemented the Model View Controller (MVC) framework and worked on Spring Quartz functionality for scheduling tasks such as generating monthly reports for customers and sending those mails about different policies. Designed RESTful webservices for transferring XML data between two interfaces and for handling AJAX requests. Designed and developed the UI using spring view component HTML 5, CSS 3, Bootstrap and AngularJS 2.0. Used Angular Promise, Angular Custom directives, Angular custom services, Angular to REST to Spring calls Used Spring validator framework for client and server-side validation, used Spring and Hibernate for implementing IOC, AOP and ORM for back end tiers and developed DAO interfaces using Hibernate to interact with database.   Used a Microservice architecture with Spring Boot through REST and Apache Kafka message brokers. Developed Micro services using Spring MVC, Spring Boot, Spring AOP, Dependency Injection. Implemented Authentication & Authorization with Site Minder and Spring security integration, certificates. Developing the Python APIs which represent the memory subsystem. Used gulp and lower components Gulp-to bundle whole application for Jenkins deploy. Developed Applications using Rule Engines, Drools, ILOG with corresponding to validate the business User roles.  Updating status report daily basis and weekly basis by conducting meetings with QA team. Utilized pair programming approach to ensure high quality code and Involved in production deployment and support activities of the system and Coordinated with various teams including offshore support teams.  Installed Pivotal Cloud Foundry (PCF) on EC2 to manage the containers created by PCF and used Docker to virtualize deployment containers and push the code to EC2 cloud using Pivotal Cloud Foundry. Used Multi-Threading and concurrency and implemented threads while preparing and generating mails.  Performed deployment of applications on WebSphere Application Server (WAS) and tested Service and data access tier using TestNG and performed UI testing and front-end testing using Selenium. Responsible for Configuring Kafka Consumer and Producer metrics to visualize the Kafka System performance. Migrated existing modules in Active MQ to Kafka. Used DB Connect APP to load data from Mongo DB. Used GIT as version management, JIRA for defect management system, Maven as build tool.  Environment: Java 8.0, Spring 4, Hibernate 4.2, Spring batch/security/Boot, JavaScript, AngularJS 2.0, Jenkins, HTML 5.0, CSS3, WAS 8.5, Eclipse, Mongo DB, log4j, TestNG, XML, SQL Server, Kafka, Scala, Selenium. Client: State of Tennessee(Deptt Of Healthcare), Nashville, TN\t\t\t\t June 2015 – July 2016 Role: Sr. Java Full Stack Developer Responsibilities:  As a Java developer involved in back-end and front-end developing team. Took part in developing, maintaining, reviewing and supporting quality code and involved in daily SCRUM meetings and weekly SPRINT Meetings. Worked on Security-System development for Web Applications. Integrated application with Spring Security for form-based authentication and authorization by used spring security jsp tags to provide UI level spring security. Implemented Dynamic job scheduling according to the business need (daily, weekly, monthly etc.) same using Quartz scheduler and developed Spring Quartz jobs to run the backend jobs and generated reports. All the functionality is implemented using Spring IO / Spring Boot, Thymeleaf and Hibernate ORM. Implemented Java EE components using Spring MVC, IOC, Spring transactions and Spring security modules. Implementing or exposing the Micro services to base on RESTful API utilizing Spring Boot with Spring MVC. Implemented the application using design patterns such as Session Facade, Singleton, and Data Access Object. Implemented and developed UI components using Angular JS features like dependency Injection, Models, data binding and controllers and developed test cases for Angular JS using karma and grunt. Created Stacks using Amazon Cloud Formation templates to launch AWS Infrastructure and resources.  Developed Interactive web pages using HTML, CSS and JavaScript and developed various screens for the front end using Angular 2.0 and used various predefined components from NPM (Node Package Manager). With the concept of ReactJs worked on usage metrics and end to end events tracing for analysis purpose. Used JMS for reliable and asynchronous exchange of important information such as payment status report.  Worked with JAXB and XML Schema for exporting data into XML format and importing data from XML format to data base and JAXB in the web service's request response data marshalling as well as unmarshalling process.  Used PL/SQL stored procedures for applications that needed to execute as part of a scheduling mechanisms. Used Java Multi-threading part in back-end component, one thread will be running for each user which serves that user and multi-threading was also used to process data in chunks to improve performance.  Utilized Hibernate for Object/Relational Mapping (ORM) purposes for persistence onto the Oracle database.  Deployed applications into JBoss Server. Worked with Jenkins Continuous Integration tool and Build Tool Ant. Used Bitbucket as version management & used JUnit for unit testing of the application and log4j for logging.  Environment: Java 7.0, Spring 3, Hibernate 4.2, Spring batch/quartz/security/Jta, Spring Boot, JPA, Java Scripts, Jenkins, AngularJS 2.0, ReactJS, HTML 5.0, CSS3, JMS, JBoss, Eclipse, Oracle 12c, RESTful, AWS, log4j, Junit, XML, Bitbucket. Client: Southwest Airlines, Orlando, FL\t   \t\t\t\t   \t\tJune 2013 - May 2015 Role: Java/J2EE Developer   Responsibilities:  Worked on Agile Scrum methodology and involved in daily stand-up meetings to monitor the progress. Interacted with Managers & Business users for performance issues, discussed about key Aspects based on requirements and its relational mapping to the application with users.  Developed Application using Spring MVC with Spring IOC, annotations, integrated with Struts 3 frame work with views based on JSP. Involved in coding for the presentation layer using JQuery Mobile, NodeJs, JavaScript. Used core java concepts such as Multi-Threading, Collections, and Exception handling. Worked extensively on Core Java, low latency side using Java Concurrency on the back-end of the application. Involved in coding for the presentation layer using JQuery, JQuery Mobile, NodeJs, JavaScript. Developed the application using industry standard design patterns like Singleton, Business Delegate, MVC, and Factory Pattern etc. Involved in developing Single page applications using NodeJs, WEBPACK (ES6). Developed a dashboard based on Ajax calls with Business Customers Count, Flags, Real-time graphs for Analytical Reporting using NodeJS. Involved in presentation layer frameworks using JQuery widgets. Implemented application using design patterns such as Session Facade, Bean Factory and Singleton.  Utilized MEAN stack, REST design pattern, MVC framework and Single Page Application framework based on Node JS. Transaction management is done by JTA API specification by implementing them. Utilized XML and XSLT for dynamic web-content and database connectivity. Implemented Map-reduce functionality in MongoDB to maintain customer order tracking. Involved in fixing bugs or defects in the application. Developed Junits using Mockito and SpringJunitRunner frame work. Used version control repository SVN. Used JIRA for issue tracking. Used Maven as a build tool and retrieved all dependencies required for application.    Environment: Core Java, Spring MVC 3, Spring integration, Spring JDBC, Struts 3, JMS, JIRA, NodeJs, JQuery, JQuery Mobile, Java script, HTML, CSS, Apache Tomcat 7.0, Restful, Eclipse, Mongo DB, Oracle 11g, Maven, Drools, Mockito, Junit, SVN. Client: CNSI, Lansing, MI\t\t\t\t   \t\t\t         \t          March 2012 – June 2013 Role: Java/J2EE Developer Responsibilities:   Involved in various SDLC phases like Requirement gathering, Design, Analysis and Code development and the project was developed using Agile based SCRUM Methodology.  Successfully executing offshore modeling by effective and on time knowledge sharing with offshore project groups through weekly team meetings and daily status update calls. Developed user-friendly web-based GUI using AngularJS, JavaScript, CSS, HTML, and NodeJS.  Implemented Struts Framework and Hibernate in the new version of the Application and used Validation framework.  Used EJB Stateless/Stateful session beans to implement business logic, session handling, and transaction and deployed Enterprise Java Beans both Session and Entity on WebSphere Application Server.  Implement modules into NodeJS to integrate with designs and requirements and developed real time tracking of class schedules using NodeJS. Developed the UNIX shell scripts to automate jobs. Used Command Query Responsibility Segregation CQRS and direct calls to PL/SQL stored procedures while accessing Oracle Database. Used Java Messaging Service for asynchronous exchange of message by applications on different platforms. Extensively used Java Scripts to enforce client-side validations and used JQuery for Ajax processing.  Involved in unit testing, troubleshooting, debugging and modifying existing programs with enhancements. Used JDBC to connect to backend database MySQL. Worked on Linux environment for deploying the application, running scripts for jobs. Involved in fixing bugs the bugs or defects in the application.    Environment: Jakarta Struts Framework 2.0, Core Java, Hibernate 3.0, EJB, Web Services, CSS, NodeJs, Eclipse, CVS, Apache Tomcat, JUnit, UNIX, JavaScript, Servlets, JSP, JDBC, jQuery, MySQL. Client: Key Bank, Cleveland, OH \t\t\t            \t\t \t    \t\t     Nov 2010 – Feb 2012 Role: Java Developer    Responsibilities:  Developed the presentation screens by using JSP, HTML, CSS and JavaScript.  Implemented MVC architecture and developed Form classes, Action Classes for entire app using Struts Framework.  Performed client-side validations using JavaScript and server-side validations using in built Struts Validation. Implemented data persistence functionality of application by using Hibernate to persist java objects to relational DB.  Used Hibernate Annotations to reduce time at the configuration level and accessed Annotated bean from Hibernate DAO layer. Used HQL statements and procedures to fetch the data from the database.  Transformed, Navigated and Formatted XML documents using XSL, XSLT.  Used JMS for asynchronous exchange of message by applications on different platforms. Developed the view components using JSP, HTML, Struts Logic tags and Struts tag libraries.  Involved in designing and implementation of design patterns such as Session Facade, Business Delegate, Adaptor, Command, Service Locator patterns to delegate request to appropriate resources.  Involved in developing SQL queries, stored procedures, and functions. Creation of database objects like tables, views using oracle tools like Toad, and SQL* plus. Involved in writing Stored Procedure in using PL/SQL.  Worked on Linux environment for jobs scheduling for Inbound data on monthly basis.  Developed JUnit test case using Mockito Framework for performing Unit testing of the application. Deployed application in WebSphere Application Server and developed using Rational Application Developer RAD.    Environment: Struts 2.0, Hibernate 3.0, JSP, RAD, JMS, CVS, JavaScript, XSL, XSLT, Servlets 2.5, WebSphere Application Server 6.1, Oracle 10g. Client: Info Edge Solutions, Hyderabad, India \t\t\t\t\t\t June 2009 – Sep 2010 Role: Java Developer  Responsibilities:  Designed Use Case and Sequence Diagrams according to UML standard using Rational Rose. Extensively used XML documents with XSLT and CSS to translate it to HTML to present to GUI. Developed Session beans for functionality as per the requirement. Used Spring MVC framework for implementing the Web tier of the application. Used Hibernate API to perform database operations. Used Design patterns like MVC pattern, DAO pattern, and singleton to achieve clean separation of layers.  Used Hibernate API to perform database operations. Worked on Hibernate persistence tier. This involves developing mapping files and Hibernate (POJOs/ DAOs). Used Lo4j debugging tool to monitor the Error Logs. Involved in developing SQL queries, stored procedures, and functions.   Developed Custom tag libraries to separate presentation and processing logic and prepared Unit test cases for existing functionality as per the requirement and also involved in the Integration testing support and involved in bug fixing.  Responsible for writing detail design documents and class diagrams and sequence diagrams. Involved in tracking and resolving Production issues.  Environment: Servlets 2.5, JSP 2.1, Spring, JDBC, JavaScript, HTML, PL/SQL, SVN, Hibernate 3.0, WebLogic, Oracle."}