{"text": "Name: hazel hazel E-Mail: hazel.hazel@gmail.com Address: Nanjing, China Github: https://github.com/hazel LinkedIn: https://linkedin.com/hazel Phone No. 456913396534 SUMMARY Experienced Software Engineer with a demonstrated history of working in the higher IT industry for about 7 years with strong experience in Analysis, Design, Development, Testing, Review and Deployment Working Knowledge and experience in Implementation of Multi-Tier distributed applications in technologies like Core Java, J2EE (JSP, Servlets), Springs, Hibernate, JDBC, XML, JSON, Web Services and Design Patterns Proficient in all phases of SDLC and highly competent in Gathering user requirements and converting them into software requirement specifications using UML, Design Patterns, Object Oriented Methodologies (OOP) Experience working with Agile/Scrum and waterfall development methodologies Expertise in Core Java with strong understanding and working knowledge in Object Oriented Concepts like Collections, Multithreading, Data Structures, Algorithms, Exception Handling and Polymorphism Hands on expertise in designing, developing and deploying applications using J2EE technologies including JSP, Servlets, EJB, JSTL, Struts, Spring, AJAX, JDBC, JNDI, Java Beans, Hibernate, RAD, Web Services and RDBMS Good Experience in implementing several object-oriented design patterns such as FAÇADE, SINGLETON, FACTORY, Spring Framework that uses features of IOC, Spring MVC, Spring Boot, Spring JDBC, Spring Batch, Spring Security and AOP features. Developed code in Java, J2EE, Webwork and Hibernate using XP Practices Pair Programming, TDD, Continuous Integration . Expertise in coding optimized SQL queries on databases like Oracle and MySQL Hands-on experience in designing and implementing high performance distributed cache memory management systems like HazelCast and enCache. Strong front-end GUI wire-framing/prototyping skills using scripting languages like JSP, HTML5, XHTML, jQuery, JavaScript, AJAX, DOM and Cascading Style Sheets (CSS) Hands on experience in TypeScript, Angular JS, Vue JS, Node JS and UNIX Shell Scripting IDEs for development – IntelliJ IDEA, and Eclipse Good Working Knowledge of Ant/Maven for project build/test/deployment, Log4j for logging, JACOCO for code coverage and Junit4 for unit and integration testing. Adopted agile methodology with pair programming technique and addressed issues during system testing. Experience on different OS like UNIX, Linux, and Windows operating systems Excellent skills in programming using wide variety of languages and ability to adapt new latest technologies & work in Multi-platform environment Has the motivation to take independent responsibility and be a productive team member, accompanying a strong programming and analytical background Good verbal and analytical skills WORK EXPERIENCE        Harvest Trading Group, Norwell, MA                \t\t\t\t\t                  Sep 2017 - Present        Software Development Engineer Involved in SDLC Requirements gathering, Analysis, Design, Development and Testing of application using AGILE methodology  Applying experience with across multiple architectures and collaborating with business colleagues to bridge technology requirements with business needs. Interfacing with business product leaders to gather requirements  Implemented Multithreading in application using Sprihazeng threading and Async features to consume data from multiple provides simultaneously to improve application performance. Developed Web Service which performs payment processing, credit evaluation, authorize merchants and generate summary reports. Configured, tuned and maintained MySQL Server database servers. Advised core team to develop new marketing strategies to improve the sales and business performances with reduced cost and using existing services Generate UI mockups from paper-and-pencil concepts to high-fidelity prototypes that convey the interaction model using HTML5, JavaScript and CSS Involved in the configuration of Struts and Hibernate into a spring application and used Spring DAO support to build Hibernate DAO classes. Worked on Oauth2 for authentication payment gateway service. Responsibilities include estimation and development of new modules using the AGILE process and pair programming using the divide and conquer method of breaking down a chunk of requirements into piecemeal stories and breaking each major release into iteration. Developed JSP pages for presentation layer (UI) using Struts with client-side validations using Struts Validator framework/ JavaScript Involved in developing the Controller framework using Annotated REST based spring controller. Development of HazelCast low latency volume curve cache, used to calculate the intraday cash balance Administrating Inventory management and data analysis on the product through MWS and Amazon seller account Developing, integrating, testing & delivery of web applications following complete software development life cycle Support of products liquidity analytics and collaborating with cross functional teams Analyzing existing software implementation to identify areas of improvement and adding new features Maintaining IBM server’s EXTOl/VAI applications for B2B EDI and identifying error or validating logs on a daily basis Designed and Implemented Unit testing using JUNIT Framework Successfully executed all the test cases and fixed issues identified during the test cycles Environment:  Core Java, Java, J2EE, Multithreading, Hibernate, Hazelcast, Struts, React JS, JavaScript, AJAX, CSS, HTML5, JSP, jQuery, JDBC, SpringMVC, Web Services (SOAP/REST), SQL, Servlets, ANT/Maven, Shell Script, CSV, JSON.         Tamago-DB, Boston, MA                               \t\t\t\t\t\t\t          Sep 2016 - Aug 2017         Software Engineer Developed and optimized existing Tamago-DB application and improved its performance up to 30% using front end optimization tools and plugins Managing/Troubleshooting MySQL 5.0.22 and 5.1.24 in production and developer environments on both Linux (5.0, 5.1) and Mac OS X. Designed and developed the application using Agile methodology and followed TDD, Scrum, pair programming. Designed API platform to provide GMap API services (REST), integrated with vue.js and Symfony bundle  Created SQL queries, functions for database layer by studying the required business objects and validating them with Stored Procedures using Doctrine ORM. Followed Agile Methodology Collaborated with a diverse group in a fast-paced, team-oriented and rapidly changing work environment  MassHousing, Boston, MA                  \t\t\t\t\t\t                         Jan 2015 - Aug 2016 Machine Learning engineer Achieved 75% accuracy on test data which predicted the financial letter grade of future for MassHousing using Supervised learning Algorithm Implemented stochastic gradient descent (SGD) approach with a 3-layered Feed Forward neural network using python libraries  Used statistical analysis to identify insights and conclusions from complex data Used data in form of excel and normalized it using Minmax normalization Bolas Intelli Solutions (Pvt) LTD, India            \t \t\t\t\t\t         Aug 2011 – Dec 2015 Java/J2EE Engineer Responsible for overall design & analysis of components and integration with JAVA Involved in the complete Software Development Life Cycle including Requirement Analysis, Design, Implementation, Testing and Maintenance Involved in system design and development in core java using Collections, multi-threading and exception handling. Used multi-threading architecture to improve speed of application and to design thread safe environments Deliver new and complex high quality and quick solutions to clients in response to varying business requirements Designed and implemented customized exception handling to handle the exceptions in the application Used Struts Validation Framework for form input validation augmented by struts validator XML config files Involved in developing code for obtaining bean references in spring framework using Dependency Injection (DI) or Inversion of Control (IOC) using annotations Used Spring validation and wrote validation rules Primarily focused on the spring components such as Dispatcher Servlets, Controllers, Model and View Objects Designed, developed Content Management Systems (CMS) using recursive algorithms to dynamically change the data and UX of the applications Developed data-driven responsive applications that interact and provide information to various users Designed wireframes and used HTML and CSS to implement 100%-pixel perfect UI designs Agile Methodologies, Organizational and multitasking skills helped rapid deployment of projects which consequently improved customer satisfaction and increased projected growth rate  Designing the front end using JSP, jQuery, CSS and HTML5 as per the requirements that are provided Used Hibernate, Object/Relational-Mapping (ORM) solution, technique of mapping data representation from MVC model to Oracle Relational data model with a SQL-based schema Developed Hibernate DAO classes and with the spring frame work manager classes retrieve and save the data from the database Designed and developed components for order entry using EJB with a Java Swing client application Implemented Web Services to send order details to downstream systems using Jax-Rpc, SOAP Implemented log4j for logging purposes and debug the application Prepared Junit test cases and executed the test cases using Junit in eclipse Environment:  Core Java, J2EE, Hibernate, Struts, Spring, Servlets, Multithreading, Web Services, JavaScript, CSS, JQuery, EJB, JSON, HTML5, Angular JS, Eclipse IDE, Oracle, PL/SQL, XML, Windows SKILLS EDUCATION PROJECTS"}