{"text": "Name: katherine katherine E-Mail: katherine.katherine@gmail.com Address: Kunming, China Github: https://github.com/katherine LinkedIn: https://linkedin.com/katherine Phone No. 20046755289 PROFESSIONAL SUMMARY Over all 8 years of IT experience in Analysis, Design, Development, Testing and Deployment of various enterprise web application using Java/ J2EE Technologies and Frameworks like Spring, Hibernate and Big Data technologies like Hadoop, SPARK. Involved in all the phases of Software Development Life Cycle including Analysis, Design, Development, Integration and Implementation using Waterfall and Agile Methodologies. Proficient in using Java, J2EE Standards, JSP, Servlets, Java Beans, RMI, Web Services, SOAP, WSDL, JAXB, UDDI, XML, Java Script and DHTML technologies. Hands-on experience in using J2EE frameworks: Spring (MVC/ DI/ AOP), Spring Templates (Hibernate, JMS, Spring Restful), Spring Dynamic Module, Spring Boot, Hibernate, Web Services (AXIS & Jersey) Proficient in Service Oriented Architecture and related technologies: (SOA), SOAP,  AXIS, SOAP UI, Postman, JSON and XML Technologies. Expertise in Creating & Consuming Web Services, related technologies, Frameworks & Tools: SOAP, Restful, WSDL, UDDI, AXIS and Jersey Frameworks Experienced with frontend technologies like HTML, XHTML, CSS, JavaScript, jQuery and AJAX. In depth understanding of BigData framework Hadoop and hands on experience on its various components such as HDFS and MapReduce concepts.  Expertise in Pig Scripts, Hive Queries and efficient in using Hbase. Knowledge on working of Sqoop, Flume, Kafka and Zookeeper on Hadoop.  Hands on experience on both Python & Scala in developing analytical components in SPARK and knowledge on SPARK SQL, SPARK Streaming and SPARK Mllib. Experience on Amazon Web Services AWS in using EC2, EMR, S3, RedShift and DynamoDB. Experience in deploying business applications using application Servers IBM Web Sphere, Web Logic, JBoss and Apache Tomcat and resolving Build Issues and verifying Log4j and Server logs. Proficient in IDEs & Java Tools such as Eclipse, OEPE, RAD and Spring Source. Expertise in designing applications using J2EE design patterns like Singleton, Factory Methods, Service Locator, Adaptor, Business Delegate Hands on experience in developing UML Diagrams like Class, Use case & Sequence diagrams. Experience with unit testing using Junit and knowledge of ANT and Log4j tools. Deploying the J2EE applications to Application Servers using Ant, Maven and Shell Scripts for creating Build Scripts. Good knowledge in version control system tools like CVS, SVN and GIT. Experience in using Oracle and DB2 databases and writing SQL queries. Experience in working in an Onsite/Offshore delivery model. Penchant to learn things, Good communication skills, Hardworking and adaptable, quick learning, Self-motivated, precise and dedicated. Ability to manage scope, and project resources. Mentor and develop technical staff. TECHNICAL SKILLS PROFESSIONAL EXPERIENCE Well Point, Woodland Hills, CA\t\t\t\t                                                    March 2014 – Till Date Java/J2EE Developer\t\t\t\t Project Description: Anthem Insurance provides Enhanced Personal Health Care Program and new service offers Members Quality and Cost Guidance, Health Care Reform Updates and Notification, Information about Health Insurance Exchanges and also it includes generating the recommendations on Insurance to the members. The system has been developed using J2EE Technologies with Spring Frame Work, Web Services and Hibernate Technologies & deployed on Tomact Application Server on Linux Platform. Responsibilities: Worked in AGILE Methodology and involved in the project discussions.  Responsible for designing, developing, and implementing J2EE applications using Spring framework, RESTful Services and  Hibernate Framework Developed Spring Controllers, Service Components, DAOs, Web Services and UI Integration for processing the member request for two modules.  Used Spring MVC Framework Dependency Injection for integrating various Java Components. Developed and consumed RESTful web services using Jersey Frameworks. Integrated the Spring framework with Hibernate ORM tool to access the database. Developed the DAO layer using the hibernate annotations and configuration files. Worked on Oracle and MongoDB databases as backend.  Worked on Hadoop eco system components HDFS, MapReduce, Hive, Pig, Sqoop, Flume, Hbase & Zookeeper. Handled importing of data from various data sources, performed transformations using MapReduce, Pig, Spark and loaded data into HDFS.  Configured EC2 cluster on AWS to run Spark jobs and written python scripts to run jobs on AWS. Used the Log4j framework to log the application errors to the error logs. Used Maven to build and involved with the build team to integrate the code for Continuous Integration(CI) using Jenkins.  Used GIT version controlling to maintain project versions Developed JUnit for Unit Testing and Mockito as Mocking framework. Worked with the business team for the project requirement review & User Acceptance Testing. Used JAXB for parsing auditing information in xml format. Used SPLUNK to search and reviews the logs information while working on the incidents Analyzed web applications, documented detail Test plans, Test cases and expected results based on the business functional requirements. Environment: Agile, Rally,  GIT, Tomcat Application Server 7, JAVA 1.7, Spring 3.x, Spring MVC/ DI/ AOP/ Templates, Hibernate 4.0, Web Services,  RESTFUL  Services, Jersey, JDBC, Oracle 10,  HQL, PL/SQL, JSTL, Spring Tags, JSP, CSS, AJAX,  ANT, Maven, Jenkin, UML, SPLUNK, Eclipse, Linux/Unix, MongoDB, SPARK, Hadoop(Map-Reduce, HBase, Navigator, Oozie), AWS(EC2, S3, EMR) Aeropostale.Inc, NY\t\t\t\t\t\t\t                           Oct 2012 – Feb 2014 Java/J2EE Developer Project description: Aeropostale’s stores are lacking in visibility on inbound shipments and cannot track products which are currently in transit until trailers are sorted at a pool point. The automated Stores Visibility & Line Haul Log system will provide stores a view of inbound shipments as well as a visibility into the details of the shipments.  This system will provide the transportation department an automated method for creating and maintaining the Line Haul Log and streamline the communication process to the pool point to schedule the sorting of trailers. Responsibilities: Worked on various new enhancements on the system that involved requirements analysis, designing the solution, development and implementation.  Followed Agile Methodology for application development. Responsible for designing, developing, and implementing J2EE applications using Spring frame work, SOAP Services and Hibernate Framework. Used JSP, Java Script and jQuery for front end development.  Used Axis2, Jersey to developing and consuming Web services.  Developed Hibernate for developing service persistence layer. Imported data into Hadoop file system from RDBMS using Sqoop. Written Map-Reduce jobs to process the data on Hadoop HDFS. Consumed Enterprise Web Services & generated client using Axis Frameworks Created WSDL and SOAP based Web services for adding, modifying and deleting trading partners.  Helped UI to integrate the java beans data using JSTL, Spring tags Used ANT, Maven Scripts to build and deploy applications and worked closely with build team to resolve CI, Maven site and Report Issues Unit Testing Java code using JUnit and Integrating with Jenkin. Used SVN version controlling to maintain project versions. Wrote SQL queries and Stored Procedures for interacting with the Oracle database. Involved in migration of data from existing RDBMS (oracle) to Hive on Hadoop using Sqoop. Involved in testing and deployment of the application on Tomcat Application Server during integration and QA testing phase. Supported On call on a weekly basis as part of team on call rotation.  Implemented tickets in production. Used JAXB for parsing auditing information in xml format. Was part of production support team to resolve the production incidents Co-ordinate with the QA lead for development of test plan, test cases, test code and actual testing responsible for defects allocation and those defects are resolved Documentation of common problems prior to go-live, while actively in Production Support role. Supported the application in production and used SPLUNK to review the production logs Environment: Java, J2EE 1.5, JSP, Servlets, JDBC, XML, Spring 3.x, Hibernate, Web Services, SOAP, WSDL, Hadoop, Hive, Sqoop, Jersey, JAXB, Axis, SOAP UI, Eclipse, Oracle10, TOAD, JUNIT, SQL, PL/SQL, JSTL, Spring Tags, HTML, CSS, ANT, Maven, SVN, Jenkin, UML, Tomcat, Linux Fidelity Investments, Boston, MA.   \t\t\t                                                       Nov 2011 – Aug 2012 Java/J2EE Developer Project description: Fidelity Investments is among the most diversified financial services companies in the world, offering a full range of product solutions for individual investors, employers, institutions and intermediaries. The project is an intra-net web application which allows enrollment, member status, correspondence, fulfillment etc., for the existing and new customers. This application supports, maintains all the investment policy/ benefits for existing customer. This application is used by the administrators; customer support specialists to helps the new/ exiting customers in selecting the policy which best suites there requirement.   Responsibilities: Involved in Requirement gathering, Analysis, Preparing Functional Specifications, and Technical Specifications according to their requirements. Used Spring IOC, AOP and auto wiring concepts in developing the application. Used Spring Container to performed dependency injection. Used Hibernate to map the database with POJO using hbm.xml files. Designed the Architecture of the project as per MVC standards. Used Struts MVC for the developing funds module and mortgage module. Deployed the application on JBOSS application server. Used AJAX technology for creating interactive Web Applications. Developed SOAP message envelopes and headers using WSDL. Developed JSP (Java Server Pages) for orders module and Customer Service Department. Used Maven for build code. Used PL/SQL, Stored Procedures for handling Oracle database. Involved in Integration of all the modules and deploying them on the Application server & used JMS. Involved in bug fixing of various modules in the application that were raised by the testing team. Environment: Java (JDK 1.6), J2EE, JavaScript, Spring 3.0, Hibernate, Web services (SOAP & RESTFUL), JAXB, Log4j, MySQL, SVN, Eclipse, Junit, JSP, ANT, HTML, CSS, JSON, XML, WebSphere HSBC Bank, Orlando, FL  \t\t\t\t\t                                          July 2009 – Oct 2011 Java/J2EE Developer Project description: Global Merchant Site is a multi lingual web application for the HSBC Merchants available in most of the locations of United States, Europe, Middle East and Asia to know the available HSBC products with rich user interface with an e-commerce engine to plug and play the payment gateway on purchasing different products. Additional features of the project include the Order history and Reporting.   Responsibilities: Involved in design and requirements gathering for project for further improvements and enhancements as per business requirements. Development of application using J2EE, Spring, Hibernate, Web Services (SOAP & REST), jQuery, JSTL, Oracle, Maven technologies Created business logic and application in Spring Framework, Hibernate and Annotations Developed the persistence logic using Hibernate and configured using Annotations Developed and consumed SOAP and Restful using Jersey and Axis Frameworks Monitored error log using Log4j and solved the problems. Used JUnit for testing and integration of modules. Used various Design Patterns like Factory, Abstract Factory and Singleton Patterns. Integrated the Spring framework with Hibernate ORM tool to access the Oracle database Developed build and deployment scripts using Maven to generate WAR, EAR and JAR files and store them on the repository, publish and deploy on the Tomcat. Developed java scripts for all client side validation and developed User Interface (GUI) using JSP, CSS. Responsible includes integration cycle and deploying application on Production server and providing Production support Environment: Java, J2EE, CSS, Servlets, JSP, Struts, Web Services, SOAP, Hibernate, Log4j, Junit, Ant, RMI, ANT, SVN, JDBC, XML, HTML, Eclipse, Tomcat, Oracle 10g Caterpillar, India    \t\t\t\t\t\t        Oct 2007 - June 2009 Java/J2EE Developer\t\t\t\t\t\t\t Project description: Part Store Integrated Procurements e-commerce B2B procurement applications allows various customers to integrate with different Caterpillar dealers either directly from their purchase system or through marketplaces. B2B e-hub interacts with Cat dealer's DBS with various API's and generates xml response and then passes the response back to the customer's legacy system. Responsibilities: Analyzing business requirements along with team lead.  Designed necessary backend Java classes to support data access and user authorization.  Implemented MVC Architecture using Struts Framework.  Troubleshooting and implementing bug fixes related to client and user reported issues.  Involved in the coding of generating the Actions, Action Forms.  Wrote Client side validation using Struts Validate framework and Java script.  Implemented Struts Action classes using Struts controller component.  Wrote unit test cases for different modules and resolved the test findings. Developed the Servlets and Data Access Layer classes. Servlets and JDBC were used in retrieving data. Debugged and enhanced performance of the web application.  Developed various daily jobs using PL/SQL stored procedure to update notification status in multiple tables.  Developed high quality software solutions that satisfy our customers’ needs.  Created technical specifications and use cases.  Used agile development practices and work in short iterations to deliver a continuous flow of the most important and valuable features. Environment: Java, J2EE, JSP, AXIS, Jersey, SOAP, WSDL, UML, HTML, XHTML, DHTML, JavaScript, CSS, jQuery, Rally, CSS, XML, JAXB, JAXP, Junit, Log4j, Oracle, JUnit 4, Eclipse, Tomcat, WebSphere EDUCATION Bachelors in Computer Science, Osmania University, Hyderabad, INDIA. 2007"}