{"text": "Name: agnes agnes E-Mail: agnes.agnes@gmail.com Address: Nagoya, Japan Github: https://github.com/agnes LinkedIn: https://linkedin.com/agnes Phone No. 358734001516 \t\t\t\t\t\t\t PROFESSIONAL SUMMARY Java/JEE Full Stack Developer having around 7+ years of experience on Enterprise applications, Distributed Application Development, Client/Server Applications, testing and implementing application environment A self-driven, adaptable and quick learning professional with in-depth knowledge and understanding in Software Development Life Cycle (SDLC), requirement gathering, design, Software development OOA & OOD Experience on Web Technologies using HTML4, HTML5, XHTML, DHTML, JavaScript with ECMA6 features, TypeScript, jQuery, XML and JSON, Bootstrap, Ext.js, Backbone.js, Angular.js, Angular 2, React.js, Redux and Node.js. Experience in Service Oriented Architecture (SOA), Web Services design development and deployment using WSDL, REST, UDDI, JAXP, JAXB, SAX, DOM, XSLT, Apache AXIS, SOAP Web Services. Expertise in Angular2.0 framework and its ability to create simple and scalable code for SPA. Worked extensively on Angular 2/ Typescript SPA domains. Used webservices concepts such as XML, SOAP to transfer and transform data between applications. Handled response data from RESTFUL webservices using XML, JSON and JQuery to update UI Interacted with java controllers (JQuery, Ajax, and JSON to write/read data from back end systems). Extensive familiarity designing both front end and backend applications using Java, J2EE, JDBC, Servlets, JSP, Java script, UNIX Shell Scripting and Database technologies Microsoft SQL Server, and MySQL. Developed single page applications using Angular 4 by creating Typescript reusable components and services to consume REST API’s using component-based architecture. Deployed Spring Boot based micro services Dockers container using Amazon EC2 container services and using AWS admin console. Extensive Knowledge in Data Modeling, administration and development using SQL and PL/SQL in Oracle, MY-SQL, MS SQL Server, DB2 and SQL Server environments. Involved in using new features with Angular 4 like Ng-If with Else, Pipes, compare selector and Validators followed by the client requirements. Extensive experience of designing and developing software applications with Java, J2EE, EJB, JSP, JSF, Servlets, Java Beans, Web Services, JDBC, XML, SOAP, REST. Experience in User Experience (UX) design and development, User Interactive (UI) Web Pages and visually appealing User Interfaces using HTML 5, CSS3, Bootstrap, JavaScript, JSON, JQuery, Angular 2/4, NodeJS and ReactJS Developed XSLT files for transforming the XML response from the web service into HTML as per the business requirements.  Worked on AWS, High Availability Practices and deploying backup/restore infrastructure Strong work experience on databases like SQL server, PostgreSQL, Oracle11g, MongoDB (NoSQL) and DB2 Good Exposure to Service Oriented Architecture (SOA) such as Web Services and hands on experience in developing and registering web services using JAX-RPC, JAX-WS, SAAJ, JAX-RS, SOAP, RESTful, WSDL, UDDI registry Created Dynamic routing mechanism and customized polices using Node JS in APIGEE Edge ecosystem. Involved in unit and integration testing using both SOAP UI and APIGEE trace tool. Implemented Web Service and consumed third party Web Services using SOAP, SOA, WSDL also very strong in Restful Web Services Experienced in setting up logging configurations in the applications using Apache Log4j and Log back. Having good knowledge on using Version Controlling tools like CVS, SVN, GIT, Rational Rose, Clear Case, Jenkins etc. Experienced with Apache Tomcat, Oracle WebLogic, JBoss and IBM WebSphere application servers. Expertise in development and deployment of SOA and multi-tiered web-based enterprise applications using J2EE technologies like Servlets, JSP, JMS, Hibernate, Spring, JDBC, Angular, Java Beans and Web services (SOAP, Rest) Application development experience using multithreading, Serialization, Externalization, Collection, Generics, Core JAVA Experienced with Angular 2/4 and its features like Dependency Injection, Angular expressions, Bindings etc. Proficient with development of RESTful Web Services using JAX-RS for exchange of JSON and XML representations Knowledge of J2EE design patterns like MVC, Front Controller, Factory, Abstract Factory, Command Pattern, Singleton, Session Facade, Transfer Object, Business Delegate and DAO Patterns Experienced in the deployment of the ear and jars using Jenkins, ANT, Maven deploy tools and performing other configuration changes for setting up the application in the integration testing environment Expertise in developing dynamic web pages in HTML with Angular, jQuery for user interface and developing single page applications by using Angular Responsible for Creating the Node.js and Express Server combined with Socket.io to build MVC framework from front-end side AngularJS to back-end Mongo DB, to provide broadcast service Experience of working with databases Oracle and DB2, MySQL; extensive experience working on SQL, PL/SQL, Oracle Database development experience using tables, triggers, views, packages and stored procedures Good working experience on client-side programming like HTML/HTML5, XHTML, Java Script, CSS/CSS3 and Custom tag libraries EDUCATION Bachelor’s in Computer Science TECHNICAL PROFICIENCY PROFESSIONAL EXPERIENCE Mercedes-Benz Financial Services USA LLC, Detroit, MI                                                     July 2018 – Till date Role: Sr. Full Stack Java Developer Responsibilities:  Followed Agile Scrum methodology for application development and deliverables. Designed and implemented application using Spring MVC, Backbone, Spring IOC, Spring annotations, Spring AOP, Spring Transactions, Hibernate, JDBC, SQL, JMS, Oracle, JBoss Involved in Enhancement of existing application utilizing ReactJS, created HTML navigation menu that is role based wherein menu items changes dynamically based on the values derived from the database in the form of JSON. Developed all the UI pages using HTML5, CSS3, JSON, JavaScript, jQuery, ReactJS, Ajax Used various Bootstrap components and developed the application following Responsive web design. Worked on AWS, High Availability Practices and deploying backup/restore infrastructure Worked with Struts front-end utilizing the Struts tiles framework and Struts Validation Framework to implement. Handled response data from RESTFUL webservices using XML, JSON and JQuery to update UI Interacted with java controllers (JQuery, Ajax, and JSON to write/read data from back end systems). Developed webservices to consume data with Restful service using Jersey framework. Developed EJB 3.0 components and SOAP Web Services for the UI integration. Developed controllers, services, custom directives for various modules in ReactJS and was also involved in developing unit test cases using Jasmine, Karma Developed projects with RESTful services (JAX-RS, Spring Boot), SOAP (JAX-WS, Apache CXF, WSDL, Apache Axis2) and automated the documentation using Swagger and WADL. Good hands on experience in Data Modeling, administration and development using SQL and PL/SQL in Oracle, MY-SQL, MS SQL Server, DB2 and SQL Server environments. Maven tool has been used for the build and deploy procedure scripts in UNIX, Linux and Windows environment using Hudson. Strong experience in UNIX & Linux Shell scripting Bash, Perl scripting. Maven tool has been used for the build and deploy procedure scripts in UNIX, Linux and Windows environment using Hudson. Experience in creating real time data streaming solutions using Apache Spark /Spark Streaming, Kafka. Used AWS deployment services to quickly set up a dynamic website and configured virtual servers using AWS EC2 and responsible for maintaining and expanding our AWS infrastructure using AWS EC2/EBS Performed form validations using reactive forms from Angular2.0 framework. Extensive experience in developing User Interface (UI) using CSS, HTML, jQuery, JavaScript, Bootstrap, JSON, Ajax, AngularJS, Angular 2, Angular 4. Experience in client design and validations using HTML5, Angular 4, Typescript, Bootstrap, JQuery API, JavaScript, AJAX, Node Js. Excellent knowledge and experience of developing applications with Model View Controller (MVC) using Struts 2 framework and Spring framework. Expertise in using HTML, CSS, XML, XSL, XSLT, JAXP, JAXB, JAVASCRIPT, JQUERY, JSON, JSTL, Backbone JS, PHP, Express JS, YUI (yahoo UI) Ext JS, React JS, Node JS and AJAX meeting W3C standards. Developed Scripts for UNIX platform deployment. Developed Micro services using Spring Cloud, Spring BOOT, Spring Config Server, Netflix Eureka, Netflix Zulu (Edge Server), Netflix Ribbon. Good experience on using big data technologies such as Apache Spark, Hive, HBase, Sqoop etc. Performed Data Ingestion from multiple internal clients using Apache Kafka. Developed RESTful webservices resources using Spring to serve the data in JSON format and used Swagger to create the REST API documentation for clients. Used OPENSHIFT command line tool to import Docker image, refresh image, delete existing image, create application services, delete service, update the service with latest Docker image, create and update environment variables. Worked on building proxies and policies with in Apigee along with security frameworks. Developed custom Node JS scripts that support API proxy in routing and response handling. Expert in designing web applications and web contents utilizing various Search Engine Optimization (SEO) techniques. Experienced in designing, developing and maintaining portal applications using IBM Websphere Portal on Rational Application Developer (RAD) Deployed the developed portlets to WebSphere Portal Server Worked on Securing WebSphere Portal with LDAP and DB2, WebSphere with LDAP.  Expertise in designing and developing User Experiences for Web Applications using Web Authoring tools such as Adobe Dreamweaver CS3, Adobe Illustrator, and Adobe Flash. Developed Micro services using Spring Cloud, Spring BOOT, Spring Config Server, Netflix Eureka, Netflix Zulu (Edge Server), Netflix Ribbon. Developed RESTful webservices resources using Spring to serve the data in JSON format and used Swagger to create the REST API documentation for clients. High level of expertise in CSS pixel-level layout, Consistency with browsers, Version and Platform Independence. Experience in handling messaging services using Apache Kafka by Configured Kafka to read and write messages from external programs to handle real time data Developed JMS messaging components to handle asynchronous messaging from queues using Tibco EMS and Spring JMS. Used Angular 2/4 with Typescript to develop a Single Page Application. Created Typescript reusable components and services to consume REST API's using Component based architecture provided by Angular 4. Involved in using new features with Angular 4 like NgIf with Else, Pipes, compare selector and Validators followed by the client requirements Implemented React services to connect the web application to the back-end API. Used Tomcat server for the application development and Utilized JIRA for task scheduling, quality control activities like defect tracking and fixing Implemented Hibernate along with annotation based transactional support in Spring Framework Developed Java Beans and Custom Tag Libraries providing client-side validations in JavaScript and providing interactive front-end GUI using AJAX Used GitHub version controlling tools to maintain project versions supported the applications through debugging, fixing and maintenance releases. Worked with NoSQL databases such as MongoDB Wrote services to store and retrieve user data from the MongoDB for the application on devices Created JUnit test cases to automate the testing of business logic. Environment: Java, J2EE, Java 1.8, Struts 2, Spring Core, Spring (MVC), Spring Boot, Linux, Unix, DB2, EJB 3.0, Hibernate, JSON, Unix, Junit, Agile model, HTML5, CSS3, JavaScript, Angular4, jQuery, Eclipse, Tomcat, Maven, Jenkins, GitHub, Oracle, PL/SQL, Jasmine, Karma, NodeJS, ReactJS, MongoDB, Jira, AWS. Blue Cross Blue Shield, Jacksonville, FL                                                                                          NOV 2017- June 2018  Role: Full Stack Java Developer Responsibilities: Involved in different stages of Software Development Life Cycle SDLC including analysis, designing, coding, and testing Implemented all web applications with object-oriented principle and design patterns Designed and Developed User Interactive (UI) Web pages using HTML5, React-JS, Bootstrap, CSS, JSX, jQuery, AJAX and NodeJS, Spring REST using Microservices Created reusable components used across various modules using React-JS, React-DOM, Bootstrap andJSX Developed the React Web UI components using Visual Studio Code IDE and made backend REST calls Implemented Flux architecture in the application by developing dispatcher, stores and actions and defining event emitters Worked with Bootstrap CSS for dialogs, tabs, date picker, model pop up's and advanced components to implement UI model Responsible for creating efficient design and development of REST Webservices using Spring Boot and Microservices. Used the scripting language such as shell and ruby are for creating environment role and parameter file which are used for deployment of webservices in AWS. Experience in writing the ANT Scripts and UNIX Scripts for building and deploying the working Worked on AngularJS to create single page applications (SPA) using its features like routers, Controllers, Services, Directives. Hands on Experience in working with Databases MYSQL, Oracle 10g/11g, SQL-Server, DB2 and NoSQL (MongoDB, Cassandra) Dynamo DB, Couch DB. Configured Spring to manage Action classes and set their dependencies in a Spring context file and integrated middle tier with Struts. Configured and administered JDBC, JMS, and cluster EJB objects in WebLogic Server. Build and configure WebSphere Portal components including navigation, menu, and content view portlets. Involved in deploying the ESL portal application on IBM Websphere portal server. Installed, configured and maintained WebSphere Application Servers (WAS) in a network deployment. Integrated with Restful Services (JSON) to fetch data and build Transaction GRID, Dashboards, etc.  Developed user interface using Spring, JSP, HTML5, CSS3, JavaScript, jQuery, AngularJS, NodeJS, ReactJS, Bootstrap, AJAX and JSON Experience in shell scripting and Python in Unix/Linux environment. Wrote automated test cases for web application using Selenium and performed unit test cases using Jasmine and karma Developed and utilized J2EE Services and JMS components for messaging communication in Web Logic Application Server. Extensive experience in both front end and backend applications using Java, J2EE, JDBC, Servlets, JSP, Java script, UNIX Shell Scripting and Database technologies Microsoft SQL Server, and MySQL. Involved in designing the UI using Tab Bar, Navigation Bar, Table Views, and Page Control along with some customizations. Configured Java Messaging Services (JMS) on WebLogic Server using Eclipse IDE. Utilized ReactJS in combination with AngularJS to create fast, simple and dynamic views Implemented nested views and routing using Angular-UI Router as per the requirement. GUI was developed using JSP, HTML, and AngularJS and created reusable components in Angular 4 using Custom Directives Filters, Services and Partials Worked extensively with API Management product of Apigee edge in consuming the APIs in implementing customer use cases and Performed Service Level Testing for Web services using Apigee. Used Microservices are designed with the individual database and project with no dependencies. Developed the automated unit test cases for the Microservices using Junit, Mockito, Jacoco and Sonar and deployed them in the Jenkins pipeline. Developed Micro services using Spring Cloud, Spring BOOT, Spring Config Server, Netflix Eureka, Netflix Zulu (Edge Server), Netflix Ribbon. Actively involved in Migrating applications from Dot Net 2.0 to Dot Net 4.0, classic to Azure cloud and AWS deployment. Developed pages using Angular2.0 directives, expressions, routing capabilities for bookmarking, filters, validations and Angular-UI components such as grid, buttons, carousels, date pickers, modal dialogs and other input components Configured AWS identity and access management groups and users for login authentication Involved in setting up AWS Oracle RDS (Relational database service) databases for our project Consumed Restfulwebservices using apache HttpClient for the data coming from external systems. Designed, developed and migrated custom Mongo applications specific to client needs. Developed SpringJMS message listeners to consume JMSmessages from queues and used Springtransaction management to manage the transactions in the application Worked withSpring framework at Business Tier and uses Springcontainer for initializing services and used Spring core annotations for Dependency Injection such as Bean, Component, Repository, auto wiredetc. Worked withJIRA and Log4J for project management, tracking and monitoring errors. Environment: Java 1.5, JBoss 7, Restful Web services, HTML5, CSS3, Bootstrap, Microservices, JavaScript, ReactJS 0.13, Node.JS, jQuery, AngularJS, Angular 2.0, AJAX, Linux, Unix, Shell, JSX, MongoDB, Spring, Struts1.1, Hibernate, Eclipse, Visual Studio Code, Selenium, Junit, DB unit, ANT, Jira, log4j, AWS, Oracle 11g. Gordon food service, San Francisco, CA                                                                                       APRIL 2016 - JUNE 2017 Role: Full Stack Developer Responsibilities: Involved in Full Cycle of Software development from Analysis through Design, Development, Integration and testing phases Created Class diagrams, Sequence diagrams and Activity diagrams to describe the relationship that exists among system's object in accordance with the business requirements using UML Developed Pop-in Dialog JSPs and passing Request Parameters using JavaScript, jQuery, JSTL System built using Model-View-Controller (MVC) architecture Implemented the application using the concrete principles laid down by several design patterns such as Composite View, Session Façade, Business Delegate, Bean Factory, Singleton, and Data Access Object Implemented front-end using Backbone, underscore, jQuery, HTML, CSS and JavaScript Developed backbone views, models, and collections and configured routing in the application using Backbone router Experience in User Experience (UX) design and development, User Interactive (UI) Web Pages and visually appealing User Interfaces using HTML 5, CSS3, Bootstrap, JavaScript, JSON, jQuery, Angular 2/4, NodeJS and ReactJS Designed and developed the business logic layer components in middle-tier of the application using Spring Framework4.0 and Spring Boot in STS. Developed Web-application pages using HTML, CSS3, Bootstrap and AJAX. Implementing Code (Perl/Unix Shell scripts) and writing unit test cases. Worked with jQuery Ajax to perform backend calls for data retrievals to populate model objects in collections Comparing the application logs in different test environments of Java Hosting and Splunk by getting the logs in PUTTY using Shell script. Developed Web services to allow communication between applications through RESTful over HTTP using ApacheAxis2 Designed and implemented transaction management using Spring declarative transaction management Consumed JMS messages using message listener container in spring from WebSphere MQ broker. Implemented different types of spring controllers as per application requirements, Spring Validators, persistencelayer, DAO and service layer components using Spring/Hibernate API and Spring/Hibernate annotations. Extensively used Hibernate QL Migrated the current Linux environment to AWS Linux environment and used auto scaling feature and Involved in Remediation and patching of Unix/Linux Servers. Extensively used SpringIOC, configured Application Context files and performed database object mapping using Hibernate annotations Developed various batch jobs using Spring and Quartz schedulerdeployed them on WebSphere application Server 8.0 Worked with HibernateJPA for mapping business objects to the Oracle database Automate build process by using Maven and used CVS version control tool Created application for data modelling to allow various DB2 to Cassandra table migration use cases and used   Cassandra   CQL with Java API's to retrieve data from   Cassandra   tables. Developed Apache Camel middleware routes, JMS endpoints, Spring service endpoints and used Camel free marker to customize REST responses. Used Java Message Service JMS API for reliable and asynchronous exchange of important information. Configured and customized logs using Log4J and transaction and connection pool related issues in production and refactored code to fix the issues Took part in code reviews, application deployments, establishing CI/CD Jenkins process, creating ansible playbooks for AWS cloud deployment Environment: Java 1.5, J2EE, HTML, CSS, JavaScript, Backbone, JMS, Spring MVC 3.0, Hibernate 3.0, JDBC, RESTful, Axis2, WebSphere 8.0, Maven, Oracle10g, CVS, XML, JSON, Log4j, Underscore, jQuery, jQuery -UI, UML, Windows. US BANK, Dallas, TX\t\t                                                                                                             FEB 2016 – DEC 2016 Role: Full Stack Developer Responsibilities: Involved in enhancing the existing Trade Confirmation Project and providing support. Designed and developed the project using Spring Web MVC, hibernate using front controller design pattern. Integrated with Restful Services (JSON) to fetch data and build Transaction GRID, Dashboards, etc.  Enhanced user experience by designing new web features using MVC Framework in HTML, CSS, Bootstrap. Used Spring, and Restful Web Services and optimized the performance for better user experience. Developed user interface using Spring, JSP, HTML5, CSS3, JavaScript, jQuery, AngularJS, NodeJS, ReactJS, Bootstrap, AJAX and JSON Used Sonar and Jenkins tools for code review and integration testing. Designing data models in Cassandra and working with Cassandra Query Language (CQL).  Implemented Spring architecture and Spring Bean Factory using IOC, AOP concepts. Designed and Developed User Interface using Spring framework and JSP, JSTL, EL, Custom Tag libraries, jQuery, and CSS. Scripting experience using Microsoft batch commands or Unix shell Developed program integration layer for different MVPD integrations using JavaScript Designed Restful XML web service for handling AJAX requests and configured Hibernate objects as Spring Beans in the Spring Configuration File. Sending and configuring Queue to send messages using JMS message Queue. Deployed and maintained Amazon AWS cloud infrastructure consisting of multiple EC2 nodes. Created AWS RDS database instances consisting of Oracle, SQL Server and AWS RDS Oracle database clusters. Managed servers on the Amazon Web Services (AWS) platform instances using Puppet, Chef Configuration management.   Updated the front-end of the web application based on user selection using Ajax and serve Resource. Used Gradle plug-in to build the application and deployed the application using Jenkins build scripts. Performed testing using JUnit by developing proper test cases and documented project knowledge and access related information on confluence. Installs DB2 software and apply fix packs with zero problems.  Setup JIRA Sandboxes and test new plugins and add-ons to ensure compatibility and used JIRA for task assignment, bug tracking and fixture. Involved in deploying the application in the QA and Prod Environments using Jenkins.  Environment:  Java/JEE, JIRA, JMS, jQuery, Jenkins, JUNIT, Bootstrap, Eclipse IDE, AWS, SVN, CQL, Cassandra, Spring, Hibernate, Backbone-JS. SRS TECH, Hyderabad, India                                                                                                           NOV 2011 – DEC 2015 Role: Java/J2EE Developer Responsibilities: Responsible for gathering new Business Requirements of the system from client and followed Waterfall Methodology to plan and monitor projects. Developed the functionality for communication between the modules mostly involved in VIEW and CONTOLLER section of MVC pattern, which includes jQuery, HTML, CSS, JavaScript Developed Web Application using RESTful Web Services involving the Consumption of Third-party service integration like SOAP webservices Involved in the extensive usage of HTML, CSS, jQuery, JavaScript, and Ajax for client-side development and validations Developed dynamic Emails using JavaScript, and hand coding of HTML and CSS Database schema design development and coding of DDL and DML statements, functions. Extensive Knowledge of database like Oracle, designing the database and coding of SQL, PL/SQL, Triggers, and Views Developed programs for accessing the database using JDBC thin driver to execute queries, Prepared statements, Stored Procedures and to manipulate the data in the database Used SVN for version control Designed various tables required for the project in Oracle 11g database and used the stored procedures in the application and Wrote Stored Procedures, Triggers and Functions on SQL Server as well as PL/SQL on Oracle to support both databases for the application.  Designed and developed Data Access layer using Spring JDBC, Oracle and Hibernate. Added dynamic functionality to the application by implementing jQuery Jersey implementation of JAX-RS is utilized to develop RESTful Webservice to carryout CRUD capabilities. Used Jenkins which automates the provisioning and configuration for all the continuous Integration Server including plugins, jobs, server configuration, etc. Involved in Technical Documentation and Use case design using UML modeling Class and sequence diagrams and was also involved in Integration, bug fixing, acceptance testing and Code reviews Utilized Hibernate for persisting data while developing an application based on Spring Framework Used Maven for dependency management and involved in consuming SOAP services using Spring Environment: Core Java 1.4, Junit, SOA, Web services, JSP, HTML, CSS, JavaScript, jQuery, Tomcat Server, Jenkins, Maven, Hibernate, MVC/MVW, Spring, Eclipse, Oracle, Maven, log4j, SVN, Agile, Express."}