{"text": "Name: edith edith E-Mail: edith.edith@gmail.com Address: Khartoum, Sudan Github: https://github.com/edith LinkedIn: https://linkedin.com/edith Phone No. 392376700398 PROFESSIONAL SUMMARY 8+ years of experience in the IT industry specifically in web technologies with skills in analysis, design, development, re-engineering, maintenance, installation and testing java based applications. Extremely proficient in J2EE Technologies JDK 1.7/1.5, JDBC, Servlets, JSP, JSF, XML/XSL, JMS, Struts/MVC Framework, Spring Framework, Web Services (SOA), Web logic 8.1/7.0, IBM Web sphere 5.1, Hibernate, JSF 2.0, ANT, Design Patterns, Junit. Experience in deploying J2EE applications on WAS 5/5.1/6/6.1 versions using WAS admin console and ws admin scripting tool. Proficiency in core java concepts like Threads, Exception handling, Generics, Strings etc.  Worked in Web Technologies in developing applications using Servlets, JSP, JDBC, JavaScript, Struts 2.0 HTML and CSS. Strong development experience in Java, J2EE, SOA, Servlet, JSP, Struts, Spring, JDBC, Java Beans, JMS, JNDI, LDAP, Axis, AJAX, JUnit, Log4j, and JavaScript. Experience in Developing User Interface(UI) Rich Web Applications, and Web Service Applications using Front End/User Interface(UI) Technologies like HTML5, XHTML,DHTML, XML, Object Oriented JavaScript, JavaScript ,JQuery, Backbone JS, Angular JS, JSON, Bootstrap Framework, Ajax, CSS2/3, , CSS Frameworks ,JSP. Experience in developing applications using Java technologies include Core Java, J2EE, Java Server Pages (JSP), Servlets, Java Script, JDBC, Java Mail, JMS and EJB. Experience in implementing Web Services based in Service Oriented Architecture (SOA) using SOAP, Restful Web Services with JSON, JAX-WS, and Apache Axis technologies. Proficient in using RDBMS concepts with Oracle 10g/11g, MySQL and experienced in writing SQL, PL/SQL Stored procedures. Experience in developing Unit testing & Integration testing with unit testing frameworks like JUnit, Mockito, TestNG and Power Mocks, Mobile Testing. Extensive experience in DOM manipulation using JavaScript, jQuery, Angular JS Worked in Agile environments and used Agile methodologies such as Scrum and Extreme Programming (XP) in the SDLC process. Strong technical knowledge in Jboss Application server implementation, support, workload management and performance tuning including Web server setup configuration with Jboss App Server. Experience in database connectivity (JDBC) for databases like Oracle 11g/10g/9i, MS SQL Server 2010/2008/2005, DB2 and MySQL Experience in working with the integration tools like GIT/Stash, JIRA, Jenkins , Mockito Frameworks. Proficient in programming by using the IDE’s such My Eclipse 8.x, Eclipse 3.5, Net Beans 6.9, WSAD 5.x, and RAD 6/7. Used Tomcat in my projects and successfully deployed and compiled many of the applications on them. Experience in Network management, Transaction management, Data Analysis, DB Administration, Data Mining. Excellent communication skills, has clear understanding of business procedures and ability to work as an individual and also as a part of a team. A resourceful team player with good Interpersonal, effective problem solving and decision making skills, looking ahead for great career in a fair working environment with opportunities to grow. TECHNICAL SKILLS/PROFICIENCIES Programming Languages\t: SQL, Java, UNIX, C, HTML.  JAVA Technologies\t\t:Java,J2EE,JDK 1.8/1.5, JDBC, Servlets, JMS, EJB Operating Systems\t\t: Linux, MS-Windows 2k/XP/7/8/10, Mac. Network Tools\t\t\t:Resolve,Open Reach, SNR reset, jvm, Eclipse, SIP, CS central, Filezilla.  RDBMS\t\t\t\t: ORACLE 10g, MS-Access, MS SQL Server, My SQL, PL/SQL Web Servers\t\t\t: Tomcat, Wblogic, JBoss Modeling Tools\t\t\t: Eclipse 8.x, Eclipse 3.5,  Netbeans 6.9, RAD 6/7 Data Modeling/BI Tools\t: Rational Rose®, UML,   MS Excel.   Software Packages\t\t: MS Project, OPnet, SSH, MS Office, MS Visio. Design Patterns\t\t\t: Singleton, UML, Data Access Object(DAO), MVC, Session Facade PROFESSIONAL EXPERIENCE Americold, Atlanta, GA\t\t\t\t\t\t                                          Oct 15 – till date Role: Sr.Java Developer.                                                                                   \n Worked on the enhancement new business requirements related to the Americold US website and WCMS worked in separate application supporting Americold operations like Web Services, Batch jobs, DB update based applications. Also worked extensively on bug fixes and production issues, for both the systems involving immediate fast paced development . Responsibilities: Developed new modules and functionalities for WCMS and US Website which uses frameworks like Struts, Spring and iBatis in an integrated way to form the application.  Used iBatis as a persistence framework to perform CRUD operations and wrote SQL queries for Oracle DB.  Implemented application using MVC architecture integrating Hibernate and Spring frameworks. Designed the application by implementing Struts based on MVC Architecture, simple Java Beans as a Model, and JSP UI Components as View and Action Servlet as a Controller. Worked on writing triggers, packages, indexes for different tables together with some tuning. Wrote Jquery , BackboneJS and AngularJS based function for several UI functionalities like filters, carousels and different DOM modifications for best user experience and a cutting edge website appearance. Developed an AngularJS workflow manager leveraging Angular-UI's state router. Worked on Restful Webservices to present data in XML and JSON formats for different urls based on different logical conditions. Deployed the application on JBOSS Application Server and used ANT framework for developing automated build scripts.  Applied Fix packs fix packs for WAS using Update Installer and automating it. Used different frontend technologies like HTML, CSS, AJAX, JSP/ JSTL to put new pages and enhancements for the Samsung website. Good exposure with Chrome developer tools and emulators for frontend debugging. Worked on responsive design pages, involving different views for desktop, ipad and mobile.  Involved in complete development of “Agile Development Methodology” and tested the application in each iteration. Extensively written unit and integration test cases using mockito objects and JUnit, JIRA,GIT. Experience in applying patches and plug-ins for Jboss Application Server. Developed API’s for generating XML, JSON content to be used by Frontend. Coded utility Components in Java for marshalling and unmarshalling XML file.  Developed operations using Jenkins, Stash developing tools. Worked on Cassandra Database configuration. Designed and implemented application using JSP, Spring MVC, Spring IOC, Spring Annotations, Spring AOP, Hibernate, Oracle. Have worked on Oracle10g database for storing and retrieving the application data. Environment:   Java J2EE, JSP, JavaScript,  XML, JSON, Spring ,Jboss,  Hibernate, Jquery, Struts, Junit, Oracle, Angular JS, Tomcat , Junit. JIRA, SOAP, Eclipse. Fidelity Investments , Merrimack, NH.\t\t\t\t\t\t\tNov14 – Sep 15 Role : SrJava/J2EE Developer Banking Management is an intranet banking project used for managing banking products. This application allows authorized users to access, update, and add products. Staff and Manager are provided Access Rights \tbased on the Right ID. This application is used for handling various kinds of bank products like Credit card, CD, Mortgage, Money Market.  Responsibilities: Involved into analysis and design phase. Participated into discussion meetings about requirements. Involved in the development of Presentation layer using JSP, HTML, DHTML, CSS and used JQuery for form validation. Developed the new features for the application using JSPs, XML, XSD, XSLT, HTML, CSS, Servlets, JavaScript, J2EE, Hibernate, Spring 3.0 and Maven 2.0.8. Worked on Spring DAO, Spring MVC and Spring AOP Interceptors in Logging and Auditing. Used Spring IOC developed an Application Context to create configured beans.  Used Hibernate for object-relational mapping and for database operations in Oracle database. Used JUnit for testing the application, ANT and Maven for building Projects Implemented various J2EE design patterns like Session Facade, Business Delegate, DAO, Singleton patterns etc. Used Rational Rose for developing UML diagrams such as Use Cases, sequence diagrams and class diagrams.  Used XML parser APIs such as JAXB in the Web services request/response data for marshalling and unmarshalling. Worked with Business Analyst&QA during application development cycle.  Extensively involved in Java application design and development using Java design patterns, Spring, WebLogic and Oracle DB Server.  Used JDBC, SQL for developing data access layer for an application. Worked on Cassandra to store big Data. Worked on refactoring java codebase to improve application performance. Used HP Quality Center for bug tracking and development progress. Created Stored Procedures using SQL/PLSQL for data modification. Worked on SAOP UI for wsdl validation, security testing and ws-security. Performed infra testing and updated the performance testing using the test cases .  Worked on the integration tools like GIT. Created Unit test cases using JUnit 4.0. Co-ordinate with QA for testing, Production releases, Application deployment and integration. Involved in Production Support and minor enhancements as per application requirements. Environment: Java, J2EE, JSP2.0, Servlets 3.0, JavaScript, JQuery, HTML,DHTML, CSS, Spring 3.0, Hibernate 3.0, Tiles, Validator, Unit 4.0, Web Services, JMS, UNIX, Oracle 10g, XML, XSD, XSLT, DOM SAX and STAX Parsers, WebLogic 10.x and Eclipse 3.6. CNA Insurance, Albany, NY .\t\t\t\t\t\t\t\t   Aug 12-Oct 14 JAVA / J2EE Developer\t\t\t\t Agent processing is an application which is used by the Insurance Agents to sell policies, endorsement, process policy claims, maintain the reports of the policy holder etc. The System provides a GUI where the Agent can login and order for a policy, Motor Vehicle Report (MVR), Claim, Endorsements for existing policies, cancellation etc. The system also supports to maintain the history of all the transactions for each individual agent. Responsibilities: Designed Use Case Diagrams, Class Diagrams and Sequence Diagrams and Object Diagrams, using IBM Rational Rose and RUP Used Rational Application Developer (RAD) as Java IDE tool for creating JSPs, Servlets, EJBs, and XML Developed the application front end and validations using Java Server Faces (JSF) Developed Session EJBs which encapsulated the business logic for getting an insurance quote and then buying it Designed and developed Servlets, Session and Entity Beans to implement business logic and deploy them on the Web Sphere Application Server Used Hibernate as ORM tool to store the persistence data into the Oracle10g database Implemented the application using the concrete principles laid down by several design patterns such as Business Delegate, Session Façade, Service Locator, Data Access Object(DAO) and Data Transfer Object Used Java Message Service (JMS) for reliable and asynchronous exchange of important information, such as policy status report, between the Agent and Insurance Company Parsed XML documents using JAXB Worked as a Cassandra Architect in storing the big data. WebSphere Portal V5.0 and WAS V5.0 were installed and configured on local window machine and developed portlets using JSR 168 Used Oracle9i extensively for developing different tables and ran SQL queries on them.  Used JNDI for Naming and Directory services Used XML to transfer the application data between client and server XSLT style sheets for the XML data transformations that included both mid-layer transformations (XML to XML) and final transformations (XML to HTML) Developed automated Build files using ANT and deployed on IBM WebSphere Application Server 6.0 Developed the different components of application such as JSPs, EJBs using WSAD Tested the application functionality with jUnit Test Cases Used CVS for version control Developed logging module using Log4J to create log files to debug as well as trace application Environment: Servlets 2.3, JSP 2.0, JMS 1.1 , JSF 1.0, EJB 2.0, Hibernate 2.0, SOAP, JNDI, JDBC2.0, XML, Web Services, WSDL, JAXB, JavaScript, PL/SQL, Oracle 9i, jUnit, CVS, ANT1.5.4, Log4J,Rational Rose, WebSphere Application Server 5.0, windows XP. Xcira, Brandon, FL . \t\t\t\t\t\t\t\t\t     Jun 11- Jul 12\t JAVA DEVELOPER Auction management system has auctioning between different bidders and clerk on equipment like cattle, machinery etc. the bidders are web-based applications provided with a user-interface with specific features to participate in the auction. Through the AMS tools interface clerks and bibbers are launched to enter into an auction, auctions are created through events via ring-manager. Ports required for the auction are brought-up through this interface. And user registration and maintenance is performed through this interface. Responsibilities:  Effectively participated in weekly client communications with Business Analysts. Involved in the architecture team for design and implementation of system. Wrote custom Maven script to application on JBoss Application Server. Developed the code using Core Java Concepts Spring Framework, JSF, JSP, AJAX, JavaBeans, Hibernate3.0, WebServices, Java Script, XML and HTML.  Developed views and controllers for client and manager modules using Spring MVC and Spring Core. Used Spring Security for securing the web tier Access.  Data Operations are performed using Spring ORM wiring with Hibernate Template Implemented Design patterns and design of DAOs and Mapping Files for Hibernate. Involved in creating database objects: tables, views, constraints using postgresql. Involved in adding new functionalities to legacy system  Implemented JMS to provide access to other application, which maintain user Transactions Designed static and dynamic web-pages using HTML, CSS, javascript, jquery. Consumed SOAP based webservices for Payment Transaction and Payment Release using Apache Axis. Expertise in designing and creating WSDL using XML Spy and Spring WSDeveloped and modified database objects as per the requirements. Developed Exception handling framework and used log4J for logging. Involved in finding the root cause for errors and fixing themand involved in providing production support during deployment. Environment: Java, JSP, Spring, Servlet, Javascript, Jboss, Jetty, Dojo, PostgreSQL and OLR bid server. Amazon,  Hyderabad, India.\t\t\t\t\t\t\t\tNov 09- May 11 Role: JAVA Developer Amazon.com strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection, and convenience - Amazon.com continues to grow and evolve as a world-class e-commerce platform. Amazon's evolution from Web site to e-commerce partner to development platform is driven by the spirit of innovation that is part of the company's DNA.  Responsibilities Designed and developed Application based on Struts framework using MVC design patterns.  Involved in Implementation and Unit testing of the product. Developed Struts Action classes and Form Beans.  Designed and developed the UI using Struts view component, JSP, HTML, CSS and JavaScript.  JSP Content is configured in XML Files.  Implemented session beans using EJB 2.0  Deployed the web components into the weblogic application server.  Hibernate is used as persistent at middle tire for providing object model over relational data model. Code Reviews, customization and maintenance of code across applications.  Responsible for performance issues. Optimized ant build scripts for faster building and worked on modifying shell scripts.  Creating environment for user-acceptance testing and facilitating Integration and User Acceptance Testing with JUNIT. Environment:Java, J2EE, Struts1.3, Eclipse, EJB2.0, Hibernate, XML, JSP, JDBC, Rational Rose, JavaScript, HTML, JUnit, DB2 British Telecom /HCL. Hyderabad, India. \t\t\t\t\t         Jul 2008- Oct 2009 Role: Network Analyst HCL Technologies Limited is a global IT services company headquartered in Noida, India. It offers services including software-led IT solutions, enterprise transformation, remote infrastructure management, engineering and R&D services, and business process outsourcing . HCL Technologies is on the Forbes Global 2000 list and is one of Asia’s Fab 50 Companies. Responsibilities Project deals with the maintenance and improvisation on the internet connection for British Telecom. It included the line tests and the signal to noise ratio modifications. The line tests include the complete check from exchange to the source.  Worked on the DSLAM check, analyzed the PCP position for the BT Wholesale and BT Retail Connections. Worked on the SIP issues for the FTTP and FTTH connections. Developed the new routing Algorithm on Opnet for the DOS ping attacks. Installation of intra networks and troubleshooting network failures Resolving ongoing issues or defects, often called up to consult network problems. Monitored systems in the absence of lead engineer. Updating tickets request to and closed upon request Researched coding and database concerns to resolve nonfunctional application issues Ensure design of system allows all components to work properly together. Monitor networks to ensure security and availability to specific users. Evaluate and modify system's performance Administer servers, desktop computers, printers, routers, switches, firewalls, phones, personal digital assistants, smartphones, software deployment, security updates and patches. Support LANs, WANs, network segments, Internet, and intranet systems. Responsible for reconciliation of accounts as per the debits and credits for the customer accounts using Microsoft access database. Generated reports using Excel as per the requirements. Environment: Openreach, Resolve, SNR, DSLAM, DB, Opnet, Switch Functions. EDUCATION QUALIFICATION: Bachelor of Technology in Computer Science, Jawaharlal Nehru Technological University, India"}