{"text": "Name: ethel ethel E-Mail: ethel.ethel@gmail.com Address: Bangalore, India Github: https://github.com/ethel LinkedIn: https://linkedin.com/ethel Phone No. 622511814071 OBJECTIVE: A constant learner and a go-getter, I love taking up challenges and proving up to them. SUMMARY: Over 7 years of professional experience in designing, developing and testing internet/intranet Web-based applications, Client/Server applications, Java/J2EE Architecture, OO Design patterns. Good experience in designing web/enterprise applications using Software Development Lifecycle (SDLC) methodology like Waterfall, Agile, SCRUM, RUP and Test Driven Development. Hands on expertise in designing, developing and deploying applications using J2EE technologies including JSP, Servlets, EJB, JSTL, Struts, Spring, AJAX, JDBC, JNDI, Java Beans, Hibernate, Web Services and RDBMS. Very good understanding ofModel View Controller (MVC), Client Server, Multi-tier architectures, Session Façade and Service Locator. Strong knowledge of Java/J2EE design patterns. Implemented various design patterns like, MVC, Command, Singleton, Session Facade, Front Controller, Data Access Object, Value Object patterns. Expertise in web development usingHTML5, DHTML, CSS3, Java Script, XSL, XSLT, and XML (SAX, DOM, JAXP, JAXB). Experience working with Service Oriented Architecture (SOA) with SOAP and REST and Enterprise Service Bus (ESB) using WSDL. Strong front-end UI development skills using HTML, HTML5, CSS3, JavaScript, jQuery, Angular JS, AJAX, XML, XSLT. Expert in designing enterprise applications using technologies like EJB, JNDI, JMS. Extensive experience in designing, developing and implementing Model View Controller (MVC2) using Struts 2.0/1.1/1.0, spring, and Hibernate framework. Experience in Database programming using Oracle9i/10g/11g, Sybase, DB2 UDB, MySQL, SQL Server and MS Access. Good experience in writing SQL Queries, PL/SQL Procedures, Functions, Triggers and Cursors. Experience in working with Tomcat, GlassFish, IBM WebSphere, BEA WebLogicandJBoss. Expertise in working on ANT, Hudson, Maven, Log4j, JUnit, Mockito, JMock, Test-ng. Experience in using Design Tools like Rational Rose Enterprise Tool, MS Visio, ERwin for Object Oriented Analysis (OOA) and Design (OOD) using UML(Unified Modeling Language). Experience in using various version control tools like CVS, SVN and Rational Clear Case. Strong Inter personal communication skills & ability to work independently as well as in a group. Quick Learner and adaptable to working environment. EDUCATION: Bachelor of Technology, India. TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE: \t\t\t\t Client: Florida Blue, Jacksonville, FL\t\t\t                                                        Apr 15 - Till Date Domain: Health Insurance Role: Java Developer Project Title: AOR (Agent of Record) Description: This project was to derive all the agents’ information from the source systems and provide the subscriber and member details along with agent information for their health plans. This agent information will be used at the time of agent commission payments. Responsibilities: Worked closely with Business Analysts and Project Leads to transform business requirements into Java code. Involved in design discussions and understanding of business requirements and identify the relevant functional and technical requirements. Developed UI screens using custom, general use modules and components that extend the elements and modules of core Angular JS. Used Ajax for service calls on pages to interact with the server for information.  Utilized various Angular JS and JQuery libraries, AJAX for form validation and other interactive features.  Implemented the middle layer using Spring framework for maintenance of business logic. Created and injected Spring dependency injection and to wire objects of business classes. Developed the DAO layer using Hibernate annotations to interact with POSTGRE SQL. Developed all CURD operations in the DAO layer using Hibernate annotations. Coding individual modules and unit testing them and then deployment on AWS and integration testing application.  Worked on development and operations to facilitate deployment of components over AWS Cloud using Jenkins, Fabric Tools.  Production deployment integrated with AWS ElasticBeanstalk. Used Tomcat application server to deploy the application. Used Log4j to track all the messages at different levels. Maintained the source code and all its versions using SVN. Used Maven to build the application and to retrieve all its dependencies from the central repository. Used Sonar to test the quality of the code and to identify any code related bugs. Involved in maintenance of automatic builds using Jenkins. Used Jiratool to track the tasks assigned and its progress at different levels. Involved in Unit testing, UAT, documenting, bug fixing and pre-production support. Environment: Java 7.0, HTML 5, CSS 3, JavaScript, Angular JS 1.4, JQuery 1.9, Ajax, Spring 2.3.2, Hibernate 3.6.4,  POSTGRE SQL 9.4, AWSElasticBeanstalk, Windows 7, Eclipse,  JUnit,  Log4j,  Maven,  SVN, Jenkins. Client: FedEx, Memphis, TN\t\t\t                                                                       Apr 14 – Mar 15 Domain: Logistics Role: Sr. Java Developer Project Title: ePRS (Enterprise Pricing Request System) Description: Intelligent “Process & Workflow” management system defines & facilitates the “End-to-End” pricing. This system should deliver outstanding user experience for pricing requests, pricing approvals, and pricing implementation that can be translated into maximum customer loyalty and value by offering a scalable, efficient and complete pricing request process consistently exceeding user needs. Responsibilities: Involved in converting business requirements into technical requirements. Used JSF framework with Ice Faces in developing user interface using JSF UIComponents, Validator, Events, Listeners and Backing Beans. Supported Navigation rules using JSF configuration file and defining them in the managed beans. Implemented AJAX andAngularJS to allow dynamic loading, improved interaction and rich look to the User Interface.  Coded Angular JS controllers and directives for application functionality.  Used Spring framework as middle layer and to configure an external rest service. Consumed an external Rest Service to retrieve data which acts like a service layer. Developed Model objects for presentation and Database layers. Implemented the DAO layer to interact with MySQL using Hibernation annotations. Developed all CURD operations in the DAO layer using Hibernate ORM tool. Developed and implemented SOA solutions, software apps and web service solutions. Worked within SOA based enterprise framework to build web services. Worked on AWS, High Availability Practices and deploying backup/restore infrastructure Designed and implemented a database migration to centralize multiple local MySQL database instances to a single Amazon Aurora RDS instance. Used Log4j to log the messages at different levels. Also used Ivy to maintain all the dependencies as a central repository. Used Tomcat application server to deploy the application. Used software versioning and revision control system SVN to maintain current and historical versions of codebase. Used Hudson to maintain automated builds. Developed JUnit test cases for DAO layer. Used PMD/EMMA tools for code coverage. Involved in the maintenance of deploying the code to different test levels and to production servers. Environment: Java 6.0, HTML 5, CSS 3, JSF 2.1, IceFaces 3.2,AngularJS 1.4, Spring 3.2.5, Hibernate 3.5, AWS,MySQL,  Rest Webservice, Windows 7, Eclipse,  JUnit,  Log4j,  ANT,  SVN. Client: Benecard, Orlando, FL\t\t\t\t                                                         July 13 – Mar 14 Domain: Healthcare\t\t\t\t Role: Java/ J2EE Developer    Project Title: MTM\t\t\t\t\t Description: MTM is a health care project currently being implemented by Benecard. This project will provide access to different users from Smart D and EGWP programs. It essentially sources transaction information from different pharmacies and enrolled users, also includes weekly and monthly batch programs for updating claim and enrollment data to the database. This project provides online maintenance of different cases belonging to that pharmacy and also rerouting patient cases.  Responsibilities: Interacting with the business users, analysts and understanding the requirements. Developed UI by using HTML5, CSS, JavaScript, JQuery and Ajax calls. Used JSF Framework to wire the business components. Defining the managed beans in Faces context and business layer component beans. Developed UI screens from scratch with wireframes using Primefaces3.2. Defined Managed beans using annotations and implemented navigation on UI pages in JSF2. Used Maven to build project by defining all dependencies in POM file. Defined service layer using EJB3.0 and also defined remote and local services using JNDI names. Involved in SDLC design and development of the back-end system in Java, which included implementation of Sliding window protocol, integration of the ILogJRules. Accessed remote and local EJB services from controller using JNDI names. Created different Model objects for Database and presentation. Developed data access object layer components to interact with Oracle and used Hibernate to access Database. Worked on data access layer for insertions, updating and retrieval operations of data from Oracle database. Performed deployment of project EAR on Web Sphere. Data Access Layer accessed Database using JNDI Names of Data source which are created on web sphere. Used SPRINGDependencyInjection to access mapper objects created using Hibernate from Data Access Layer.  Built configuration management scripts in Amazon's Elastic Beanstalk. Used Log4j to log the error friendly log messages to the log files. Used software versioning and revision control system SVN to maintain current and historical versions of Codebase. Generated User interface Templates using JSP, JavaScript, Ajax, JQuery, and PHP. Interacting with the Quality team about the issues, bugs found and fixing them in the testing phase of the Application. Used Mantis Bug Tracker to keep track of application bugs as well as to coordinate with the testing team. Environment: Java 5.0, JSF 2.0, Prime faces 3.2, HTML 5.0, CSS, JavaScript, Ajax,  EJB 3.0, Spring, XML, XSLT, iLog, JRules, Web services (SOAP,WSDL), AWS ElasticBeanstalk, Hibernate, DB2, Oracle, Windows 2007, Eclipse, JUnit, Log4j, Maven, SVN, Web Sphere 7.0,PHP. Client: Sprint Corporation - Overland Park, KS                                                                          July 12 – June 13                                            Role: Java/J2EE Developer Description: Sprint Corporation, commonly referred to as Sprint, is a United States telecommunications holding company that provides wireless services and is also a major global Internet carrier. It is the third largest U.S. wireless network operator. Responsibilities:  Designed, developed and deployed the application framework including Spring FW, Hibernate and deployed on Web logic Application server 10g.  Involved in developing application using agile methodologies by reporting weekly progress.  Developed the testing framework before starting the application development as confirming to agile methodologies.  Exposed web services to client developing WSDL also involved in developing web client for application interactions.  Developed an asynchronous, AJAX based rich client for improved customer experience.  Worked with developing UI by analyzing and design using MVC based Struts framework 2.0, JavaScript, CSS and HTML for the front-end screens.  Designed and implemented a Spring/Hibernate/JMS based product identification system for searching Imei and finding the status.  Worked with JSON notations to populate the data from server to client screens.  Developed Framework API for Tax calculations in Yoda using server-side components using J2EE and spring framework.  Designed, developed and implemented a messaging module using Java Messaging Service (JMS) point-to-point messaging and Message Driven Beans to listen to the messages in the queue for interactions with client ordering data.  Worked on SVN for version control and source code control.  Implemented Logging, Auditing using Spring Framework's Aspect Oriented Programming.  Worked extensively configuring JDBC connection pools and in Web logic and used SQL and PL/SQL also developed stored procedures for searching warehouse Quantities from the databases.  Environment: Java, Core Java, J2EE, UML, MDB, Servlets, Ajax, Struts, Hibernate, Spring, JSP, JDBC, Java JMS, JUnit, Oracle, Eclipse, Apache Tomcat, SVN, XML, JavaScript, CSS, Log4j, Perl, Solaris Unix, Weblogic10g, PL/SQL, Web Services (SOAP). Client: Citi Bank\t\t\t\t\t                                                           Dec 10 - Jun 12 Domain: Banking Role: Java/J2EE Developer Project Title: Banking Legal Control Application Description: The project is about the share market and the dealings carried out over there. The company develops some applications and it directly doesn't interact with each and every individual or small organizations. It will be dealing with its clients who act as mediators between the individuals and the company. Responsibilities: Responsible for gathering business requirements, review the requirements and converting them to detailed design documents andclarification documents. Used Agile Methodology (Scrum and XP) for the entire module. If required giving a quickprototypes for the application and used CoreJava for implementing multi-threading. Responsible for High Level Designs (HLD) and Low Level Design (LLD) using J2EE DesignPatterns for numerous enhancement projects within the application.  Responsible for integration of different modules.  Developed UI and backend applications using Struts, JSF, Hibernate, EJB 3.0, JSP, HTML, JavaScript and AJAX. Implemented JSP, JSF, Struts Tag Libraries, Java Scriptand CSS for developing User Interfaces Responsible for creating/generating Hibernate classes and configuration XML’s to manage Transactions (insert, update, and delete). Created JUnit test cases, and Development of JUnit classes. Configured log4j to enable/disable logging in application. Developed ANT script to build .war and .ear files for the application Used JProfiler to identify memory leaks in the application. Responsible in coordination with offshore team, attending daily and weekly scrummeetings to update the work status, issues clarifications etc. Environment: Java, Core Java, J2EE, JSP, HTML5, CSS, Struts, JMS, spring, Hibernate, NetBeans, Web Sphere, JUnit, JavaScript, Log4J, Ant, Maven, JProfiler and Oracle. Client: Andhra Bank, India \t\t\t\t\t\t                             Sep 09 - Nov 10 Domain: Security Role: Java Developer Project Title: Security Management System for Bank’s IT infrastructure Description: The project is for the identification of an organization's threats (including information systems), followed by the development, documentation, and implementation of policies and procedures for protecting these systems. Responsibilities: Participated in user requirement sessions to analysis and gather business requirements. Participated into meetings to discuss about requirements and communicated to users (Agencies) to get the information about requirements. Wrote JNI components in Java to call C++ library and interact with C++ functionality. Implemented the CoreJavaOOPS and collectionframework. Understand UseCases and prepared UML Diagrams. Involved in Analysis, Design, Development, Integration and Testing of application modules. Develop applications using Struts, spring framework and EJB. Involved developing Hibernate ORM layer (DAO) Developed WebServices using Java technology. Implemented Log4j and ExceptionHandling frameworks. Prepared unit test cases. Implemented JMS, MDB and related confirmation. Environment: Java, Core Java, J2EE, JSP, HTML, CSS, Struts, JMS, spring, Hibernate, Net Beans, Web Sphere, JavaScript, Log4J, Ant, Maven, JNI, CVS, RAD and Oracle. "}