{"text": "Name: sally sally E-Mail: sally.sally@gmail.com Address: Quanzhou, China Github: https://github.com/sally LinkedIn: https://linkedin.com/sally Phone No. 18446041415 Summary Over 8 Years of progressive experience in all the phases of software development life cycle that includes Requirement Study & Analysis, Design, Development, Integration, maintenance, installation, implementation and testing of various client/server and N-tier web applications. Experience in Application Design and Development using OOA, OOD, OOP, OOED, MVC and J2EE. Extensive experience in developing web applications using Java, J2EE, JSP, Servlets, EJB, JDBC, Struts 1.2/2, Spring 2.5, Hibernate 3.x, JMS, JSF 2, ColdFusion,Groovy, Jenkin,Ice faces 2 and XML. Experience in working with custom frameworks Experience on server side programming like JavaBeans, RMI, EJB, JDBC, JNDI, JavaMail, JMS. Experience in Database including SQL, PL/SQL, data modeling, Stored Procedures, Triggers, Views and functions in Oracle, MySQL, MS-SQL Server and DB2. Expert on XML, DTD, Schemas, XSL, XSLT, SOAP, WSDL, UDDI, SAX and DOM parsers. Worked on JQuery as a JavaScript UI Library. Good experience on servers like Apache HTTP, Apache Tomcat and application servers JBoss4.0.5 GA, BEA WebLogic 8.1, IBM WebSphere 6.0/6.1/7.0/8.5 and configuring them. Good Exposure to Service Oriented Architecture (SOA) such as Web Services including SOAP, UDDI, WSDL, JMS (Java Messaging Service), IBM Web sphere MQ Series, REST Webservices. Worked on different version controlling tools VSS, CVS, ClearCase and SVN (Subversion). Experienced in writing and building files with ANT, Maven and coding test cases using JUnit. Developed J2EE applications on different IDE’s like RAD 6.0/7.0/7.4, Eclipse3.0/3.2/4.2, JBuilder8.x and NetBeans. Worked on different operating systems WINDOWS, MAC OS, UNIX and LINUX. Having experience in designing, developing and delivering QA automation testing. Having experience in working Test Driven Development, Agile Development and Extreme Programming methodologies. Technical Skills: Professional Experience AIG Insurance\tMarch 2014 - Current Senior Java/J2EE Developer\tOrlando, FL Description: ePAS Application is used to handle Policy Management, Customer Service Claims management, Agency Management, Account Management and Output System Management.ePAS is a secure, web-based insurance policy administration system that allows authorized agents to quote and submit new policy applications, view policy statuses, and submit policy endorsements. The system will guide the agent through the policy application and endorsement processes and automatically apply underwriting rules when submitting transactions. Responsibilities: Involved in various phases of Software Development Life Cycle (SDLC) as requirement gathering, analysis, design documentation, development, test cases, implementing and production support of the application. Worked closely with the Business Analyst and designed the rules and reevaluate the rule flow in Rule Governance team. Followed AGILE Methodology to promote iterations, collaboration, and process adaptability and participated in SCRUM Meetings throughout the life cycle of project. Developed embedded C software for LINUXoperating system. Worked on rule authoring scenarios and have knowledge in articulating rule flows, Rule tasks, Decision tables and BAL rules. Exposed all the business logic in the services layer as RESTFULL Web Services using JAX-WS wrapper. Developed user interface using JSP with Java Beans, JSTL and Custom Tag Libraries, JS, CSS, Jenkin, JQuery, HTML and Ajax to speed the application. Developed standards-based web applications for various clients using ColdFusion, SQL, XHTML, DHTML. Designed and developed the project using MVC design pattern and integrated JSF 2.0 Used Spring 3.1 Framework for Dependency injection, Spring Web Services framework. Used Hibernate 3.0 in data access layer to access, update and insert information in the database. Used Java API for XML Web Services (JAX-WS) to convert Java Objects to XML conversions Used HTML, Groovy and CSS in the development in front end of the application. Implemented various design patterns in the project such as DAO, Business Delegate, View Helper, Data Transfer Object (DTO), Session Façade, Singleton and Model View Controller. Used ANT,Maven build scripts to build the application and deploy on Web Sphere application server v8.0. Performed QA testing in on the front-end of the development cycle for gains in code quality, software functionality and programmer productivity. Developed different modules of the application using IntelliJ IDEA 13.1. Used iText API to generate PDF Used JUnit 3 for unit testing and Log4j to log the logs Used Perforce Visual Client for updating the view and used Serena Business Manager for bug tracking in test and production environment. Used Microsoft Outlook 2011 for Email Exchanges and Process to promote the code to higher environment (Test Environment to Production). Prepared the High Level and Low Level, UI standard, Code Review, Architectural Review and Project Approval Documents. Used Code Collaborator 8.5 to do the Code Reviews and Aqua Data Studio 14.0 - 64bit for Database UI Client Environment: Java 1.4/1.5/1.6, WebSphere Application Server 8.0, IntelliJ IDEA 13.1, soap UI 4.01, DB2 for i5/OS V5R4, Spring MVC 3.0.1, Spring Security 3.0.5, Hibernate 3.0, JSP, Servlets, JavaScript, JSF 2.0,HTML, CSS, Groovy, Jenkin, JMS, XML, SOAP,REST, WSDL, LINUX, Web Services, JDBC, UML,QA Testing, Java Beans, JNDI, Ajax, JUnit, ANT, Perforce Visual Client, Serena Business Manager, ColdFusion, Log4J, iText API, Aqua Data Studio 14.0. Blue Cross Blue Shield\tAugust 2012 – February 2014 Java Developer\tJacksonville - FL Smart Quote Enrollment System project at Blue Cross Blue Shield of Florida needed to update and improve the overall user experience and functionality of the existing smart quote and enrollment system, which covers the health, and dental insurance plans for individuals and employers. The smart quote system was designed to provide real time synchronous quotes using state of the art profile analysis and coverage matching algorithms in the online enrollment module for individuals and employers. The system was designed using a J2EE perspective using the combination of Hibernate and spring framework to provide a dynamic and rich user experience. Responsibilities: Involved in Analysis, Design and Development of “price change” module, “vendor & product setup” modules, “supply chain module” (SCM) and “purchase order” module and developed specs that include Use Cases, Class Diagrams, Sequence Diagrams and Activity Diagrams. Developed Custom Tags, Struts Tags to support User Interfaces. Followed AGILE Methodology and participated in SCRUM Meetings throughout the life cycle of project. Developed the application using Struts Framework with respect to Model View Controller 2 (MVC) architecture. Used Spring Framework for Dependency injection of DAO’s into Service Layers and also for injecting the Service Layers and DAO’s into Struts Action Classes. Integrated with the Spring Framework, Struts and Hibernate. Provided performance tuning enhancements to Clients system based on Sun Identity Server and Access Manager. Integrated with Sun’s JD API. Used Web Services using SOAP for communicating between the Integration Layer and Automated Case Pick System. Developed standards-based web applications for various clients using ColdFusion, SQL, XHTML, DHTML, JavaScript, jQuery, Jenkin, AJAX, CSS, and relational databases (MS SQL Server and MySQL). Designed, code, and integrated software for LINUX platform. Implemented persistence layer using Hibernate that use the POJO classes to represent the persistence database tables. Mapped the classes and their relationships according to the Database Model. Performed Regression and Functional Testing on Lotus Notes. Performed QA testing for software functionality and programmer productivity. Developed stored procedures, triggers for efficient interaction with database. Used JBoss 5.1.0 for deploying the Application and Tomcat 6.0 for Coding, testing the application. Used Log4J to capture the log. Used CVS for version control across common source code used by developers. Environment:Java, J2EE 1.6, JSP 2.1, Struts 1.2, Apache ActiveMQ, Oracle10g, XML, Castor, SOAP, ANT, JAX-WS,Jenkin Backbone.js, Rational Rose, JBoss 5.1.0, Hibernate 3.1, ColdFusion, Agile, Spring Framework, LINUX,QA,LOG4J, CVS, Eclipse 3.2 Wright-Patt Credit Union, Inc.,\tNovember 2011 – July 2012 Java Developer\tFairborn, OH The e-Banking Project involved the enhancement of web-based online banking services to customers.  It give customers a secure and easy access to online functions that includes creating new accounts, monthly Statements account balances, transfer funds and more. Responsibilities: Gathered requirements for preparing Business Requirement specifications and analyzed the specification documents to development process. Involved in all layers like Presentation Layer, Business Logic and Data Access Layers. Front-end is designed by using HTML, CSS, JSP, JSTL and Struts. Involved in developing the CSS sheets for the UI Components. Used Struts Tiles-definition for lay outing the different sections of the page. Designed the Struts Validation Framework for validating the UI, tiles framework and implemented Internationalization (il8n). Involved in writing Struts form-beans for transferring the data from Controller to the Model. Involved in developing Hibernate mapping files and POJOs for Hibernate persistence layer. Used Hibernate as ORM tool for accessing database. Implemented different modules of Spring Framework such as IOC, DAO, O/R mapping. Implementing the file upload and download functionality using Struts, Servlets. Integrated and configured Struts Spring and Hibernate framework environment. Used Log4j for logging in the application. Involved in front end validation using Struts Validation and JavaScript. Designing and configuring core xml files for implementation of struts. Used ANT tool for creating and deploying the .war files. Involved in Unit and System Testing using JUnit (TFD) before placing the application for the Acceptance Testing. JDBC connection pooling for accessing Oracle 10g database. Used SOAP WebServices (synchronous and asynchronous) for checking customer information like names (NA) and credit checks. Used Rational Clear Case for version control. Extensively used RAD 6.0 with various plugins for implementing various modules. Developed Ant build scripts for deploying the project on WebSphere 6.0 application server. Involved in unit testing of different components using JUnit. Used MQ Series for different applications so that they can work together. Responsible for the support and maintenance of the application. Environment: Java (JDK 1.5), J2EE, JSP 1.2, Servlets, Java Script, HTML, Struts1.2, Spring, Hibernate, RAD 6.0, JSTL, Rational Clear Case, SQL, MQ Series Windows XP. Cybertech Systems and Softwares Ltd\tJanuary 2010 -October 2011 Java J2EE Developer\tMumbai, INDIA This project is for US based client Integrated and it was mainly for data backup on internet where users can subscribe for paid or free subscription and store their data on different servers located in Europe and US. User can perform multiple functionality like share data with others and also user can access features like Encrypted data service etc. This project is titled as MyNexoko which refers to something own (for the users). This is an online data backup site. A user can put his data on the site and can access from any location in the world. They can access their data in different language also as per the location and browser setting. It has been developed to address the problem of today’s data backup, save and security problems. Often the big companies and organizations have the problem to maintain their data. They have to face several challenges regarding this. ‘MyNexoko’ is the solution for this. It provides two kinds of users 1. The free users and 2.The Paid Users. Both the users can access MyNexoko. Apart from this; users will get other services too. Like they can ask for DVD’s of their data on MyNexoko. Responsibilities: Feasibility Analysis. Requirement gathering. Involved in Designing. Assist higher authorities to choose best solution. Developed the entire application implementing MVC Architecture integrating HTML with Hibernate and Wicket frameworks. Responsible for creating Use-Cases. Involved in development of presentation layer using JSP and Servlets with Development tool Eclipse IDE 3.4. Worked on development of Hibernate, including mapping files, configuration file and classes to interact with the database. Implemented Object-relation mapping in the persistence layer using hibernate frame work in conjunction with Springfunctionality. Involved in DAO layer using Hibernate to connect to databse. Developed some property files to support internationalization. Developed web-based customer management software using Wicket and web services. Created Java Servlet and other classes, deployed as EAR file, connecting to MySql database using Hibernate. Developed the business logics using Java Beans. Developed the user interfaces using HTML and CSS according to Wicket Framework. Web-UI developed using HTML, AJAX, JavaScript, CSS and Tag libraries. Developed the business logics using Java Beans. Providing estimates for the changes based on the business and functional requirements. Code reviewing. Used JUnit framework for Unit testing of application. Utilized Log4J for logging application-debugging logs. Environment:Java1.5, J2EE, Wicket, CSS, HTML, AJAX, JavaScript, Log4J, ANT, Hibernate 3.0, Web Services (Restful), WebSphere6.1, MySql, Netbeans, AJAX, Junit,HTML, Windows XP Professional, SVN. Motorola\tMarch 2008 - November 2009 Role: Java/J2EE Developer\tHyderabad, India This project is broadly divided into two modules: User Module and Administrative Module. Registered users can log into their accounts which includes Payment Info, Contact Info, Validating payments and sending acknowledgement mails to the users as well as to the administrator. Administrator module allows validating user profiles. Responsibilities: Involved in Customer and Admin modules, understood the technical specification Worked on presentation layer with JSP, HTML, CSS, AJAX and JavaScript Used Hibernate as the persistence/ORM framework, for mapping the objects into MySQL Database. Coded hibernate configuration and mapping files. Developed one-to-one and one-to-many mappings Developed web services using SOAP, WSDL and Apache Axis, done XML transformation and parsing using XML, XML schema, XSLT and XPath Implemented JavaMail API to send order confirmation and updates to the user Developed unit test cases using JUnit and involved in unit testing and integration testing Done clustering and load balancing in tomcat server to achieve scalability of the application Environment:  J2SE 1.4,  Servlets, Tomcat 5.0, Struts 1.1, Hibernate 2,JDBC,  MySQL, SOAP, WSDL, Web services, XML, XSLT, EJB-Stateless session, XPath, XML Schema, Unix, Eclipse, HTML, CSS, JavaScript, ANT, Log4J, JUnit, Eclipse, Bugzilla. AmplisoftPvt Ltd\tMarch 2007 - February 2008 JAVA Developer\tHyderabad, India Astro 7.5 Fault Manager project is involved developing an NMS-EMS system using AdventNetWebNMS framework to manage and monitor Motorola proprietary devices. These devices were used primarily by the LAPD and various other police departments around the globe for two-way communication. The infrastructure involved the basic personal equipment of handheld Two-Way radios to the Call processing Servers, Base Stations and even the fans used to cool the servers. Some of the basic functionality supported by the EMS includes Fault Management, Performance Management, Configuration Management and Security Management. Responsibilities: Worked on the development of the Performance Management module in Astro7.5. Design and development of Migration Module. Successful integrated the Performance Management module in the Astro 7.5 system and ensured the flawless Performance Management of legacy Astro 7.3 devices. Involved in effective Unit testing of the entire Performance Management and Migration Modules. Performed design updates and design document delivery to customer Executed a successful live demo of the Migration Module that ensured the migration of a server running Astro 7.3 to Astro 7.5 with preserving the older data and minimal downtime with almost zero personnel intervention. Environment: Core Java, Swing, MySQL, AdventNetWebNMS 4.7 SP3, AdventNet Simulator 4.0, SNMPv3, Apache Tomcat, CVS, Bugzilla, ANT, NMS Archive – NAR, AWT, JDBC"}