{"text": "Name: gladys gladys E-Mail: gladys.gladys@gmail.com Address: Yuncheng, China Github: https://github.com/gladys LinkedIn: https://linkedin.com/gladys Phone No. 591783105719 PROFESSIONAL SUMMARY: 7 years of experience in developing web-based enterprise applications using Java/J2EE technologies. Experience in software development includes analysis, design, implementation, deployment and testing phases of SDLC life cycle. Extensive experience in Requirement capturing, impact analysis, user story capturing, use cases, specification design, function point analysis, and various phases of project documentation. Extensive experience in developing professional UI web modules using HTML5, DHTML, Cucumber and Selenium Web Driver, CSS3, JavaScript, XML, XSLT, JQuery, Ajax, backbone.js, JSON, Tiles, Bootstrap. Experience in using CSS Preprocessors like SASS, LESS. Use Node Package Manager (NPM) to manage the modules and used it to install useful tools such as Express. . Expertise in developing applications using Core Java concepts like OOPS, Multithreading, Collections Frameworks, Exception Handling, Data structures and JDBC. Good experience in working with different modules of Spring Framework, particularly Inversion of Control (IoC) and Aspect-Oriented Programming (AOP). Experience with multiple servers including Apache Tomcat, JBoss, BEA WebLogic, and IBM WebSphere. Extensive experience in IDE and debugging tools such as Eclipse and NetBeans. Good experience in various design patterns such as Façade, Factory, Model-View-Controller (MVC), Data Access Object (DAO), Front Controller, Prototype, and Singleton. Extensive experience in Java Server side programming, Client/Server technology, and Web based software development using J2EE, Servlets, and XML. Had experience in developing RESTful Services and Web Service Clients (JAX-RS or JAX-WS) with data representation in different formats such as XML and JSON. Experience of using SOAP based web services with JAX-WS frame work, Apache CXF, WSDL and Apache Axis2 engine. Experience in using and implementing various business rules using rule engine Drools and SOA. Extensive experience with ORM Frameworks Hibernate, Ibatis, JPA. Proficient in Java Enterprise Technologies such as Spring MVC, Struts MVC, Hibernate, and Spring JDBC. Used GO language to build Monolith server and Auth application. Experience building micro services using Go Lang / Go Framework. Experience in writing SQL and PL/SQL scripts including stored procedures, packages, query tuning, optimization, and indexes. Hands on experience in working with various databases like Oracle and MySQL. Experience in working with the Columnar NoSQL Database like HBase, MongoDB, Cassandra to manage extremely large data sets. Good working knowledge of Cassandra and MongoDB Experience in Lucene/Apache Solr to index the processed data to make use of Solr search capabilities. Hands on exposure to different SDLC models like Waterfall, Agile and undergone the training in software Development Processes like SDLC, Test Driven Development (TDD),ATDD(Automated test Driven Development) and Iterative Methodologies, SCRUM, SDLC, UML, Parallel programming, Extreme Programming and Test-Driven Development.  Design, purchase, assemble, and configure network servers and workstations for data processing, multimedia production, web services, email, and other business operations using UNIX (Solaris, RedHat, Gentoo Linux) and Windows (XP, Vista, 7, 2003 Server, 2008 Server) Operating Systems.   Experienced in writing XML DTDs and style sheets. Experienced in using SOAP and REST based Web Services. Hands on experience in unit testing using  JUnit. Optimized Hibernate fetching strategies and reduced DB2 hits  Identified and fixed mystery coding-bugs and DB2 SQL errors  Made requests to remove some very expensive calls from JSP pages to DB2 via Hibernate queries Configuration Management and source code repository management using tools like GIT, Subversion.  Experience in Administration/Maintenance of source control management systems, such as Sub Version (SVN), TFS, Git Bash, Github, Git GUI and other command line applications etc.  Experience leveraging TFS (Team Foundation Server) in an environment using Visual Studio and Microsoft SQL Server.  Worked on using Rabbit MQ, IBM MQ, and Apache Kafka as a Message Oriented Middleware for integrating applications. Asynchronous logging was done using Log4J and SLF4J framework. Experience on performing unit Testing using JUnit and mocking frameworks like JMock and Mockito and made source code changes will not break existing Unit Tests Expertise in Querying RDBMS such as Oracle and SQL Server for data integrity.  Experience in deploying and configuring application servers such as IBM WebSphere, Oracle WebLogic, Jboss and Apache Tomcat. Strong experience in UNIX and Shell scripting. Exposure to onsite/offshore coordination. Good organizational and interpersonal skills along with skilled problem solving and troubleshooting abilities. Ability to understand new ideas and technologies very quickly and produce desired results.  TECHNICAL SKILLS\t EDUCATIONAL DETAILS Bachelor of Technology in Computer Science from JNTUH, INDIA. WORK EXPERIENCE Client: Darden, Orlando, FL                                                                                                      Nov’2016 – Till date SR. JAVA DEVELOPER\t\t\t\t\t Description: Darden is an American multi-brand restaurant operator who owns eight casual dining restaurant chains. This project deals with Online Ordering platforms like making an order, validating order and online payment system. My role is to create UI components for login, user profiles, user accounts, bill payment, viewing orders and provide back-end support for these modules using RESTful services. Responsibilities: Involved in various Software Development Life Cycle (SDLC) phases of the project. Generated Use Case Diagrams, Class Diagrams, and Sequence Diagrams with Business team using Rational Rose. Implemented the application using Spring Framework 4.x, which is based on the MVC design pattern. Created TypeScript reusable components and services to consume REST API's using Component based architecture provided by Angular 2. Used Selectors, Events, AJAX and Dom Manipulation using components in Angular 2 for updating content on DOM nodes. Implemented Angular Router to enable navigation from one view to the next as agent performs application tasks. Used Angular 2.0 forms like Template Driven forms and Modern Driven forms to perform form validations both on server and client side. Designed and developed Micro Services using latest server technologies like Docker, Apache Kafka and Kafka Streams. Developed complex functions with Lambda expressions using JAVA 8. Used Spring Validation and Tiles Framework in the presentation layer. Developed user interface using JSP and JSP Tag libraries. Created prototypes for business user approval. Used Spring’s  AOP feature to overcome cross cutting concerns. One cross cutting concern was optimistic locking of a contract. Used Spring Framework for Dependency Injection and integrated it with the Struts Framework and Hibernate. Used GO programming language to build Monolith server and Auth application. Experience building micro services using Go Lang / Go Framework. Developed Spark applications by using Scala and Python and implemented Apache Spark for data processing from various streaming sources.  Developed Spark applications using Scala & Python to do the analytics on the data stored on HDFS.  Worked as a Spark Expert and performance Optimizer.  Experienced with Spark Context, Spark-SQL, Data Frame, Pair RDD's, Spark YARN.  Writing MapReduce (Hadoop) programs to convert text files into AVRO and loading into Hive (Hadoop) table.  Scrapping the application data from web server using Go language and syncing & backing up databases. Worked with Spark for improving performance and optimization of the existing algorithms in Hadoop using Spark Context, Spark-SQL, Data Frames, Pair RDD's.  Developed preprocessing job using Spark Data frames to transform Json documents to flat file.  Loaded D-Stream data into Spark RDD and did in-memory data computation to generate output response.  Experienced in writing real-time processing and core jobs using Spark Streaming with Kafka as a data pipe-line system. Designed and developed DTOs to carry the data from front end to middle tier.  Involved in DAO development to access data from the Microsoft server database. Extensively used Log4J for logging the client activity and other processes in the system. Consumed Web Services using SOAP and REST. Built model jar files and rule flow, helped design the large numbers of rules, extracted rules data from the database and decision tables. Invoked rules from Java side. Used Drools Decision Table using excel sheets with a Spring boot project. Implemented OAuth 2.0 protocol on our API for authentication and authorization to add more layer of security in accessing our applications. Managed and maintained HSQL databases in production domain. Used WebSphere as to Deployment the application and web services. Used Lucene/Apache Solr to index the processed data to make use of Solr search capabilities. Worked with different business groups to generate cost based reports using Solr. Several reports were built using Hive and indexed using Solr. Involved in developing UNIX scripts for creating and indexing the Data in the Solr. Used JMS API for asynchronous communication by putting the messages in the Message queue. Used JMS publish and subscribe queue messaging for asynchronous communication with other systems. Design, purchase, assemble, and configure network servers and workstations for data processing, multimedia production, web services, email, and other business operations using UNIX (Solaris, RedHat, Gentoo Linux) and Windows (XP, Vista, 7, 2003 Server, 2008 Server) Operating Systems.   Designed and developed automate creation on of kafka and zookeeper infrastructure. Used Workflow tools included: ReactJS, Redux, Flux, Axios, NodeJS, REST API, JavaScript(ES6), Webpack, jQuery, Bootstrap, JSON, Postman, Docker and Github. Designed and developed Message Driven Beans (MDBs) as Message Listeners. Designed and developed some part of Business tier with Stateless Session beans with EJB 2.0 standards. Optimized Hibernate fetching strategies and reduced DB2 hits  Identified and fixed mystery coding-bugs and DB2 SQL errors  Made requests to remove some very expensive calls from JSP pages to DB2 via Hibernate queries. Used iReport tool to develop Jasper reports for generating reports in PDF format. Implemented various design patterns in the project such as Façade, Factory, MVC, DAO, Front Controller, Prototype, and Singleton. Used ESLint tool to review the jQuery/JavaScript code to make client-side script as per industry standards.  Used GIT Repository with VS extensions for version control and source code maintenance needs.  Utilized Postman for calling API's from Backend to make sure data passing appropriate for Front End.  Involved in unit testing and code reviews while development and fixing the bugs.  Developed Power Shell 2.0 scripting to work with TFS Object Model to utilize for more repeatable, automated processes and tasks.  Performed unit testing using JUnit framework. Designing and executing the automation scripts using Selenium-WebDriver. Conducted Automation testing using the Standards, guidelines and structured methodology in testing the application using Java. Used Agile tools like Rally and Jira for project management and tracking. Followed micro services architecture to make the application scalable. Used Jenkins to build and deploy on JBoss Application Server. Performed Unit testing and integration testing. Provided Technical support, fixed bugs, and added enhancements for production teams. Environment : java 1.8, J2EE,JSP,Servlets,Angular2 js, Spring 4.3, Spring MVC, Spring boot , Maven, Hibernate, JMS, MDB, iReport, JSP,JSF, HSQL, OAuth 2.0 , Micro Services, HTML, DHTML, SVN, CVS, Git, Node js, Angular2 js, Microsoft SQL Server, RedHat, Go Language, DB2, Solr, Agile, Spring JDBC, JUnit, Web Services SOAP and RESTful, WebSphere, Selenium,Log4j, SQL, JBoss 5.0, Docker. Fram Group, Perrysburg, OH.                                                                                                 Dec’2015 – Oct’2016 SR. JAVA DEVELOPER  \t\t\t\t Description: Fram Group supplies a broad range of automotive products under well-known industry brands, including: Autolite spark plugs and wire sets and FRAM filters. Project involved creating new pages for Autolite site to provide users a better and friendly experience with the site using Agile Methodology of software development. I am responsible for designing front end components. I was involved in developing the front end for the product pages and provided the backend with the web services to persist data from the database. Responsibilities: Involved in design, implementation and testing phases of SDLC as the project was agile in nature. Created the design document and production support transition plan to facilitate the process of maintenance.  Developed the application using Service Oriented Architecture (SOA). Developed the Restful web services which intern make multiple calls and format the data as per the user requirement. Implemented spring MVC architectural design pattern.  Used Apache CXF and Jersey APIs in developing the web services. Followed micro services architecture to make the application scalable. Involved in the integration of frameworks like spring and Hibernate.  Developed the front end using JSF, HTML5, CSS3, JavaScript, AJAX, JSP, CSS, JQuery, Bootstrap and Angular Js. Designed web screens for various modules using JSF, HTML, DHTML and CSS and used JavaScript client side validation.  Used Angular Js as the development framework to build a single-page application. Developed the User Interactive NodeJS RESTFul API Web Application navigation tool like Maps API using Leaflet.JS for front-end regional mapped area. Expertise in implementing application using Multithreading, JSF, Struts, Struts Validations, Tag libs, Log4j, spring, Hibernate Frameworks, Apache Camel, Apache Karaf. Development of Rest web services using  Spring with the enabled OAUTH. Implementation of second level cache in Hibernate. Wrote build & deployment scripts using Ant, Maven on Unix environment.  Involved in the deployment of the application using WebLogic Server.  Developed POJO's, Data Access Object (DAO) which handles all database operations using Hibernate.  Managed and maintained Oracle and NoSQL databases in production domain.  Spring IOC is used to handle the object creation. Json, Jackson and JAXB parsers are used to convert the java POJO’s to Json and XML objects and vice versa.  Created Store Procedures, Views, Triggers, SQL Queries on tables. Worked on installation of different versions of DB2 UDB on AI The application was deployed on Web Sphere Application server 8.5.5. Used tools like JProfiler for application profiling and Sonar-Qube for static code analysis. Rational Team Concert is used for agile application management. Cucumber was used for entire regression testing and functional testing with primary tool as Selenium to test Scenarios, test Cases and Test conditions identified.  Used Jazz source control to maintain and integrate the source code. Involved in SCRUM meetings and stand up meetings. Asynchronous logging was done using Log4J and SLF4J framework. Environment:  Java1.8, J2EE, JSP, Servlet, Spring, Hibernate, Angular Js, WebLogic, Oracle 11g/12g, XML, Java Script, CSS, HTML, NoSQL, OAUTH , Bootstrap, micro-services, Apache Spark , Cassandra, JUnit4, DB2,REST, Jenkins, Maven, Agile, Apache Camel.  Client: Cigna Health Care, Bloomfield, CT.\t                                                              Feb’2015 – Nov’2015                                                                                              SR. JAVA DEVELOPER   \t\t Description: Cigna website online is used by Members, Prospective Members, Organizations and Brokers to perform day to day insurance needs. The aim of the project was to develop, enhance and maintain Insurance applications for “CIGNA Group Insurance” for members. Also, to check current plan and benefits details. Additional Features such as status of a claim, View policies and procedures, and administrative guidelines where provided. Client interacts through web interface with web services written at back end to fetch data from database and select their plan benefits. Responsibilities: Involved in developing the front end using BackBone JS, HandleBar JS, Jquery, HTML5 and CSS3. Worked with other JavaScript frameworks such as Backbone JS and Handle Bar JS. Used JQuery in developing the Rich Internet Applications (RIA) with AJAX mechanism and JSON as a data exchange tool. Used Backbone JS to utilize its rendering functions and create controllers to handle events triggered by clients and send request to server. Involved in developing components on Reporting Dashboard with Spring MVC, Spring Framework and Hibernate. Designed and Implemented SOA Architecture, Multithreading, using Spring MVC Framework, Spring Batch Coding involves Writing Controller Rest Controller, Service Layer and DAOClasses. Used Spring/MVC framework to enable the interactions between JSP/View layer and implemented distinctive design patterns with J2EE and XML technology. Involved in development of Spring DAO layer which invoked database queries. Extensively worked with Hibernate Query Language (HQL) to store and retrieve the data from Oracle database. Used JPA (Java Persistence API) with Hibernate as Persistence provider for Object Relational mapping. Design and development of business components using Spring AOP, Spring IOC, Spring Annotations. Used Spring MVC Framework for Dependency Injection and integrated with the Hibernate and spring security features, using AOP Interceptors for authentication. Used the DAO pattern for data access layer and JMS API for the messaging requirement. Involved in the development of underwriting process, which involves communications without side systems using IBM MQ and JMS. Used Jersey API to implement Restful web service to retrieve JSON response and used Jackson library to parse JSON response.  Developed SOAP Web Services by using JAX-WS and Restful web services by using (JAX-RS) Jersey framework. Implemented Spring MVC Rest API which interacts with Soap web service and Oracle data base and elastic search. Experience in installing, configuring and administration of an Elastic Search Cluster.  Involved in the deployment of Web-Service End-Points using Apache CXF. Performed appropriate JUnit testing and ensured accuracy. Automated builds and deployments of business-critical customer-facing J2EE web applications into Web sphere 6.x application server environment on Solaris 10 platform. Integration of automation batch run job with JENKINS. Worked with Jenkins Continuous Integration tool. Wrote and integrated with the business validations for the application in the Drools layer Environment: AngularJS, Spring MVC, Backbone JS, Hibernate, Spring AOP, Spring DAO, Spring Security, JMS, JTA, Rest Services, SOAP Services, Apache CXF, Junit, Selenium, WebSphere, JBOSS, Drools, MySQL, Jenkins. Client: Ericsson, NJ\t                                          \t \t                               \t      Oct’2013 – Jan’2015 SR. JAVA DEVELOPER                                                        \t\t\t Description: Ericsson is a multinational networking and telecommunications equipment and services company. The project is about developing architecting solutions, building new products, enhancing existing systems all to deliver value to our customers. My role is to create UI components for login, user profiles, user accounts, bill payment, viewing transactions and provide back-end support for these modules using RESTful services. Responsibilities: Application development using Java/J2EE Technologies which include Servlets,  Java Beans, Spring 3.x, Web Services (SOAP and RESTFUL) Written Hibernate annotation based mapping java classes with Oracle Database tables. Used Session façade. Implemented JMSAPI for messaging. Involved in High Level Design and prepared Logical view of the Application. Involved in designing and developing of Object Oriented methodologies using UML and created Use Case, Class, Sequence diagrams. Implemented Multithread concepts in java classes to avoid deadlocking. Utilize Redux to render and deploy company-end setting webpages and all the jobseeker-end webpages.  Created Core java Interfaces and Abstract classes for different functionalities. Written Spring Core and Spring MVC files to associate DAO with Business Layer. Used PL/SQL procedures. Implemented the spring dependency injection of the Database helper instance to the action objects.  Wrote Action classes, Business Objects and Service classes.  Used Struts tag libraries in the JSP pages. Created detail design documents which has the UML Design diagrams, table information, object model etc which are required for the developer.  Worked with various version control tools like CVS, Clear Case and Subversion (SVN)  Developed the Servlets for processing the data on the server  Configured Struts-config.xml with all the mappings required by the architecture.  Created Data Source and deployed web application in the IBM Websphere application Server. Implemented JSF in Presentation layer programming using JSTL, AJAX, GWT Development. Worked with DHTML, CSS, JAVASCRIPT, JSON in UI pages. Created controller Servlets for handling HTTP requests from JSP pages. Installing, configuring Jboss 4.3 on Linux, Unix servers, integrating it with Apache server. Writing JavaScript functions for various validation purposes.  Developed complex Web Services and tailored JAX-RS API to suit the requirement. Consumed and Developed Web services (REST) through JAX-RS in Apache Axis to interact with other components. Created new JAX-WS services and updated existing SOAP services. Created WSDLs as per UI pages & generated client jars using JAX-WS. Developed, deployed and supported enterprise backup and recovery strategies, using RMAN, shell scripts. Automated Business rules and metadata loads with maxl and shell scripts. Achieved Created-Read-Update-Delete(CRUD) operations for various tasks and objects within user's authority on Oracle database. Used JDBC to invoke SQL stored procedures for applications that need to execute as a part ofa scheduling mechanisms and database connectivity to Oracle. Created database tables and implemented SQL Stored Procedures, triggers, and complex queries in MySQL. Writing JavaBeans to contain data objects. Implemented session beans, entity beans and message driven beans. Developed client user interface using JSPs and Servlets. Used Version Control Tool to perform Checking-out and Checking-in of codes from the repository. Developed web services in Java and Experienced with SOAP. Used Jenkins to build and deploy the application. Environment: EJB2.0, Springs, Hibernate, JSP, JSF, Servlets, Web services, XML, XSLT, XSL, JavaScript, Struts , Ant, JBoss, HSQL, Net Beans, SOAP, Rest, Apache, DB2, Oracle 9i, SQL, PL/SQL, IBM websphere, Windows 2000/XP, Linux , Unix, Enterprise Architect. Client: HomeShop18.com, India                                                                                            Feb’2013 – Sep’2013                                                   JR. JAVA DEVELOPER          \t\t\t Description: Homeshop18 is a B2B transaction portal, which enables marketplace for small, and medium sized enterprises E-commerce in India seeking export opportunities. Our project includes various modules like enrollment process, selection of user preferences for industries, allowing users to list items/materials for sale, work flows among enrolled users, news groups, administrator module, e-mail support for enrolled users. My role in this project is to create UI interface and provide backend support using Java/J2EE technologies. Responsibilities: Analysis and Design of various modules using J2EE Architecture. Written Hibernate annotation based mapping java classes with Oracle Database tables. Used Session façade. Implemented JMS API for messaging. Developed web services SOAP, WSDL and web services clients using JAXB and XML, implemented SOA architecture. Involved in High Level Design and prepared Logical view of the Application. Involved in designing and developing of Object Oriented methodologies using UML and created Use Case, Class, Sequence diagrams. Implemented Multithread concepts in java classes to avoid deadlocking. Utilize Redux to render and deploy company-end setting webpages and all the jobseeker-end webpages.  Created Core java Interfaces and Abstract classes for different functionalities. Written Spring Core and Spring MVC files to associate DAO with Business Layer. Used PL/SQL procedures. Implemented the spring dependency injection of the Database helper instance to the action objects.  Wrote Action classes, Business Objects and Service classes.  Used Struts tag libraries in the JSP pages. Created detail design documents which has the UML Design diagrams, table information, object model etc which are required for the developer.  Worked with various version control tools like CVS, Clear Case and Subversion (SVN)  Developed the Servlets for processing the data on the server  Configured Struts-config.xml with all the mappings required by the architecture.  Created Data Source and deployed web application in the IBM Websphere application Server. Implemented JSF in Presentation layer programming using JSTL, AJAX, GWT Development. Worked with DHTML, CSS, JAVASCRIPT, JSON in UI pages. Created controller Servlets for handling HTTP requests from JSP pages. Installing, configuring Jboss 4.3 on Linux, Unix servers, integrating it with Apache server. Writing JavaScript functions for various validation purposes. Writing Java Beans to contain data objects. Implemented session beans, entity beans and message driven beans. Developed client user interface using JSPs and Servlets. Used Version Control Tool to perform Checking-out and Checking-in of codes from the repository. Used EJB Query Language to retrieve data from Hypersonic SQL. Developed web services in Java and Experienced with SOAP. Used Jenkins to build and deploy the application. Developed and maintained Ant Scripts for the build purposes on testing and production environments. Environment: EJB2.0, Springs, Hibernate, JSP, JSF, Servlets, Web services, XML, XSLT, XSL, JavaScript, Struts , Ant, JBoss, HSQL, Net Beans, Apache, DB2, Oracle 9i, SQL, PL/SQL, IBM websphere, Windows 2000/XP, Linux , Unix, Enterprise Architect. Client: Value Labs, India.   \t       \t\t\t                                                 Nov’2010 – Jan’2013                                                                                    JR. JAVA DEVELOPER\t\t\t\t Description: Project involved creating new pages for personals site to provide users a better and friendly experience with the site using Agile Methodology of software development. Project involves developing product pages for personals providing various features to users along with promoting partners in various pharmaceutical companies. Responsibilities: Involved in Design, Development, Testing and Integration of the application. Implementing business logic and data base connectivity. Client side installation and configuration of project. Developed using simple Struts Validation for validation of user input as per the business logic and initial data loading. Co-coordinated Application testing with the help of testing team. Writing database queries on Oracle 9i. Writing stored procedures, Packages, Views, Cursors, Functions and triggers using SQL in the back end. Used Hibernate for Object Relational Mapping (ORM) and data persistence. Wrote SQL commands and Stored Procedures to retrieve data from Oracle database. Used PL/SQL procedures. Generated proper correspondence for Health Benefits such as SNAP, TANF and LiHeap Program.  Developed the application using Singleton, Business Delegate and Data Transfer Object design patterns in the project. Created and implemented Oracle Stored Procedures, Functions, Triggers and complex queries using SQL. Used multithreaded environment to run the processes asynchronously using different future calls to access the data. Ability to quickly adjust priorities and take on projects with limited specifications.  Effective team player with excellent logical and analytical abilities. Excellent written and verbal communication skills, inter-personal skills and self-learning attitude. Environment: Java, JSP, Struts 1.3.8, CMS, Spring 1.0.2, SOAP Web services, SOA, JavaScript, CSS, XML, JAXB XHTML, XSLT, JMS, Ajax, Hibernate 2.1, SNAP, TANF, LiHeap, EJB 2.0, 2.1, Log4j, Oracle 9i, PL/SQL, Web Sphere 6.1, Ant, RAD 7.0, Eclipse 3.2, UNIX, Perl."}