{"text": "Name: vera vera E-Mail: vera.vera@gmail.com Address: Sūrat, India Github: https://github.com/vera LinkedIn: https://linkedin.com/vera Phone No. 895039827975 SUMMARY Around 8 years of IT experience in ERP including Designing, Development, Testing and Implementation of Oracle Applications R12/11i/10.7 in Oracle Financial and SCM modules in Oracle EBS Good technical development skills in developing Reports, Interfaces, Conversions and Extensions, and Workflow (RICEW) components. Strong Technical knowledge in Oracle EBSFinancials, Supply Chain Management (SCM) modules like Oracle Inventory(INV),Order Management(OM), Bill of Materials(BOM), Account Receivables(AR), Account Payables(AP), General Ledger(GL),Advance Pricing, Work in Process(WIP). Expertise in design and development of Interface/Conversion programs to import data from legacy systems and integrate it into Oracle Applications using Oracle open interfaces and Oracle Public API’s. Technically proficient in RICEW components (Reports, Interfaces, Conversion, Extension, Workflow). Good knowledge on Order to Cash (OTC),Procure to Pay (P2P) cycles. Proficient in writing stored procedures, Packages, Triggers and Functions using SQL & PL/SQL and expertise in implementing UNIX Shell scripting. Strong Knowledge of Application Implementation Methodology (AIM), Application object Library (AOL) implementation standards, and Trading Community Architecture (TCA). Strong technical skills such as Oracle Reports 6i, UNIX, SQL*LOADER, TOAD and SQL*PLUS and experience using Oracle Discoverer. Expertise working with Oracle 10g/9i/8i, Developer 2000, Forms 10g/6i, Reports 10g/6i/4i, Discoverer 10g/9i/4i and XML/BI Publisher. Expert in Oracle Application Framework (OAF) applications, customization of OAF pages, extension and creation of new OAF pages in JDeveloper 9i and 10g environment. Expert in developing Technical design documents (MD070), Technical Test documents (TE020), Conversion (CV050) and Migration documents (MD0120). Exposure to all phases of the process oriented SDLC, including working with the business analysts and software development teams to ensure a clear understanding of the requirements. Extended experience in XML/BI Publisher in creating new custom reports, cross tab reports, matrix reports, upgrading standard 6i Reports to XML/BI Publisher, migrating Data Definitions and Templates from Instance to Instance and also designing of multi layout reports. Possess good interpersonal, presentation and developmental skills with Strong analytical and problem solving approach and an excellent team player On-site coordination experience and worked with offshore team during knowledge transfer and development support. Skills ERP: - Oracle apps R12, 11i (OM, INV, PO, BOM, WIP, AP, AR, GL, CRM, P2P, O2C cycles). Front End tools: - Oracle J Developer (11g, 9.0.5),Forms6i/9i/10g/11g,Workflow Builder2.6.3.5. Reporting Tools:-Oracle Discoverer 10g/4i, XML Publisher, Oracle Reports6i/10g/11g. Tools:-SQL* Plus, SQL* Loader, Toad, SQL Developer. Languages: - SQL, PL/SQL, C, Java, HTML, UNIX Shell Scripting, XML. RDMS: - Oracle 10g/9i/8i, MS Access.  Operating systems: - SUN Solaris, HP-UX, UNIX, Windows. PROFESSIONAL EXPERIENCE Client: Extreme Networks, NC  \t\t\t\t\t\t\tMar 2015 – Till Date Role: Oracle EBS Technical Developer Responsibilities:  Worked on development of interfaces, Data Conversions, Developingnew Forms, Reports, CustomizingOracle Reports in Order to Cash cycles touching various modules such as AR, PO and AP, GL. Worked on RICEW objects like Price List conversion program, Mass Price Update from, Custom PL/SQL procedure to return Prices for products, Custom Price Book reports based on Client Requirements. Developed Program for the Auto Invoice Interface to import Customer Invoices, Credit & Debit Memos in ReceivablesAR. Customized standard GL reports like Journal Entry report, Account Analysis Report, Accounts Hierarchy Report as per business needs. Involved in Customer Conversions to load Customer details into HZ tables by creating staging tables and performing validations and finally loading them in to base tables using TCA APIs. Involved in AR Lockbox Interface to import receipts into Oracle Applications Account Receivables. Involved in Auto Invoice Interface to import Invoice, Credit Memo, Demit Memo, On account Credits into Interface table in Account Receivables (AR). Involved in Supplier/ Vendor API to insert new vendor, Vendor sites and Vendor contact information. Supported AP Supplier Conversions (Vendors, Vendor Sites and Vendor Contacts) and Invoice Conversions using AP Interface Tables, PL/SQL packages, API’s in Oracle EBS. Involved in Standard PO Import Program to import purchase orders into oracle applications. Loaded the vendor information from legacy system to Purchasing. Developed a PO interface to generate Purchase Orders through Interface/Conversion program as per data received from Legacy System. Customized various workflows like Requisition Approval Workflow, PO Approval Workflow, Create PO workflow, Order Line Workflow, and PO Requisition Account Generator as per user requirements. Developed Supplier Audit Report and Bank Audit Report in Accounts Payable (AP) and Rental Order Report in Order Management (OM) using XML/BI Publisher. Developed Forms Screens using Oracle Forms Builder to create the user interface.  Created Forms Triggers, Alerts, Data Blocks, LOVs, Parameters, and Program units and displayed data using PL/SQL procedures and functions of OOPS methodology. Used TCA APIs to convert legacy customer information into oracle. Handled “BOM Routing Conversion” and imported data into base tables. Extensively designed Data mapping and filtering, consolidation, cleansing and Integration. Work on the development activities as part of issue resolution. Perform Unit Testing, Migrate to next environments, assist user testing and closing the tickets. Wrote a standalone query using PL/SQL block to trace the performance issue in a large code file. Version: - Oracle Applications R12 Application Modules: - Oracle Apps PA, OM, INV, AR, GL, AP, PO, Advance Pricing, WIP. Tools and Languages: - XML publisher, Forms, Report Builder, TOAD, SQL*Loader, SQL, PL/SQL. Client: PHT Corp. Boston MA\t\t\t\t\t\t\t       June 2014-Jan 2015 Role: Oracle EBSTechnical Developer Responsibilities: Created Auto lockbox interface to import historical receipt data, and apply receipt to outstanding invoices. Created a custom credit memo form and integrated with custom Approval workflow process and interfaced them to AR using Open Interfaces. Created Auto invoice interface to transfer invoices, debit memos, credit memos and on account credits form legacy system into Oracle EBS. Worked on Advanced Pricing RICEW objects like Price List conversion program, Mass Price Update from, Custom PL/SQL procedure to return Prices for products, Custom Price Book reports. Design and Developed Accounts Payable Invoices Interface using APIs. Developed Conversion program to import Vendor/Supplier Information into PurchasingPO by loading data into staging tables from legacy system, validating data using PL/SQL API’s Involved in setup and customization of Oracle Payables and data conversion from legacy system into Oracle Accounts Payables (AP). Developed Interface of Sales Orders Import in OM after actively participating in the preparation of the conversion mapping documents. Worked on the development of Interfaces, Data Conversions, Developing new Forms, Reports, Customizing Oracle Reports in Order to Cash Cycle touching various modules such as GL, AR, INV, OM. Created complex stored procedures to collect, analyze, and report on data across multiple functional and line of business systems in response to customer requirements. Database performance by optimizing back end queries, PL/SQL tuning and implementing performance improvements by analyzing indexes, table partition, parallelism etc. Worked on designing, coding and maintaining database objects, tables, views, packages, functions, procedures, indexes, sequences and triggers using Oracle PL/SQL.  Designed Distribution Labor Cost Report using XML/BI Publisher in Project Costing. Designed and developed PO requisition interface to load PO requisitions from the legacy systems into purchasing interface tables. Worked on Open Item Interface to convert Purchased Item Information from Custom Purchasing System to Oracle INV module. Developed Interface for the Standard Items in INVENTORY generating the SQL*Loader scripts and PL/SQL procedures for validating and loading data into oracle tables. Created Item modifier and Item Generator screens to create items and created a custom Item interface them to interface them to Item master. Creation of customized Mailing Label and the Pick Slip Report to fulfill the requirements of the client using the WSH and OM tables using Reports 10g. Customized of PO Requisition Charge Account Generator workflow to take a standard charge account based on the customer using Workflow Builder. Customized the report called Backorder Detail Report which is used to review all customer orders that have backordered using Reports 10g.  Worked on some of the Discoverer Reports ASCP, Inventory, order management and WIP modules. Coordinating closely with Technical development team, functional testing team for the smooth delivery of the component. Customized the PO output communication report using XML Publisher. Version: - Oracle Applications R12 ApplicationModules: Oracle Apps OM, INV, AR, AP,GL, PO, PA Tools and Languages: UNIX, Toad, Developer (Forms & reports, Discoverer, XML publisher), PL/SQL, SQL Client: Global Experience Specialists (GES), NV\t\t\t\t\t      Aug 2012-May 2014 Role: Oracle EBS Technical Developer Responsibilities:  Created custom interfaces to import exhibitor information into Oracle AR using oracle standard API’s. Developed Payables Open interface Import Program to load invoices from multiple sources like legacy invoices into AP in periodic basis and also designed a report using XML/BI Publisher. Performed AR adjustments using oracle API’slike AR_ADJUST_PUB. Extensive experience using credit memo using oracle API’s like AR_INVOICE_API_PUB. Worked on Oracle Application Framework (OAF) to develop custom solutions for iExpense module. Development involves analyzing MD50 (Functional Spec) and then writing MD70 (Technical Spec). Performed SQL and PL/SQL tuning and Application tuning using various tools like EXPLAIN PLAN, SQL*TRACE, TKPROF and AUTOTRACE. Modify existing codes and developed PL/SQL packages to perform Certain Specialized functions / enhancement on Oracle EBS. Wrote SQL*Loader scripts to migrate the data from the text files, CSV files etc. and populated the intermediate tables.  Experience in set up AME Rules for Invoice Approvals, Audit Rules for Expense Types, Auto Accounting Rules in Project Accounting and Receivables and Various set up in all EBS modules. Extensive experience in Auto invoice and handled multiple issues in auto invoice interfaces. Creation of SQL*Loader control programs and PL/SQL validation procedures to execute along with Customer Interface (AR), (OE) programs to support the interface requirements. Assisted Functional Team members with setting up Flex field, Calendar, Currency, Chart of Account, Set ofBooks, New Responsibility, Set of Books Profile, and Opening first period in GL module. Developed Items Conversion to load the item master data from GES Legacy System. Customized some of the Reports like ACH Payments, Positive Pay (NACHA format), Check Format, and Bank Statement in AP Using XML/BI Publisher. Customized various BI/XML Publisher Reports using RTF templates and defined their respective Templates and Data Definitions. Used the Totals/subtotals/group/sort features of BI/XML Publisher to make data intense operations happen at the template level. Built custom reports using Oracle Report Builder and integrated them with the application (based on descriptive flex fields) to solve the clients reporting needs. Developed new report Credit Memos in AR using Discoverer. Developed FSG reports in GL to list Actual, Budget and Prior Amounts. Developed PL/SQL scripts to load data from external system to Fixed Assets interface tables. Conducted and coordinated CRPs, UAT - unit testing, integrated testing Developed UNIX Shell Scripts for performing daily activities. Used SQL Loader and UTL file packages for data conversion and interfaces. Version: - Oracle Applications 11i ApplicationModules: Oracle Apps OM, INV, AR, AP,GL, PO, PA Tools and Languages: UNIX, WEBADI, Developer (Forms & reports, Discoverer, XML publisher), PL/SQL, SQL Client:Southern Company, GA\t\t\t\t\t\t\t        Feb 2011 - Jul 2012 ROLE:Oracle Apps Technical Developer Responsibilities: Requirement gathering, technical design and code development in AP, AR, GL, Service contract, Install base, Field services  and other modules related to custom interface, conversion, OAF personalization and custom reports, providing end to end technical solution for complex business problems. Created AR customer import using Oracle TCA API’s to create and update existing customer information. Build Custom Reports and Conversions from Legacy to Projects using API's. Design and developed an Auto Lockbox interface so that the bank file will be automatically imported into Accounts Receivables (AR). Configure and Setup AP Approval Processes using AME, Approval groups, Payable Groups, Vendor Types, Rules, Banks, Payment formats Approval limits, Expense Template, Expense Mileage rules, and Expense Audit setups. Experienced in deploying Customizations, Extensions and Personalization’s in Standard and Custom Built Oracle Forms, Self Service Pages (OA Pages), workflows, AME, etc. Developed BOM Routing Conversion program to upload Routings into BOM Module. Developed custom program to integrate Oracle and EBS for updating BOM structure data periodically. Customized the Standard Workflow Items and process such as Order Header, Order Line and Change Order. Developed Interface of Sales Orders Import in OM after actively participating in the preparation of the conversion mapping documents.  Modified PO Approval notification workflow so the Project, Project Description, and Task Information can be viewed by the Project Manager in the Purchase Order (PO). Developed new reports in OM and INV such as Sales Tracking Report, On hand Quantity tracker, Move Order Reconcile Report, Sale Order Reconcile, Open purchase Order and Logistics/Sub Inventory status reports. Developed custom quality check programs for service contract module using service contract API’s. Worked on Auto invoice interface to load invoices automatically from legacy systems to Oracle Account Receivables (AR) interface tables. Design and developed the invoice EDI inbound and outbound interface using EDI Gateway in Payables (AP). Designed and developed layout model and data model for Customization of Reports in Report 6i. Used AOL and System Administrator modules for registering the developed and customized reports and conversion programs.  Involved in setup and customization of Oracle Accounts Payables (AP) and data conversion from legacy system into Oracle Payables. Developed a PL/SQL package to validate data like GL codes and insert freight invoices into Interface tables. Designed Oracle forms using Oracle Applications framework (OAF) as per the requirement. Worked on Personalization of existing OAF pages in PO Suppliers page to show Attribute column on the Supplier page. Performed trouble shoot with run time performance of the reports and use lexical parameters and bind variables wherever required to improve the performance. Developed UNIX Shell scripts to run the interface program and to archive the data. Communicate the changes made and issues resolved to projects managers and business system analyst on timely basis. Experience in Database Application Development, Query Optimization, Performance Tuning and DBA solutions and implementation experience in complete System Development Life Cycle. Version: - Oracle Applications R12 Application Modules: - Oracle Apps OM, INV, PO, PA, AR, AP, eBTax, BOM, WIP, GL Tools and Languages: UNIX, Developer (Forms & report, Discoverer, XML/BI publisher), PL/SQL, SQL, Toad Client: VIAD Corp, NV\t\t\t\t\t\t\t\t       Jan 2010 - Dec 2010 Role: Oracle Application Developer Responsibilities:  Assisted functional team to identify the setups required for implementing the oracle Inventory, AR, OM, Shipping modules. Developed the interface program to import Invoice data from legacy system to Account Payables (AP) using SQL*Loader and PL/SQL packages to validate data. Used TCA API's for creating Customer Parties, Party Accounts, Contacts, and Account Sites. Developed reports in Oracle inventory for comparison of available and on-hand quantities in various lots and sub-lots. Designed and customized reports like New Customer Setup Report and Contract Price List Report using Report Builder 10g. Used FND_LOAD to upload and download the “LDT” files during the migration on Concurrent Programs registration.  Developed Inventory “Items Conversion” & “Items Category Conversion program” to load Inventory data from into interface tables. Created a custom package for the extraction of fixed asset movement data. Performed various AOL and system Administrator activities depending on the requirement. Oversee all the EBS system administration activities including Security Setup, New Concurrent Programs, Printers, Forms, and Menus Handled “On Hand Quantity Conversion” using Setup, Null and Data validations to populate data into interface table. Designed Order Import Program which enables to import Sales Orders into Oracle Applications. Wrote scripts to populate data into PO headers, PO lines interface tables and used “Standard Purchase Orders Import program” to transfer data into base tables. Involved in printing the intercompany invoices in the 3 EMEA, US, Asia regions. Involved in implementing IR-ISO functionality for the new business Operating units. Identifying the defects and issues raised in SIT and providing solutions to functional team and providing logic and code fix required to development team. Wrote PL/SQL packages for data conversions & interfaces for finance, OM and supply chain modules. Database performance by optimizing back end queries, PL/SQL tuning and implementing performance improvements by analyzing indexes, table partition, parallelism etc. Providing user training to users to make users get used to some Imp custom forms. Extensive experience in working with HP QC to create test scenarios for SIT, and updating QC for fixed/closed issues. Proficient in generating Forms using Oracle Forms 9i meeting variety of Business needs including custom Reports. Modifying Forms to accommodate new functionality like adding Buttons and Texts. Version: - Oracle Applications 11i Application Modules: - Oracle Apps OM, INV, AR, AP, GL, FA, Advance Pricing. Tools and Languages: - XML/BI publisher, Report Builder, workflow, TOAD, SQL*Loader, UNIX, SQL, PL/SQL. Client: Larsen & Toubro, India\t\t\t\t\t\t\t       Apr 2008 - Oct 2009 Role: Oracle Apps Technical Consultant Responsibilities:  Worked with users and functional teams in gathering requirements. Offshore support in trouble shooting the OM, PO, AP and AR modules. Supported the end users in Order Management and Purchasing. Customized and developed Discoverer custom reports. Design and Developed Account Payable (AP) Invoices Interface using APIs. Extensively used Discoverer administrator and Discoverer desktop versions. Customized business areas simple and complex folders using Discoverer Administrator and customized and created new reports using Desktop. Developed Database triggers on Item tables to capture any updates or inserts happened in the critical attributes. This will update a custom table with the updates or new items. Developed Shipping Notification report using Oracle report builder. Developed   Sales Quote Report using Oracle report builder. Customized Oracle 6i Reports as per the business requirement. Developed various level of documents like MD070 for Technical design, TE020 for Unit and Functional testing, MD120 for Installation. Version: - - Oracle Apps 11 Application Modules: - Account receivables, Order Management, Purchasing and Account Payables. Tools and Languages: - Oracle Discoverer, Oracle Report Builder, SQL, PL/SQL."}