{"text": "Name: julia julia E-Mail: julia.julia@gmail.com Address: Zhumadian, China Github: https://github.com/julia LinkedIn: https://linkedin.com/julia Phone No. 514681914874  _______________________________________________________________________ OBJECTIVE: Around 7 years of diverse experience in the field of Information Technology worked with Web/Client-Server applications. Dynamic and Assertive team player with strong commitments. Possess excellent verbal and written skills complimenting a strong quality assurance background with excellent interpersonal and problem-solving capabilities. PROFILE SUMMARY: Proficient in Manual and Automated testing of applications on different environments. Expertise in Automated testing tools such as Selenium and QTP. Expertise in QA experience with Client/Server and Web-based applications. Proven expertise in creating Test plans, Test Scenarios, Testing Process, Testing Approaches, and Traceability Matrix and conducted GAP Analysis Significant experience in Functional Testing, Compatibility Testing, Integration Testing, System Testing, Alpha, Beta, Performance Testing, and Regression Testing. Extensive knowledge of different kinds of testing like Back-End Testing, Positive/Negative Testing, Black box Testing, Configuration Testing, Data Driven Testing, User Acceptance Testing (UAT), Unit Testing, Integration Testing, System Testing and Regression Testing. Performed Back End Testing by executing SQL queries. Created SQL Statements and UNIX Shell scripts to perform ETL testing on the oracle database. Proficiency in Reporting and Prioritizing software bugs in conjunction with the development and QA Managers. Excellent knowledge of Point of Sale Applications (POS). Strong skills in performing Functionality, GUI, Backend, System, Stress, Performance, Load and Volume Testing of software applications. Executed the tests to verify the web GUI using QTP Proven expertise in HPQC ALM with QC previous versions. Good communication and presentation skills. Can easily adapt to new environment at a greater pace.  Able to define and fulfill the project goals Dedicated and conscientious work ethic, able to work independently or as participating member in a team environment Ability to multi-task, prioritize and work with time constraints while paying attention to minute details. Experience working with business users, IT technical staff as well as senior management TECHNICAL SKILLS: Testing Tools:                \tQuick Test Professionals, Selenium Operating Systems:     \tWindows 98/2000, Vista, 7, UNIX Database:                       \tMS Access, MS SQL Server, Oracle and MS Access Office Tools:                  \tMs Word, Ms Excel, Ms Project, Ms Visio Bug Reporting:              \tALM, JIRA, Bugzilla, ClearQuest Shire - Exton, PA\t\t\t\t\t\t\t        April-2014-Till date Sr. QA Consultant With over 22,000 employees across more than 100 countries, Shire’s expanded global reach and best-in-class products offer the potential to help even more patients around the world with significant unmet needs. I am currently working remotely in this project. Track bugs using JIRA and check daily updates on tests performed also fix the bug issues. Follow up with manual tests and then write test cases and perform automation tests using Selenium Web Driver.   Responsibilities:  Created Automation test framework using Selenium.  Used Selenium WebDriver to handle various web page controls like textbox, button, dropdown, checkbox, radio button, labels using XPath and other locators.  Created test scripts using VB Script and by Creating Checkpoints, Synchronization points and Output values. Enhanced the test scripts if necessary. Maintained Lab where Server, and Web Services Integrates and Tested Performance of Integrated system using Jmeter. Automated Test Cases using Grid, Eclipse.  Used Java language and JUnit framework for scripting.  Expertise in developing scripts for Automation testing using HP QTP/UFT for the Web and Windows based applications.  Generated automated test scripts for functional and regression testing using QTP.  Developed Test scripts for functional testing in QTP. Used the API portion of UFT to create service tests.  Created the automation framework using UFT (QTP) and VB script to the requirements. Used Ant for building the WebDriver project. Integrated with Continuous Integration tools Jenkins for running test on nightly basis automatically. Involved in testing Web services and XML with tool called SOAP UI. I have been using this tool to locate WSDL file on internet, create Test cases, run them, do load testing & security testing.  Used Firebug tool to identify the Object's id, Name, XPath, link in the application.  Analyzed the user requirements, functional specifications and Use Case documents and created the Test Plans, Test cases for Functional testing.  Develop smoke, sanity, regression test scripts using WebDriver.  Exported Test case Scripts (Java-Selenium WebDriver) in Eclipse IDE and modified the selenium scripts and executed. Prepared automation test framework.  Done Data Base Testing using toad and Performance testing using Jmeter. Used Selenium WebDriver for writing test scripts for regression test coverage.  Enter and maintain defect information in defect tracking system (JIRA).  Composed Cucumber and respective tests in the application and coded java script for popup screens.  Implemented the Metrics in the Project to achieve the best Quality in the Testing Output.  Involved in weekly walkthroughs and inspection meetings, to verify the status of the testing effort and the project as a whole. \n Environment: Selenium, Quality Center ALM 11.0, CA LISA Angular JS, Node.js, Quick Test Professional 11.0, Oracle 10g, Python, HTML, Ruby, Jenkins, Jmeter, HP UFT 11.5 / QTP 11.0, Java, Excel, Rally, JAVA, C#, J2EE, JIRA, Maven, ANT, Eclipse, JDBC, Agile Methodology, Linux TJ Maxx Framingham, MA                                                                                     June 2013 – Mar 2014 QA Analyst   At TJ Maxx I worked mainly as QA Analyst for Order Management System (EPOS) that was part of the supply chain and Data Warehouse Inventory System which plans, implements and controls the efficient, effective forward and reverse flow and storage of goods, services and related information between the point of origin and the point of consumption in order to meet customers' requirements. The Order Management System was part of the e-commerce application that was being developed for Nordstrom retail website. Responsibilities: Reviewed Test Plans and created Test Cases for the test. Executed Test cases on various stages of SDLC. Performed regression testing on the application using QTP. Tested user interface and navigation controls of the application using QTP. Inserted Checkpoints to check for broken links, Text and standard properties of an object, using QTP. Verified the application’s functionality on different Configurations with QTP. Participated in requirement walkthroughs and creation of test plan. Conducted system and user acceptance testing for point of sale (POS) system. Performed Unit, Integration and System testing, Web Testing.  Conducted Functionality Testing, Regression Testing and System Testing using QTP Performed GUI Testing and User Acceptance testing. Performed Sanity Testing and Smoke Testing. Investigated software bugs, tracked and reported to the developers using QC’s Defect Module. Performed Usability Testing. Generated defect reports/graphs using Test Director for the developers and project managers. Environment: QTP 11.0, Windows/XP/Server 2003, MS SQL Server 2005, MS Excel, UNIX, QC Country Financial - Bloomington, IL\t\t\t\t\t        Dec 2012-May2013 QA Analyst Country Financial was formed by a group of Illinois farmers in 1925 as a fire and lightning insurance company. A year later, the company expanded and began to offer coverage for autos and equipment. I worked on the gateway application, Checked Front End Functionality, Hyperlinks, Navigation, GUI and System Integration testing of the Application. Responsible for writing and testing the test cases using JUnit and TestNG. Responsibilities:  Implemented Data Driven Framework using Selenium WebDriver, JUnit, ANT, and Java. Used Several Java collection classes, wrote code to handle textbox, dropdown, checkbox controls using XPath, Selenium WebDriver classes. Developed Test objectives for the applications based on User Requirements/Use cases.  Involved in executing automated test cases using Selenium WebDriver to automate Manual Testing solutions.  Developed Unified Functional Testing (UFT) automation scripts using library functions, Data driven tests and Regression tests.  Involved in both Manual Testing and Automated testing using the automated tool Unified Functional Testing (UFT). Experience in Functional Testing, Data Driven Testing, Load Testing and Validating WSDL using SOAP. Performed Load and Performance Testing using Load Runner.  Automated regression test cases using Selenium.  Created Test data based on user requirements  Created keyword driven framework in QTP using to automate test cases.  Prepared the test report document which summarizes testing activities and results.  Responsible for analysis of business user needs documentation of requirements and translation into proper system requirement specifications  Manually tested the application to baseline before going for the Automated Testing.  Responsible for writing and testing the test cases using JUnit and TestNG.  Checked Front End Functionality, Hyperlinks, Navigation, GUI and System Integration testing of the Application.  Automated Functional and Regression Testing using Selenium WebDriver, JUnit, ANT, Java Authored JavaScript and Java codes needed for Selenium WebDriver to automate the tests.  Experience in Manual Testing of web-based and client/server applications.  Involved in the User Acceptance Testing, Participated in various meetings and discussed Enhancement and Modification Request issues. \n Environment: IDE, Selenium WebDriver, Selenium Grid, ANT, Java, HTML, JDBC, C#, Eclipse Hibernate, J2EE, MES, JDBC, Oracle 10g, HTML, Maven, Load Runner, Performance Center, Junit, TestNG, Bugzilla, Jira, Python, Linux, MS Stack. Safeway, Inc., Miami, FL                \t\t\t\t\t      Aug 2011– Dec 2012        QA Analyst Safeway, Inc., together with its subsidiaries, operates as a food and drug retailer in North America. The company operates stores that provide an array of dry grocery items, food, and general merchandise, as well as features specialty departments, such as bakery, delicatessen, floral, and pharmacy, as well as coffee shops and fuel centers. It also offers SELECT line of products that include salsas, bagged salads, whole bean coffees, cookies, frozen pizzas, fresh and frozen pastas, and an array of ice creams and hors d'oeuvres; ORGANICS line, which comprises milk, chicken, salads, juices, entrees, and others; Eating Right line of better-for-you products; Priority Total Pet Care line of pet foods and pet care products; Basic Red value-priced paper goods; and Lucerne line of dairy products and the Primo Taglio line of meats and cheeses. As of December 29, 2007, Safeway operated approximately 1,743 stores in California, Oregon, Washington, Alaska, Colorado, Arizona, Texas, the Chicago metropolitan area, and the Mid-Atlantic region, as well as British Columbia, Alberta, and Manitoba/Saskatchewan. Responsibilities:   Design and execute Test Plans and Test Cases, generate Test Scripts and Test scenarios. Implemented the whole life cycle of QA methodology starting from planning, capturing, creating, executing reporting and tracking the defects using Test Director Designed, Communicated, and enhanced QA testing plan for the application. Wrote and executed Test cases and reported defects using Test Director. Involved in the Review of Requirements Specification with functional manager and technical specialists of the application Prepared Test cases, according to the business specification and wrote test scripts and maintained them.  Performed Regression, Functional, Positive / Negative Testing using QTP. Inserted different checkpoint to perform various testing. Performed Data Driven Testing in QTP. Conducted System, Integrated and Regression testing to the application. Performed Sanity and Smoke testing on the application by scheduling tasks using Unix environment. Used SQL Plus to execute SQL queries on the Oracle Database. Used UNIX shell scripts for monitoring the servers during testing sessions. Wrote and Enhanced test cases and test scripts to meet new functional requirements as per the new business requirements. Involved in creation and maintenance of Test Matrix and Traceability Matrix. Performed User Acceptance Testing. Analyzed test results using reports and graphs generated in Test Director. Worked on Test Director in setting up and Customizing Project entities for Defect Module Screens.  Maintained and systematized the documentation process. Participated in various meetings meant for enhancement and modifications of applications, following client request. Conducted Risk Analysis and interacted with developers to resolve bugs. Actively participated in inspections and walkthroughs. Environments: VB, Oracle, SQL, UNIX, Windows 2000, QTP, Test Director. FedEx, Nashville, TN   \t\t\t\t\t\t\t    Jan 2010 – July 2011 QA Analyst Description: FedEx Corporation (FedEx) provides a portfolio of transportation, e-commerce and business services through companies that compete collectively, operate independently and manage collaboratively, under the respected FedEx brand. Project:  The project at Transportation Services was to design, alter, and update their transportation platform. It allows inputting all the information about businesses and individuals in the main application form that is tied up with number of other forms in a precise workflow.  I was initially working as a part of the off shore team and later joined the US location for the second half of the project. Responsibilities:  Analyze Requirements for testability. Involved in Test Design, Test Plan, Test Development and Test Results for Web-based Application. Analyzed system requirements and developed detailed Test Plans and Test Scripts for system testing using Mercury Quality Center. Created Graphs and Reports in Mercury Quality Center to keep track of Daily Testing Efforts. Planned and reviewed the Test Cases and Test Scripts for Unit, Integration, Functionality, System, Regression, Database and User Acceptance Testing. Recording Test cases, scenarios that adhered to the requirements, and executed Test cases using QTP and Load Runner. Connected to SQL Plus in UNIX and created and executed complex SQL queries.  Performed back-end testing by extensively using SQL commands to verify the database integrity.  Automated the back-end testing for reusability by writing UNIX Shell Scripts. Created and maintained SQL Scripts and UNIX Shell scripts to perform back-end testing on the oracle database.  Performed Manual testing in the UNIX environment.  Tested some SQL error handlings. Created complex SQL scripts and embedded them into the UNIX Shell scripts to automate the Back-End testing. Responsible for inserting Check points to verify Functionality of the application using QTP. Executing one test on multiple user platforms. Executed Shell Scripts for automation and performed monitoring of those. Database Testing using the SQL commands and completing projects within established timeframes. Performed Backend Testing using SQL commands  Environment: QTP 9.5, Load Runner, Mercury Quality Center, Windows 2000, Oracle/Unix, XML, HTML."}