{"text": "Name: marie marie E-Mail: marie.marie@gmail.com Address: Nangandao, China Github: https://github.com/marie LinkedIn: https://linkedin.com/marie Phone No. 251233300984 SUMMARY About 6+ years experience as a Software Quality Assurance Analyst/Engineer. Worked in all phases of Software Testing  Life Cycle including Implementation, Documentation, Testing in different domain & different type application In-depth knowledge of all QA phases like Manual, Functional, System, Integration, End-to-end, Business Process testing. Quality Assurance and Software Testing experience involving complex client/server and web based applications.   Proficient in System, Functional, Integration, Regression, Progression, End to End, Security, Load, Fail Over and Performance testing. Proficient in designing, reviewing and documenting system test plans, defining test procedures and creating test cases on the basis of product releases features, client’s requirements and related technical documents Experience in Writing and Executing the Test cases, analyzing the Test results and Defects Tracking. In depth knowledge of Software development life cycle and testing methodologies. Worked on agile software development environment where performed testing in each sprint. Experienced in Using Version One to manage/analyze stories  & project wall Thoroughly Cross browser tested projects to support IE7+, FireFox, Safari, Opera and Chrome. Experienced in Testing Mobile application using both Simulator (AVD for android and xCode for iOS) & Real device Performed automation testing using diverse testing tools like Load Runner, QTP/UFT and Quality Center/ALM. Expertise in working knowledge of Core Java and Object Oriented Concepts( Inheritance, Polymorphism, Exception Handling, Multi-Threading and Collections) Performed unit testing using Junit/TestNg, integration and deployment of applications done using tools such as ANT and Maven and debugging through Log4j. Experienced in using Version Control Tools like CVS, SVN and gitHub Expert in automation script development using different automation tools like Selenium WebDriver (Eclipse, Java, JUnit)  Experienced in converting existing QTP/UFT Script to Selenium WebDriver Script for multi browser support Experienced in designing customized hybrid framework (Keyword Driven & Data Driven) using Selenium WebDriver, Java, TestNg & apache POI. Designed & developed automating regression suite using HP UFT/QTP, descriptive programming & VBScript. Design & developed Data Driven Framework using UFT & VBScript to validate test case against different data set. Experience in testing SQL stored proc, functions, package, and triggers in different RDBMS including Oracle 10/11g and MS SQL Server 2008/2012  Perform ETL testing while data migration using SQL & excel.  Experience all types SQL queries like select, insert, update, delete and joining multiple table based on business requirement. Knowledge in assisting performance engineering and analysis of web performance projects using Load runner for Web based and Client/Server Applications. Highly experienced in developing and maintaining Requirements Traceability Matrix (RTM) to make sure customer requirements are captured successfully using HP Quality Center (ALM/QC). Possess strong technical aptitude with strong analytical, problem solving and communication skills An effective communicator, committed team player, quick learner and rapid problem solver with commitment and a strong work ethic and ability to quickly adapt to new environments.  Excellent organizational skills and the ability to handle multiple assignments concurrently Able to come up to speed quickly and handle multiple tasks in a fast-paced environment. Experience in installing UFT tool in VMWare. TECHNICAL SKILLS Testing Tools\t\t\t: \tQuickTestPro /UFT, Selenium WebDriver, SOAP UI Pro, Jenkins Programming Languages\t\t: \tC++,SQL, PL/SQL Mark-up/Scripting Lang\t\t\t:\tVBScript, HTML, XML, CSS Defect Tracking Tools\t\t\t:\tHP ALM, JIRA, BugZilla, Quality Center, Version One Databases\t\t\t:\tMS SQL Server 2008/2012, Oracle 11g/10g/9i, DB2, Sybase Platform\t\t\t:\tWindows 8/7/XP/Win 2k Server, UNIX, Linux, DOS PROFESSIONAL EXPERIENCE WellPoint, Inc. Thousand Oaks, California\t\t\t\t                   Sept 2016-June 2018 QA Automation Engineer WellPoint, Inc. is one of the largest health benefits companies in the United States. Through its networks nationwide, the company delivers a number of leading health benefit solutions through a broad portfolio of integrated health care plans and related services, along with a wide range of specialty products such as life and disability insurance benefits, dental, vision, behavioral health benefit services, as well as long term care insurance and flexible spending accounts. Roles & Responsibilities: Analyzed requirements, provide testing scope and proposed the testing methodologies. Expertise in analyzing Business requirement specification and System Requirements specification Worked on agile software development environment where performed testing in each sprint Designed and executed functional testing and performance testing on Gannett client facing application  Performed System, Integration, Regression, Failover, UAT and Compatibility Testing. Assisted end users to develop UAT test cases. Expertise in creating Test Strategy, Test Plan, Test Reports, Test Cases and Test Scripts for Automated and Manual Testing based on the functional specification for the Functional, Regression, GUI Usability and System Testing.  In addition to Version One was also used in our Agile shop Test Management, user story integration, development and testing. Participate in Daily Agile Scrum \"Stand-up\", Sprint Planning and Retrospective Sessions Extensively used Quality Center/ALM from running Test scripts through Defect reporting and tracking. Planned, designed and implemented test lab for browser/os compatibilty testing using  VMware Coordinate with team members, developers, test execution team and project managers the proper Defect management strategies and defect tracking in HP ALM Experienced in opening & managing defect using Jira Participated weekly defect meeting. Developed Automation Engineering solutions for GUI and Web Services for 2 applications developed in JEE (Java, Spring, Hibernet) using SeleniumWebDriver Converted existing UFT Script to Selenium script to support multiple browsers using Java, Selenium, and TestNg & Eclipse. Design & Develop automation framework using Selenium Java, WebDriver, TestNg & apache POI Implemented Object Oriented Concept like Polymorphism, Encapsulation to produce efficiency & scalability in automation Framework Tested Asynchronous Programming to Update the Chart on home page for dynamic ad changes on web site as well as data validation using Quick Test Professional. Performed data driven testing using UFT and integrated descriptive programming in UFT script for dynamic object recognition  Developed and enhanced VBScript external functions and integrated with UFT automation regression framework for continuous integration testing  Developed script and performed Web Services testing using soap UI pro tool for functional and regression testing. Performed SOAP based and Restful base web Service testing using soap UI pro for data driven testing Verified Request, Response to test SOAP based web service testing using WSDL file end point Location. Developed SQL script in TOAD for data validation and data integration testing in Oracle and SQL Server database. Performed Regression tests to verify whether modification made in the application have not cause unintended adverse side effects. Analyzed log files for exceptions and errors in Linux system and re-generated those errors to provide the root cause of defects Designed and executed Performance test to analyze the bottlenecks in the application using Load Runner Analysis. Continuous Integration of Build, Deploy and Test using Jenkins. Work with engineering services team to run tests in continuous integration environment (Jenkins) and report on results. Experienced in testing Server hardening and server health check with Open source Tools like Jmeter. Mentoring and monitoring the junior colleagues. Environment: Quality Central, JIRA, Java, Selenium WebDriver, Selenium RC, Selenium Grid, Firebug, FirePath UFT, SQL Server 2008, Soap UI, XML, Linux, Web Services. Eclipsys Corporation, Malvern, PA\t\t\t\t\t\t        Oct 2014-Aug 2016 QA Automation Engineer SCM and SMM are bi-directional application exchange of order information between Clinical Manager and external Pharmacy System. Sunrise Clinical Manager application allows Physicians to enter patient information and test results for example create a new patient, identify a patient, enter, edit and cancel patients order. Enter groups of orders from multiple departments, check the status, request date and service date of an order, retrieve clinical data, cost and charge of procedures and enter clinical interventions. Sunrise Medication Management application allows Pharmacist to verify the order, modify the order and send it back to Clinical Manager after verification. Roles & Responsibilities: Analyzed requirements provide testing scope and proposed the testing methodologies Developed Test Plan, Test Suite, Test Cases. Expertise in analyzing Business requirement specification and System Requirements specification Performed System, Integration, Regression, Failover and Compatibility Testing Developed test automation frame work using UFT 11.5 for functional and regression testing. Performed the Back-End testing to ensure data consistency on front-end by writing and executing enterprise level complex SQL statements on the Oracle Database using TOAD Extensively Designed and developed Keyword Driven Framework using VBScript, Descriptive Programing & UFT. Retested production issues and developed test cases from production issues for regression testing using HP ALM Responsible to test each new version of application for Regression testing using UFT. Conducted Functionality and Regression testing using UFT during the various phases of the product development.  Worked on Agile environment and performed testing sprint wise. Participated in sprint planning meeting, Daily scrum & Sprint retrospective. Experienced in Using Version One to manage/analyze stories  & project wall Customized UFT Scripts with Parameterization, Check Points, Library Files, Regular Expression Customized the UFT Test as per the Test Case by using the VB-Script. Created test cases, executed and recorded results of test cases using JAMA Contour as the management system tool. Used JIRA for Defects management. Performed web service testing using Soap UI Pro and created assertion point for response xml validation Performed Load and Stress test using HP LoadRunner  Executed Load Test, Stress Test and Endurance Test by uploading the VuGen Scripts into LoadRunner Controller Involved and responsible for creating Daily and weekly status reports regarding the progress of testing process. Actively participated in Handover meetings, Business Analysis and design reviews for each release and identifying Critical test cases on each release. Developed UAT test cases for End to End testing. Environment:  UFT, SQL Server 2008, Soap UI, XML, Linux, Web Services. National City Bank, OH\t\t\t\t                \t                                    Apr 2012-Sept 2014 QA Analyst National City Bank developed CMR (Customer Management and Reporting) platform to manage all FX customers’ data & operation information centrally. This platform also provides advance tools for sales and operation to improve growth and efficiency Roles & Responsibilities: Analyzed business requirements, functional requirements, use cases and provided feedback for clear understanding of each requirement. Developed test plan, test cases, executed test cases, logged defects and provided testing signoff Performed all phases of testing like System Testing, Integration Testing, Regression Testing, System Testing, and User Acceptance Testing. Worked on QTP Framework and modified necessary Framework components Design & develop data driven framework to validate different Member profile using QTP, VBScript & Descriptive Programming Involved in generating Vuser in Load Runner for performance testing, and load testing of the application. Experienced in working Expertise in testing Web Services using SOAPUI (Simple Object Access Protocol User Interface). Both of UNIX & Linux environments to analyze log file & to monitor process. Thoroughly tested the data synchronization module and verified transactional documents & import export reports. Interacted with developers to follow up on defects and issues. Created a functionality test matrix of test scenarios from business requirements and use cases. Wrote and executed test cases in Quality Center and test scripts after reviewing business required document and technical specifications. Prepared test execution report and defect management report to management. Attended defect triage meetings between development, QA, and product management. Performed Regression testing, Integration testing, System testing and data validation testing. Wrote SQL script in TOAD to verify the data integrity and end-to-end testing  Worked on multiple applications/phases at the same time. Followed Agile based testing methodology Environment: SQL Script, BugZilla, UFT, QC, Excel, Linux, Windows XP, SOAPUI"}