{"text": "Name: esther esther E-Mail: esther.esther@gmail.com Address: Shenzhen, China Github: https://github.com/esther LinkedIn: https://linkedin.com/esther Phone No. 133202384860 PROFESSIONAL SUMMARY: 7+ years of experience in Quality Assurance and Software Testing. Diverse experience includes successful projects in the areas of Requirement Gathering, Documentation, Use Case, UML diagrams, Vendor software Implementation, Business Intelligence and User Acceptance Testing and experience in HIPAA 4010 and 5010 EDI healthcare transactions like 837, 835, 834, 276 and 278. Experience in requirement analysis, creating traceability matrix, test planning, creating test data and implementation of test suite (test plan, test scripts and test cases). Extensive experience in testing Client/Server and Web-based Applications. Expertise in Automated testing tools such as Win Runner and QTP. Expertise in Bug reporting tools such as Test Director and Clear Quest. Strong Knowledge of Agile and waterfall methodology of SDLC. Proficient in manual and automated testing of applications on Windows and Unix environment.  Very good experience in Back-End Testing using SQL on UNIX and Windows platform to validate the consistency of data. Experienced working with 5010 transactions changes analysis, design and migration strategy.  Analyzed test results to ensure existing functionality and recommend corrective action where necessary. Participated in UAT and wrote Test Cases for UAT. Implemented Sanity Testing, Smoke Testing, White Box testing, Black Box Testing, GUI Testing, Functionality Testing, Positive and Negative Testing, Unit Testing, Security Testing, Integration Testing, System Testing, User Acceptance Testing (UAT) and Regression Testing of Web Based Applications and Client-Server Applications. Expertise working in Healthcare industry with Insurance, Loans, Claim Processing, Medicaid and Medicare modules as well as Interface Testing and Data Conversion. Strong experience in gathering Medicaid and Medicare plan requirements from the client. Extensive knowledge of all aspects of the Software Development Life Cycle. Good knowledge on different modules within healthcare (Membership, billing, enrollment, Claims, providers). Excellent communication and writing skills with the ability to adapt to new and dynamic environments. Good team player and can work alone with minimal or no supervision. Experience with Medicare, Medicaid, & commercial insurances in HIPAA ANSI X12 4010, 5010 formats including 270,271, 276, 277, 835, 837, 997, NPI, ICD 9,ICD 10, for interfaces & images to clearinghouses/ trading partner applications. Ability to multi-task, prioritize and work with time constraints while paying attention to details.  Technical Skills Testing Software:\t\tWin Runner, QTP, Test Director, Load Runner,                                                     \t\t\t                         \tBusiness Process Testing, Rational Team Test Bug Reporting Tools:\t             \tHP Quality Center, HP Application Lifecycle Management,                                                                                                                                                                                           \tTest Director 7.6, IBM Rational Clear Quest 2000 Programming Languages:\tJava, SQL, C, C++, Visual Basic, XML, HTML, MS FrontPage Database:\t\t\tOracle, MS SQL Server, IBM Net db2, MS Access Applications:\t\t\tMS Office XP Suite, MS Visio, Adobe Photoshop 6.0, Adobe PageMaker Operating Systems:\t\tWindows NT, Windows 98/2000/XP, Windows 7, Linux, UNIX. Other Tools:\t\t\tInformatica Power Center, Transaction Management, Spec Builder, XEngine,                                \tBiztalk, Ultraedit, Filezilla, Winscp, Beyond Compare, Notepad++ PROFESSIONAL EXPERIENCE: MetLife Insurance, Denver, CO\t\t\t\t\t\t                    June 2017- Dec 2018 Sr. QA Analyst MetLife offers Life Insurance, Annuities, Mutual Funds, Group Insurance, Retirement Services, Investment Management and other financial services. Principal products and services provided include life insurance, annuities, mutual funds, pension- and retirement-related investments, administration and asset management, securities brokerage services, and commercial and residential real estate in many states of the U.S. As a member of the QA team, I was mainly responsible for defect tracking and testing the companies quoting and policy management software. The company rebuilds the life insurance quoting system for their group life members and I tested the tools for end users. Subsequent to testing the quoting system for group life members, I worked on software for investment and retirement planning services.  Responsibilities: Participated in Requirement meetings and Detail Design meetings for better understanding of the functional requirements. Performed Manual Testing prior to Automated Testing of the application for Usability testing.  Prepared Test Data and performed Positive and Negative testing.   Prepared Requirement Traceability Matrix (RTM) to map the functional Test cases with the requirement from the functional Requirement Document. Compared and analyzed actual to expected results and reported all bugs in Quality Center.  Performed regression testing to ensure that bugs fixed did not generate new bugs. Created detailed Test cases for different modules in the application according to the functionality of documentation.  Involved in various types of testing like Functional testing, integration testing, End-to-End testing, Regression testing, User acceptance testing of the application.  Performed Sanity, Smoke, Functional, Adhoc and Regression Testing using QTP tools.  Tested new functionality and performed regression testing for every release and modification in the application using QTP. Written Data Driven test to handle the scenario requiring multiples sets of data.  Participated in weekly project status meeting and reviews.  Interface with developers to solve software problems. Attended daily stand up calls, Walkthrough and Scrum meetings. Participated in Sprint planning, Retrospective and Estimation meetings. Created Test plan and Test Summary for each sprint.  Blue Cross Blue Shield, Boston, MA\t\t\t\t\t\t     Jan 2016 – May 2017 Business/ QA Analyst Description: BCBS (BlueCross Blue Shield) is one of the largest healthcare companies in USA. BCBS provides various HealthCare Policies. BCBS offering large networks of the region’s best Physicians, specialists and hospitals. Providing programs and information to help and manage chronic health conditions. Offering related services including dental coverage, life insurance and pharmacy benefits management. Responsibilities: Interacted with developers and documented the functionality process of all the components. Responsible for meeting or exceeding all defined target goals and milestone dates for the project in order to ensure its overall success. Created Use Case Diagrams, Functional Design Documents and Technical Specification documents  Designed and developed Business Rules document about the Claim Component and HIPPA. Created business workflows on the claims module for the client to get a better understanding of the software and prepared a detailed BRD including all functional and non-functional requirements Good Understanding of the EDI (Electronic data interchange), Implementation and Knowledge of HIPAA code sets. Worked on HIPAA Transactions and Code Sets Standards according to the test scenarios such as 837/834/835 transactions. Checked the data flow through the frontend to backend and used SQL Queries to extract the data from the database. Worked in the analysis of the ICD10 codes. Uploaded the diagnosis codes, procedure codes to the related tables in test environment to verify the changes related to ICD10. Verified the field length & character. Involved in writing extensive SQL Queries for back end testing oracle database. Involved in the processing of the claims on the NASCO and then sharing the test results with the business according to test acceptance criteria during their UAT phase. Gathered Data Hub requirements and responsible for creating test cases and test scripts under Quality Center Test Plan and Test Lab modules, developed automation test scripts in Quality Center Worked on legacy conversion data base systems on claims processing. Reviewed EDI 837 claims and flagged HIPPA noncompliant claims received from the Payer side. Investigating software bugs and reporting to the developers using Quality Center Defect Module. Aetna Health Care, Hartford, Connecticut\t\t\t                                   July 2013- Dec 2015 QA Tester Description: Aetna is promoting the health and well-being of the residence of Connecticut. I worked as a QA Analyst on Medicare Claim Accuracy Project for Provider Reimbursement and various modules like Multiple Surgeries, Late Payment Interest and Coordination of Benefits.  Responsibilities: Responsible for decomposition of the requirements based on the functional specifications, design, development, coding, testing, debugging and documentation of applications to satisfy requirements.  Prepared Test Plan and Test cases based on the functional specifications. Set claim processing data for different Module.  Executed SQL queries for searching, creating and updating test data Extensively involved in Data Hub Back-End Testing using Oracle SQL Server; performed daily process testing using SQL scripts execution and logged test results in Quality Center. Created and executed test scripts for approved Change Requests, logged their test results and related documentations in Quality Center. Identified, analyzed, and documented defects, errors, and inconsistencies in the application using Quality Center. Responsible for defect tracking and bug reporting using Quality Center; interacted with developers and Business Analysts to discuss and resolve defects UAT testing for HIPAA 5010 projects including legacy testing and HIPAA requirements and compliance mandates. Inspected and worked on HTTP web services application and on SOAPUI. Analyzed all the bugs in the QC reported by the users during the UAT. Performed feedback concerning completeness and accuracy of AUT. Involved in documenting the defects found during AUT. Participate in various meeting and discussed Enhancement and Modification request. Independent Health Association Inc., Buffalo, New York        \t           \t                  Feb 2011 – June 2013                            QA Analyst Description: Independent Health, a not-for-profit organization provides HMO, PPO, indemnity, and Medicare Advantage plans to 375,000 members. Project involved in developing advanced UI for claim reimbursement process in order to provide better user experience. Project Claims-fallout dealt with creation of new UI that helped in modifying claims fallouts that occurs during claim adjudication process. In short new UI helped claim processor by providing access to other work actions such as claim adjudication, claim denial, claim reversal etc.  Responsibilities: Analyzed the system requirement specifications and developed appropriate test plans, test cases test scripts and executed testing. Worked on claim processing module, which involved Receipt and Verification of Claim Forms (837) and Claims Adjudication, Health Claim Payment/Advice (835) as per HIPAA guidelines.  Designed and documented test plan, test strategies, test cases in Test Manager by evaluating the requirement document in RequisitePro and performed hands-on testing for complex test conditions, scenarios and scripts so HIPAA transactions in EDI formats are verified. Validated and analyzed EDI outbound and inbound Transactions. Executed test cases for the existing market’s various lines of business. (The test cases covered: Authorization of claims, Accumulator, Benefits, Claim Payment and Pricing, as well as member and provider data updates) Validated the application against the expected results by inserting Database, Bitmap and GUI checkpoints.  Performed data-driven testing to read test input data from an Excel File so as to test the application with different positive and negative data. Performed QA Acceptance testing for test workflows with business users and performed data encryption testing as per HIPAA guidelines to ensure the privacy, security and confidentiality.  Extensively used QC for defect reporting and tracking and prioritizing defects and enhancement requests after base lining the requirements.  Attended change request meetings to document changes and implemented procedures to test changes. Involved in continual improvement of automation test scripts to provide improved QA of testing processes and to reduce whole testing cycle time."}