{"text": "Name: dorothy dorothy E-Mail: dorothy.dorothy@gmail.com Address: Wuhan, China Github: https://github.com/dorothy LinkedIn: https://linkedin.com/dorothy Phone No. 135149130780 Professional Summary: Professional with over 7+ years’ experience in Quality Assurance and Software Testing experience in the Information Technology (IT) industry with projects focused in domains such as Banking, Telecom, Finance and Insurance.  Extensive experience in Analyzing, Designing and Implementation of QA Testing strategy for Web based and Client/Server applications using Automation testing and Manual testing. Extensive experience providing quality assurance, business analysis, end user and system documentation in a regulated Software Testing environment. Experience in analyzing, reviewing, interpreting business requirements and translating them into testing requirements and write Test Plans, Test strategy, Test Cases and Test Scripts as well as End to End test scenarios. Expertise in executing test scripts for various software applications through manual and automation testing. Quick learner, self-starter, great communicator and follow good work ethics and a strong team player as well as handle multiple projects simultaneously. Implemented the Software Development Life Cycle (SDLC) for the testing life cycle to follow the standards involved in the process of the application. Experience in White Box Testing, Black Box Testing, Positive, Negative, Data Driven Testing, Performance Testing, Load Testing, Stress Testing, Regression Testing, Integration Testing, System Testing, and Functional Testing. Extensive experience in Visio and MS office tools like Ms-Word, PowerPoint and Excel. Knowledge and experience in Manual/Database Testing and Automation testing like QTP, HPQC (HP ALM). Proficient in overall Defect Management/Problem solving including tracking bugs and reporting using Quality Center and Jira. Good experience in configuring and utilizing testing tools like Quality Center, Team Foundation Server, ALM, Microsoft Test Manager,  Selenium Web Driver, QTPand other requirement specification tools like TeleLogic Doors, JIRA. Good Knowledge of SQL and experience in conducting backend testing. Experience in developing and executing automation Regression testing and System Technical Skills: Professional Experience: State Farm Insurance, Bloomington, IL\t\t\t\t\t                        Oct2014 - Till Date Sr.Automation Engineer State Farm is a group of insurance and financial services companies in the United States. State Farm Insurance is an online web based application providing Insurance and Financial Services to the Customers. This Online application allows the customers to register on their online web site to receive the benefits and provide access to Pay insurance bills and view their insurance policies online. With this application customer can also request policy documents, review the status of insurance bill, access saved insurance rate quotes, access bank accounts, including balances, free online bill pay, and electronic transfers. Responsibilities: Execute manual test cases and automation scripts to ensure all functionality is performing as intended. Conducted Functionality, Security, and Regression testing during the various phases of the development of the application doing Manual Testing. Extensive experience in Quality Assurance Life Cycle (QALC) aspects such as developing Test Strategies, Test Plans, Test Cases (Manual / Automated), Defect Reports and developing Test Scripts, Traceability Matrices and Test Environments. Integrated Application Lifecycle Management (ALM) with HP ALM. Conducted automated test cases using QTP for Oracle Applications, Recorded and wrote test scripts and created user defined functions in scripts. Analyzed the results of manual and automated tests. Knowledge to define the test case Automation and Manual Testing strategies. Logged and tracked defects using JIRA. Customized QTP Scripts using VB Script and also created complex automated scripts in QTP Executed test scripts using manual testing methodology, assisted data entry and verification during Manual test execution to reduce human error. Performed backend testing to verify the data integrity by passing SQL Queries. Exported Test case Scripts (SeleniumWebDriver) in Eclipse IDE and modified the selenium scripts and executed. Performed QTP Automation testing, design, implementation and maintenance Actively Participated in Business requirements review meeting and weekly team meeting. Involved with working in all phases of SDLC methodologies. Used UNIX shell scripts to automate pre-session and post-session processes. Performed Functional, Regression and System Testing of the Application. Experience in Defect Management tools like JIRA. Environment:Java, HTML, XML, HP QTP, SOAP UI, Agile, Application Lifecycle Management (ALM)/Quality Center(QC), SQL, Oracle, Windows 7, UNIX,Selenium Web Driver, MS Office (Word, Excel, Power Point), MS Project, Jira. Verizon, Vienna VA.\t\t\t\t\t\t\t                     Oct2013 – Sep 2014 QA AutomationTester Verizon Communications is a global leader in delivering broadband and other wireless and wire line. This project we have different applications modules to be tested, Residential module, Business Module, Wireless Module. Under Small Business Module- New Customer, Current Customer, they had various options to select from like Services-Business phone, High speed, FIOS Internet. This Application Module is used to collect customer information and enter it into the database of Verizon. Responsibilities: Analyzed the system requirement specifications and involved in developing Test Plans, Test Scenarios, testing scope, and Test Cases.  Performed regression, integration, platform and performance testing to certify the stability and     usability of software systems. Developed and executed different set of test cases that helped improve accuracy of QA results. Provided comprehensive software release documentation for final deployment. As part of testing, executed the test cases on different browsers like Internet Explorer and Mozilla Firefox, Chrome using Selenium Web Driver. Consistently recognized for excellent problem-solving and analytical skills by programmers, project managers and other team members. Performed Black Box, Functional, Integration and Regression Testing.  Used Quality Center to organize and manage all phases of the software testing process, writing test cases, executing tests, and tracking defects. Exposure to Backend Testing using SQL. Prepared Test Results after Test case execution.  Performed Positive and Negative testing against requirements.  Extensively tested cross Browser, Cross platform, Usability, Accessibility and security testing for all the applications under test (AUT).   Extensive experience in different testing methods like System Testing, GUI Testing, Functional Testing, Browser Testing, Positive & Negative Testing & Web Application Testing.  Experience in Performance, System, Functional, Systematic, Requirements, Unit & User Acceptance Testing (UAT)  Experienced in Bug tracking & Analysis using bug tracking tool – QualityCenter Checked the data flow through the front and backend and used SQL queries to extract the data from the database. Involved in Handover meetings, Business Analysis and design reviews for each release and identifying Critical test cases on each release. Developed Test Scripts for manual testing and automated them using Win Runner, Load Runner and QTP. Tested application response for positive and negative sets of data with data-driven testing procedures. Involved in weekly walkthroughs and inspection meetings, to verify the status of the testing effort and the project as a whole. Environment:Java, J2EE, Oracle, HTML, XML, HP QTP, SOAP UI, Agile, Application Lifecycle Management (ALM)/Quality Center(QC), Windows 7,Selenium Web Driver,MS Office (Word, Excel, Power Point), MS Project, SQL Server. Fannie Mae,Herndon, VA\t                                                                                                Jul2012 – Sep2013 QA Automation Engineer Fannie Mae is one of the leading Mortgage companies.  This is an online application maintaining the financials of the Mortgage application. Performed Automation testing on Mortgage application using HP ALM tools. Responsibilities: Gained detailed knowledge on key concepts and methodologies such as Agile, Scrum development process, Waterfall, etc. Created test cases, test plans, test deliverables, test execution and bug eports on simulated projects. Actively learned how to write queries using SQL. Learned Java for automated testing. Effectively analyzed and decompose business requirements to extract test requirements Wrote Manual test cases and test scripts. Performed Performance, Load, and Stress Testing of the application by creating virtual users (LoadRunner). Involved in maintaining Test Matrix. Transactions were defined to measure server performance under load by creating rendezvous points to simulate heavy server load. Mercury Performed System and Regression Testing for new releases using win runner. Implemented agile testing methods and worked closely with the developers and reviewed the specifications. Worked on conversion of Manual tests into automated test Scripts. Involved in QA team meetings, Defect tracking meetings and assisted junior testers in completion of the tasks. Responsible for defect tracking and defect reporting in IBM Clear Quest. Created Test Cases and Test Scripts for the Functionality Testing. Used SQL statements extensively to retrieve data for database testing. Involved in Functional, Regression and smoke testing Manually Developed Data Driven tests to check how application performs with different sets of data using QTP Recorded User action on GUI using QTP and performed Regression Testing on builds. Assisted the Team Lead with daily QA tasks. Attended Project Meetings, Walkthroughs, and QA Status Meetings. Responsible for defect tracking and management metrics, defects are logged and change requests are submitted. Expertise in developing Automation Frameworks for Web Applications using QTP Tracked and managed all the defects using bug tracker tool JIRA. Actively participated in GUI testing, Functional testing, System testing, Smoke and Sanity testing. Environment: Java, J2EE, SQL Server, XML, QTP, JIRA, Agile, Application Lifecycle Management (ALM)/Quality Center(QC), Windows 7, IBM Quest Hindustan Computers Limited,Noida, India.\t\t\t\t\tJul 2009 -Jun2012 Manual Tester Hindustan Computers Limited is a global IT services company, headquartered in Noida, Uttar Pradesh, India. I was the automation tester of a project that was initiated to redesign its website with new ecommerce features and an easy navigation of the site. The project also involved a complete revamp of the site search, browsing and zoom features.  Responsibilities:\t\t Troubles hooted client installation by monitoring log files for errors. Establishing manual testing and troubleshooting methodology. Worked on design, testing, and production support of AT&T’s consumer-based Modem application. Technical and production support for the application. Worked directly with client different business analysts and test leads. Extensive knowledge in Manual testing using tools such as QualityCenter. Provided Windows 7 remote desktop support Participating in release of new IT services/applications into production Providing shared folder access to users. Reset user account passwords using Active Directory Used Service now to monitor and close tickets Generated reports and subscriptions to update client on progress of their environment Monitored software compliance in asset tracking and reporting Producing custom task sequences for each department and model / make of devices present in the environment Provides systems operational support, monitor, operate and maintain stability after deploying software. Completion of documentation including Trouble Tickets Tested the backend database using SQL queries. Worked on Existing Automation QTP Scripts Developed test scripts for GUI applications using QTP and automating the test scripts for the regression testing. Record incidents encountered during System testing and generated Status/Defect report. Environment: Quality Center, QTP, HTML, Web Logic, Jira, SQL Server, SQL, HP ALM. Education: Bachelor of Electronics and Instrumentation Engineering,Kurukshetra University   \t\t"}