{"text": "Name: irene irene E-Mail: irene.irene@gmail.com Address: Shantou, China Github: https://github.com/irene LinkedIn: https://linkedin.com/irene Phone No. 906115108697 SUMMARY: Around 8 years of experience as a Business Analyst dealing with versatile business solutions, which includes 4+ years of experience as Salesforce Analyst in Business Requirements Analysis, Requirement Gathering and Gap Analysis. Over 4 years of experience as Sales force Business Analyst and Administrator in CRM space. ImplementedSales andService cloud to improve Business process , and an active contributor in Salesforce user Community, Developed Business Requirement Documents (BRD), functional requirement documents (FRD) and traceability matrix. Good Knowledge of Waterfall and Agile SDLC methodologies. Conducted interviews with users andJoint Application Development (JAD) Sessions for gathering requirements and developed Use Cases in UML using Visio. Developed Test Scenarios, Test Cases and Test Data for UAT. Developed training material and Conducted End user training. Experienced in CRM business processes like Forecasting, Campaign Management, Lead Management and Knowledge Management. Functional Expertise in Sales Force Automation (SFA), Marketing Automation, Partner RelationshipManagement (PRM), and Case Management. Created Custom Objects, Custom Fields, and Formula Fields, Field Dependencies, automated alerts and Email templates. Familiar and hasFunctional knowledge in Apex Classes, Triggers and writing Workflows, approval process, validation rules and Auto response. Provided direct support to Sales Force users during post-implementation issues. Installed and configured Salesforce.com AppExchange Apps. Generated custom Reports, Dashboards and analytical snapshot for management and various business unit personnel to provide detail information on key performance indicators (KPI). Experienced in data migration and integration using Data Loader and Informatica. Excellent communication, analytical, interpersonal, and presentation skills. Worked actively in various phases of System Development Life Cycle (SDLC) by implementing methodologies such as Waterfall, Rational Unified Process (RUP), Agile (Scrum). Skilled in Stakeholder analysis, management and communication by working with Executive, senior business sponsors and technical specialists for proposing any new change in applications or building new applications. Experienced in working with SMEs and development team to design solutions for clients. Involved in eliciting requirements using documents analysis, requirement workshops, brainstorming, use cases and workflow analysis Prepared Business Requirements Documents (BRD), Functional Requirements Specification (FRS), System Requirements Specification (SRS) Developed Use Case Diagrams, Sequence Diagrams, State Diagrams and Activity Diagrams using UML to make developers understand the business and system needs. Experienced in facilitating and conducting Joint Application Design (JAD), Rapid Application Development (RAD), interviews, workshops and requirement elicitation sessions with stakeholders and end-users. Tracked, validated and communicated requirements using Requirement Traceability Matrix (RTM) Gathered and prioritized requirements using various techniques including Delphi and MoSCoW. Performed SWOT Analysis, Risk Analysis, Root Cause Analysis and GAP Analysis between As Is and To Be workflow models for conducting Enterprise Analysis. Proficient in writing Test Plans for Unit Testing, System Integration Testing and User Acceptance Testing (UAT) Collaborated with the technical team / Development/ QA teams to resolve issues/defects towards the satisfaction of the users. Participate in design reviews and provide input to the design recommendations. Experience in managing multiple projects concurrently by using exceptionally strong organizational skills, analytical, problem solving, decision making, leadership skills and Project management skills to work and deliver under pressure /critical deadlines. Highly initiative, self-motivated with excellent communication skills, Conflict resolution and presentation skills. Highly collaborative team player with extensive Customer Relationship Management (CRM) skills, also possess excellent facilitation and mentoring skills and ability to prioritize tasks according to business needs. Excellent communication and inter-personal skills, accustomed to working in both large and small team environments. TECHNICAL SKILLS:\t WORK EXPERIENCE:\t LesConcierges, San Francisco, CA                                                                        June2013-Present Salesforce Business Analyst LesConcierges is the world’s premier provider of global concierge services and solutions. They represent and enhance your brand to generate loyalty from your most valued employees and most treasured customers. More than just a service provider, LesConcierges is a strategic partner who work to develop unique approaches and programs that deliver value and best suit your business needs. The project involved working with Cipher cloud to further secure the customer’s credit information by converting it into encrypted data  Performed roles of business analyst and administrator in the company. Interfaced directly with clients, super users, and management team to create a comprehensive Functional Requirement Document. Conducted GAP Analysis and enhanced business process by integrating with Sales force vanilla processes. Regularly interfaced with clients during scoping, development and implementation to ensure solution met the requirements and to prevent scope creep. Configured Sales force roles/profiles, accounts, contacts, views and account planning. Implemented call center management functionalities to retention and monitor customer activities. Created landing page and survey form with force.com sites and visual force. Created triggers using Apex class to meet the business requirement. Migrate code using change set and Force.com IDE. Developed and managed dashboards and reports for all team functions at both management and individual level. Implemented data migration and integration between Legacy system and Sales force CRM using Data Loader. Assisted with UAT, documentation and refresh of sandbox environments. Developed training material and Conducted End user training. Environment:Saleforce.com platform, Apex, Visual force, Salesforce.com Data Loader, Workflow & Approvals, Reports, Custom Objects, Custom Tabs, Email Services, Security Controls, HTML, Java Script, Java, Web Services, WSDL, Sandbox, Eclipse IDE Plug-in. Seagate, Cupertino, CA                                                                                       Jan 2012 – June 2013 Salesforce Business Analyst Seagate is the leading provider of hard drives and storage solutions. From the videos, music and documents we share with friends and family on social networks, to servers that form the backbone of enterprise data centers and cloud-based computing, to desktop and notebook computers that fuel our personal productivity, Seagate products help more people store, share and protect their valuable digital content. The project involved partnering with Apptus for contract management.  Developed, gathered and documented the business needs of clients and stakeholders. Organized and validated the requirements and ensures that all are traceable and measurable. Implemented Sales cloud and incorporated the enhanced features as required to streamline the business process. Designed and maintained user roles, security, profiles, workflows, approval processes, and validation rules. Assisted in user acceptance testing (UAT) process including creating and validating UAT scripts and coordinating UAT process with users. Designed customizations and configurations of SFDC objects, page layouts, workflows, document templates, data fields, reports and dashboards according to the business need. Imported excel based customer information records in to Accounts, Contacts and Cases using Data Loader and Import Wizard. Modified Opportunity and Pipeline by customizing various stages to help prospect better and enabled forecasting. Designed escalation rules, automatic case generation and their escalation to call center representative, and generated email alerts for quick issue resolution. Developed, documented, and executed test plans to assess the integrity and accuracy of business processes, module functionality setups and modifications, enhancements, customizations, and patches.  Assisted the PM in capturing and reporting project measures to the appropriate stakeholders. Managed resources and project timeline using MS project based on Statement of Work. Created custom Dashboards for Sales manager’s home page to reflect their sales quota and sales team’s performance against the forecast and provided accessibility to dashboards for authorized people. Environment: Saleforce.com platform, Data Loader, HTML, Java Script, Workflow & Approvals, Custom Objects, Custom Tabs, Email Services, Security Controls, Sandboxes (Developer sandbox, Configuration only, Full sandbox) Eclipse IDE Plug-in, Windows XP. Avaya, Fairfax, VA                                                                                               Jan2011 – Julne2011 SFDC Business Analyst Avaya is an Enterprise communications Solution provider. It implemented Sales cloud to improve forecasting, campaign, and Partner Portal for channel partner with deal registration, lead distribution and entitlement functionalities.  \t Interacted with stakeholders, managed stakeholder responsibilities through continual communication. Facilitated meetings with stakeholders through various elicitation techniques like JAD sessions, brainstorming, and interface analysis to identify business needs and rules. Established constant communication with the Project Manager and development team during different stages of the agile life cycle. Analyzed requirements and created use cases diagrams and activity diagrams using MS Visio. Created Use case descriptions and prototype to communicate those businesses needs to the development team. Tracked and managed the requirements using the Requirement Traceability Matrix (RTM) which facilitates to trace the artifacts produced by the team throughout the project.  Conducted structured walkthrough to conform the elicitation results to end users, developers and managers Prepared training manuals and guidance documents by working with business and technical teams. Performed business requirements traceability testing using the Requirement Traceability Matrix (RTM) Analyzed impacts of proposed solutions with the communication of key stakeholders. Collaborated with QA team in preparing test data for positive and negative test scenarios as per application specifications and writing test plans. Analyzed and evaluated the performance of the application from various dimensions and conducted User Acceptance Testing (UAT) for successful implementation. Conducted bug triage meetings to prioritize bugs in order to help streamline the QA efforts Used Quality Center for tracking defects that were reported to development team during System testing and UAT. Environment:Saleforce.com platform, Data Loader, HTML, Java Script, Workflow & Approvals, Custom Objects, Custom Tabs, Email Services, Security Controls, Sandboxes (Developer sandbox, Configuration only, Full sandbox) Eclipse IDE Plug-in, Windows XP. Adaptive Marketing, (Vertrue Inc), Norwalk, CT                                  Jan2010 –Dec2010 SFDC Business Analyst        Adaptive Marketing, LLC provides online and offline consumer membership and loyalty programs. It offers consumer discount programs and financial programs. It has implemented sales cloud and service cloud to improve customer retention and service delivery process improvement                                                                        Interacted with various business team members (JAD Sessions) to gather the requirements and documented the requirements. Created complete As-is and To-be business process flow  Involved in handling Change Requests and its management. . Worked with various salesforce.com objects like Accounts, Contacts, Leads, Campaigns, Reports, Dashboards Developed and configured various Custom Reports and Report Folders for different user profiles based on the need in the organization. Worked with Biz to obtain requirements thereby designed, implemented, unit tested, maintained, and troubleshoot the application. Having a good techno-functional knowledge on different products used by Client. An end-to-end exposure on force.com business cloud applications Analysis and development. Supporting BAT and UAT with testers. Developed Custom Objects, Custom Reports and configured the Analytic Snapshots to dump the data on regular basis for the sales performance and lead generation statistics. Created and deployed Several Reports using salesforce.com platform. Developed and deployed workflows wherever necessary. Performed the roles of Salesforce.com Analyst and Administrator in the organization. Used the sandbox for testing and migrated the code to the deployment instance after testing. Interacted with the Salesforce.com premium tech support team on a regular basis.  Environment:Saleforce.com platform, Data Loader, HTML, Java Script, Workflow & Approvals, Custom Objects, Custom Tabs, Email Services, Security Controls, Sandboxes (Developer sandbox, Configuration only, Full sandbox) Eclipse IDE Plug-in, Windows XP. Adagio InfoTech, Bangalore, India                                                                     Jan 2008 –Oct 2009   Business Analyst Gathered business, system, and functional requirements by conducting detailed interviews with business users, stakeholders, and Subject Matter Experts (SME's) Implemented the entire Rational Unified Process (RUP) methodology of application development with its various workflows and activities. Identified and developed Use Cases from the business and systems requirements. Documented high level and detailed Use Cases to include all the functionalities of the new system. Served as liaison between the functional and technical team. Gathered the functional and business requirements by conducting JAD sessions. Followed the UML methodology to Create UML Diagrams including Use Cases Diagrams, Activity Diagrams, Sequence Diagrams, Data Flow Diagrams (DFDs), ER Diagrams using Rational Rose and MS Visio. Facilitated meetings with developers, system analyst and testers to collaborate resource allocation and project completion using MS Project. Designed and implemented basic SQL queries. Supervised the User Acceptance Testing (UAT) to test the usability of the application. Maintained weekly status reports using MS Project. Environment:J2EM, XML, SQL Server 2005, HTML, RUP, MS Project, MS Office Suite, Dreamweaver Neo Delta Technologies, Bangalore, India                                              Mar 2006 –Oct 2007    Jr. Business System Analyst Conducted joint requirements planning sessions as a facilitator to gather requirements from the business area. Implemented RUP and followed an iterative Use-Case driven process for requirement documentation and deployment. Understood and articulated business requirements gathered from user interviews and then converted these business requirements into technical specifications. Identified, gathered, analyzed, prioritized, and documented all the system specific requirements Performed GAP Analysis to figure out what we have and what we want to have. Created Use Cases, activity report, logical components to extract business flows and workflows involved in the project using UML and Microsoft Visio. Participated in meetings with developers, Project manager and Quality Analyst to discuss business requirements, test planning, resource utilization, and defect tracking. Conducted JAD sessions with stakeholders and business users and managed conflicts using Conflict Management skills. Worked closely with the UI team to model the screens, which met user, define requirements and also company standards. Communicated all the requirements to the developers in an understandable manner. Performed a Change Management Role to make software compatible with different means. Identified Test execution method: Manual/Automated. Read and Understood Test cases and identified the frequent functions. Interfaced with Quality Analysts during unit testing, integration testing, system testing, and user acceptance testing. Developed user presentation and training manuals per project specification and timeline. Environment:MS Office, Waterfall, UML, MS Visio, GAP, SWOT analysis. EDUCATION:\t MS in Global Marketing Management -Virginia Commonwealth University, USA,2014"}