{"text": "Name: helen helen E-Mail: helen.helen@gmail.com Address: Baoding, China Github: https://github.com/helen LinkedIn: https://linkedin.com/helen Phone No. 854698363984 Certified Salesforce.com Consultant (DEV-401) with 7+ years of overall professional IT Experience with strong Object Oriented Analysis, Designing, Programming skills including 4+ years’ experience in Salesforce.com CRM platform with proficiency as a Salesforce Developer & Administrator SUMMARY: Strong experience working with Apex classes, Triggers, Controllers and Controller Extensions. Experience in implementing Salesforce Custom objects, Custom fields, Junction objects, Master-Detail relationships and Look-Up relationships. Expert in Query language using SOQL and SOSL statements. Experience in Data Migration using Data Loader, Import Wizard and Informatica on Cloud. In-depth knowledge in Developing Apex code within Governor Limits. Strong Experience in Code Migration using Force.com IDE and Change sets. Expert in SFDC Administrative skills like creating Profiles, Roles, Users, Relationships, Page Layouts, Email Services, Approvals, Workflows, Reports, Dashboards, Tasks and Events. Proficient in dealing with the functionalities related to the Service cloud, Sales Cloud, Call center, Chatter & App-exchange applications. Extensive experience of using declarative features like Validation rules, Assignment rules, Auto-Response rules, Escalation Rules for satisfying complex business process automations. Possess comprehensive understanding of CRM business processes like Campaign, Lead, Account and Case Managements and Call Center. Experience of Web-to-lead, Web-to-case, Email-to-case functionality. In-depth understanding of CRM Business process like Campaign Management, Lead Management, Account Management and Case Management. Proficient in dealing with Content, Documents, Files and Libraries tabs. Worked on multiple projects simultaneously. Developed and worked on different Salesforce.com environments such as Sandbox and Production environments. Experience in working with Offline edition and reporting modules. Installed Salesforce AppExchange Apps, configured and maintained user security permissions in compliance with organizational needs Experience in Web Services and Integrated Google Apps in Salesforce. Experience in web technologies like HTML, XML, CSS and JavaScript. Efficient team player with excellent analytical, communication & problem solving skills with ability to work independently as well as in a team Capable of rapidly learning new technologies and processes  and successfully applying them to projects and operations CERTIFICATIONS: Salesforce.com Certified Force.com Developer (DEV-401).  TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE: Client: G/O Digital, Phoenix, AZ\t\t\t\t\t\t\t      June 2014 - Present\t Role: Salesforce Developer G/O Digital offers a dynamic, entrepreneurial culture in a high growth division of Gannett Company, Inc., an international media and marketing solutions company that reaches more than 100 million people every month through its powerful network of broadcast, digital, mobile and publishing properties.. Responsibilities: Interacted with business users for gathering the requirements for Salesforce implementation. Developed and deployed Apex Classes, Controller Classes, Extensions and Apex Triggers for various functional needs in the application using Eclipse IDE. Used SOQL and SOSL with consideration to Governor Limits for data manipulation needs of the application using platform database objects. Developed Visualforce Pages to show customized content for certain things according to client needs. Used Web Services API to extract data from external systems. Implemented complex Approval Processes and created many Workflows to accomplish the tasks. Partner portals using communities can update opportunities or qualify leads. Used Custom Settings to store frequently used data and Field Sets to avoid code changes when new fields are added. Created various Profiles, Roles, Page Layouts and configured the Permissions based on the Organization hierarchy requirements. Created communities as a part of customer portals and partner portals with the organization. Developed Web-to-Lead functionality for customers directly to Salesforce CRM. Used Data Loader extensively for data exports & imports. Used Eclipse based Force.com IDE and Change Sets to deploy Apex code. Implemented several optimizations techniques to make the code more efficient. Worked on multiple projects simultaneously.  Designed various HTML Email templates for Auto-Response to customers. Actively participated in testing of the application by writing test classes. Environment: Apex Classes, Apex Triggers, Visual Force, Workflows & Approval Processes, HTML, Java Script, Web Services, SOQL, SOSL, Eclipse IDE Plug-in, JQuery, Web Services, JIIRA, Apex Data Loader,  Jitter bit. Client: TargetX, Conshohocken, PA\t\t\t            \t\t                  June 2013 - May 2014\t Role: Salesforce Developer TargetX provides a campus wide solution to help colleges build relationships and forge lifelong communications with their most important constituencies, including prospective students, current students, alumni and potential donors. The company’s CRM is built on the powerful development platform of Salesforce.com Responsibilities: Participated in analyzing the Requirements, preparing the Design documents based on the specifications and Developing and Maintaining the application. Developed a process to manage request and approvals for leads and opportunities. Implemented a specialized management process with version capabilities to keep track of updates and milestones in project. Used DML and SOQL for Data entry through Visualforce page. Used pagination in order to control the number of records displayed. Created workflow rules and defined related tasks, validation rules, Auto-Response Rules, Approval process, email alerts and field updates. Customized page layouts for Campaigns, Leads, Opportunity, Contacts and Accounts depending upon user roles, and groups. Used SOSL to search the records from the list of records shown in Visualforce page. Used Visualforce pages as custom tabs and Buttons. Used merge Fields to create Email Templates for Visualforce. Created Visualforce pages to show list of records with inline edit support. Created Apex classes for actions in Visualforce pages like undelete, delete, save etc. Worked on Force.com IDE to write apex classes and triggers. Took the responsibility of writing Test classes for every Apex class written. Performed data migration from MS Outlook, Excel to Salesforce using Data Loader. Integration using Informatica cloud for data migration into the cloud. Used Tabular, Summary and Matrix reports to create Standard reports and Custom reports. Environment: Saleforce.com platform, Force.com Sites, Apex, Visualforce (Pages, Component & Controllers), Pages, Data Loader, HTML, Java Script, CSS, Workflow & Approvals, Reports, Custom Objects, Custom Tabs, Security Controls, Sandbox data loading, Data Loader, SF Explorer and  Eclipse IDE Plug-in. Client: Ribbit/BT, Mountain View, CA\t\t\t\t\t                  May 2012 - May 2013 Role: Salesforce Developer/Administrator\t\t Ribbit provides the supply chain infrastructure from production through delivery that enables content providers and service providers alike to engage and prosper in today’s video economy. The Salesforce CRM application developed is used by the sales and support teams to keep track of customers, their contact information, opportunities in pipeline and activities. Responsibilities: Configure, maintain, develop and support the salesforce.com application. Create and manage custom objects, fields, and formulas. Develop and maintain custom reports, dashboards, validation rules, approval processes and custom workflows. Develop and schedule Batch Jobs when required. Data mapping and data migration into current salesforce.com instance.  Manage salesforce.com instance using the standard aspects of the salesforce.com setup menu.   Maintain, create and manage user accounts, profiles and security. Customize new and existing page layouts for individual business units within the organization. Recommend, implement, test, and deploy Visualforce pages and Apex classes and triggers. Performed the techno-functional role of Salesforce.com Analyst/ Developer and Administrator in the organization. Environment:\tSaleforce.com platform, Apex, Visual Force (Pages, Component), Salesforce.com Data Loader, Informatica OnDemand, Workflow & Approvals, Reports, Custom Objects, Custom Tabs, Email Services, Security Controls, HTML, Java Script, Web Services, Eclipse IDE Plug-in. Client: Ansley Capital Group, Chicago, IL\t\t\t\t\t   Feb 2011 – April 2012 Role: Salesforce Administrator Ansley, a Financial Services Company, needed a CRM solution to improve sales process and facilitate tracking and sharing of information across diverse business groups. Responsibilities: Performed the role of Salesforce.com Analyst in the organization. Created the detailed requirements document for entering and retrieving various types of data related to bonds such as coupon, yield, convexity, duration. Assisted in loading the parameters and creating order through manager workbench. Created Custom Objects and fields for transactional and contractual information. Created users, roles, public groups and implemented role hierarchies, sharing rules and record level permissions to manage sharing access among different users. Designed and deployed Custom tabs, validation rules, Approval Processes and Auto-Response Rules for automating business logic. Identified and created workflow rules and defined related tasks, email alerts, and field updates. Identified and created page layouts, search layouts to organize fields, custom links, related lists, and other components on record pages. Identified and created pick lists, dependent pick lists, lookups, master detail relationships, validation and formula fields to the custom objects. Used field level security along with page layouts to manage access to certain fields. Designed and developed User Interfaces for Salesforce users as per requirements. Designed and implemented various Email templates for Auto-Response to customers. Provided the training to the internal business users to use the application. Environment: Apex Data Loader, Workflow & Approvals, Reports, Custom Objects, Custom Tabs, Security Controls, Sandbox, Data Loader, ANT migration tool. Client: Ideacts, Hyderabad, India\t\t\t\t\t              \tDec 2009 – Dec 2010 Role: Java Developer  \t\t The WTS project is initiated by the Quality department of Aegis as an internal requirement to track the reporting of the software developers and capture the metrics there by and analyze the same for the future requirements as part of quality function. Responsibilities: Analyzed the system, and gathered all the requirements. Designed use case diagrams, class diagrams, sequence diagrams, deployment diagrams. Designed and developed technical specifications using design patterns and OO methodology. Developed presentation tire using HTML, JSP and Java Script. Involved in the configuration, development, and deployment of EJBs, and JSPs & Servlets in Web logic Test Environment. Involved in writing ANT script for application deployment. Involved in development of the server side business logic using Action Classes, Action Forms, Helper classes and DAO access layer classes. Designed and developed Session Beans for implementing Business logic. Involved in all phases (Unit/Integration/System) of testing. Environment: Java Server Pages (JSP), Struts 2.0, JSF, JavaScript, Java 1.4, Struts 2.0, Web Services, EJB, Servlets, SOAP, XML, ANT Build Scripts. Client: TechSol, Hyderabad, India\t\t\t\t\t\t     Jan 2008 - Nov 2009             Role: Web Developer \t\t\t\t\t\t\t Responsibilities: Involved in developing, designing the application in various design patterns which are used in the design of the application. Designed the application page flow using struts actions and forms. Developed user interfaces (UI) of the application using HTML, CSS and JavaScript. Developed the application using HTML, and JavaScript. Designed the Hibernate mapping for the application entities. Extensively used XSL to style XML data. Responsible in writing the interface to the sourcing and inventory application. The data exchange was done using XML.  Environment: HTML, DHTML, XML, CSS, JavaScript. "}