{"text": "Name: annie annie E-Mail: annie.annie@gmail.com Address: Pudong, China Github: https://github.com/annie LinkedIn: https://linkedin.com/annie Phone No. 631910001613 Professional Summary: 9 years of experience in Data Modeling, Database Design, Programming, Development and Implementation of Client-Server Applications & Database systems using SQL Server 2005/2008/2008R2/2012/2014/2016. Experience with Business Systems analysis in Health care, with QNXT application and extensive interaction with client Extensive experience in using Microsoft BI studio products like SSIS, SSAS, SSRS for implementation of ETL methodology in data extraction, transformation and loading. Expert in Data Warehouse development starting from inception to implementation and ongoing support, strong understanding of BI application design and development principles.   Highly experienced in whole cycle of DTS/SQL server integration services (SSIS 2005/2008) Packages (Developing, Deploying, Scheduling, Troubleshooting and monitoring) for performing Data transfers and ETL Purposes across different servers.  Experience in providing Logging, Error handling by using Event Handler, and Custom Logging for SSIS Packages. Scheduling and Monitoring ETL Processes using DTS Exec utilities and batch files. Expertise in generating reports using SQL Server Reporting Services, Crystal Reports, and MS Excel spreadsheets and Power Pivot. Expert in designing Enterprise reports using SQL Server Reporting Services (SSRS 2000/2005/2008) generated drill down reports, parameterized reports, linked reports, sub reports, matrix dynamics and filters, charts in SSRS 2005/2008. Experience in creating Ad-hoc reports, data driven subscription reports by using Report Builder in SSRS.  Good knowledge of Data Marts, Operational Data Store (ODS), MDM, OLAP, Dimensional Data Modeling, Star Schema Modeling, Snow-Flake Modeling for FACT and Dimensions Tables using Analysis Services. Developed OLAP Cubes by using SQL Server Analysis Services (SSAS), and defined data sources, data source views, Dimensions, Measures, Hierarchies, Attributes, Calculations using multi-dimensional expression (MDX), Perspectives and Roles. Created Dashboard pages in SharePoint Server that use different types of web parts and excel services for reports With the ease of TFS, managed user permissions among team projects and also, further made it easy to identify any missing permissions Has very strong background in a disciplined software development life cycle (SDLC) process and has excellent analytical, programming and problem-solving skills. Good team player, Excellent interpersonal and communication skills combined with self-motivation, initiative and the ability to think outside the box. Expertise in defining the business process flow and gathering business requirements. Experience in creating interactive reports with SSRS, using the report parameters, query parameters, Filters and Expressions Good exposure on visualization tools Tableau and MS power BI Generated reports using Global Variables, Expressions and Functions for the reports Generated periodic reports based on the statistical analysis of the data from various time frame and division using Power BI Created Ad-hoc reports, data driven subscription reports by using Report Builder in SSRS Good knowledge of Data Marts, Operational Data Store (ODS), OLAP, Dimensional Data Modeling, Star Schema Modeling, Snow-Flake Modeling for FACT and Dimensions Tables using Analysis Services Created Dashboard pages in SharePoint Server that use different types of web parts and excel services for reports Used Team Foundation Server (TFS) for assigning & integration of tasks, defect management and source & version control Used Team Foundation Server for sprint planning, tracking bugs and work items and as a version control Has very strong background in a disciplined software development life cycle (SDLC) process and has excellent analytical, programming and problem-solving skills Technical Skills: PROFESSIONAL SUMMARY:  BCBS Detroit MI\t\t\t\t\t\t\t\t\tJan 2017-till date\t Senior SQL/BI Developer Responsibilities: Developed complex programs in T-SQL, writing Stored Procedures, Triggers and Queries with best execution plan.  Extensively used Joins and Sub-Queries to simplify complex queries involving multiple tables.  Involved in complete lifecycle implementation of the project from gathering user requirements, preparation of technical specifications documents, designing and developing reports, Integration testing, Unit testing to Go live production support.  Used Power BI Power Pivot to develop data analysis prototype, for advanced visualize reports. Used various Transformations in SSIS Dataflow, Control Flow using for loop Containers and Fuzzy Lookups etc.  Designed and developed SSIS Packages to import and export data from MS Excels Server and Flat files.  Involved in gathering requirements for data deliverables to ensure an understanding of their purpose and provide a technical perspective on requirements. Worked on Tabular Model and imported it into Power BI. Developed Custom Visualizations to suit the best of business needs.  Created designs and process flow on to how standardize Power BI Dashboards to meet the requirements of the business.  Colleague Student Information System (SIS) Administrator - Responsible for administration, updates, troubleshooting, and analysis of the SIS and supporting applications.  Informer BI reporting software administrator including implementation, training (reporting and dashboards), and mapping to DB. Created multiple dimensions, perspectives, hierarchies, and dynamic measures to analyze performances of each KPI. Automated the creation of Excel pivot tables from SAS data sets using SAS /Macro and VBA  Primarily worked on producing Monthly and Daily reports in Power BI. Developed SAS stored procedures and views to provide BI analysis and insights  Developed data model, SQL Coding, SQL Query tuning process and Schemas.  Created new ETL packages to validate, extract, transform and load data into data warehouse databases, data mart databases using SSIS packages.  Worked with other team members (Data Analysts, Data SMEs and Data Architects/Modelers) to design the source of data required and details about the meaning and structure of the data necessary to properly use it. Involved in the Unit testing, Quality Assurance testing and User Approval testing of Power BI reports and modifying the code accordingly to match user’s business requirements. Prepare and Distribute Financial Reports using SSRS to internal and provide recommendations for client’s strategic decision making Resolve production issues related to the SSRS reports and create ad-hoc financial reports for the clients Reconcile general ledger and various revenue and expense accounts on monthly basis. Performed scenario analyses to align operational and financial resources with growth objections. Making data visualization in a variety of ways of multiple visualizations using Power BI. Generated server-sidePL/SQL scripts for data manipulation and validation and materialized views for remote instances.  Making changes to the existing APEX applications in the production.  Created SQL*plus reports as per client's various needs, and developed business objects.  Developed PL/SQL triggers and master tables for automatic creation of primary keys.  Used Configuration Files in SSIS to ease the process of moving the packages across servers.  Designed packages which utilized tasks and transformations such as Execute SQLTask, Data Flow Task, Sequence Container, For Each Loop Container, Lookup, Aggregate and Derived Column.  Used Power BI Power Pivot to develop data analysis prototype, and used Power View and PowerMap to visualize reports. Developed packages in SSIS with error handling.  Created DAX calculated columns inpower pivot worksheets to extract, import and join data that coming from different sources. Involved in data cleansing to remove unnecessary columns eliminate redundant and inconsistent data by using SSIS transformations.  Created new ETL packages to validate, extract, transform and load data into data warehouse databases, data mart databases using SSIS packages.  Implemented Performance Tuning and Query Optimization. Created Package Configurations to deploy packages from development to production server.  Designed tabular, matrix reports, drilldown, drill through, Parameterized and linked reports in SQL Reporting Services (SSRS)  Using SQLServer Reporting Services (SSRS) generated periodic reports based on the statistical analysis of the data.  Defined data sets with joins and sub-queries for complex queries involving multiple tables in Power BI. Designed Cubes with Star Schema usingSQL Server Analysis Services 2012 (SSAS).  Developed large number of standard and customized reports using SSRS for data feeds and for Reports on server.  Handled errors using Exception Handling extensively for the ease of debugging and displaying the error messages in the application. Designed and developed Power BI dashboards, Reports and published it on Power BI sites. Conducted database management, performance measurement and performance tuning for new databases and existing databases by using SQL Profiler and SQL Analyzer.  Implemented cell level security in cubes using MDX expressions to restrict users of one region viewing data of another region using SSAS.  Environment: MS SQLServer 2016/2014/2012, MS SQLServer Reporting Services (SSRS), MS SQLServer Integration Services (SSIS), Power BI Desktop, SharePoint, TFS, Visual Studio 2015, DAX Studio,MS SQLServer Analysis Services (SSAS), C#.NET, T-SQL, SQLProfiler, XML, Team Foundation Server (TFS) 2012, MS Excel, Excess, Windows 8. Diplomat pharmacy Flint, Mi \t\t\t\t\t\t\tApril 2016-Dec2016 Senior SQL /BI Developer  Responsibilities: Coordinated with the front-end design team to provide them with the necessary stored procedures and packages and the necessary insight into the data.  Worked on SQL*Loader to load data from flat files obtained from various facilities every day.  Created and modified several UNIX shell Scripts according to the changing needs of the project and client requirements.  Developed Power BI reports and dashboards from multiple data sources using data blending. Optimizing the performance of queries with modifications in T-SQL queries, removed unnecessary columns, and eliminated redundant and inconsistent data.  Responsible for creating Databases, Tables, Cluster/Non-Cluster Index, Unique/Check Constraints Views.  Created PL/SQL stored procedures, functions and packages for moving the data from staging area to data mart.  Responsible for providing SAS programming and analysis support for several studies in close collaboration with Statisticians.  Scheduled jobs for creating snapshot of Power BI Reports and Dashboards and troubleshooting on datasets for Power BI sites. Overview of .NET structure within Colleague Self Service and Colleague Web API. Overview of Data Reader and Transaction Invoker Methods within .NET environment to use Entity Data Contracts and Colleague Transaction Data Contracts.  Created Power BI Visualizations and Dashboards as per the requirements. Developed, identified, designed, built, tested, optimized, and maintained a Data Warehouse and OLAP Cube using the entire Microsoft BI Stack with emphasis on, but not limited to SSIS, SSAS, and SSRS.  Configured and maintained Report Manager and Report Server for SSRS. Created Sub-Reports, Drilldown-Reports, Drill through, Summary Reports, and Parameterized Reports in SSRS. Designed and implemented Parameterized and cascading parameterized reports using SSRS. Used Microsoft Power BI Power Query to extract data from external sources and modify data to by calculated columns as required in Excel, and created SSIS packages to load excel sheets into database. Involved in project status report updates/ creation of issue items for reviews/ updates of technical and transformation files on timely basis. Performed DBA tasks like Backup, Restore of tables and Stored Procedures, and Refreshing Database on weekly basis. Worked on Power View and Power Map to visualize reports. Created SSIS Packages using Fuzzy Lookup, Derived Columns, Pivot Transformation, Condition Split, Term extraction, Aggregate, Execute SQL Task, Data Flow Task, and Execute Package Task to generate underlying data for the reports and to export cleaned data from Excel Spreadsheets, Text file, MS Access and CSV files to data warehouse.  Scheduled the SSIS package services to run at different intervals to fetch the data and for transferring the data into another database.  Extensive customization of Crystal reports and Forms in AP, GL, and Explorer modules  Created processes that verified data integrity and self-correct anomalies  Food.com (www.food.com) - A provider of online ordering solutions to restaurants and retailers  Functional Implementation of GL, AP & AR with extensive forms and reports customization.  Created interfaces to credit card & check verification and extracts to support reconciliation. Set up some tables in the main server as a snapshot publication and push them to the warehouse server (Subscriber) on the nightly basis. This eliminated the old way of emailing spreadsheet on the weekly basis.  Created Package Configuration files to support the SSIS packages in different environments.  Generated Dynamic Reports from Cubes (SSAS) using SSRS 2012.  Created, Maintained & scheduled various reports in Power BI. Designed and implemented Parameterized and cascading parameterized reports using SSRS.  Deploying and scheduling reports using SSRS to generate daily, weekly, monthly and quarterly reports run periodically.  Created SQL Server Reports using SSRS and exported them to Excel format for managers and QA team for easy validation.  Published Power BI reports from Power BI desktop to Power BI service. Experience with SQL Server Reporting Services (SSRS) to author, manage, and deliver both paper-based and interactive Web-based reports.  Created Write back functionality in SSAS to write the data back into the cube to make changes to the data those changes return back in to the cube.  Implemented Performance Tuning and Query Optimization. Worked on identifying and resolving blocking and deadlocks.  Created different visualization in Power BI according to the requirements. Collaborated with fellow team members through Team Foundation Server (TFS) for effective project management, which includes work issues and track on the update of versions.  Extensively used the advanced features of PL/SQL like Records, Tables, Object types and Dynamic SQL.  Handled errors using Exception Handling extensively for the ease of debugging. \nEnvironment: SQL Server 2014/2012/2008R2 Enterprise Edition, .NET Framework, XML, T-SQL, SSIS, SSRS, SSAS, Visual Studio .NET IDE, Windows 2008 Advance Server, ASP, MS Excel, MS Access, Visual Studio 2008, TFS 2010, PL/SQL, Oracle Database11g, Shell Scripts, SQL*Developer, UNIX, Reports Builder 11g, Forms Builder 11g. Urban Science  Detroit, MI\t\t\t\t\t\t\t\t\t Sep2014- Mar2016 MS SQL/BI Developer Responsibilities: Migrated and resolved conversion errors for Performance Point Server reports to Sharepoint 2010 Business Intelligence platform. Optimized the performance of queries with modifications in T-SQL queries, removed unnecessary columns, and eliminated redundant and inconsistent data. Created numerous efficient Stored Procedures to perform data cleansing and loading task when data is loaded into staging area. Developed database objects like Tables, views, stored procedures, indexes etc.  Tuned SQL statements using views and Stored Procedure  Designed Database objects including tables, procedures, views and database triggers on SQLServer Database. Experience inOracle supplied packages, Dynamic SQL, Records and PL/SQL Tables. Migrated DTS packages from SQL Server 2000 to SQL Server 2008 as SSIS Packages. Created efficient, robust SSIS packages for data movement and loading with error checking and well documented code. Created SSIS Packages to integrate data coming from Text files and Excel files. Migrated old data from MS Access into SQL Server 2008 using SSIS Packages in Business Intelligence Development Studio. Created SSIS packages to validate, extract, transform and load data to data warehouse databases. Extensively worked with SSIS tool suite, designed and created mappings using various SSIS transformations like OLEDB Command, Conditional Split, Lookup, Aggregator, Multicast and Derived Column. Wrote stored procedures and User Defined Scalar Functions (UDFs) to be used in the SSIS packages and SQL scripts.  Handled Tableau admin activities granting access, managing extracts and Installations Built connections to/pulling data from AS400, mainframe/db2 and Oracle. Deployed SSIS Package into Production and used Package configuration to export various package properties to make package environment independent. Implemented Event Handlers and Error Handling in SSIS packages and notified process results to various user communities. Data management and data processing solutions using SSIS, this includes Error Handling and Slowly Changing Dimensions. Worked on Database Compression for different databases to save space across different environments. Wrote many stored procedures for cleaning, manipulating and processing data between the databases. Extensively used Joins and Common Table Expressions to simplify complex queries involving multiple tables Developed complex Stored Procedures and views to generate various Drill-through reports, parameterized reports and linked reports using SSRS. Involved in scheduling, creating snapshots and subscriptions for the reports (SSRS 2008R2/2012). Worked on querying data and creating on-demand reports using Report Builder, Report Designer inSSRS and sent the reports via email as scheduled subscriptions. In depth knowledge in SSRS for report generation to create various types of reports and also to develop different SSIS packages. Created Dimensions and cubes with star schema using SQL Server Analysis Services (SSAS).  Created OLAP Dimensions, Measures and Cubes using SSAS.  Created components, tools, techniques, methods and procedures used in an on OLAP \nenvironment for accessing and translating data into understandable and usable business information using SSAS.  Migrated and recreated existing dimensions and cubes using star schema on 2008 server to achieve the efficiency of SSAS. Enhanced the functionality of OLAP Cube by creating KPI, Actions and Perspective from huge dataset using SQL Server 2008 Analysis Services(SSAS). Migrated and resolved conversion errors for Performance Point Server reports to Sharepoint 2010 Business Intelligence platform. Repaired/recreated PPS reports damaged in the conversion process. Worked on Filtered Views, views and Base table integration between different Source systems. Used Visual Studio 2008 as Source Control, to maintain drop location to test, all docs and scripts. With the help of TFS, managed repositories, build processes, testing infrastructure and lab deployment while easily collaborating and reporting status. Scheduled the Packages in SQL Server Agent on daily/weekly/monthly basis. Document new SSIS packages and Train Senior Analyst on basic SSIS concepts. Interacted with vendors, developers and customers to manage the business requirements. Verified business requirements and functional specifications. Environment: MS SQL Server 2014/2012/2008/2008R2, TSQL, PL/SQL 11g, SSRS, SSIS, SSAS, Informatica, TFS, Tableau, Visual Studio 2008, SharePoint 2007/2010, Lotus Notes, Oracle, Erwin. SavemarketSupermarkets Modesto CA \t\t\t\t\t\t\tDec 2012 Aug2014 Responsibilities:  Created new database objects like stored procedures, Functions, Triggers, Indexes and Views using T-SQL in Development and Production environment for SQL Server 2008. Migrated DTS packages from SQL Server 2000 to SQL Server 2008 as SSIS Packages. Optimized the performance of queries with modifications in T-SQL queries, removed unnecessary columns, and eliminated redundant and inconsistent data. Designed and developed custom .NET components and user controls using ASP.NET Created efficient, robust SSIS packages for data movement and loading with error checking and well documented code. Created SSIS packages to validate, extract, transform and load data to data warehouse databases. Built connections to/pulling data from AS400, mainframe/db2 and Oracle. Migrated old data from MS Access into SQL Server 2008 using SSIS Packages in Business Intelligence Development Studio. Deployed SSIS Package into Production and used Package configuration to export various package properties to make package environment independent. Implemented Event Handlers and Error Handling in SSIS packages and notified process results to various user communities. Data management and data processing solutions using SSIS, this includes Error Handling and Slowly Changing Dimensions. Worked on Database Compression for different databases to save space across different environments. Extensively used Joins and Common Table Expressions to simplify complex queries involving multiple tables Developed Sub Reports, Matrix Reports, Tabular Reports, Charts, and Drill down reports, using SQL Server Reporting Services (SSRS). Created Drill-through, Drill-down, Cross Tab Reports and Sub-Reports using SSRS. Created Perspectives, Partitions and Design Aggregations in cubes using SSAS.  Migrated and resolved conversion errors for Performance Point Server reports to Sharepoint 2010 Business Intelligence platform. Scheduled the Packages in SQL Server Agent on daily/weekly/monthly basis. Document new SSIS packages and Train Senior Analyst on basic SSIS concepts. Interacted with vendors, developers and customers to manage the business requirements. Verified business requirements and functional specifications. Environment:  Data Transformation Services (DTS), SQL Server 2012/2008/2008R2 Enterprise Edition, ODBC, OBIEE, BIDS, SSRS, SSIS, SSAS, Business Objects, Crystal Reports 8.0, XML, ASP.Net, Visual Basic 6.0. Health Care Partners, Dallas, TX\t\t\t\t\t\tMarch 2011 to November 2012 SQL BI Developer Responsibilities: Helped conduct meetings with the end users and performed interviews to gather the requirements from them and to convert those requirements into Requirements document for the development and testing teams Analyzed the business requirements to get a thorough understanding of the testing requirements and developed test plans and created test cases in Rational Test Manager for extensive coverage of the requirements during testing Designed Logical/Physical and Conceptual models of database using ERwin and VISIO Did extensive reverse engineering of databases by using ERwin Worked with the developers to understand the ERD (Entity Relationship Diagram) and thus create comprehensive test plans, following the RUP model, for the applications and also gather test data for the data driven test cases Managed the migration of SQL Server 2000 databases to SQL Server 2008 Created Tables, Stored procedures and defined functions. Created SQL scripts for tuning and scheduling Fine-tuning Stored Procedures to improve performance that was achieved by removing unnecessary cursors and used SQL Profiler to improve performance Developed physical data models, data warehouse models and created DDL scripts to create database schema and database objects Developed various operational, drill-through and drill-down reports using SSRS Designed Star schema (identification of facts, measures and dimensions) and Snowflake Used SSIS to create ETL packages to validate, extract, transform and load data to data warehouse databases and data mart databases Generated periodic reports based on the statistical analysis of the data from various time frame and division using SQL Server Reporting Services (SSRS) Expert in Creating and Deploying SSRS Reports on the portal for user accessibility Experienced in writing Parameterized Queries for generating Tabular reports, formatting report layout, Sub reports using Global Variables, Expressions, Functions, Sorting the data, defining data source and subtotals for the reports using SSRS Used DBCC Statements to perform maintenance tasks on the database. Executed DBCC commands like CHECKDB before backing up the databases Performing Replication (snapshot and transactional) Troubleshoot system issues, monitored scheduled jobs and set up maintenance plans for proactively monitoring the performance of SQL Server databases Configured replication servers and transactional replication between production & standby server for disaster recovery Created calculated measures and dimension members Environment: MS SQL Server 2012/2008/2008R2, Oracle, TSQL, ASP.Net, Informatica Power center, Visual Studio 2008, SSRS, SSIS, SSAS, Erwin. T-Mobile Seattle WA\t\t\t\t\t\t\t\tNovember 2010 to February 2011 SQL BI Developer Responsibilities: Created new database objects like stored procedures, Functions, Triggers, Indexes and Views using T-SQL in Development and Production environment for SQL Server 2008 Migrated DTS packages from SQL Server 2000 to SQL Server 2008 as SSIS Packages Optimized the performance of queries with modifications in T-SQL queries, removed unnecessary columns, and eliminated redundant and inconsistent data Experience in creating multiple reports (SSRS) in Drill mode using tables, financial tables, crosses tabs and charts Designed, deployed, and maintained various SSRS Reports in SQL Server Designed and implemented Parameterized and cascading parameterized reports using SSRS Involved in the preparation of detail Unit Cost, Price and Volume Trends, Expense Variances and Profitability Reports using SSRS Used ProClarity for accessing and analyzing cubes and dimensions, and also worked on integration of SharePoint with SSRS Developed user defined financial reports to provide on demand financial data analysis using SSRS Developed numerous reports using SSRS for day to day financial reporting Developed complex Stored Procedures and views to generate various Drill-through reports, parameterized reports and linked reports using SSRS Created SSIS Packages to integrate data coming from Text files and Excel files Created SSIS packages to validate, extract, transform and load data to data warehouse databases Built connections to/pulling data from AS400, mainframe/db2 and Oracle Migrated old data from MS Access into SQL Server 2008 using SSIS Packages in Business Intelligence Development Studio Implemented Event Handlers and Error Handling in SSIS packages and notified process results to various user communities Delivered projects working in Offshore-Onsite model. Directly responsible for deliverables Coordinated with QA Analysts and business partners to support offshore projects Tracked, monitored and documented offshore project status Data management and data processing solutions using SSIS, this includes Error Handling and Slowly Changing Dimensions Worked on Database Compression for different databases to save space across different environments Environment: SQL Server 2008/2008R2, SSIS, SSRS, SharePoint, Data Transformation Services (DTS), Business Objects, XML, ASP.Net, Visual Basic. Feisystem Baltimore MD\t\t\t\t\t\t\t\tFeb 2009-October 2010 SQL/BI/ Developer Created new database objects like stored procedures, Functions, Triggers, Indexes and Views using T-SQL in Development and Production environment for SQL Server 2008 Developed in Win Forms and C# Used .NET Windows Controls and created User Controls Developed XML Web service to access Crystal Report Developed Win API using C#, WCF services Used ADO.NET like Data Adapter, Data Readers, Data Sets and Typed Data Sets Used Microsoft Enterprise Library 3.1 for Exception handling and Logging application block Involved in writing complex SQL queries, stored procedures, triggers, views for data migration in SQL Server 2005 Imported data from excel using SQL Server Integration Services (SSIS) Used Team Foundation Server (TFS) for defect management and source and version control Interacted with vendors, developers and customers to manage the business requirements Verified business requirements and functional specifications Worked on Filtered Views, views and Base table integration between different Source systems Used Visual Studio 2008 as Source Control, to maintain drop location to test, all docs and scripts Developed tables, Views, Stored Procedures and Triggers using SQL Server Management Studio Optimized the performance of queries with modifications in T-SQL queries, removed unnecessary columns, and eliminated redundant and inconsistent data Established Inner Join, Outer Join and created Indexes whenever necessary Modified report content and exported reports in multiple formats based on user input Developed logical and physical data models, design data access strategies and wrote SQL code to access and manipulate data stored in relational databases Scheduled the Packages in SQL Server Agent on daily/weekly/monthly basis Environment: Data Transformation Services (DTS), SQL Server 2008/2005 Enterprise Edition, ODBC, BIDS, Business Objects, Crystal Reports 8.0, XML, ASP.Net, Visual Basic 6.0."}