{"text": "Name: frances frances E-Mail: frances.frances@gmail.com Address: Zhanjiang, China Github: https://github.com/frances LinkedIn: https://linkedin.com/frances Phone No. 774736466429 \tSummary\t Over 6+ years of extensive experience in web-based applications using LAMP, WAMP, PHP, Drupal, e-commerce & SEO technologies.  Excellent knowledge on Apache, Linux, MySQL, Varnish, memcache, nginx, and content distribution networks  Expertise on UI development, UX design, Frontend development, rich user interface design, development, documentation, standards, media (screen, mobile, touch interface).  Migration from Drupal 6 to Drupal 7 and Drupal 7 to Drupal 8.  Extensive experience with Content Management Tools such as Drupal 7 and Drupal8,WordPress Advanced SQL/database programming skills with relational databases: MSSQL, Oracle  Experienced using MVC frameworks such as Zend, codeIgniter, CakePHP.  Excellent working knowledge on LAMP/WAMP environment Solid with design and development in Java (Core Java, Spring, web services using CXF)  Proficient in network protocols like, SOAP, REST, Web Services and CDN (networks).  Excellent understanding of the LAMP-stack based architecture, systems development life cycle management, version control, application maintenance and support techniques, bug/issue tracking.  Experience in developing web-based applications using Python 2.7/2.6, Django 1.4/1.3, PHP, Angular JS, VB, C++, XML, CSS, HTML, DHTML, JavaScript and jQuery.  Applied security guidelines according to OWASP framework Proficient at Search engine optimization using constantly evolving legitimate techniques to improve websites rankings among Search Engines.  Experienced in developing Web services using SOAP and AWS.  Developed web pages with Multilanguage support using Internationalization, Secure PHP etc.  Experienced with ZENDMVC Framework and ZEND_X libraries for developing enterprise applications.  Experienced with multiple version control tools like SVN, CVS, TFS Source Control.  Experienced working with Databases like MYSQL, Oracle, MSSQL  Experienced in identifying and resolving issues under time critical scenarios.  Expert in developing Object-Oriented Web applications using MVC architecture.  Strong Hold on Object Oriented Programming (OOP'S) Concepts in PHP 5.  Expertise in Database Programming and Development using MySQL, Oracle, and SQL Server.  Experienced with MySQL which includes configuration, query optimization, full-text search indexing and de-normalization Expert in handling the administration of MySQL database using PHPMy Admin.  Extensive knowledge in using IBM Web Sphere, Web Logic, Apache Tomcat application servers.  Experience designing and developing mobile and desktop applications using iterative methodology and overall Software Development Lifecycle (SDLC).  Accomplished team player with excellent communicative, interpersonal, intuitive, analytical and leadership skills. Professional Experience Computershare, Highlands Ranch, CO\t\t\t\t\tJan 2017 – present Sr. PHP developer Responsibilities: Developed fully functional, cross browser compatible websites on DRUPAL platform utilizing Agile and Scrum methodologies. Worked as a part of team on a series of Drupal sites, which included custom panels, blocks, content types and views that allow every user to customize the look of their site. Created Drupal modules for Active log sessions and Service Reporting System. Maintained groups of multiple users with Drupal CMS. Fixed some functionality issues on existing Cold Fusion application that was not sending information to database correctly Creating a single sign-on (SSO) webservice using Zend Framework. Integrated the Expression Engine plugins for the development and assigned the file permissions. Build themes and templates in Expression Engine 2.0. Hands on experience InnoDB creating and converting the existing tables into InnoDB. Daily content change migrations as per Business requirement, such as creating Forms, updating the existing Forms to accept improvised validations.  Worked on Acquia Cloud environment. Created RESTful services in a Drupal 8 environment to hold and provide Worked heavily on DRUPAL CMS development and developed various custom modules. Experience working with CSS-Preprocessors like SASSand LESS. Worked with design patterns like singleton pattern and registry pattern in Symphony web application framework as well as Model-View-Control (MVC) pattern in ZEND framework. Worked on front-end to make web pages more dynamic via AJAX and JQUERY. Responsible for developing dynamic rich web applications using Adobe Flex and ColdFusion. Set up and deployed multiple LEMP (Linux Nginx MySQL and PHP) servers for development and testing as well as Apache servers CMD or SSH based remote ubuntu servers running LAMP servers (Linux Apache MySQL PHP) Used Angular.JS MVC architecture to split the UI logic into Views, Models, and Collections. Worked on developing Drupal Commerce site using Magento & JOOMLA. Responsible for Drupal module development, Profiling and optimization, Drupal theming.  Created logical & physical data models, database design and performance Tuning processes to ensure clean data transfers.  Worked in an Agile environment and Installed and configured Drupal 8 on a Linux Server and other Servers.  Configured the PHP Build Systemto access the C++ code. Hands on experience in calling C++ functions from PHP. Responsibilities include database design, Code Profiling, and extensive documentation.  Involved in developing the UI pages using HTML5, CSS3, Angular.JS, JavaScript, jQuery, and Ajax. Used Angular.JS for heavy DOM manipulation. Created DOM for collections of data. Worked with several collections of data using JSON format. Datasets are collected from back end server PHP file using API and these data-collections are then requested back to client-side using HTML, DHTML and CSS. Significant experience in web development tools like APTANA STUDIO, Adobe Dreamweaver CS3, Spring Tool Suite, Eclipse, and Firebug. Work on implementing Single Sign on Service (SSO) by implementing Joomla Web Services. Developed custom themes for Magento.  Extensive experience in MVC frameworks like Magento. Implemented the application using Magento 2.0 Enterprise Framework on LINUX Environment web server. Created Client-Side UI with object- oriented JavaScript and AJAX with API. The JSON data collections are returned and then rendered in appropriate format such as pdf, XLS, csv and charts. Worked on Drupal themes, modules and familiarity with the Drupal API and hook system. Develop, test, and implement cross-browser compatible Drupal themes using valid XHTML/CSS. Worked with LAMP stack, NOC and IT operations. Converted all user facing applications from Cold Fusion to PHP Created Web back-end user interfaces to new and existing databases utilizing PHP and MySQL/Oracle databases. Designed and developed websites from wireframes with perfect pixels. Worked on cross-browser compatibility issues according to the standards of 508 Compliance. Develop Custom Drupal 8 Modules for implementing OAuth and RESTAPI Used many different core modules in Drupal 8 like CKEditor, Block, Field SQL Storage, Dynamic page cache modules, SSO. Environment:PHP5, Drupal 8, Drush, C++, Lamp Stack, DKAN, CKAN, Magento 2.0, MYSQL, REST API, XML/XSLT, jQuery, Ajax, Shell Script, Apache, Linux, ANGULAR JS. Merck & Co Inc Washington DC\t\t\t\t\t\tMay 2015– Dec 2016 Sr. PHP DEVELOPER Responsibilities: Worked on Web Form security for Forms authentication of user's registration. Designed forms and user interfaces for administrator, supervisor and employee using Drupal and CSS. Created Drupal modules for automated approvals, billing and pay rates, custom reporting, and payroll integration. Modified C\\C++ code on 32 Bit/64bits environments to support enhancements, fixed bugs in the existing software in multithreaded, highly scalable, high throughput applications. Involved in implementing MVC architecture to separate business logic from the view using OOP in PHP5. Worked with the Zend framework's filtering, decoding, encoding security features in developing secure banking modules. Developed PHP based server-side API using Zend framework and implemented MVC architecture. Worked on LESS and used NodeJS as a platform to run. Development of e-commerce website using ColdFusion components with a MySQL database. Developed PHP pages enforcing the Zend Model View Controller design pattern (MVC). Modified the search engine so that the user can find the relevant data as per the requirement. Designed Database Schema, Database creation using RDBMS in MYSQL. Implemented AJAX to enhance the capability of the website. Designed database tables like administrator, supervisor, and employee in MYSQL. Created Views in MYSQL for sharing tables with various databases. Worked on media consulting with Adobe Photoshop. Worked on an open-source CMS Drupal to build website using Drupal 8. Administration panel and user interface website for content management using Flex with ColdFusion components with a MySQL database. Developed with PHP7, Magento 2.0.7.  Worked on HUB module for implementing Single Sign on Service (SSO) by implementing Drupal Web Services. Magento development, theme customization, responsive theme, extensions installation & Custom extension. Worked with JSP to create dynamic content from server to update website dynamically. Used jQuery to make the HTML5, DHTML and CSS3 to interact with the JavaScript functions. Consumed RESTful APIs such as Approval Request, Address Verification Service, Email Lookup, Initial Solution, Morgage Lookup information for application development. Proficiency in web designing using HTML, DHTML, CGI-PERL, Java Script, Cascading Style Sheets (CSS), Macromedia Dreamweaver, MS FrontPage, Home site, Adobe Photoshop, and CorelDraw. Consumed RESTful APIs such as Approval Request, Address Verification Service, Email Lookup, Initial Solution, Morgage Lookup information for application development. Drupal 8 module development and customization  Created charts using JFreeCharts showing pay-roll system of employees. Environment: Linux, PHP, HTML5, Drupal 8, Magento 2.0, MySQL, CSS3, C++. DKAN, CKAN, JavaScript, GIT, JSON, AJAX, jQuery, Html, Lamp Stack, PHPUnit, CSS3, code ignitor, XML, XSD, SAAS, PL/SQL, SSO. Cenduit Bangalore India\t\t\t\t\t\tJan 2013 – Dec 2015 PHP/DRUPAL DEVELOPER Responsibilities: Worked onPHP5 and MYSQL, HTML5, Ajax, JavaScript, CSS3 and Drupal on Windows and Linux operating systems.  Extensively worked on Drupal and other CMS theming  Develop extensions and customizations for Magento 1.x Developing compatible User Interface Functionality using jQuery and other libraries.  Developed Custom Module for maintaining the inventory of applications obtained from different Web Services in JSON protocol.  Developed and maintained ANT scripts, pearl scripts and shell scripts that facilitate the Administration of BEA WebLogic 8.x. and IBM Web Sphere 5.x  Worked on applications and developed them with XML, JSON, XSL (PHP, Django, Python, Rails)  Conceived and designed database tables in MYSQL 5  Worked on Linux and UNIX platforms. Also worked with XML, XSD, and RESTful APIs  Worked on an open-source CMS Drupal to build website using Drupal 7  Designed and developed the dynamic and user-friendly front-end website using jQuery UI.  Experienced in Gathering and defining user requirements, created software architecture and data models, defined criteria for system testing and defined SDLC.  Experienced in Coding using solid object-oriented principles, SOA, ORMs, design patterns and the latest advancements supported by the platform.  Maintain high volume availability demands using open source tools such as Linux, Apache, PHP, and MySQL.  Maintain User groups with Drupal CMS.  Designed applications in AJAX with rich user interfaces.  Install MySQL workbench Client to access MySQL Server.  Worked on customizing modules, themes using API's and core Drupal modules.  Worked with teams in designing and developing server optimization techniques like caching, output stream compression, memcache, Drupal module updates and releases etc. Database Design and Query Optimization (Worked in backend with MySQL).  Maintain SQL server database and reporting tools updating PHP script.  Create Runtime PHPfiles using Zend framework. Environment:PHP 5, XML, HTML, LAMP, WCAG, JavaScript, AJAX, Magento 2.0.7, CSS, Bugzilla, MySQL, VPN, Cake PHP, Drupal Hexagon Hyderabad India\t\t\tMay2012 – Dec 2012 PHP DEVELOPER Responsibilities: Configured and maintained various software extensions for the LAMP architecture.  Clear understanding of the entire project life cycle including Analysis, Design, and Development.  Developed Object Oriented PHP application and Drupal.  Designed different front-end forms using DRUPAL and CSS.  Created Survey Systems module for collecting the decision critical feedback on various issues.  Maintaining User groups with Drupal CMS.  Designed applications in AJAX with rich user interfaces.  Wrote programs using PHP for easy manages of MYSQL database operation.  Created the helpdesk for user's queries to meet the bulk queries submitted by the user.  Upload the code and do necessary changes and test the application in server, if needed then fix the bugs and test again.  Extensively used jQuery Table sorter plug-in as a data grid for sorting and freezing headers and footers for many tables which holds huge data related to vendors under the specific Contract vehicle  Implemented module for sending E-mail Newsletter. Did integration with Facebook, Digit, Myspace bookmarks in the application.  Built Web Services using SOAP and XML using PHP and implemented Tree Based Parsing.  Building Customize modules in Drupal depends on client requirement.  Involved in developing various CMA controlled features for existing system.  Involved in Fine Tuning of application in Drupal.  Involved in Security Fixes in the application level (by updating core and contributed modules).  Clear understanding of the entire project life cycle including Analysis, Design, and Development.  Developed Object Oriented PHP application.  Integrated the application with Face Book API.  Environment:PHP, Linux, SVN/Git,MySQL, JavaScript Drupal5, Drupal 6, HTML4/5, CSS 2/3. Virtusa Hyderabad, India(Intern) \tOct2011 – Feb 2012 PHP DEVELOPER Responsibilities: Worked in Gathering and defining user requirements, created software architecture and data models, defined criteria for system testing and defined SDLC.  Maintain high volume availability demands using open source tools such as Linux, Apache, PHP, and MySQL.  Maintain User groups with Drupal CMS.  Worked with the Model-View-Controller (MVC) architectural pattern, and developed web applications using this pattern or on existing MVC frameworks  Interacted with MySQL database systems through abstraction layer.  Used PHP to create and consume web services (SOAP, XML-RPC) and implemented data integrations within the platform.  Customized the website with other contributed modules including tokens, PHP code, CTools, Views, and Panels etc.  Used Drush for Drupal website updates.  Wrote code for multiple chained selects using jQuery select and JavaScript.  Used Linux to maintain and configure Apache/MySQL web servers.  Implemented customized web view component to load an SWF file and HTML data.  Extensively used XML documents with XSLT and CSS3 to translate the content into HTML to present to GUI.  Creating UI prototype with website structure, layouts, modules using CSS3, HTML for client acceptance.  Modifying PHP, HTML, CSS3, JavaScript, jQuery according to project requirements.  Identifying and solving issues caused by plugins or feeds under PHP, MYSQL, HTML, CSS3, JavaScript and jQuery Technology.  Used the Model View controller (MVC) framework to build modular and maintainable applications Environment: HTML, C++, JavaScript, XML, XHTML, DOM, DHTML, PHP Oracle database, SQL Education Master’s in Computer Science."}