{"text": "Name: evelyn evelyn E-Mail: evelyn.evelyn@gmail.com Address: Riyadh, Saudi Arabia Github: https://github.com/evelyn LinkedIn: https://linkedin.com/evelyn Phone No. 378224010614 SUMMARY UI Developer with 8+ years focused on creating interactive software products with valuable & intuitive user experiences. Experience in all phases of SDLC like Requirement Analysis, Implementation and Maintenance, and extensive experience with Agile and SCRUM. Expertise in working on Front End/User Interface (UI),(UX) and (KonyUI) Technologies like using HTML4/5, CSS2/3, DHTML, JavaScript, jQuery, AngularJS 4, React JS, Bootstrap Framework, AJAX, JSON, and XML.  In-depth knowledge of front-end Single Page Application (SPA) development using open source framework AngularJS and Vue.js. Strong knowledge in using Object Oriented Programming concepts in JavaScript and DOM. Good Expertise in analyzing the Document Object Model (DOM) Layout, DOM Functions, and JavaScript functions, Cascading Styles across cross-browser using Fire Bug, Developer Tool Bar. Extensive experience in developing web page quickly and effectively using jQuery and also in making web pages with cross browser compatible. Involved in Enhancement of existing application utilizing Angular JS, developed routing through web pages and achieved Single page application. Developed a core component of Analytics with Angular JS used Node js for writing the code in the server side.  Experience in SOA implementation using SOAP and XML processing APIs, REST Web Services.  Developed Responsive Web Design (RWD) using Media Queries and Bootstrap. Created JavaScript modules to be used with Bootstrap to speed up development.  Excellent experience in developing web pages complying with Web Content Accessibility Guidelines (WCAG) and ability to apply W3C web standards. Insight knowledge of building website, mobile apps and forms using Adobe Experience Manager. Thorough understanding of CSS principles with a clear ideology for managing maintainable, scalable and cross-browser code.  Experience in developing web applications using Microsoft Visual Studio 2013 using ASP.Net, C#, SQL Server.  Performed Test Driven Development (TDD): N-Unit Testing and have experience in using bug tracking tools like JIRA, Redmine. Expertise in using Version Control Systems such as GIT and SVN. Experience for the sake of long-term user retention and engagement on different browser like Safari, Firefox, Google Chrome, Opera and Internet Explorer (IE). Ability to write well-documented, well-commented, clear and maintainable efficient code for web development. Deep understanding in implementing the business rules in different layers like UI, services and backend database. Experience with Firebug for Mozilla, Developer Toolbar for Chrome and IE Developer Toolbar for Internet Explorer for testing applications. A very good understanding of Network Management Systems &amp; Network Visibility Systems. Experience in all stages of testing namely Functional testing, Performance testing, Integration testing, Regression testing and User Acceptance testing. Self-motivated, able to work independently and in teams; can handle multiple projects while paying attention to details; accomplished problem solving and analytical skills. TECHNICAL KNOWLEDGE EDUCATION Bachelors from India (computer science and engineering-2009 / Jntu Hyderabad) PROFESSIONAL EXPERIENCE Blue Cross Blue Shield Association – Chicago, IL. \t\t\tJun 2016-Till Date UI Developer Description: Develop and modify web based applications for Maritz travel clients such as Dell, Google, UBS, WWT and more to meet client's business objectives according to Quality Management system standards.  Responsibilities: Analyzed business requirements, participated in technical design, development and testing of various modules assigned. Gathered the requirements from both technical and non-technical audience by working with them. Involved in web designing using HTML5, XHTML, CSS3, JavaScript, jQuery and extensively used Table-less Design in CSS for positioning. Created popup forms using Bootstrap version 3.0.0 Models, AngularJS4 Models and AngularJS Controllers. Implemented code according to coding standards and implemented AngularJS Controller Which maintains each view data.  Developed the front-end framework, monitoring dashboards and real-time monitoring user interfaces using Angular Widgets using Custom directives. Client-Side code were written in Typescript and Server-Side Code were developed using MVC.  Develop various screens for the front end using Angular JS4 and used various predefined components from NPM (Node Package Manager). Very good implementation experience of Object Oriented concepts, Multithreading \nand Java/Scala.  Worked on ECMA Script 5 (ES5) and ECMA Script 6 (ES6) for building Angular 4 Components. Enhancement of existing application utilizing JSP, Created HTML5 navigation menu that is role based menu items changes dynamically, derived from the database in the form of XML. Designed and documented REST/HTTP APIs, including JSON data formats and API versioning strategy. Implemented the application using Spring MVC Framework, Spring Batch,Spring Boot and handled the security using Spring Security.  Involved in maping data from SQL server to Controller using Hibernate framework. Worked with making calls to APIs to fetch the data from the backend as JSON response and parse it on the UI for DOM/CSS Manipulation.  Implemented Server and Client side validations using JavaScript. Extensively used JUnit for unit testing, integration testing and production testing. Web application development for backend using Angular JS with cutting edge HTML5 and CSS3 techniques.  Environment: Java, HTML5, CSS2/3, JavaScript, jQuery, DHTML, MVC, DOM, JSON, Angular.js, Node.js, JSP, JAVA, Spring IOC, JBOSS (with tomcat) Application server, Spring Batch, Spring Boot, AJAX, SOAP, XML, XPATH, Adobe Flash, GWT, Karma, Mocha, TFS, MySQL, Windows. Apps Associates Pvt. Ltd – New York City, NY.\t\t\t\tJuly 2015-May 2016 UI Developer Description: This Project mainly deals with Health Information System, which deals with the Admissions, Registration, OPBilling, Administration, Ward modules. OPBilling is the application to provide details about the patients, test(s) taken by patient and their corresponding amount, company details of the patient, which are part of billing process in hospital. Using this application, related information can be added, updated and viewed conveniently.  Responsibilities: Web application designing and development using HTML, CSS and ReactJS, handle services in ASP.NET and database in SQL server.  Implement different modules in ReactJS.  Extensively involved in redesigning the entire site with CSS styles for consistent look and feel across all browsers and all pages. Expert knowledge in designing SPA using AngularJS, Angular 2, Angular4. Developed the UI component architecture for Developer framework using ReactJS.  Developed all the UI pages using HTML5, DHTML, XHTML, DOM, CSS3, JavaScript, jQuery, Ajax.  Worked on React Router for developing single page applications. Used Axios with react for making AJAX Calls.  Worked on Webpack for build and web pack-dev-server a server. Developed user interface using Ajax and DHTML libraries to simplify the complexities of the application. Developed additional UI Components using JSF and implemented an asynchronous, AJAX(JQuery) based rich client to improve customer experience. Designed the User interface using JavaScript Libraries framework like ReactJS Framework. Working with React Router for developing Single Page Applications SPAs.  Experienced in developing React components.  Partially deployed TWED web app on iOS platform with Angular 4 and Ionic 2. Responsible for designing Front-side of the website like embedded graphics, and interactive documents using REDUX application architecture. Used Redux architecture to simplify (isolate) the usable code.  Used jQuery to traverse through a DOM tree and manipulated the nodes in the tree. Implemented the Drag and Drop functionality using jQuery framework.  Used jQuery core library functions for the logical implementation part at client side for all the application. Participated in design brainstorming sessions, technical design reviews, formal code reviews, bug triage, and functional walkthroughs. Wrote test plans and performed unit testing and performance testing.  Worked with the systems team and Quality assurance team in the process. Environment: JavaScript, HTML5, CSS3, Node.js, ReactJS, Responsive Web Design, Angular, JQuery, XHTML, XML, JMS, REST, JSON, Ajax, JSP, DOM, MVC, Junit, SQL, PL/SQL, Oracle, Bootstrap, Redux architecture, Windows Web Services (REST) NETENT – Hoboken, NJ.\t\t\t\t\t\t\tNov 2012-Jun 2015 UI Developer Description: Project involved the development of a gaming application which is a web based casino game, a real slots gaming environment. Players gamble casino chips on various possible random outcomes or combinations of outcomes. Responsibilities: Handled design and development of game view and animations mainly using HTML5 sprite-sheet &amp; canvas. Delivered UI pixel perfect by matching up with given design mock ups. Responsive Web Design (RWD) methodology for various form factors using media queries and defining with percentages of width. Providing a responsive, AJAX-driven design using JavaScript libraries such as JQuery, Angular JS and Bootstrap using Subversion for version control Developed Asynchronous means of retrieval of data from the Server and Database using AJAX features as well JavaScript and using Node.js applications to written in JavaScript. Used Dreamweaver and Photoshop tools for web application development.  Implemented a common styling with the help of CSS across entire application that controls color, layout, width, height, font size, images size and accomplished other graphic related   features. Optimized memory usage and increase performance of the game for various handheld devices with memory restrictions. Taken care of various user agents while developing game. Example: By specifying -MS, -WEBKIT &amp; -MOZ specific CSS Environment: HTML5, CSS3, JavaScript, Bootstrap.js, Angular.js, Node.js, GIT, Jira, JETBRAINS WEBSTORM 9.0.1. PGI – Irvine, CA.\t\t\t\t\t\t\t\tFeb 2010-Oct 2012 UI Developer Description: Project involved the development of an app for global conference calling, web-enabled meetings, hosted events, virtual events, and video conferencing. Responsibilities:  Responsible for design and development of applications various functionalities such as file upload, whiteboard, conference video streaming in flex ACTIONSCRIPT. Managed memory and performance optimizations using Adobe Scout profiling tool. Responsible for creating architecture implementation of Premiere Library which was the internal library for web services (both SOAP &amp; REST). iOS development using XCODE for adding functionality to the app which needed device hardware support. Testing the website on multiple browsers with their old as well as latest release.  Used JSON for storing and exchanging information between browsers and servers.  Integrated different social networking site like Facebook, twitter.  Created forms to collect and validate data from the user in HTML and JavaScript.  Active participation throughout the entire software development lifecycle from project inception on to code development and elaborate testing of the various modules.  Used agile methodology for the software development. Environment: HTML5, CSS, JavaScript, Adobe flex, XCODE iOS development, GIT, Jira, Adobe Flash Builder 4.6 and 4.7, Eclipse IDE. Pramati Technologies – Hyderabad,India.\t\t\t\t\tJune 2009-Jan 2010 Junior UI Developer Description: Pramati technologies works with primary client to develop IT solutions to business problems,designs, delivers, deploys and supports state of the art technologies, allowing organizations to the highest leverage Information Technology to achieve levels of effectiveness, efficiency, and collaboration. Responsibilities: Responsible for creating efficient design and developing User Interaction screens Using HTML5, CSS3, JavaScript, jQuery AJAX and JSON. Used JavaScript, jQuery for user interactions in pages. Worked on responsiveness of the application and explored the fixed width and fluid layouts using Bootstrap. Involved to create the User Interactive web pages in a professional manner using web technologies like HTML5, XHTML, and CSS3 based on the W3C and ADA standards.  Used CSS LESS/SASS preprocessors. and Responsible for creating detailed wire frames and process flows Experience in LESS/SASS CSS PreProcessors and Utilized the latest front end technologies such as HTML5 and CSS3 for layouts Used JQuery Ajax for service calls on pages to interact with the server for information. Rapid prototyping of design concepts. Utilized various JavaScript and jQuery libraries, AJAX for form validation and other interactive features.  Involved in designing and developing the JSON, XML Objects with MySQL.  Coded Angular JS controllers and directives for application functionality. Used Ajax, JSON to send request to the server to check the functionality of the websites. Used JQuery to make REST API calls and Designed/documented of REST APIs for collection and retrieval of high data Developed SQL queries to perform insert, update or delete operation on MySQL database.  Responsible for authoring of website functionality with JavaScript, HTML, CSS. Hands on Experience in using Adobe Creative Suite, Photoshop, Illustrator and In Design. Environment:  HTML5, CSS3, JavaScript, AJAX, JSON, JQuery, AngularJs, XML, LESS, SASS, Bootstrap, PHP, SVN, MySQL."}