{"text": "Name: esther esther E-Mail: esther.esther@gmail.com Address: Yantai, China Github: https://github.com/esther LinkedIn: https://linkedin.com/esther Phone No. 829403021015 Summary Over 7+ years of experience in implementing, designing, and developing SAP ABAP applications. Full working knowledge in various phases of implementation right from business blueprint, realization, go-live andproduction support including configuration, customization, master data setup, data conversion, interface/integration Testing. Solid experiencein end-to-end implementation,full life cycle implementationand Support Environment. Worked on 4 end-to-end implementation projects and 2 support projects. Strong exposure to modules like Sales and Distribution (SD), Material Management (MM), Production Planning (PP) and Financial/Controlling (FI/CO). Extensive experience in developing custom ABAP programs, reporting, data migration and ABAP performance tuning. Experience in Conversion, Mapping & Migration of Legacy data using Legacy System Migration Workbench (LSMW Tool).  Working knowledge on Inbound and Outbound IDOCS enhancements and configuring them. Good understanding of designing EDI and ALE interfaces, custom IDOC creations, EDI processes, error handling and reprocessing of IDOCs through Workflows. Extensive experience in managing Data Dictionary Objects like - Tables, data element, domain, includes and append structures, views, search help etc. Strong knowledge in using various modularizationtechniques like subroutines, function modules, RFC’s and class modules. Developed efficient and high quality reports which include Classical reports, Interactive reports, ALV, BDC, BAPI, BADI, and RFC. Worked on Dialog Programming using screen painter and menu painter. Expert in designing smartforms used for print programs. Experienced in working with NetWeaver(7.0) components (NWDI). Good knowledge in OO ABAP (Object Oriented Concepts). Worked on Performance tuning tools like Run time analysis (SE30), SQL trace (ST05) and RFC trace and optimization. Expertise on writing Test Scripts and Test Cases during unit testing and integration testing. Excellent debugging skills. Very good team player with hardworking and smartworking nature. Exceptional communication and interpersonal skills. Outstanding organizational skills. Organized and participated in many events. Educational Background Masters in Computer Science\t\t\t-\tUniversity of New Orleans, LA, USA Bachelors in Information Technology\t-\tJNT University, India Technical Summary ABAP Expertise Reports: Developed and modified various types of reports such asClassical, Interactive ALV reports, OOPS and OOPS ALV. Data Dictionary:  Design and development of the various Datadictionary objects. Enhancements: Developed enhancements using User Exits, BADIs andPricing Routines as to meet the customer requirements. Dialog Programming: Working knowledge in Dialog Programming with thescreen painter, menu painter and flow logic. Data Migration: Worked on data migration using LSMW, BAPI, BDC andIDOC's. Forms: Worked in Smart forms, Scripts, and  Adobe  Forms  and  modifiedLayout Sets as per client requirements Interfaces: Worked on interfaces using IDOCs, BAPIs and PI mappingdesign and configuration. Debugging: Strong problem solving and debugging experience, quick tofind resolutions. Code Optimization: Developing efficient coding with performance Tuning. Professional Experience Client: NPL Construction Company, Phoenix, AZ\t\t\tNov’13 – Present Role: SAP ABAP Consultant Description: As a part of the construction process, NPL utilizes different expensive equipment and hence involves streamlined budgeting and procurement processes to ensure better planning and utilization of capital. Responsibilities: Experience in end-to-end implementation which includes Project preparation and Business blueprint, realization, go-live andproduction support. Coordinate tasks from design phase up to unit acceptance test with process team, development team and Legacy team and as one of the approver for the deliverables of a development object. Intensively involved in discussion with the Business team for collecting required information and data for functional design document for the RICEF (Interfaces, Enhancement and Conversion) objects. Data Dictionary: Creation and Maintenance of Tables, Structures and Views, table maintenance generator, forms, lock   objects, search help exits. Dialog Programming: Developed a Dialog program for Material Details, Vendor Details, and Customer Details using tab-strips this front end was created to Add, Modify, and View the respective details from Tables, SAP Tables. Modifications done for existing menu painter, screen painter to develop user-defined screens. Involved in modifications of various aspects of dialog Programming. Develop user-exits, screens, menus and create mapping documents.  List Processing and Reports: Classical and Interactive lists using standard Logical Databases (LDB) and ALV Reports using ALV Grid technology. Developed an Interactive report using ALV tree which displays all the sales orders for one particular customer, the items order for that particular order, quantity ordered, goods issue date. Modifications in various module pool programs as well as ALV reports and smart forms. Used Object Oriented Programming to create an editable ALV to update claim information. Worked on designing of forms using SAPSCRIPTS andSMARTFORMS Developed and Designed forms using SMARTFORMS for MM module like Purchase Order, MIGO, MIRO etc. Solved SMARTFORMS printing issues like printing both Arabic and English in forms like Sales Invoice, Purchase Order and MIGO etc. Modified sapscript layout set of payment voucher. Payment voucher is a Sapscript layout which will be attached to standard screen. Modified layout set using SMARTFORMS for SD module documents such as Invoice, Delivery, Sales Order etc. Create project definition and add WBS element to the project definition using BAPI. Developed a conversion to create production orders in ECC using recording method and BAPI Developed an interface to create customer quotations using BAPI Designed and implemented custom ABAP program to re-distribute IDOCs received in staging golden client to all downstream clients. Provided support and troubleshooting problem Developed a Dialog program for Material Details, Vendor Details, and Customer Details using tab-strips this front end was created to Add, Modify, and View the respective details from Tables. Modifications done for existing menu painter, screen painter to develop user-defined screens. Involved in modifications of various aspects of dialog Programming. Involved in technical design of all the objects that are involved with LSMW. Extensively used LSMW in order to obtain the data from various non-legacy systems. Code and test changes to SAP functional modules and LSMW. Provided an interface to upload vendor master from legacy system to SAP ECC by using LSMW. Created a project for LSMW to Load Material master data from File. Responsible for all data conversion, interfaces and customizations to support deployment of SAP. Processed the EDI 850 sales orders through SAP IDOC interface. Processed the EDI 810 Invoice through SAP IDOC interface. Adding the Custom fields to EDI 856 ASN. Responsible for issues analysis in production, maintaining configuration, code testing, functional testing, functional Specifications, IDOCsmonitoring   and analysis for other issues. Involved in Debugging of the programs during the error handling while testing of the RICEF object. Client: Avnet Inc., Richardson, TX\t\t\t\t\t\tJan’13 – Nov’13 Role: SAP ABAP Consultant Description: Avnet, Inc. is one of the largest distributors of electronic components, computer products and embedded technology serving customers globally.Project involves supporting and maintaining time recording system that supports 7000 plus employees, both exempt and non-exempt. This system also supports several diverse labor unions as well as several State and National rules including US and EU. Experience with development workbench, report writing, ALV and user exits. Work and development in the SD and MM module Responsibilities: Requirement gathering to prepare the Technical Specification documents. Developing the source code for the required screen designs and process flow Developing the Reports, Interfaces, Conversions, Enhancements and Workflows (RICEF). Developed a report (Ultimate project report details) based on ALV which will be useful to display cost and revenue details per project. Developed project forecast report details using ALV based per WBS element wise. Developed purchase order (Message type ORDERS) interface (EDI/IDOC based) which send procurement data to the third party vendor. Enhancements on purchase order and contract work flow with respect to the customer requirement in the PO Contract approval process. Developed account receivable report which will display business profit unit per each financial document. Developed account payable report which will display business profit unit per each financial document. Fine tune custom programs for better program performance processing. Developed Sap Scripts and print programs for Quotation and Sales Order Confirmation. Involved in configuring Sap Scripts for mailing and for this developed communication strategy. Developed new Smart Forms and print programs for Packing Labels, Shipping Labels and Drop Ship Labels. Developed Smart forms for packing labels which include Barcodes and written print program. Developed new Smart Forms and print programs for Quality Notifications. Upload material master data (MM01) data using batch job method in LSMW as a plant based. Upload Vendor master data (MK01), Customer (XD01) using screen recording in LSMW. Upload Bill of Materials (CS01), Routings (CA01), Purchase info records (ME11) through direct input method in LSMW. Implemented BADI enhancement (Enhancement: ME_PROCESS_REQ_CUST) to populate WBS element details while PR creation. Implemented BADI enhancement (Definition: ME_PROCESS_PO_CUST) to populate shipping point details while PO creation. Client: Lexmark International Inc.\t,Lexington, KY\t\t\tAug’12 - Dec’12 Role: SAP ABAP Consultant Description:\t Lexmark International, Inc. provides businesses of all sizes with a broad range of printing and imaging products, solutions and services that help them to be more productive. Responsibilities: Involved in Designing, testing and support activity for development of functional specs for RICEF objects. Developed technical specs for multiple RICEF objects-Reports, enhancements to transactions, and user exits. Developed purchase order (Message type ORDERS) interface (EDI/IDOCsbased) which send procurement data to the third party vendor. SAP Net Weaver process integration, Create Service definition and Generate WSDL file to which will make a link between portal and SAP. Developed a RFC enabled function module that will provide sales order details to the web portal. Enhancements on purchase order and contract work flow with respect to the customer requirement in the PO/Contract approval process. Web Pricing–Real time call to SAP to send Customer specific prices to Web portals.  Country specific changes in the ‘Address’ and ‘Bank’ Info types using SAP HR Mini Master Interface. Developed purchase order print form using smart forms. Developed a smartform for automatic order confirmation. Developed Invoice forms using SMARTFORMS to create the paper or electronic invoice that is sent to the customer for billing services. Modified standard Smartform LB_BIL_INVOICE for FB70 as per client requirements. Update functional area in the SRM purchase order using BBP_DOC_CHANGE_BADI (BADI SRM development). Update Goods receipt and Invoice receipt indicator for shopping cart using BBP_DOC_CHANGE_BADI. Triggering purchase order/shopping cart workflow when clip level amount has been maintained in the custom table. Developed ALV report display Mass approval claims list in Vistex environment. Developed pricing routine which will update pricing amount in the SAP Vistex claims. Using Workflow passing hyper link (URL) to the work item which will display Vistex Claim. Automatic Event Triggering in the Wed Dynpro application. Convert forecasted pages volume back into BPN Units using macro in the BADI /SAPAPO/ADVX.  Convert basic part number volume into Pages using macro in the BADI /SAPAPO/ADVX. Calculate printer retirement which will be used in Supply forecasting. Interface for manual load of On Hand Inventory for non-Lexmark location planned in APO module. Extract BoM/Material Information and display as ALV report. Experience on support pack EPH5 application process upgrade on ECC 6.0. Client: GE Lighting, Dayton, OH\t\t\t\t\t\tFeb’11 - Jul’12 Role: SAP ABAP Consultant GE Lighting is the division of General Electric specializing in lighting solutions all around the globe. They additionally help in progressing new advances, for example, fluorescents and light - emanating diodes (LEDs). Responsibilities: Development of new objects based on functional specifications. Created a Price List Generation Tool. This also involved sending a formatted Excel Email attachment using class CL_IXML. Created various pricing routines in VOFM. Worked extensively on Smart forms like Sales Order Preview, Sales Order Confirmation. Developed new Smart Forms and print programs for Packing Labels, Shipping Labels and Drop Ship Labels. Developed new Smart Forms and print programs for Quality Notifications. Used Exit in MV45AFZZ to populate sales agreement on the Sales Order Line Item. Used Exit EXIT_RMCAF000_001 in Enhancement RMCAF000 to update various LIS tables. Created Process Code for Inbound IDOCs(Claims). Created Smart form for Credit Memo. Enhancements of BW Extractors with custom fields. Maintained and regularly updated the defect and change log. Testing of individual objects, complete integration testing & bug fixing. Involved in Code review process. Client:\tNewmont Mining Corporation, Elko, NV\t\t\t\tFeb‘10 - Jan’11 Role: SAP ABAP Consultant Description: The customer is primarily a gold producer, with significant assets or operations all over the world. SAP modules related to Finance, Human Resource and Logistics were implemented to serve customer business. Experience in developing HCM Processes and Forms objects, Enhancements, Adobe forms and portal related configuration. These developments were done to automate the HR processes like transfer, terminate or hire employee. Responsibilities: Translate customer requirements into formal requirements and establish specific solutions. Coordinating with the functional consultants, to develop the reports based on the requirements. Deliver new and complex high quality solutions to clients in response to varying business requirements. Developed Specification for multiple RICEFW objects-Reports, enhancements to transactions, user exits, and enhanced standard SAP Reports. Customizing the module according to client business flow. Modifications of existing Reports, Scripts andSmartforms. Also creating various layouts using Adobe forms. Developed an Interactive report using ALV tree which displays all the sales orders for one particular customer, the items order for that particular order, quantity ordered, goods issue date Technical development of HRFORMS for Pay slips and Checks for US, Canada, Ghana and Peru. Pay Checks and Pay slips were configured and automated region wise for all employees. Extensively involved in Implementing User Exits related to Billing (RV60AFZD) and Pricing (Move additional fields into the Communication table used for Pricing USEREXIT_PRICING_PREPARE_TKOMK and USEREXIT_PRICING_PREPARE_TKOMP).  Client:\t First Solar, Perrysburg, OH \t\t\t\t\tJul’09 – Feb’10 Role: SAP ABAP Consultant Description: Manufacturer of photovoltaic modules designed for large scale, grid connected and off grid solar power plants. Worked on Reports, BDC’s and Scripts. As a Technical Consultant, involved in the implementation of SAP R/3 for Design and development of various objects pertaining to SD and MM Modules. Responsibilities: Developed forecast report in raw materials. This report gives the point of interest materials and opening and closing stock and utilization on a month to month basis. Developed a Report to show all materials that go out-of-stock OnlyFinishedGoods. Developed a drill down report of materials details for totals and subtotals for material stock values by material group and material type. Developed a Report, which will calculate date wise projected inventory based on production quantity and inbound, outbound quantities for a given material. A report to get details of all the materials received in a financial year (MM).  This will give Material Document Number and Date, P.O no, Vendor Name, No. of quantity received. Purchase Order Layout Set (SAP Script) Modified the existing Layout Set (MEDRUCK) to get the Company Header and Logo, Supplier andDelivery address, Total Purchase Order Value and General Terms and Conditions. Also, included the barcodes etc., Develop Article Master’s interface user-exits using ARTMAS IDOC\t"}