{"text": "Name: elizabeth elizabeth E-Mail: elizabeth.elizabeth@gmail.com Address: Zhengzhou, China Github: https://github.com/elizabeth LinkedIn: https://linkedin.com/elizabeth Phone No. 56950567872 PROFESSIONAL SUMMARY: Over 8 Years of experience as a Software Developer specialized in Content Management systems and in areas that include client/server applications which have helped gain a thorough expertise in CQ5 and Java based applications. Responsibilities include overall technical leadership, oversight of design, coding, Trouble shooting, testing, implementation and maintenance.   Excellent work experience in AEM/CQ5 (5.4, 5.6, 6.1, 6.2,6.3) application design, development and administration and integration.  Designed and Developed Application Leveraging advanced techniques in CQ5 DAM (Digital Asset Management), CQ5 Search and Tagging framework, SOLR Search, Adobe Scene7, CQ5 workflows, CQ5 Campaigns, CQ5 components and templates, CQ5 User and group management.  Strong experience with setting up AEM/ CQ5 using Maven and standard Eclipse tools.  Excellent work experience in CRXDE, CRXDE Lite,WCM, CMS,OSGI Framework, JCR,Apache sling, template development, Component Development and installation of author and Publish instances. Experienced in developing CMS based applications using Adobe CQ5/AEM, Apache Sling and OSGI. Knowledge in Slightly HTML5 Templating Language  Hands on experience in setting up or upgrading CQ environment with expertise in CQ5 Author, Publisher and Dispatcher administrations.  Experienced in developing applications using CRXDE, Eclipse and Rational Application Developer (RAD) IDEs.  Expertise in Java, J2EE, CVS, ClearCase, SVN and ANT.  Experience on working with JUnit and LOG4J.  Proficient in JDBC, JSP, JNDI, Servlets, JavaScript and AJAX.  Strong hands-on with EAI technologies like Spring 3.2 (Spring MVC), Struts 2.0, and Hibernate 3.0  Strong hands on experience in developing the Enterprise and Web applications on n-tier Architecture using Java/J2EE, Spring, JSP, Hibernate, Servlets, EJBs, Struts, JNDI, Web services, XML, and JDBC.  Expertise in applications development using Spring MVC, Dependency Injection, AOP, ORM, Tiles and Security.  Proficient in building Web User Interface (UI) using HTML5, DHTML, XHTML, CSS3 and Java Script that follows W3C Web Standards and are browser compatible.  Experienced in using RDBMS like Oracle, Microsoft SQL Server and MySQL.  Experience in SQL, MySQL, PL/SQL Database Triggers, Cursors, Packages, Stored procedures, Functions and Exceptions.  Developed Use Case diagrams, Class Diagrams and sequence diagrams using Rational Rose.  Experienced in developing applications using application/Web servers such as JBoss, WebSphere, WebLogic and Tomcat.  Experience Working with Agile Methodologies for development Process in different way of approaches like SCRUM, Iterative.  Experience working with Bug tracking tools like Version One, JIRA, Bugzilla, QC.  Involved in writing various UNIX shell scripts for writing automated scripts for scheduled queue process and pm cmd commands. Experience with Agile process methodology and Scrum methodology. TECHNICAL SKILLS: Languages:   \t\t\tC, C++, JAVA/J2ee, JavaScript, XML, SQL, PL/SQL, MATLAB / SIMULINK Content Management Tools:\tWorkflow Manager, Adobe CQ5.6, AEM 6.1, 6.2,6.3, Apache Jackrabbit, Apache Sling, Apache Felix Day CQ 5.5, 5.6.1. WebTechnologies: \tJDK, Servlets, Portlets, JSP, JSTL, Custom Tags, Struts, Java Beans, Enterprise Java Beans (EJB), RMI, XML, HTML, DHTML, Java Script, JQuery, JSON, Bootstrap, ExtJS, JSTL, EJB, XSLT Application/Web Servers: \tIBM WebSphere Portal/Application Server, Bea Web Logic Portal / Application Server, ALUI Portal Server, Apache Tomcat Server Web services:                        \tApache AXIS SOAP, RESTful, WSDL, UDDI, XML Frameworks/APIs:  \tSpring MVC, Apache Struts, Hibernate3.x, Ext JS (Sencha), Node JS, Groovy and Grails Build Tools:   \t\t              Apache Ant, Maven 2.0,Jenkins Application Servers:\t   \tJBoss, Tomcat, Apache Web-server Tools/IDEs:                      \tEclipse/My Eclipse, IntelliJ, Brackets Rational Application Developer, WebLogic Workshop, JUnit, Ant, Maven, Jenkins, Ruby IntelliJ, Brackets Database Methodologies:\tOracle, MySQL, MS SQL Server Version Control:\t\tCVS, GIT, SVN PROFESSIONAL EXPERIENCE: Royal Caribbean, Miami, FL\t\t\t\t\t\t                           Jan 2017 to Till Date\t Role: Sr. Lead AEMCQ Developer Responsibilities: Activities also include writing the code from the scratch, testing and debugging it and migrating content.  Migration of content from live sites to AEM templates and replicating it.  Sound Knowledge on the AEM/CQ administration activities such as User permissions/creations with LDAP synchronization, sling setting status. Involved in creation of audit reports, code and configuration management. Experience in testing for Web Content Accessibility Guidelines / ADA Compliance (Section 508) on the web. Created MVC design pattern to organize AngularJS controllers, Custom Directives, views. Used AngularJS as framework to create a single page applications(SPA) which can bind data to specific views and synchronize data with server using Bootstrap, AngularJS. Developed and executed test cases for Section 508 Compliance. Implementing AWS Cloud Front for the newly built websites.  Lead architecture activities of AEM and non AEMweb projects that focus on usability and user adoption. Upgraded current AEM 6.1 to AEM 6.2 SP1 to AEM 6.3. Involved in integrated AEM 6.3 with Adobe Analytics, Adobe Target, and Dynamic Tag Management to build, deliver and measure personalized experiences. Verify and validate for both backend and frontend Functionality, Usability, Performance, also did SIT and UAT, and Performed OLA and email testing. Played a major role in determining testing phases and timeline estimates for various projects. Worked on AEM Forms and Sites and End to End Implementation in AEM 6.2  Developed Event Templates and Related components in AEM 6.2.  Developed Templates using AEM 6.2, 6.3 Slightly which converted written code in to reusable tags.  Adobe Experience Manager /CQ application installation and configuration in Windows/Linux platform. Developed Templates, components using Sightly. Developed styles for the respective AEM pages and Templates using HTML5, CSS3 and JS from the scratch to build an entirely new site in AEM and made the sites responsive for tablet and mobile view using media queries. SME for GCPSS system. Being a SME of GCPSS, Design and Built a tool for real time tracking of report processing. This helped marketing to know the SLA of each cycle cut and report delivery time. Development of static web pages, landing pages, category landing pages using content management system, Adobe AEM. SME for accurate problem identification, proposing solutions and design fixes for impacted systems Setup and configured and developed AEM Templates and Components. Perform CQ5 customization on foundation components, core CMS and workflows to extend functionalities, improve performance as per the requirements. Extensively used sling models and sling servlets. Working Knowledge of building an OSGi bundle that consumes SOAP based web services.  Used different AEM components for storing content and DAM for storing assets.  Worked on the staging environment directly and have a very good understanding of CRXDE. Created AEM pages for multi lingual sites which includes brazil, Portuguese, middle east, Chinese and UK sites, extensively used Multi Site Manager.  Used Package Manager for creating, building and installing packages.  Solved complex design and functionality problems, working directly with Front end and back-end developers.  Documented developer resources which include local setup steps, creating packages, publishing pages from AEM, Pushing and merging code, website development scenarios and many more. Environment:AEM 6.1, AEM 6.2, AEM 6.3, CRXDE, Touch UI, HTML5, Adobe Analytics, Adobe Target, Windows, Linux, CSS3, Sightly, Sling, Granite UI, Java, JavaScript, OSGi, DAM, MSM, DTM, Package Manager, LDAP synchronization, SOAP web service G6 Hospitality, Carrollton, TX Role: AEM/CQ5 Developer\t\t\t\t\t\t\tMarch 2015 to Dec 2016 Responsibilities: Involved in the project from requirements gathering and involved in various stages like Design, Testing till production.  Implemented Spring MVC framework, which includes writing Controller classes for handling requests, processing form submissions and also performed validations using Commons Validator.  Implemented the business layer by using Hibernate with Spring DAOand also developed mapping files and POJO java classes using ORM tool.  Designed and developed Business Services using Spring Framework (Dependency Injection) and DAO Design Patterns. Developed web applications and web services using MVC4, Entity framework, HTML/CSS/Bootstrap, JavaScript and AngularJS. Migrating the entire project in a single goal from CQ-5.6 to AEM 6.1 Touch UI. Implemented GUI using HTML5, CSS, AJAX, and JSP components.  Offer solutions on top of the Adobe WCM, CRX/CRXDE, CQ WCM, DAM.  Experienced with W3C (WCAG 2.0, Sec 508) guidelines.  Worked on SMTP Server and developed Adobe LivecycleProcess to manage Bounced Emails and undeliverable emails to clients.  Creating AWS load balancers to distribute the load on different servers as per the application requirements  Involved in writing Spring Configuration XML file that contains declarations and other dependent objects declaration  Developed Touch UI Components and Templates using Adobe AEM 6.1 for supporting the different Webpages.  Performed AEM customization on foundation components, core CMS and workflows to extend functionalities, and improve performance.  Implemented the Sling Filter, Felix Filter, Sling Servlet, and OSGI bundles for interacting with remote spring web services.  Have been using DAM Assets, Package Manager, Package Share, Replication and other tools provided by CQand also have an in-depth knowledge of using all the above.  Developed Adobe AEM templates and reusable components.  Managing ISD IT Service Level Agreement (SLA), ISD IT Operational Level Agreement (OLA). Extensively used AEM tagging features in developing components and templates.  Installed and Configured AEM Authoring & Publishing Instance.  Experience on JAVA, JCR, Felix, OSGi and other technologies involved in deploying solutions based on the AEM framework of AEM Forms.  Experienced in Day CQ and associated technologies like Sling, OSGI, Felix, Jackrabbit, JCR, CRX. Worked with Maven to build and generate the jar files to deploy in the Felix Console.  Used Apache Maven for managing jars, which build automation. Worked on Multi Site Manager and extensively used CQ tag libraries in the components. Utilized HTML, CSS, jQuery for designing and implementing custom CQ components.  Developed workflow components related to digital assets upload workflow as per the client requirements. Environment:AEM 6.1, CQ5.6.1 (WCM), AEM DAM, Workflow, Apache Sling, CRXDE, CRX, WCM, HTML5, JSP, Services, Models, Servlets, JavaScript, jQuery, Eclipse IDE, IntelliJ, Tomcat 6, Scene 7, Apache Maven, JIRA, Apache HTTP Server, SOAP and REST Web Services. Master Card, St. Louis - MO                                                                                        Dec 2013 to March 2015 Role: AEM/CQ5 Developer\t\t\t\t\t\t\t Responsibilities: Worked on CRX as a repository and accessing the CRX content nodes by SQL Queries and XPath.  Developed custom components, customized forms for Internet and Intranet sites of the company.  Development of static web pages, landing pages, category landing pages using content management system, Adobe CQ5.  Maintaining OSGI java classes for assets import, validation processes, and to fetch the data from CQ repository obtained from different providers.  Provide estimates, designs, and specifications for CQ5templates, components, and workflows.  Built various web pages using HTML, CSS, Java Script and JQuery.  Implemented lots of Restful based web services from scratch  Solid understanding of all Adobe CQ building blocks and the CQ development and deployment process.  Setup and configure Authoring and Publishing environments, replication agents, CQ5 dispatcher to cache the landing pages html and serve as the static pages from Apache.  Worked on CQ5Forms customization by developing the custom form fields, writing the custom constraints for form fields and specifying the global validation resource type at the form level.  Offer solutions on top of the Adobe WCM, CRX/CRXDE, CQ WCM, DAM.  Integrated Spring DAO for data access using with Hibernate.  Developed GUI using HTML and JavaScript. Effectively communicate design to customers and present design options/considerations.  Adopt and utilize iterative/Agile methodology as needed or requested. Building and Installing servers through Azure Resource Manager Templates or Azure Portal. Migrating an On-premises virtual machine to Azure Resource Manager Subscription with Azure Site Recovery. Produce quality work even when under extreme time pressure and deadlines.  Environment: AEM5.6.1, Adobe CQ5, JAVA, J2EE, OSGI, Spring Integration, HIBERNATE, MYSQL, AJAX, JSON, HTML, CSS, Java Script, JQUERY, Jenkins, Maven, SOAP UI, XPath, XML, LINUX, JSP, Web Services (REST), Eclipse, SVN. 3i Infotech - IN\t\t\t\t\t\tAug 2012 to Nov 2013 Role: Java/J2EE Developer Responsibilities: Created Class diagrams and Use Case diagrams from design spec using Rational Rose. Implementation of J2EE Design Patterns like Singleton, Session Facade, Business Delegate, and Data Access Objects.  Actively involved in design of the application architecture in lines of their own Framework based on MVC2 Architecture with JSP Front End (HTTP Request/Response Integration) as View, Servlet as Controller and combination of EJBs and Java classes as Model.  Designed and developed presentation layer using JSP which acts as View in a distributed MVC architecture, which involves model components and controller components.  Used Message Driven Beans for asynchronous messaging. Used Java Message Service API to create, send, receive, and read messages between application components.  Wrote complex SQL queries and programmed stored procedures, packages and triggers.  Involved in configuration of Spring MVC and Integration with Hibernate.  Developed and deployed back-end services to Azure to support mobile apps.  Involved on migrating SQL Server databases to SQL Azure Database using SQL Azure Migration Wizard. Deployed application to Azure Cloud. Used Spring MVC framework for design and development of web application  Used Hibernate for Object Relational Mapping and Persistence.  Designed and developed business tier using EJBs. Used Session Beans to encapsulate the Business Logic.  Involved in configuration and deployment of application on WebLogic Application Server. Used CVS as Version Control System performed Module and Unit Level Testing with JUnit and log4j.  Used Apache Ant for building the application. Gained a good knowledge about browser compatibility issues and their solutions.  Environment: Java 1.4/1.5, J2SE, J2EE, JSP 2.0, Servlets, Struts 1.1, JDBC, XML, JavaScript, HTML, XSLT, Jasper Reports, Firebug, Lotus Notes 8.5, Putty, Toad for Oracle 10g, RAD 7.0, JAXP. Misys, Bangalore - IN\t\t\t\t\tMay 2010 to Aug 2012 Role: Java Developer Responsibilities: Involved in all phases of the Software development life cycle (SDLC) using Agile Methodology.  Developed the application using JSF 1.1 MVC Framework.  Implementing complex designs using enterprise level application systems, technologies include: Servlets, Oracle 9i, JSP, XML, PL/SQL, JBuilder2005, Hibernate 3.0, and J2EE Framework (internal framework), LDAP.  Designed and developed Hibernate DAO's using spring framework's, Hibernate DAO Support and Hibernate Template.  Involved in developing the UI pages using HTML, DHTML, CSS, JavaScript, JSON, jQuery and Ajax.  Used JQuery core library functions for the logical implementation part at client side for all the application.  Created tables, triggers, stored procedures, SQL queries, joins, integrity constraints and views for multiple databases.  Involved in developing HTML and JavaScript for client-side presentation and, data validation on the client side with in the forms.  Involved in writing SQL Queries, Stored Procedures.  Implemented the Drag and Drop functionality using jQuery framework.  Used jQuery plugins for Drag-and-Drop, Widgets, Menus, User Interface and Forms.  Developed web presentation layer using HTML and CSS according to internal standards and guide lines.  Involved in writing application level code to interact with APIs, Web Services using AJAX, JSON and XML. Designed the table less web applications using CSS and with the help of and tags as per W3C standards.  Environment: Eclipse, Firebug, CVS, HTML, CSS, JavaScript, jQuery, Java, XML"}