{"text": "Name: katherine katherine E-Mail: katherine.katherine@gmail.com Address: Ji’an, China Github: https://github.com/katherine LinkedIn: https://linkedin.com/katherine Phone No. 267796420889 Summary: Around5+years of experience in object-oriented design, development, deployment and maintenance of Web and J2EE applications using process methodologies Around 4 years of hands on experience in development of content management solutions using Adobe CQ5/AEM. Expertise in building CMS solutions on top of the Adobe CQ5/AEM WCM, DAM, Campaign management and implementing custom components.  Expertise in developing custom AEM/CQ5 templates, components and widgets using both Ext JS&Granite UI. Hands on experience in integrating CQ5 components with JQuery and AngularJS frameworks. Development experience with core frameworks including Apache Sling, OSGi, Apache Felix. Experience with HTML5, CSS, Less, Bootstrap and client-side JavaScript Frameworks like JQuery, Angular JS, Require JS and EXT JS. Worked on Jenkins CI configurations for Build Automation. Exposure to dispatcher configurations as part of AEM website architecture. Used JCR (JSR-283) API, Apache Sling/Felix in CQ5/AEM as part of developing custom bundles. Strong experience in MSM (Multi Site Management) and creating multiple live copies and blue prints needed for MSM in Adobe AEM. Experience with multi lingual websites having i18n translations. Worked on creating workflows and users administration in AEM/CQ5. Expert in development of applications using J2EE technologieslike Java, JSP, Servlets, Apache Axis, JDBC,JNDI,JavaMail,JTA,JMS,LDAP and XML/XSL Experience in developing and deploying applications using Websphere Application server, WSAD, Tomcat, Web Logic, Portal Server V 6, Websphere Portlet Factory 6.0.02, NetBeans IDE and JBoss. Created custom sling bundles as part of new functionalities provided to CQ sites. Having good Knowledge working with Web Services especially based on Rest API. Knowledge of database such as Oracle 11g/10g. Working experience with IDEs tools such as CRXDE, Brackets, Eclipse Juno, Eclipse Mars, and IntelliJ. Experience in developing applications using three tier architectural frameworks such as MVC (Model View Controller) and STRUTS, SPRING framework and Hibernate. Experience in AJAX,XML,DOJO and XML related technologies like SAX, DOM Parsers Experience in using various Configuration Management tools like SourceSafe and CVS Worked on all phases of Systems Development life cycle (SDLC) Prepared test case scenarios and internal documentation for validation and reporting Experience in working with source control and versioning tools like SVN, CVS, and Clear Case. Experienced in User Support and training end users for efficient use of developed applications. Versed with development methodologies namely SDLC, Agile and SCRUM Knowledge of WWCM 5.x / 6.0 for web content management. Technical Skill Summary: Professional Experience: AEM Business Analyst Project #1 Prime Therapeutics, MN\t\t\t\t\tJanuary 2018 – May 2018 Responsibilities: Played a key role during requirements gathering, analysis and testing. Elicit documentation review requirements using interviews, document analysis, requirements workshops, business process descriptions and flows, and key operating procedures for e-Commerce application. Critically evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and distinguish user requests from the underlying true needs. Collaborate with business users of Digital Marketing teams, Vendors, and IT teams to introduce process to implement AEM/CQ5 for the IT/Digital Marketing teams. Delivered, use cases, functional documentation, and wireframes, Updated BRD, redirect document for bringing code base in house from an outside agency, conducted JAD sessions. Validate visual design and oversee the implementation of Client's International and multi-language websites on Adobe Day CQ CMS platform including search integration with GSA and CRM integration with Eloqua. Document user personas and attributes for personalized content delivery and segmentation. Define and document initial segments used in application Co-coordinate the development efforts with offshore consulting team manage scheduling budget for the resources, Implement scope control procedures was actively involved in Milestone planning, resource allocation for the project. Performed extensive AS-IS and GAP analysis of the legacy HRIS system for various HR business processes recruiting, benefits, time management formulated TO-BE business processes according to the new HRIS implementation of SAP HR module. Utilized Testing Target Adobe Target and Optimize for AB optimization tests. Environment: Adobe Day CQ5, Adobe Target, XML, JavaScript, HTML, Omniture, SQL Server 2008, SAP HCM, AgileWrap, SharePoint, MS Visio, MS Excel, MS Project. AEM Developer Project #2: International Bingo Network\t\t\t\tAugust 2017 – December 2017 Client: Gtech, Providence RI Description: GTECH provides innovative technology, creative content, and superior service to effectively manage and grow today’s evolving gaming markets. Responsibilities: Used OSGi to deploy dynamic libraries Developed Servlets to handle requests from the client in an OSGi bundle Content authoring and maintenance for test environments Developed various components using Search & Promote Developed Java components for AEM6.0 CMS (Content Management System) and deployed/tested on Author/Publisher instances. AEM packages deployment from one environment to other environment. Developing templates/components using CRXDE Lite/Eclipse with the help of VaultClipse XML Feed into AEM and persisting the data into AEM Maintenance and packaging of content, delivery and installation across all environments Environment: Java, Servlets, JSP, Eclipse, Adobe AEM 6, OSGi, Adobe Search & Promote Java/CQ5 Developer Project #3: Ontario Lottery and Gaming\t\t\t\tJanuary 2017 – June 2017 Client: GTECH, Providence RI Description: GTECH provides innovative technology, creative content, and superior service to effectively manage and grow today’s evolving gaming markets. Responsibilities: Involved in design and development using Java, J2EE, Web 2.0 technologies Involved in design and development of reusable components. Worked extensively on Version One for requirements/story tracking. Providing CQ5/AEM consulting services for integrating all web application, database Used OSGi to deploy dynamic libraries Developed Servlets to handle requests from the client in an OSGi bundle CQ5/AEM Content authoring and maintenance for test environments Testing of components and templates; Cross-browser/MacOS/Windows Developing templates/components using CRXDE and deploying on CQ5/AEM Maintenance and packaging of content, delivery and installation across all environments Demos to VW User Groups, Video demo creation and Wiki Documentation Training of new VW employees on basic use of WCM, DAM, Packages and CRXDE JIRA ticket creation and management of tasks; facilitation of Agile Scrum meetings Guided the team for overall design/prototyping/unit testing/web services integration. Environment: Java, Servlets, JSP, Eclipse, JavaScript, web services, Adobe CQ5.6/AEM,CRXDE,JCR 2.0, OSGi(Apache Felix),RESTful Web services, Apache Jersey, SVN. Sr Java Developer\t\t\t\t\t\t\tAugust 2016 – December 2016 Project #4 Client : Valence Health, Chicago, IL Responsibilities: Involved in the process of analysis, design, and development of the application. Developed user interface using JSP, Struts and Java Script to simplify the complexities of the application. The entire application was developed in J2EE using an MVC based architecture with help of Apache Struts 1.3.8.  Coded Struts Action classes, Model classes. Implemented the application using the concrete principles laid down by several Java/J2EE Design patterns like Business Delegate, MVC, Singleton, Data Transfer Object (DTO) and Service Locator Used JavaScript for client-side validations, and AJAX to create interactive front-end GUI. Implemented client side validations using JavaScript. Used Form Based Authentication. Used Web Sphere as the application server for deployment. Involved in writing stored procedures, complex queries using SQL to process the data on MYSQL DB. Performed unit testing on various project modules using JUnit framework. Used Apache Ant as build tool. Used IBM Rational Clear Case as version control tool for maintaining source code and project documents.  Implemented Log4J for Logging Errors, debugging and tracking. Environment: Java, JSP, Servlets, Struts, HTML, CSS, JavaScript, JUnit, Shell, SQL, JBOSS, Eclipse, CVS, Linux/UNIX. Java Web Developer\t\t\t\t\t\t\tDecember 2014 – June 2016 Project#5 Client: Novartis Pharmaceuticals Corporation, Hyderabad, India Responsibilities: Involved in Design, Development and Support phases of Software Development Life Cycle (SDLC). Used RUP (Rational Unified Process) methodology.  Involved in developing UML Use case diagrams, Class diagrams, and Sequence diagrams using Rational Rose. Used JSF Framework for the presentation tier of the application which is based on the MVC design pattern. Developed Custom Tags to simplify the JSP2.0 code. Designed UI screens using JSP 2.0, CSS, XML1.1 and HTML. Used JavaScript for client side validation.   Developed Hibernate 3.0 in Data Access Layer to access and update information in the database. Used Spring 2.0 Framework for Dependency injection and integrated with Hibernate. Designed entire application using various design patterns such as Singleton, DAO, Front Controller, Service Locator, Business Delegate, Façade and Data Access Object. Used MYSQL Database for storing data. I have written stored procedures and queries for retrieving data. Used TOMCAT Application Server for deploying RMS application.  Written shell scripts for transferring product jars, creating new CVS tags, pushing logs, and preparing build and deployment properties.  Experience with Caching, Multithreading in application coding.   Gained experience in setting up servers and registers to install POS (point of sale) OS and environment related issues.  Used DB2 as the backend database using UNIX OS. Involved in design of the database schema and development of Stored Procedures. Coded ANT build scripts to build and deploy the application on WebSphere Application Server 6.1. Used JUnit framework for unit testing of application and Log4j 1.2 to capture the log that includes runtime exceptions. Used CVS for version control and used IBM RAD 7.0 as the IDE for implementing the application. Environment: IBM WAS 6.1.0.21, J2EE 1.5, JSF, Hibernate 3.0, Spring Framework 2.0, JSP 2.0, Servlets 2.4, Perl, XML1.1, Agile, SOAP 1.1, DOM, JavaScript, UML, HTML, JNDI, CVS1.1, Log4J 1.2, JUnit, ANT, IBM DB2, MYSQL, TOMCAT, shell scripting, Unix Java Developer\t\t\t\t\t\t\tOctober 2013– November 2014 Project #6 Client: Novartis Pharmaceuticals Corporation, Mumbai, India Responsibilities: Developed frontend layout and intro for home page using Fireworks. Utilized the mail merge techniques in MS Word for the time reduction in sending certificates. Participated in meetings with the end-clients to develop layout, color scheme for the web page and implemented them with the help of HTML, CSS and JavaScript.  Used Flash Animations and Storyboard & User Flows for e-learning tutorials using human factor engineering design concepts. Built complex desktop - style UI using HTML, CSS, JavaScript and AJAX including configuration wizards and interactive reports. Worked on JQUERY to make dropdown menus on web pages and display part of a web page upon user request.  Reviewed customer feedback about the debugging issues, fixed bugs with HTML and JavaScript codes and worked on resolving browser compatibility issues.  Hands on experience on SQL Server features like tables, stored procedures, views, triggers, relationships, constraints. Extensively used JavaScript for client-side validation.  Used SVN for Version Control. Extensively used images of the product for web and catalogue. Analyze the response of JSON to update DOM.  Use of JIRA for tracking the issues and bugs that surfaces during the development phase. Developed components to fetch the data from the back end using AJAX and JQUERY.  Developed JavaScript library for rendering domain-specific layout XML to the web.  Analyze the response of JSON to update DOM. Used Cascading Style Sheet (CSS) in web pages to separate presentation from structure.  Defined text alignment, size, borders and many other typographic characteristics.  Performed client-side validations using JavaScript and fixed bugs and provided support services for the application.  Environment: HTML4/XHTML, ColdFusion, SQL Server, CSS2, JavaScript 1.7, XML, MS Office, AJAX, SVN, JSON, DOM, Dreamweaver, JQUERY 1.3"}