{"text": "Name: jean jean E-Mail: jean.jean@gmail.com Address: Istanbul, Turkey Github: https://github.com/jean LinkedIn: https://linkedin.com/jean Phone No. 284852519433 PROFESSIONAL SUMMARY: Having 4+ years of software development experience with 2 years of experience in design and implementation of modules on Adobe CQ 5 and AEM 6.0, 6.1, 6.2, 6.3 and 1 year of experience as a Java developer. Expertise in Java Content Repository (API) suite, Sling web framework and Apache Felix OSGi framework. Proficiency with Sightly, CRX, JCR, DAM, Apache Felix, Apache Sling and OSGi technologies. Experience in designing and build Components, Templates, Dialogs, Tagging, User creation, Custom widgets and workflows using the Adobe CQ/ AEM and knowledge in CQ5 building blocks, CRX repository. Proficient in using various IDEs like CRXDE, CRXDE-Lite and Eclipse. Strong in AEM DAM, developed custom code to create assets, renditions, creating custom metadata for assets and assign Tags to assets. Expertise in creating OSGi bundles, Services, and querying JCR. Migrated components from legacy CQ5 CMS to new implementation on AEM 6.0. Strong experience with setting up AEM/CQ5 using Maven and Standard Eclipse tools.  Good web page design skills and work experience in developing web applications covering front-end/UI using the technologies HTML5, CSS3, JavaScript, jQuery, Angular JS, React.js, JSON, AJAX, Responsive Media Queries. Good knowledge on Content Management Systems with emphasis on W3C and usability standards. Expertise in developing integrated business applications using Hibernate, Spring framework (Spring Core Framework, AOP, Spring Integration, Spring Batch, Spring MVC, Spring Web flow and Spring Security), Struts, JSF Framework and Web Services (JAX-WS, JAX-RPC, JAXP, JAXB). Strong Experience with Java technologies including: Java Collections, Multi-Threading, JSP, JDBC, Servlets. Rich experienced in writing SQL queries with RDBMS skills in MySQL, SQL Server, and Oracle. Strong experience in using version control tools like GitHub, Subversion (SVN) and CVS. Well versed with Software Development Life Cycle and Agile Methodology (Scrum). Solid knowledge in Web Services using Service Oriented Architecture(SOA) and Web/Application servers like WebSphere, JBoss, and Apache Tomcat. Experienced in using Adobe Dynamic Tag Management (DTM) and integration of AEM with Adobe Analytics and Adobe Target. Experience managing daily interaction with offshore development teams. Excellent Analytical, Communication and Inter-personal skills, flexible and versatile to new environments. Technical Skills: WORK EXPERIENCE:  Client: American Express, NY \t\t\t\t\t\t          Jul ’16 –Till Date Role: Adobe AEM Developer\t\t\t\t\t Description: The project is aimed at providing enhancements and support to the new applications being released on the bank’s portal for the bank customers providing relevant content updates and information. Teamsite is one of the CMS tools used for managing the content on website. Responsibilities: \t\t Involved in Analysis, Design, Implementation, and Testing of the project. Responsible for integrating third party HTML's with the CQ components and templates. Designed and developed, AEM building blocks including templates, components, dialogs, widgets, workflows. Worked on CRX as a repository and accessing the CRX content nodes by SQL Queries and XPath. Worked on Infrastructure Setup like TarMK, ColdStandBy AEM, Dispatcher setup etc. Worked on Jenkins for continuous integration and timely builds. Installation of AEM 6.1 on Linux and windows environment. Good experience in Packaging and deploying application along with the production rollout. Worked on Security, User Creation, Groups, Workflow management. Good Knowledge on AEM 6.3 Revision Cleanup for the configuring tasks. Developed custom components, customized forms for Internet and Intranet sites of the company. Proficient in Adobe CQ foundational concepts, including the CRX repository, the CQ platform, the use of core frameworks such as Apache Sling and Apache Felix. Development of static web pages, landing pages, category landing pages using content management system. Good knowledge on creating dialogs for Touch UI. Salesforce integration to get and set information of partners. Provide estimates, designs, and specifications for CQ5 templates, components, and workflows. Built various web pages using HTML, CSS, Java Script and jQuery. Solid understanding of all Adobe CQ building blocks and the CQ development and deployment process. Experienced on creating dialogs for Classic in AEM. Offer solutions on top of the Adobe WCM, CRX/CRXDE, CQ WCM, DAM. OSGi bundle development experience. Implement best practice to manage performance and scalability. Environment: Adobe AEM 6.3, AEM 6.2, CRXDE, Eclipse, JCR, OSGI (Apache Felix), REST, SVN, File Vault, Apache Sling, Java, Maven and XML, Spring Framework, MySQL. Client: Magna Infotech (Hyderabad, India)\t\t\t\tApr 2014 – Sep 2014 Role: Java Developer\t\t\t\t \t\t\t Description: The project is to develop a suite of enterprise software applications that seamlessly interface with existing systems, to proactively manage the internal and external data flow of business, and achieve extremely effective working capital management. Responsibilities:  Designed the class diagrams, sequential diagrams and collaboration diagrams in UML using Rational Rose \nUsed JDBC to access Database. Developed Servlets in forwarding requests to different server for invoking the EJBs and connecting to Oracle database. Developed Entity and Session Beans housing the business logic for Web Sphere application server. Developed methods in EJB to store and retrieve the values from the database. Taken care of Java multi-threading in common java classes / library. Involved in developing complex SQL queries in Oracle PL/SQL. Optimized system performance by writing stored procedures. Designed and developed the front end with JSP, JavaScript, HTML, Tag Libs and CSS. Used AJAX for a synchronous data transfer, to show/hide details in Portfolio screens. Involved in production support for portfolio, trading and market data applications. Used CVS for Versioning and concurrent access to the project files. Designed and developed the action form beans and action classes and implemented MVC using Struts framework. Involved in developing and coding for the call switch using JSP, generating triggers. Developed various build scripts for building EJBs, deploying beans across domains, creating jar/war/ear etc. using ANT build tool.  \nEnvironment: Java, Servlets, JSP, JDBC, EJB, AJAX, JavaScript, Web Services, CVS, HTML, Web Sphere, Eclipse, UNIX, Oracle, PL/SQL. EDUCATION: Bachelors of Technology in Engineering Jawaharlal Nehru Technological University, Hyderabad, India. Master of Science in Electrical Engineering  Wright State University, Ohio."}