{"text": "Name: daisy daisy E-Mail: daisy.daisy@gmail.com Address: Xi’an, China Github: https://github.com/daisy LinkedIn: https://linkedin.com/daisy Phone No. 326179476615 A Highly proficient and Experienced AEM developer with 6 years of total IT experience in designing and developing of product life-cycle which includes 3+ years of AEM /CQ5 experience with hands on experience in building and deploying enterprise level Web Content Management solutions on AEM 6.0, and 6.1 and Adobe CQ 5.4, 5.6.H and holding testing experience highly collaborative team player with extensive Working relationship with Internal and external Project Stakeholders to enhance overall Project vision, demonstrated ability to manage Multi-cross functional teams to solve problems and address Project challenges, Competitive with exemplary communication skills, effectively demonstrate value added proposition to client’s satisfaction, Looking for new opportunities    Experienced in Various Project life cycle Methodologies’ Waterfall, Agile/ Scrum, Lean Methodologies, RUP, UML. Analysis and development of modules using Adobe CQ and Java/JEE technologies.  Development of templates, components and services using Java, JSP and apache sling.  Incorporation of the CQ pages with ecommerce platforms such as Hybris.  Migrating the existing content which was stored in XML files to CRX repositories \nLead independently whole technical delivery from solution to deployment  Understanding the business needs and processes; identify solutions, present and guide project team/sponsors in identifying best solution.  Contributed in Requirements Analysis; design Applications based on System Requirements and Architecture, prototype if necessary, develop, unit test and deploy applications  Provide unit testing, code documentation and support of developed applications  Designed and developed websites/pages in Adobe CQ/AEM by implementing the responsive design Extensively used Adobe CRX, CRXDE, WCM, Package Manager, Components, Workflows, Widgets, and DAM Expert in developing custom CQ components and modify the out of the box components Expert in Authoring and publishing the Adobe CQ applications and performed cross-browsing testing Strong experience in Adobe related technologies like Sling, OSGI, Apache Felix, Apache Jackrabbit, JCR, and CRX PhantomJS was used in Adobe Workflows to save the applications screenshots into multiple pdf files Experienced in developing UML diagrams like use cases, class diagrams and sequence diagrams with Rational Rose, UMLet and MS Visio Tool Rich experience in client-side design and validations using HTML/HTML5, XML, XSLT, JSP, Ajax, J Query, DHTML, XHTML, CSS/CSS3 and JavaScript Developed custom CQ components on top of JCR (Java Content Repository) and Apache Sling, CRX, and C\nExpertise in documenting defects with high level of detail, accuracy, and informative recreation steps using Rally, Quality Center, JIRA. Developed Adobe CQ templates and reusable components. \nIntegrated with a shared globally accessible repository for shared permissions- based digital media assets using AEM DAM.  Developed complex XSD schemas based on Arizona's DCSS business model \nGave guidance to AEM developers in Adaptive Form best practices and data binding  Developed custom user centric workflow in AEM Workflow that provided case workers with the ability to review, reject, deny and or forward requests for applications. Involved in building, deploying the code, moving code to different environments.  Technical Skills: TECHNICAL SKILLS: Web Technologies: HTML 4/5, CSS 2/3, JavaScript,1.2.X/1.5.7, J Query 1.X/2.X, Bootstrap 3.0, Backbone.js, Java, AJAX, XML, JSON.J2EE Technologies: JSP, Servlets, JDBC, Web Services. Enterprise Web Products: AEM6.1,6.2, CQ 5.6, CQ 5.4Operating Systems: Windows 9x/2000/XP, Linux, UNIX. Data Bases: Oracle 9i/10g/11g, MySQL, SQL Server 2000.Application Servers/Web Servers: Tomcat 4.X/5.X/6.0, Apache. IDE/HTML Editors: Eclipse, Notepad++, Visual Studio 2013/2015, Sublime Text 3. Version Control: SVN, GIT. Methodologies: Waterfall, Agile. Utility Software/Tools: MS Word, MS Excel, MS PowerPoint, MS Visio, Google Analytics, Adobe Photoshop CS5, Dreamweaver. E Bay Inc ,  Salt Lake City , Utah                                                                                                                                                       Mar’ 17 To Present  AEM developer & Tester (CQ5 Developer)           Roles & Responsibilities: Designed and developed, CQ5 building blocks including templates, components, dialogs, widgets, workflows. Worked on CRX as a repository and accessing the CRX content nodes by SQL Queries and XPath. Developed applications that uses JCR content repository in CQ to store information and query the JCR for display and reporting purposes. Developed custom components, customized forms for Internet and Intranet sites of the company. Proficient in Adobe CQ foundational concepts, including the CRX repository, the CQ platform, the use of core frameworks such as Apache Sling and Apache Felix. Development of static web pages, landing pages, category landing pages using content management system, Adobe CQ5 Experience on creating CQ: dialog & dialogs for both Touch UI/ Classic UI in AEM 6.0.  Provide estimates, designs, and specifications for CQ5 templates, components, and workflows Solid understanding of all Adobe CQ building blocks and the CQ development and deployment process. Setup and configure Authoring and Publishing environments, replicationagents, CQ5 dispatcher to cache the landing pages html and serve as the static pages from Apache OSGI bundle development experience. Adopt and utilize iterative/Agile methodology as needed or requested. Installed and configured WCM applications on IIS 6.0 web server and 2003 server. Environment: AEM 5.6, 6.0, JAVA, J2EE, OSGI, MYSQL, AJAX, JSON, HTML, CSS, Java Script, JQUERY,Teradata, Jenkins, Maven, IIS 6.0, XPath, XML, LINUX, JSP, Web Services (SOAP, REST), Eclipse, TFS. CSRA Inc, ALBANY, New York \t\t\t\t\t\t\t\t\tFeb ‘ 16 To Feb ‘17 AEM developer & Tester (CQ5 Developer) Roles & Responsibilities: Helping the business requirements in the process of converting them to technical solutions Analyzed, designed  layout of the components with interaction SME & arch-tech. Implemented Adobe WCM, CRX, JCR, Sling, OSGI, CRXDE, WCM, and DAM Around 22 common components were developed to use across all the sites and custom components were developed for each site CRX data store was used to store all the related info Workflow was developed to capture all the screen shots using PhantomJS. This workflow captures all the screens into a pdf's and uploads into DAM Implemented the internationalization I18N translating all aspects of the application iText framework was used in pdf merging in the above workflow SOAP web service was integrated with Adobe CQ to get specific information from the external application SOAP UI was used to test the external web application response Responsive design concept was implemented. Therefore, all diabetes web sites developed in this project are compatible for desktop, mobile, and tablet devices Expert in developing and deploying java code via OSGI bundle Solid understanding of all Adobe CQ building blocks and the CQ development and deployment process Developed custom components that are reusable in Adobe CQ across all three sites Worked on Sling servlets to handle POST and GET requests. Experience in Installing/Configuring Adobe CQ Heavily worked on style sheets to change the colors for each site Expert in configuring author and publish  with the help of AEM tool. Train the business users on how to author different pages using the common and custom developed components Prepared author guides which involves explanation of all the templates, components for each database site. JIRA/BitBucketwas used to handle the production/ET tickets and bug reporting Issue tracking tools Environment:Java, JSP, Active Directory, JavaBeans, HTML, CSS, JavaScript, PhantomJS, Vaultclipse, SlimerJS, AngularJS, JUnit, Log4J, Eclipse, Maven, Apache Tomcat, Web services SOAP , JAX-WS, WSDL, JIRA, BitBucket, Adobe CQ5/AEM, JCR, Sling, Apache JackRabbit, WCM, I18N, CRX, DAM, Package Manager, CRXDELite, OSGI, Workflow CAT Technologies’                                                                                                                                                                            Feb 13 – Mar’14 Hyd, India     \t\t\t\t\t Java Developer Roles & Responsibilities:  Developed the spring AOP programming to configure logging for the application Created SQL queries, PL/SQL Stored Procedures, Functions for the Database layer by studying the required business objects and validating them with Stored Procedures using Oracle DB. Also used JPA with Hibernate provider Designed and modified User Interfaces using JSP, JavaScript, HTML, CSS and jQuery Improved the performance and response time of the application by implementing AJAX Developed common reusable component libraries CRUD Scaffolding to be reused in different projects throughout the team using GWT, Sencha, Spring data, JPA Developed forms using HTML and performing client-side validations using Java Script Redesigned admin application in Angular.js Created stored procedures, sequences, tables, indexes, triggers, views on Oracle DB Implemented the database connectivity using JDBC with Oracle Database as backend Created all the services to work with the various entities provided and rectified the services using REST APIs Extensively used Java Collections API to store intermediate data objects using Eclipse editor Designed and developed a web-based test client using Spring, Struts, JSP, Tag Libraries, Java Script, HTML and XML to test different parts of the application Involved in preparing the test cases using JUnit test case and in the testing phase Designed use case diagrams, Class Diagrams and Sequence Diagrams and Object Diagrams to model the detail design of the application using UML. Used the Eclipse as IDE, configured and deployed the application onto WebLogic application server using Maven build scripts to automate the build and deployment process Developed platform using Google Web Toolkit GWT to support a consistent web experience Worked with business teams using Agile methodology to integrate business line of apps with SOA in a seamless fashion Environment: Java, J2EE, Spring, Hibernate, Struts, JPA, JQuery, Tomcat, Angular.js, JSON, Weblogic, Subversion SVN , Junit, Agile, GWT, UML, JSP, JSTL , JavaScript, CSS3, AJAX, Html5, Oracle, CRUD, SQL, PL/ SQL, Apache CXF, REST, Eclipse, Servlet, Maven, Jira, SOA. Generic Software Solutions Inc                                                                                                                                                     Mar’12 to dec’12 Hyd, India Java developer  Roles & Responsibilities: Involved in the development of various use cases, sequence diagrams using UML, and Rational Rose Extensive use of Enterprise Java Beans EJBs for middle tier component implementation and implementation of business logic Developed the Web Application using JSP, Java Script, JQuery, Servlets, HTML, DHTML, and performed validations using JavaScript Implemented the struts framework Involved in the developing swing windows and integrating them with EJB. Implementation of dynamic and static security for different roles Deployed and tested on Web Logic Application server Implemented JDBC to enable the Database connections Used Data Transfer Object and Data Access Object design patterns. Developed SQL queries and used stored procedures to perform transactions with the DB2 database Hibernate Query Language is used to perform data Retrieval, Update, and all CRUD operations. Developed Stateless Session EJBs for various Business Modules Enhancements for Several applications Developed several JUnit test cases for multiple applications Used Log4J for logging and debugging and CVS for source configuration management Environment: Java, Servlets, JSPs, JavaScript, Struts, EJB, RUP, IBM Web Logic, Oracle, XML, DHTML, CSS, Java Script, JQuery, Log4J, JUnit, JDBC, Hibernate, eclipse IDE, JSF Environment: Java, Servlets, JSP, CSS3, XML, DHTML, EJB, JavaScript AJAX, DB2, Web Services, Web Sphere Application Server, Log4j, CVS, JUnit, IBM RAD, UML. EDUCATION SUMMARY:  MASTERS in I NFORMATION TECHNOLOGY - MIT                                                                                           2014 to 2015                                              VIU International University, Fairfax VA, USA, GPA 3.7/4; Dean’s Scholar’s  BACHELOR’S IN COMPUTER SCIENCE & ENGINEERING – CSE                                                                      2007 to 2011  JNTU, HYD, India; GPA: 3.3/4 Certification: Certified System Architect (CSA) & Certified Senior System Architect  “All Reference will be Available upon request “"}