{"text": "Name: dorothy dorothy E-Mail: dorothy.dorothy@gmail.com Address: Shaoyang, China Github: https://github.com/dorothy LinkedIn: https://linkedin.com/dorothy Phone No. 315777085999 Summary: 7+ years of experience in Analysis, Design and Development in diversified areas of Client-Server, Distributed and Web applications using Java, J2EE technologies. Hands on experience in developing Enterprise Applications using Java, JSP, Servlets, Struts, Spring, Hibernate, EJB, JSTL, JSP Custom Tags, Java Beans, JDBC, JNDI, Java Messaging Service(JMS), JAXP, UML, JUnit, LOG4j, Apache Camel (common API), SQL, PL/SQL, Maven. Worked extensively on creating server-side components, designing and implementing User Interface (GUI) design and development, Unit testing and Deployment. Well acquainted in applying design patterns like Singleton, Factory, MVC, Business Delegate, Service Locator, VO, DAO and Session Facade. Experience with build systems and continuous integration (Grunt, Gulp, Webpack, Jenkins) Good Exposure to UNIX, Sun Solaris & Red Hat Enterprise Linux Environment and shell scripting.  Experience on UI development with JSP, AJAX, Angular JS, JQuery, EXT_JS, Javascript, Php, GWT. Good proficiency in C++, JAVA/J2EE, analytical skills, problem solving skills and excellent Interpersonal and communication skills. Well experienced in MVC architecture and Struts framework. Working knowledge on various libraries of JavaScript like jQuery, backbone.js, angular.js underscore.js, Mustache.JS and Bootstrap.  Hands on Experience in databases such as MYSQL, Microsoft SQL Server, ORACLE. MongoDB (No Sql). Experience in Client/Server application with proficiency in HTML (4/5), CSS (2.1/3), XHTML, JavaScript, jQuery, angular.js, AJAX, XML and JSON. Good exposure to both Application and Web servers like IBM WebSphere, Oracle BEA Weblogic, Apache Camel, Tomcat and also involved in setting up, configuration and deployment process. Experience using Fuse/Apache Service Mix as integration platform and Apache ActiveMQ as messaging platform. Knowledge of using Apache Camel through Fuse Mediation Router. Managed and maintained development of PHP backend for dynamic database driven websites. Automated the Test Cases using Selenium WebDriver, Java Eclipse, Testing, Jbehave and Appium. Good knowledge of Spring's IOC, AOP, Spring MVC and spring's integration with Hibernate and Struts technologies. Experience in designing the User Interface (UI) applications and professional web applications using HTML, DHTML, XHTML, XML, XSL, XSLT, JQuery, JSON and CSS.  Competence in the using various Integrated Development environments like Eclipse, Weblogic Workspace Studio and WSAD. Experience in designing and developing Service Oriented Architecture (SOA) using SOAP and REST Web Services. Pretty good at developing ANT scripts to build J2EE enterprise applications (war, jar and ear).  Strong database development skills using Database Servers like Oracle 8/8i/9i/10g, IBM DB2, MySQL, MS-Access and hands on experience with SQL, PL/SQL.  Superior project implementation skills using cutting-edge technologies (Servlet, JSP, JSF, Applets, XML, Code igniter, PHP etc.) Design, develop and maintain custom PHP-based WordPress Web Service for sharing sensitive data, and integrated custom API for WordPress.  Extensive experience of backend database programming in the oracle environment using PL/SQL with tools such as TOAD & SQL PLUS. Adept in OOAD Techniques developing UML Activity Diagrams, Sequence Diagrams and Class Diagrams.  Integrated API’s for Facebook login and Google Maps custom mapping for multiple clients. Developed custom PHP/MySQL customer information and support management system. Very good working knowledge on Performance Tuning, Debugging & Testing on various platforms. Experience with exposure to BDD test frameworks like Cucumber, JBehave etc. Well versed in Software Development with involvement in all phases of SDLC. Motivated team player with ability to work under minimal supervision possessing strong analytical, problem solving and communication skills. Experience migrating On-Premise Data Centers to AWS Cloud infrastructure. Technical Skills:  Professional Experience Sabre Holdings, Southlake, TX                       \t\t\t\t\tSep 2016 – present Sr. UI Application Developer Project: PMSV4 \tThis is a web application that allows to manage hospitality properties. It is developed not only specific to Wyndham but also it is developed in such a way that it is easy to add new franchisees. Property reservations, payments, housekeeping and reporting are all the services that would be accessible to all wyndham franchisee hotels. Responsibilities: Designed and coded application components in an Agile environment. Developed a responsive web page application using Angular JS, HTML5, CSS3, Node JS, Jenkins and GIT. Coordinating with the business and UX teams to get clarity on the requirement for analysis. Implemented spring MVC. Used JPA to fetch data from database to avoid any dependency on database tables. Involved in payment functionality designing. Designed Frontend with in object oriented JavaScript Framework like ReactJS. Created Dao components for multiple business services. Have developed user interface using ReactJS and bootstrap, with a very friendly User interface. Responsible for implementing new features, scenarios on the client application using ReactJS, HTML5, AWS, micro service.  Experience in creating S3 buckets and managed policies for S3 buckets and used S3 bucket and Glacier for storage and backup on AWS using lifecycle policies. Developed Python scripts to modify content as per project requirement Used Node.js to communicate with backend code. Used GIT as a repository for this project. Used Maven to Build Java API code. Used Node.js, Gulp and Bower to build the UI code. Tomcat 8 web server is used to deploy the API and UI code. Provides status reports to lead and management as needed. Used log4j for logging. Involved in application design, site architecture design, using PHP, CSS, JavaScript and HTML programming to meet validation requirements. Develop the interface for the application using JQuery, CSS and HTML and PHP. Used Code igniter PHP framework to build the application. Developed multiple PHP Test Cases for prototype service development using AJAX, JSON, XML connected to a DODD mobile app. My SQL test databases for test XML/JSON content pull for DODD mobile app tests. Supported QA testing to ensure the verification of the developed UX functionalities. Fully automated administrative systems using PHP /My SQL and Javascript for clients.  Developed tools to automate some base tasks using Python  and Shell scripting. Developed the application using SCRUM methodology, we have scrum meeting once in every two where we would demo all the user stories done during that iteration for final feedback from end users. Resolved the technical problems faced by the team during the development. Environment: HTML5, CSS3, Java 8, Spring Security 3.1,PHP,Code Igniter, MYSQL, AngularJS, ReactJS, Bootstrap, Spring ORM, Foundation CSS, Spring Data JPA, Spring Rest, SVN, mocha/chai, Intellij Idea, MongoDB. Marathon Oil, Houston, TX                                                                              \t\t           Oct ’15 – Aug’16 Java/J2EE Developer  Marathon MPP server and Web Portal\t Description:  MPP Server is backend platform for Mobile App Customer. It hosts all required API in order to register customer, check-in, validation, fueling, receipt notification and anything in between. Currently, it supports payment by PayPal and Apple Pay.  Client customers can go to gas station and using the mobile app can directly authorize a pump for fueling. Once fueling is done they get receipt on their mobile. This saves customer from hassle of getting in line to pay for gas in gas stations. Admin Web Portal is web application to monitor transaction and customer management. Responsibilities: Worked on creating a new back end server to enable mobile payment for gas fueling at gas station for Shell (UK), using Spring MVC, REST, core java, mybatis, linux, jboss. Integrated back end server with mobile platform and coordinated with android/ios team to enable enhancements. Integrated mobile registration, user Info, payment, email mechanism with PayPal registration, user Info, payment and email public API via REST calls. Integrated Marathon’s own mobile app (Motorist) and PayPal app to make all operations including logging, pre-approval, making advance payment and starting fueling and sending out final notification after fueling is complete. User can pay for fueling from his/her mobile.  Created security layers to prevent accidental theft of fuel when Mobile operator network is down and pump is already authorized to dispense fuel. Security: Prevented Man in Middle (MIM) attack by custom design and industry standard encryption for fueling transactions. Enables user to add Marathon loyalty id during user registration, PayPal instrumentation change and user wallet update. Added multiple new end point as REST API to MPP server get transaction details, mange gas pump location with data like site id, address, global site id and call to external system like PayPal and Shell system to get payment and transaction related details. Worked on creating a customized Admin portal using Spring MVC, JSP, and JavaScript, bootstrap, ibatis, XML, batch jobso monitor customers and transactions.  Created multiple reports for Business group and Customer care group to see ongoing operations like Transaction List, Customer List, Error Log list and API traffic report using ibatis2.3.4, Spring MVC, Bootstrap framework.  Planned development work in Sprints and managed issues using JIRA. Also responsible for end to end delivery. Created POC for connected car fueling for BMW. Added new Module to do transaction directly from Car’s operating system including authentication, pin validation fueling, final notification and basic validation. Apple Pay: Enabled fueling transaction using Apple Pay including Integration with Apple, exchanging secure token and authorizing fueling transactions. Deployed server and web portal code on Jboss7.1.1 manually using shell scripting in Linux RedHat server for local QA environment and Pre-Prod and Production environment hosted by Amazon Web Services (AWS – EC2). Architect AWS EC2 instances in sync with AWS ELB to asynchronously render the application to caregivers. Experience in real-time monitoring and alerting the applications deployed in AWS using Cloud Watch, Cloud Trail and Simple Notification Service to maximize resource allocations. Estimated AWS costs and identified the cost control mechanism.  All the care logs are stored in the no sql MongoDB instance. Created Batch job for Web Portal for automation of Transaction and Error report (daily and monthly) and email alert notification for RAG errors using spring batch and Quartz scheduler.  Developed Python scripts and SQL procedures to support development and testing.  Environment: Spring MVC, REST API web services, Java 7, Jboss7.1.1, Eclipse4.4.1, Oracle Database 11g Release 11.2.0.4.0 - 64bit Production, PL/SQL, Log4j, Junit 4.8.2,  apache maven3.2.3,AWS EC2,Postman Chrome App, Red Hat Enterprise Linux Server release 5.9 (Tikanga), Amazon AWS. GE Health Care, San Ramon, CA\t\t\t\t\t\t                       March 14 - Sep 15 Java / J2EE Developer Description: The Case Management, Information and Payrolling system (CMIPS) is an information computer system in California that tracks nearly 400,000 cases statewide. It is also designed to meet the needs of individuals with Medicare or both Madicaid and Medicare coverage. The IHSS CMIPS II provide modern web-based case management functionality and sophisticated processing of payroll. Responsibilities Involved in development of technical design documents and create a prototype of the critical business application. Involved in design, develop and implement rich user interfaces for complex web based systems using the frameworks like JSF.  Involved in designing Administration Portal, UI and validations using HTML, JQuery, node JS, JavaScript, JSP and Servlets as per requirements.  Implemented DAO, MVC design patterns.  Implemented the spring web module to integrate with Struts framework.  Wrote Python code to parse data from HTML websites and converted into JSON and XML. Used Python to interface with the JQuery UI and manage the storage and deletion of content.  Generated server side PL/SQL scripts for data manipulation and validation and materialized views for remote instances.  Created controller Servlets for handling HTTP requests from JSP pages.  Developed technical specifications for various back end modules from business requirements and specifications are done according to standard specification formats.  Designed and developed DAO layer with Hibernate3.0 standards, to access data from IBM DB2 database through JPA layer creating Object-Relational Mappings and writing PL/SQL procedures and functions.  Integrating spring injections for DAOs to achieve Inversion of Control, updating Spring Configurations for managing Java objects using callbacks.  Designed & coded Presentation JSP's with Struts tag libraries for Creating Product Service Components (Health Care Codes) using RAD.  Involved in creating Action classes, Java Beans, Service layers, Business delegates to implement business logic. Environment: Java, JSP, Spring 3.0, POJO's, Hibernate 3.0, XML, Web services, HTML5, JSF, CSS, JavaScript, Apache Tomcat, MAVEN, Log4j, Oracle, CVS, Agile, Eclipse, Junit, JQuery, JAXB, Design Patterns, REST, HP Quality Center CGI Federal (CMS), Fairfax, VA                               \t                                                                    May 13–Feb 14 Java/J2EE Developer  Responsibilities:  Involved in the Requirements gathering & Analysis from the business team. Developed various UML diagrams like use cases, class diagrams, interaction diagrams (sequence and collaboration) and activity diagrams. Worked on two User interfaces with Spring and Struts Frameworks. Developed business layer using Spring, Hibernate and DAO s. Worked on developing Spring related backend services Extensively involved in developing Action Servlet, Action, Form Bean, Java Bean classes for implementing business logic for the Struts Framework. Involved in developing Server-side EJB components and wrote session beans to perform the business logic. Generated the Model part of MVC with Spring and Hibernate Framework. Designed and developed RESTful service interface using Spring MVC to the underlying customer event API.  Developed user interfaces using JSP, HTML and CSS and tiles framework. Implemented Angular JS custom directives from validations, routing mechanism using ng-route module. Worked in Operations and maintenance team to handle tickets coming from user-base. Used JavaScript and struts validation framework for performing front end validations. Consumed RESTful Web services provided by different vendor to use for Address verification and validation. Ran SQL scripts in the back-end Production Database to resolve the issues. Experience in analyzing code, finding the root cause by debugging the code. Extensively used Struts framework as the Controller to handle subsequent client requests and invoke the Model based upon user requests. Jersey implementation of JAX-RS is utilized to develop RESTful service. Implemented Test cases using JUnit and Tested web services with REST Client. Developed code for interaction between struts framework and EJBs and process the input data coming from struts framework. Prepared SQL/PL-SQL scripts and Stored Procedures required to implement design and get it fine-tuned from DBAs if needed Perform Unit testing and Support system testing to resolve any defects raised during test cycle. Used various Java, J2EEdesign patterns like Factory, Singleton, Data Access Object (DAO), Data Transfer Object (DTO), etc. Oversaw all aspects of testing including Unit, System, Regression, UAT, end to end and Stress testing. Creating XML using JAXB in from java objects Used Spring AOP module to handle transaction management services for objects. Involved in Daily Scrum Meetings and production issues status calls. Develop DAO design pattern for hiding the access to data source objects. Environment:  Java, RAD7.0, JSP, HTML, CSS, XML, JavaScript, AJAX, Struts2.1, SVN, IBM WebSphere 7.0, Oracle9i/10g, Oracle Right Now Tool, JIRA, Tiles framework, Restful Web services. Experian, Costa Mesa, CA\t\t\t\t\t\t                        June’12 to Feb’13 Java Developer Description: Experian is a credit reporting bureau which offers different benefits and membership. This application enrolls a customer and offers different benefits and membership plan for credit scores. It sends alerts and reports of the credit score or any fraud. Responsibilities: Involved in the analysis & design of the application. Worked in agile development environment with the test driven development approach. Implemented web service integration components from SOA using SOAP, WSDL and RESTful web services. Developed the controller servlet to handle the requests and responses.  Designed and developed JSP pages using spring framework.  Involved in writing client side validations using JavaScript. Implemented the back-end functionality of the modules using Session beans and Entitybeans and used DAO, DTO, Business Delegate, J2EE design patterns. Developed User Interfaces using HTML, CSS and client-side validations using JavaScript.  Used AJAX for retrieving datadynamically into the client pages.  Used Web services (SOAP) for transmission of large blocks of XML data over HTTP.  Created Spring Interceptors to validate web service requests and enables notifications.  Wrote Hibernate configuration file, Hibernate mapping files and defined persistence classes to persist the data into MS SQL.  Configured Hibernate session factory to integrate Hibernate with spring.  Involved in the design of the Referential Data Service module to interface with various databases using JDBC. Implemented unit tests and code reviews using Junit. Used Hibernate framework to persist the employee work hours to the database.  Involved in designing test plans, test cases and overall Unit testing of the system.  Prepared documentation and participated in preparing user’s manual for the application.  Environment: J2EE, Java, JSP, Spring MVC 3.x, Hibernate 3.0, JBoss, HTML, CSS, AJAX, JavaScript, SOA, SOAP, RESTful, JDBC, MS SQL, Eclipse 3.7, Junit, CVS, Log4j. Allianz Life Insurance Company of North America, Murray Hills, NJ                                Sep ‘10 – May ‘12 Java Developer Project\t: ALIP Client Delivery Description: ALIP – Accenture Life Insurance Platform.                            Responsibilities: Ported CCL performance changes and CCE –reconnect changes from one client to another.  Implemented porting in two stages using maven, svn- branching, tags, svn-diff, core java, spring, processors, Oracle –SQLs, code reusability. Implemented XSL refactoring and simplified the effort on part of client to modify all static data mapping from database using generic template, XSLT, XML, Xpath, XML editors and database. Fixed requirement submit issue broken by recent change on application submit functionality  Ported Contract Aggregation and Policy centric changes radically changing the way aggregated contracts are handled and CVQ is run. This included 100 files. Prepared design and technical specification documentation. Environment: Java 6, JSP, JavaScript, Ajax – Jquery, XML, Xpath, XSLT, EJB3, Spring, Spring Integration, Groovy, apache tomcat7, WebSphere 7, Eclipse, SQL Server 2010, SVN, apache maven7.x,  SOAP webservices, Junit."}