{"text": "Name: annie annie E-Mail: annie.annie@gmail.com Address: Nanchang, China Github: https://github.com/annie LinkedIn: https://linkedin.com/annie Phone No. 559553740221 SUMMARY •\tTechnically sophisticated project manager and Application Support Lead with solid history of effective system implementation, configuration, deployment and administration.  AREAS OF EXPERTISE  •\tWide range of expertise and success in a technology environment to include requirements gathering, assessment and full life cycle project management.  •\tProven track record for developing, executing, and analyzing qualification, integration, and maintenance plans for diverse systems, applications and domains.  •\tSkilled team leader and trainer with a track record of leading and managing multiple tasks effectively to ensure on target completion of all operations and service deliverables.   •\tExceptional interpersonal and communication strengths for training users, troubleshooting system issues, and ensure complete client satisfaction.  TECHNICAL PROFICIENCIES Application Support: UNIX based applications support, Linux, Solaris, AIX, Shell Scripting, Splunk, ITIL processes Tools: Geneos, Autosys, Service Now, Remedy, Jira, Bugzilla, Concurrent Versions System (CVS), Clear case, StarTeam, WebSphere, WebLogic, Tomcat, Ansible Domain Exposure: Banking, Telecom, Travel  EDUCATION AND TRAINING Bachelor of Engineering, Concentration in Computer Science from Walchand Institute of Technology, Shivaji University, Kolhapur, India Diploma, Electronics & Telecommunication from S.E.S., INSTITUTE, BOMBAY TECHNICAL EDUCATION BOARD, Mumbai, India  PROFESSIONAL EXPERIENCE  Royal Bank of Scotland, Stamford, Connecticut\t\t\t\t\t      September 2010 – Present Project Lead\t\t\t\t\t    Rates Application Support & Maintenance Successfully built and led a team of 25+ team members, both at onsite and offshore.  •\tResponsible for production environment for Fixed Income Rates front office trading systems and middle office applications. •\tInvestigate and take ownership of issues related to the rates derivatives applications stack, and ensure that all issues were brought to resolution. Below is a small sample of the typical issues:  •\tTrade booking, pricing and related feeds to Finance, credit and market risk systems  •\tBatch troubleshooting and streamlining issues  •\tStatic data, market data, credit and market risk feeds  •\tCache and grid engines  •\tUse ITIL best practices to implement, support, and continuously improve various deliverables within the front to back transformation of the rates architecture  •\tPrepare release implementation, rollback plans, and implement releases into the production estate. Perform post-release checks to ensure successful implementation   •\tRaise incidents to notify stakeholders of system or process failures that needs investigation and drive them to resolution  •\tEnsure that testing of all proposed changes are successful and approved prior to implementation to production  •\tUse ITIL best practices to perform root cause analysis ensuring that system or process failures are well understood and follow up in order to prevent them from reoccurring  •\tInvestigated and took ownership of issues related to the rates derivatives applications stack, and ensured that all issues are brought to resolution.   •\tIncorporated the mark-to-market batch within the overall rates architecture. This batch contained approximately 1.5 million live trades within 150 portfolios. The results from the mark-to-market batch fed downstream to finance, market risk, credit risk, and compliance. Ensured that the batch completed within the different SLAs.  •\tUsed JIRA to track and follow up on issues that need fixes, enhancements and integration.  •\tPerformed regression testing on all changes and seek user signoff prior to production release.   Created support tools that help identify production issues and fix them on a proactive basis.  •\tActed as a local subject matter expert on our server and database estate as well as the different intraday and batch feeds  •\tEnvironment: Unix, Sybase, Geneos, Autosys, Service Now  Time Warner Cable, USA \t\t\t\t\t\t             September 2013 – March 2015 Technical Project Manager Application Support & Maintenance Provided technical leadership for incident support, problem management, release and deployment management for Telecom client in billing-mediation and order management domain. Oversaw activities under L1, L2, and L3 support in 24x7 support model. Monitored and ran mediation, rating and provisioning operations while proactively identifying potential issues for proper resolution. Led release and deployment while providing effective team management and billing support. Managed relationships with internal and external stakeholders by ensuring resolution of expectations through regular meetings and reports.  •\tDemonstrated leadership as first point of contact for all client and internal escalations.  •\tProvided superior relationship management by ensuring accuracy of work by respective teams to improve customer confidence level.  •\tManaged effective utilization of team members while identifying and implementing automation of tools and scripts to successfully deliver SLA.  •\tEnvironment: Unix, Fusion Works, WebLogic 10, Oracle 11g, Java   Belgacom, Belgium \t\t\t\t\t\t\t            September 2010 – August 2013 Technical Project Lead Application Support & Maintenance Led all aspects of incident and problem management in order fulfilment domain in a Level 2, 24-7 support environment. Supervised technical activities covering preventive and proactive maintenance. Managed risks and issues by delivering thorough assessment and prioritization and mapping incidents to the KM artefacts for better categorization and RCA. Conducted regular team sessions for building knowledge and maintaining knowledge management portal. Developed and maintained relationship with technology partners to enhance/build new capabilities while being accountable for project management activities including estimation, invoicing, billing, and vendor management.  •\tSaved customer costs by suggesting various cost-effective solutions resulting in repeat and referral business.  •\tImproved overall processes by establishing and continuously developing standards and best practices.  •\tLed problem resolution during critical situations and managed improvements plans though focused review of delivery.  •\tEnvironment: Linux, Amdocs, WebLogic 9, Oracle 10g, Java and Subversion  TECH MAHINDRA, Pune, India   \t\t\t\t\t\t\t     August 2008 – August 2010 Application Support Consultant Delivered an exceptional level of technical leadership by managing a team in providing application and operational support for the primary BT line of business including Open reach, Wholesale and Retail. Coordinated with Component/System Teams involving over 60 upstream systems and over 20 critical backend systems. Controlled processes for change management, incident management and problem resolution while monitoring servers running on WebLogic, Cyclone Load Balancer and Oracle ensuring optimum performance. Planned new releases and coordinated deployments in production and improved automation for error analysis and alerts. Managed project financials including billing and project estimations.   •\tEnsured process improvement for operational teams towards better customer experience while partnering with vendors for continuous improvement of application.  •\tProvided detailed documentation to leadership resulting in reduction resolution time.  •\tAssisted talent acquisition and skills management through continuous training and evaluation.  •\tEnvironment: Unix, WebLogic 9/8.1, Oracle 10G/9I, Java, Subversion  Perot Systems, Noida, India   \t\t\t\t\t\t\t    November 2006 – July 2008 Onsite Project Lead – Liberata, London, UK Unix & Application Support Provided project management and technical support leadership for primary financial services applications of Amarta, Liberata Human Resources and Payroll. Monitored servers running on Oracle and Informix databases ensuring optimal performance while managing tuning kernel parameters and disk space management. Supported Veritas NetBackup, automation of various tasks and oversaw the installation and upgrading of operating systems software on HP-UX, AIX. Offered configuration management support for developers while performing restores for developers, testers and production support.   •\tWrote and implemented system security and audit policies and procedures in support of SAS70 and SOX.  •\tContributed to cost reduction efforts and improved productivity by creating new test environments and ensuring superior performance of subsystem.  ADDITIONAL EXPERIENCE WITH PEROT SYSTEMS  •\tOnsite Software Configuration Manager, Travelocity.com, Dallas, TX, USA  •\tUNIX Application Integrator, Union Bank of Switzerland, Zurich, Switzerland   •\tEnvironment: Unix, Oracle 10G, Informix, Java and CM Synergy "}