{"text": "Name: marie marie E-Mail: marie.marie@gmail.com Address: Singapore, Singapore Github: https://github.com/marie LinkedIn: https://linkedin.com/marie Phone No. 1477361289   ● Over 7 years of extensive experience in Analyzing, Designing and Implementation of QA testing strategy for Web based andClient/Server applications using Manual testing and Automation Testing Selenium of client-server applications in back end testing. ●  Expert in developing Java Selenium Web Driver/RC/IDE/GRID test scripts using Java, JavaScript and Test Frame works using Testing/ Junit, ANT/MAVEN build tools. ● Performed Cross-browser testing by using Selenium Grid on multiple browsers and on different platforms. ● Proficient in Appium tool, for mobile testing in Android, IOS and other mobile applications. ●Extensively worked on data warehousing and decision support systems with relational databases such as Oracle design and database development using SQL, PL/SQL, SQL PLUS and TOAD. ● Involved in ETL Testing (Data is extracted from flat files, multiple databases and transferred to target database). Validated the data as per the Mapping Documents. ● Experienced in continuous integration using JENKINS to support tools likes CVS subversion, GIT and execute Apache ANT and apache Maven. ● Extensive knowledge in Protractor framework for Applications developed with Angular JS. ●Excellent working experience of Software Development Life Cycle (SDLC), Software Testing Life Cycle (STLC) and testing methodologies like Waterfall & Agile/Scrum. ● Extensive experience in writing and implementation of complex test plans, design, development and execution of test scripts for system, integration, user acceptance test (UAT) and regression testing. ● Experience in Web debugging tools like XPath, Fire path, and Firebug and also provided efficient locators for strategies like Xpath and CSS to run web driven scripts. ● Developed test scripts with Ruby-Selenium to automate browser & web applications under Cucumber (BDD) Framework. ● Hands on experience in test driven development (TDD), Behavior driven development(BDD) and acceptance test driven development (ATDD) approaches. ●Developed an automated scripts and frame works using Python, Java, C#, VB Script. ●Worked on source version control tools such as Subversion (SVN), TFS and Git. ● Proficient in using Quality Center, POS, Rally, JIRA, Clear Quest, Bugzilla. ● Knowledge on Automated Web Services using Soap UI, REST with knowledge of WSDL, RESTful, UDDI, eclipse. ●  Expertise in setting up and carrying out browser compatibility testing environment with different browsers and versions of Internet Explorer, Mozilla Firefox, Google chrome on different OS like windows and MAC. ●  Extensive experience in developing .Net framework [ ] applications using C#, MVC 4.0, ASP.NET, ADO.NET, VB.Net, WSDL, Web forms, and AJAX. ●Coded many helper and Utility classes in Java. Used Java Log4j logging framework for logging and debugging. ● Expertise in Smoke testing, black-box testing, white-box, Integration testing, Database testing, regression testing and GUI software testing. ● Good knowledge of UNIX/Linux shell commands to tail the logs, adding users, starting services from the shell, settings aliases to frequently used commands, creating users and settings file system permissions.   TECHNICAL SKILLS  Testing Tools  Selenium Web Driver/IDE/GRID, Mercury QTP, HP Quality Centre, JUnit, Cucumber, Firebug, Fire Path, TestNG, JXL, SOAPUI,Coded UI, Manual Testing, Appium (Mobile Testing), log4j,Jmeter,HP Load Runner, Visual Studio Frameworks Junit, TestNG, TDD, BDD, Mockito, Protractor, Maven, Python, POM, Modular Framework BugTracking Tools HP Quality Centre (9, 10, 11.0), Bugzilla, Visual Studio TFS (2008, 2010, 2012), JIRA, ALM QC, TestDiector, Test Link Build CI Tools ANT, MAVEN, JUNKINS, HUDSON SOA Technologies SOAP, REST, WSDL, UDDI, Web Services, SOAP UI Web development HTML, VB Scripts, XML, CSS, Flash, JavaScript, Ruby, Perl, Python. Operating Systems Windows NT, Windows 2000 Server, Solaris, HP Unix, LINUX, Citrix Databases Technologies MS SQL Server OLAP and OLTP, Oracle 9i/10g, MS Access 2000, TSQL, Oracle PL/SQL, SQL*Plus, TOAD, SQL*Plus, SQL*Loader, MYSQL Platforms Windows 7/Vista/XP, UNIX, Linux Language/ Script Java, JavaScript, Ruby, VBScript(UFT), C, C#, Python, HTML, XML , SQL ,Perl, VB script Firefox Add-ons XPath, Firebug Methodologies Agile(Scrum), Waterfall, TDD Version Control CVN, Git Repository System GitHub, Subversion, Tortoise SVN   Work Experience  Automation tester UHG-OPTUM-Atlanta GA\t\t\t\t\t                                Feb 2018-Present • Extensively involved in all stages of testing life cycle, Test Driven Development methodologies, Software Development Life cycle (SDLC) using Waterfall, Agile methodologies. \n• Developed test code in Java language using Eclipse, Web Driver and TestNG framework. \n• Developed Groovy scripts to test Report application output and used Groovy Script to customize test. \n• Configured Selenium Web Driver, TestNG, Maven tool and created selenium automation scripts in java using Test NG prior to agile release. \n• Involved in Mobile Testing includes App Testing. Test automation for web application using Cucumber \n• Used Oracle Applications like RPM, RDF for Expanding portfolio in and across different states. \n• Performed Data Analysis and developed Data Mapping documents for Reporting projects by using several data analysis in software's. \n• Enhanced JDE application depending on user request and pull the data from User defined format and update JDE files. Developed a batch application to pull the data from Excel and update JDE files. \n• Responsible for estimating required resource and components for SOA testing. \n• Involved in Designing & developing data driven framework using Selenium Web Driver, Testing and implemented Java Mail to send the regression result automatically. \n• Worked on Selenium GUI Object / element verification is done through XPath, CSS Locators. \n• Used TestNG Annotations in Selenium Web Driver and executed a batch of tests as testing suite. \n• In Automation environment various scripts based upon Ruby and Shell scripting are used for test cases involved. \n• Involved in validating functional, Integration and Regression test suites using Selenium, Cucumber and the request and response of the Web Services (SOA) through SOAP UI. \n• Used Java for SQL connection to database. \n• Used Firebug to do web based testing with selenium for the commands and locator application. \n• As part of UAT and Integration various test tools like Cucumber and selenium are used as in the part of Quality Assurance and Automated test environment. \n• Experienced in load and performance testing tool JMeter. \n• Expertise in performing manual testing & Mobile Application Testing using Appium. \n• Expertise of testing the application developed using various mobile technologies including J2ME, Blackberry, Android, Symbian, .Net Technology etc. \n• Used SOAP UI tool to test SOA based architecture application to test SOAP services and REST API. \n• Involved in executing SQL queries and PL/SQL procedures, functions and packages for backend testing. \n• Develop and maintain automation test scripts for client -server and web based applications using Python, Silk and other automation tools. \nEnvironment: Java, Selenium Web Driver, TestNG, Maven, Python, Jenkins, SOUPUI, TDD, Agile, HTML, XML, XPath, Rally, Web Services (SOAP & RESTFUL) JavaScript, Quality Centre, Firebug, SQL, PLSQL, Win SCP, SQL Navigator, JMeter, Appium, Windows. QA Analyst Common Wealth of MA -Boston MA \t\t\t\t\tDecember 2015 to Jan 2018 Responsibilities:  • Experience building automation framework from scratch using Selenium webdriver, JAVA, Junit and Eclipse. • Worked on Agile/Scrum Methodology involved in giving points to User Stories, Back log grooming, User story demos, attended retrospective meetings and worked on Iterations (Sprints) part of releases. • Good experience on Test Automation using Selenium Web Driver, TestNG Framework and Maven. • Experience in Functional Testing, Data Driven Testing, Load Testing and Validating WSDL using SOAPUI. • Utilized role in mobile testing using Appium Mobile for testing client's m platforms • Implemented open source tool Appium, Selenium Web Driver for cross browser and cross platform web/Mobile testing. • Expertise in using UIAutomator viewer in Appium to inspect elements in mobile applications. • Involved in Compatibility Testing and focused on the functionality of test plans for both web browsers and mobile devices. • Created and executed SOAP UI Scripts for the Web Services testing • Used Agile methodology to ensure the new features meet the customer requirements and acceptable quality assurancestandards. • Experience with Test Automation tools such as Selenium, TestNG, Jmeter, Junit. • Experience in creating Cucumber BDD (behavior-driven development) framework and automating BDD scenarios in Eclipse using Java script. • Written Gherkins and Java scripting automation test scripts to execute in cucumber. • Implemented Page Object Model Automation framework with Java, Selenium Web Driver and cucumber. • Performed browser compatibility and configuration testing on various operating systems such as Blackberry OS, Android OS, iOS etc. • Developed and executed tests that ensure application meets business requirements and system goals, fulfill end-user requirements and identify existing or potential issues. • Worked with three mobile application simultaneously: iOS (iPhone & iPad) and Android. • Web Service testing (RESTful API) and Automation using Apache JMeter using JSON, XML payloads. • Install and configure System Administration packages to QA environment such as Python, and SQL. • Used Python for dynamically generating property list for every application. Automated data movements using python scripts.Creating core python API which will be using among all modules. • Generated Python Django forms to record data of online users and used PyTest for writing test cases.Developed and Consumed RESTful APIs for web applications using Python and Django. • Tested the workflow through the front end to backend using SQL queries to ensure data completeness, integrity and accuracy. • Wrote Automation scripts using PhandomJS driver to run the tests on headless browsers for automating order placement and account management scenarios. • Excellent experience of build tools like Maven and managing JAVA automation projects using them • Configure the JIRA workflow for the project for improvement processes for screens, workflow procedures and reports of applications as per business requirement • Identifying, analyzing and documenting all the bugs observed during testing and create a ticket in the Jira. • Responsible for developing the scripts to support Jenkins (Continuous Integration) of the scripts with the build server Environment: Java, Selenium WebDriver, Appium, Eclipse, Test NG, SOAPUI, Cucumber, Maven, Jenkins, JMeter, Python, Phandom JS, Django, HTML, XML, Agile, JIRA, ERP, SQL, and Windows   Senior QA Automation tester Bank of texas - Houston, TX \t\t\t\t\tAugust 2014 to November 2015 Responsibilities:  • Prepared automation test scripts to validate various functionalities using Selenium WebDriver using Java. • Experienced in designing customized Hybrid framework, Keyword Driven, Data Driven & POM in order to make maintenance process easier and achieve efficiency, re-usability and accuracy across applications. • Expertise in designing, developing, deploying and supporting of Service Virtualization using CA LISA DevTest • Implemented open source tool Appium, Selenium Web Driver for cross browser and cross platform web/Mobile testing. • Experience with working in short sprints in an Agile Scrum software development model. • Maintained the Selenium & Java Automation Code and resources in source controls like Jenkins for improvements and new features. • Document software defects, and bug tracking using HP ALM QC, and report defects to software developers. • Created web UI tests using Cucumber, Gherkin, Selenium WebDriver (tests written in ruby) • Work with Teams to create Acceptance Test Driven development (ATDD) test suite using Ruby and Cucumber. • Coordinated efforts between product development teams and offshore enterprise test team. Standardized QA standards and practices across teams where possible. Involve in BDD framework using cucumber • Developed test plan, test cases, execution of test cases, reporting, tracking defect using HP Quality Center/ALM. • Usage of Ruby, cucumber in project to create and validate the test cases. • The entire Ruby scripting done using Cucumber framework Wrote and executed SQL queries to verify the data updates to various tables and ensure data integrity. • Utilized SVN repository in order to perform efficient remote team working. Checked in all tested PL/SQL code in SVN and maintaining versions of PL/SQL codes. • Experienced in integrating server side java code with UI components using JSON, XML and used AJAX & JSON communication against RESTful web services. • Developed automation framework and scripts for End to End (e2e) testing using Selenium WebDriver and JavaScript • Involved in Installing Jenkins on a Linux machine and created a master and slave configuration to implement multiple parallel builds through a build farm. • Used JDBC to invoke Stored Procedures and database connectivity to Oracle. • Written several SQL queries and analyzed them to validate the business rules in Oracle database through SQL Developer as part of Backend testing.  Environment: Selenium Web driver, Hybrid Framework, ATTD, CA LISA, HP ALM QC, TestNG, POM, JIRA, Cucumber, Jenkins, SOAP and REST, JSON, XML, Appium, Oracle , SQL, SVN, PL/SQL   QA Automation/Selenium Tester JPMorgan Chase - Wilmington, DE\t\t\t\t\t March2013 to July 2014  Responsibilities:  • Analyzed Functional Specifications Documents (FSD). Reviewed the Business Requirement documents with the business anddevelopment team to understand the architecture and functionality of the application • Prepared Test Plan and Test Scripts for various applications in the Credit Card Portfolio.Performed TSYS-TS2 Mainframe testing to test functionality • Conducted different rewards testing program for the credit card applications such as: Cash Back rewards, Circle rewards, Air rewards, and SKI rewards • Created general-purpose rules engine used to process logic for HTTP redirection service as well as XPath-based XML parsing engine powering extensible software/firmware upgrade service. • Performed System Testing on CORE FCS Totals Management. FCS Operations delivers total management solutions to assist card members with Accounting totals in meeting their financial challenges, while minimizing credit losses for the business • Executed SQL statements to validate the data with data packets Part of Data preparation.Involved in creating New Accounts, Minimum Payment, Fees, Finance Charges and Posted Transactions in TS2. Data conditioning of accounts on TSYS based on the status codes, reason codes, current balance, transactions and statements • Attended meetings and walkthroughs to work with Managers and Business Support Group • Raised defects and performed tracking using JIRA. Created automated functional scripts for the report generation module using Selenium RC. • Verified the defects assigned, prioritizing defects depending on the complexity, targeting the bugs to be solved for the release Environment: Test Director 7.6, Quality Center 10.0, JAVA, SQL, JIRA, Win Runner 8.0, Window 8.0, IBM Rational Quality Manager, Selenium WebDriver, InternetExplorer , XPath, SQL, Selenium RC, Java. QA Tester Devon Bank - Chicago, IL \t\t\t\t\t\tFeb2011 to Feb 2013 Responsibilities:  ● Hands on experience in test automation tools such as HPQTP (Functional Tester) 10/11 and Selenium. ●   Proven expertise in creation and maintenance of Hybrid QTP framework (combination of Data Driven and Keyword Driven automation approaches). ● Experience using QTP VBScript utilizing both static and dynamic descriptive programming. ●   Integrated QTP and Sikuli with Photon 2.0 to run Atomic actions. ● Develop and Build Automation Framework from scratch using WebDriver, Eclipse, TestNG and Java in Windows platform to cut down regression testing time. ●   Experience in performance of Build Validation and Verification, Positive and Negative, Boundary Values Analysis,Equivalent Classes partitioning, Smoke (Sanity), Functional, Integration, Regression, Ad-hoc (Exploratory), Cross-Browser, UI and UAT. ●   Proficient in multiplatform (Windows, Linux, MacOS) and cross browser testing (IE, Firefox, Chrome, Safari, Opera) as well as Mobile testing on different devices (Android, iOS, Windows Phone). Participation in creation of test plans, Creating test cases & bug reports. ● Used Protractor to avoid sleeps and waits in testing. ●   Expertise in Selenium RC for testing different browsers, Selenium Grid for checking instance of server and Selenium IDE for record and playback. ● Developed Python scripts to test functionality. ● Managed and executed test cases and logged defects in defect reporting tool using HP Quality Center. ●   Proven experience using test management and defect tracking systems such as HP Quality Center (ALM), Jira, Bugzilla. ●   Extensive experience in software development methodologies like V-model, agile, Iterative and Waterfall Methodologies.  mplemented Framework for Selenium scripts. ●   Strong understanding of SDLC as well as Software Testing Life Cycle. ● Integration with service engine using SOAP based web services using Apache CXF.Working knowledge of Java Web Services with real time knowledge using SOAP and REST. ● Solid SQL skills, can write complex SQL queries; functions, triggers and stored procedures for Backend testing and End-2-End testing. Environment: Quality Center, Oracle, Java Script, Ajax, UNIX, Windows, Selenium WebDriver, Web services, Cucumber, Eclipse, Java, VBScript, python, TFS, HTML, XML, Selenium IDE/RC/Grid, JUnit, Win Runner, LoadRunner, QuickTestPro, WebLogic, TestNG, HTML, CSS, AJAX, MySQL, JMETER, JIRA  "}