{"text": "Name: maggie maggie E-Mail: maggie.maggie@gmail.com Address: Allahābād, India Github: https://github.com/maggie LinkedIn: https://linkedin.com/maggie Phone No. 821830623193 Profile Summary: 5+ yearsof experience as a Business System Analyst inHealthcareInsurancedomainwith excellent analytical ,communication, decision-making and interpersonal skills, always willing to work in challenging and cross platform environment. Well versed with all phases of Software Development Life Cycle (SDLC) including but not limited to the various concepts such as Requirement Gathering. Proficient in Requirement Management, including gathering, analyzing, detailing and tracking requirements. Extensive knowledge of SDLCmethodologies like Agile (Scrum, RUP),Waterfall Incrementaland, Rapid Application Development(RAD). Extensive experience in gathering Functional user requirements, creating Use Cases and creating functional Requirement Document(FRD) as per user requirements in addition to creating Business Requirements Document (BRD). Experience in working with product backlogs, sprint backlogs along with creating user stories and prioritizing user storiesandkeeping track ofburn down charts. Excellent skills in Unified Modeling Language (UML) diagrams, such as Use case, Use Case diagrams, Process Flow,Activity diagrams, Class diagrams, and Sequence diagrams. Well versed with ICD-9, ICD-10, HIPAA 4010-5010, EDI(Electronic data interchange) transactions such as 835, 837I, 837P, 276/277, 278, and 270/271, Medicare & Medicaid, claim processing from point of entry to finalizing, claim review, identifying claims processing problems, their source and providing alternative solutions. Knowledge in the ETL (Extract, Transform and Load) of data into a data ware house/date mart and Business Intelligence (BI) tools like Business Objects Modules (Reporter, Supervisor, Designer, and Web Intelligence) , experience in using RDBMS databases like SQL , Oracle extensively. Experienced in conducting Joint Application Development(JAD) and white board sessions with Business Usersand Tech Leadto obtain domain level information of project by Requirement Management Methodology. Expertise in working closely with UI Team to develop Wire Framefor the desired look and feel.Quality assurance center assisting experience in creating test script and Unit Testing, experienced in Test Driven Development (TDD) cycle. GOAL: Analytical, dynamic team player poised to leverage professional and educational experience to launch successful as a Business Analyst or Strategic Planner for a company seeking diligent worker committed to supporting corporate missions and objectives. Technical skills: PROFESSIONAL EXPERIENCE : Genesis Healthcare, Kennett Square PA\t\t\t\t\t     Jan 2013 to Current  Business System Analyst  The scope of the project at Genesisincorporated the conversion of Business processes to be compliant with HIPAA 5010 standards.  The Healthcare Web Portal product will offer an ability to provide a consistent look and feel to the customer's existing Web presence so that the customer can offer visually seamless transitions from their existing portal to the portal product. Also, the next phase of project aimed at regulatory change of ICD 9 to ICD 10. HIPAA requires that all health insurance payers in US to comply with EDI standards for health care as established by the Secretary of Health and Human Services. Version of the ANSI ASC X12 837/835 transaction set was subjected to change as the HIPAA mandated format for electronic enrollment and disenrollmentalong with payments in claims system. Utilized Agile Software Methodology using Scrum framework. Actively participated in creating the user stories and prioritizing user stories along with tracking of burn up, burn down charts to estimate sprint delivery. Facilitated JAD sessions, user meetings, interviews and Requirement Elicitation Sessions to extract business requirements and to confirm that those requirements are in alignment with up gradation of existing system to HIPAA 5010. Involved in creating sample mappings for the conversion of EDI X12 transactions code sets - version 4010 to 5010 and translation of ICD 9 codes into ICD 10 codes. Worked on HIPAA ANSI X-12, EDI series such as 835/837 for enrollment and disenrollment in plans. Conducted GAP analysis to identify and document gaps between existing 4010 compliant system and proposed 5010 compliant system. Created User stories for 835-837 EDI transactions using Epic and acceptance criteria, prioritized user stories from product backlog with development teamand maintained the burn down chart. Worked along with development team to make sure of 5010 changes implementations while keeping testing team in confidence to have matching Test Cases to user stories. Established questionnaires and resource leveling required for implementing HIPAA 5010 and upgrading ICD-    9 diagnosis codes to ICD-10 codes. Involved in data warehousing projects dealing with ETL (extraction, transformation, loading) using various databases. Involved in analyzing requirements for data migration, data reconciliation, mapping rules, staging rules and transformation rules for the ETL processes. Worked closely with the Enterprise Data Warehouse team and Business Intelligence Architecture team to understand repository objects that support the business requirement and process. Performed workflow analysis toward automated disability claims process. Understanding XML request sent in for provider portal, assisting development team to validate XML request for web service call. Environment: Rational Requisite Pro, SharePoint, ETL,Rational Clear Case, UML,MS Project 2000,Quality Assurance, MS Office (Excel, Word), Agile , Test Driven Development (TDD ) cycle Independent Health Association Inc., NYMay 2012 – Dec 2012\t Business System Analyst Independent Health Association offers services to HMO, PPO, Medicare and Medicaid programs, and coverage for specialty services such as workers’ compensation and behavioral health care. The scope of the project intended to comply with HIPAA 5010 standards for web based application. It required the analysis of EDI transactions 837P, 837I and 835 based on HIPAA 4010 and mapping them in order to comply with HIPAA 5010 standards and also worked as a support of Member/Subscriber modules. Participated inWhite board sessionswith business owners and other relevant system stakeholders. Facilitate iteration planning, lead work within individual sprints, and coordinate retrospectives and demos.  Developed plan for data feeds and data mappings for integration between various systems,  IncludingXML, to follow ICD code set and ANSI X12 5010 formats. Ensure cross functional coordination (analysts, developers, and testers) is occurring early and often. Lead daily stand-ups, resolve conflict, and are “un-blocker” for team.  Utilized Agile Software Methodology using Scrum framework. Actively participated in creating the user stories, prioritizing user stories and setting the acceptance criteria and most importantly maintaining the Product Backlog. Involved in performance testing of Medicaid client server claims processing system, Medicaid MCC / MCO and Medicaid Management Information System (MMIS) Assisted in Healthcare ICD-10 HIPAA Gateway and 5010 transactions and migration. Participated in LEAN events and facilitated the meetings for identifying quality problems to ensure smooth flow. Analyzed CMS comparison documentation highlighting changes of 4010 format and ICD 10 diagnosis and procedure codes. Worked as a Data Warehouse consultant in the enhancement of Business Application. Involved with data analysis, data mapping and dimensional modeling experience in decision support systems (data marts) while analyzing change requirements. Worked on Pharmacy Benefit Management (PBM) with the ETLteamto Extract Benefit Plan          Data(BPE) from legacy system to transform the data to create the Benefit Plan Feed(BPF) through business transformation rules and load the data(BPL) to claims system. Environment: MS Visio, Excel, MS office, Rational Rose, ETL, Agile, SQL Server, Informatica. AARP, Washington DC                                    May 2011    –   April 2012 Business System Analyst AARP is nonprofit, nonpartisan membership organization that helps people, 50 and over improves the quality of their lives. I worked on Claims processing module of the Group Approval Process.  The claims processing module incorporated the Receiving and Verification of Claim Forms (837) Claims Enquiry and Response (276/277), Adjudication, Healthcare Claim Remittance/Payment Advice (835) as per HIPAA guidelines. Addressed the changes made to the Medicare program and created requirements mapping to that of the system requirements. As a part of agile implementation, been part of weekly standups,scrum meetings, prioritized user stories based on the requirements gathered from Business, validated those user stories and translated those to development team. Gathered and documented business requirements from SMEs, user groups and vendors via workshops, interviews and surveys. Worked in Healthcare Claims Administration – Healthcare Claims Processing (837/835) includes facility claims and professional claims. Reviewed the data model and reporting requirements for Cognos Reports with the Data warehouse/ETL and Reporting team. Facilitated and managed meeting sessions with committee of SME's from various business areas including Benefits Administration, Health Claims Group, HIPAA Administration, Health Policy and Program Evaluation Team and Data Management Group. Created Functional specifications for the 834 enrollment files with their changed benefits in the Medicare program. Participated in entering, tracking system defects in Rational Clear quest. Submitted change requests and worked with change request records in Clear quest. Involved in Configuration Management, Requirement management and analysis. Provide technical and procedural support for User Acceptance Testing (UAT). Involved in fetching and displaying data using SQL queries to represent report under claims module. Environment: Rational Requisite Pro, Clear Case, MS Visio, MS Project, SQL, Windows 2000, MS Office. HLL Lifecare Limited, Gujarat                     January 2011 - March 2011 Business Analyst HLL work is all about ‘innovating for healthy generations’, with 30 years of consistent quality. HLL Lifecare is the vaccine security of the nation. Its consultancy services and products are part of the global healthcare packages of international agencies. Conducted focused interview sessions and JAD with SMEs, project stake holders and Business users so as to obtain maximum details of requirements and involved in documenting business Requirements. Studied business requirements and conduced User Interviews to identify and document the data discrepancies and their sources as related to Government Contract Compliance (GCC),Government Disclosures, Government Pricing, Customers, Products, Product pricing. Planned and defined system requirements to Wire Frame with Use Case, Use Case Scenario and Use Case Narrative using the UML (Unified Modeling Language) methodologies. Developed thorough Business Requirements Document (BRD) by applying analytical questioning and critical reasoning to business user requirements. Business Process Modeling: Business process improvement and optimization, Document and model business processes, automated workflows and Manage business rules. Careful tracing of business requirements (BRD) ensured that they are aligned with UI from the initial stage itself while substituting legacy systems which were originated through unplanned, stovepipe development with detailed enterprise architecture models.  Proper use of RTM (Requirement traceability matrix) so as to capture all the features of the project. Performed application functionality user acceptance testing(UAT) experience (i.e. front-end application testing) in a controlled testing environment that replicates the end user usability of the application. Discussed and documented post implementation summary with senior management regarding Gaps found during the project. Environment: MS Visio, Excel, MS office, Waterfall Incremental Methodology, SQL Server Cadila PharmaceuticalsLtd, Gujarat\t\tNovember 2009 -December2010 Jr. Business Analyst Cadila Pharmaceuticals Ltd. is an integrated healthcare solutions provider with pharmaceutical product basket. The company focuses on providing high quality, appropriately priced products to its customers.I support the system straight through processing as well as complex work flow for underwriter involvement in quality bind issue. Generating BI reports based on various factors. PhaseI of this project, I was involved in documenting rating requirements for a new business complex scenarios.  In Phase II I was involved in creating and analyzing requirements for To Be system for policy change forms. Understand the business requirements from end users regarding property and causality, and documenting them to translate in software design using agile software Approach. Planned and defined system requirements to Wire Frame with Use Case, Use Case Scenario and Use Case Narrative using the UML (Unified Modeling Language) methodologies. Worked with business team to create Project need, Business scope, Resources to mitigate the risks involved in this project. Documented Requirements for Management Reporting out of Clear Quest using Crystal Reports Derived Business Process modeling based on High level and low level requirements analysis. Documented and maintained Requirements Traceability Matrix (RTM) using Version 1 tool to validate that all requirements have been tested. Maintained all requirements in Share point and also in quality Assurance center for version control and further accessibility. Developed Test plans, Test cases with QA team and helped to develop test scenarios for system testing and performance testing. Data mapping, logical data modeling, created class diagrams and ER diagrams and used queries to filter data within the Oracle database. Environment: MS Office, MS Excel, UML, Version Control, JAD,.net , MS Visio, MS Project, MS Power Point, Share point, Windows XP, Oracle.  Dun and Bradstreet, Chennai, India \t\tJanuary 2009– November2009 Jr. Business Analyst Dun and Bradstreet, Inc. is a public company that licenses the information on business and corporations for use in credit decisions, business to business marketing and supply chain management. The project was to create an online application which gives customized rates and structures to the bank mortgage. The project involved porting the existing client-server application to a web-based application which can be accessed by the brokers and loan officers. This online application also gives the users the ability to use various tools like mortgage qualification, mortgage payment, refinance, debt consolidation and monthly payment calculatorsand generating regulatory reports based on approval/rejection of loan applications. Elicit requirements by employing Information gathering techniques (e.g. Interviews, surveys, Business process analysis, competitive product analysis etc.). Communicated Project Requirements, Business Issues, created Solutions and made recommendations for To Be banking loan application module. Developedbusiness flow diagrams, Use Case diagrams, Activity diagrams, Sequence Diagrams and assisted to define the workflow of accepting the loan process. Defined Functional Requirements and segregated them into high level and low level use cases, activity diagrams using UML.  Actively involved with PM in developing Timelines for Project Delivery and Managed Projects and Resources to successful completion.  Developed the training material for functional and process improvements. Actively participated in User Acceptance Testing while accepting critical criteria to test. Prepared and Reviewed BRD and the Technical Specifications using Quality center. Created User guides and “How To” power point presentations of product features Environment: MS Visio,.Net , Microsoft Excel, MS Power Point, Share point, Windows XP, SQL  EDUCATION Bachelors from B. R. Ambedkar University, Agra Reference’s provided upon request."}