{"text": "Name: alice alice E-Mail: alice.alice@gmail.com Address: Boston, United States Github: https://github.com/alice LinkedIn: https://linkedin.com/alice Phone No. 214011811372 SUMMARY Over 6 years of business analysisexperience on multiple projects and extensively used waterfall and agile/scrum methodologies. As a Business Analyst, facilitated JAD sessions, documented requirements, Project Management and coordination: Enterprise SharePoint Implementations, Service Oriented Architecture (SOA) integration, ERP implementation and web redesign.  Core Competencies  Project Scope and Management Risk and Conflict Management Stakeholder Management and Stakeholders Engagement                                    Requirements Management and User Acceptance Testing Project deliverables such as BRD, Use case, User story, Project charter etc. Waterfall and Agile methodology Technical Skills Snapshot PROFESSIONAL EXPERIENCE Cummins Inc. IN\t\t\t\t\t\t                                  \t\tMar 2014- Nov 2015 SharePoint Business System Analyst Cummins is a global power leader that designs, manufactures, sells and services diesel engines and related technology around the world. The project was focused on migrating the data from legacy platform to share Point 2010/2013. I worked as a senior BA in content management using SharePoint and successfully manage migration of Knowledge exchange system and wiki pages to SharePoint 2010/2013.  Responsibilities: Used Agile software development methodology in defining the problem, gathering requirements, development iterations, business modeling and communicating with the technical team for development of the system. Facilitated the JAD sessions with the system architect, Subject Matter Experts (SMEs) & the project sponsor for fast & effective system requirement development. Created mockups and mapping of the migration sites by using MS Visio and Microsoft excel. Used Rational Rose for creating UML diagrams, Flow charts to illustrate Business Rules and Process Flows required for the BRDs and FRDs. Elicited requirements for development of the users’ GUI, interfacing with various systems Developing and/or reviewing functional and technical designs. Generated a streamlined process to understand the various steps in the SharePoint Migration and desired functionality of the new Platform by interacting with users, management, SMEs, and stakeholders. Identified and defined the opportunities for business process improvement, documented business processes and initiated efforts to make improvements. Facilitated design, installation and configuration of SharePoint 2010 and regular review, clean-up, management and configuration of SharePoint Involved in managing SharePoint administration task such as permissions, upgrade and migration of SharePoint 2010/2013 Helped users with navigation in SharePoint Sites & Portals and documentation of user manuals. Gathered content, designed and tested SharePoint sites by using HTML coding and Dreamweaver Worked closely with PM and negotiated on deadlines as necessary with project owner  Monitored overall server health and functionality on a regular basis and provide report to required audience. Worked with cross functional teams on content management and knowledge management principles and document the requirements. Updated sites by providing content and maintained link integrity based on client requests and objectives. Ensure the moving/copying/redesigning sites according the clients requirement Created test plans, test cases and documentation for SharePoint 2010 Involved in editing and updating web sites using multiple languages, including HTML, XML, and CSS. Analyzed the existing reports of the reporting system in the database. Checked the consistency of the data after ETL process using SQL queries Actively Consult on SharePoint governance, metadata, taxonomy, search, and security. Deployment of SharePoint sites for assigned business units. User SQL queries to extract and validate the data. Assisted in designing Test Plans, Test Scenarios and Test Cases for integration, regression and user acceptance testing (UAT) to improve overall quality of the application. Helped coordinate the testing process by helping the QA team prepare for the testing requirements such as environment, writing instructions, organizing walkthroughs, selecting the test groups, etc.   Environment: SharePoint 2007/2010, InfoPath, UML, SQL , JavaScript, ,HTML, MS Word,CRM, MS Excel, MS PowerPoint, MS Visio, HTML, Dreamweaver, SharePoint designer, XML, SnagIt, JQuery, PL/SQL Developer Eaton Corporation, Pittsburg, PA                 \t\t\t\t\t\t\t    Jan 2013- Jan 2014 SOA Business analyst Eatonis a multinational power management company, founded in the UnitedStates and based in Ireland, providing solutions to its customers to manage electrical, hydraulic and mechanical power efficiently, safely and sustainably. Worked as Business analyst for middleware team on system enhancement and system integration projects. Responsibilities: Facilitated requirement gathering sessions to integrate Sales Order, Items and Customer Information between Order Capture System (implemented using Oracle ERP) and Order Fulfillment System (implemented using SAP ERP).  Had an extensive interaction with the offshore teams in India and Europe. Conducted meetings and workshop (JAD sessions) with ERP teams and SOA teams for requirement gathering. Prepared Business Requirements document according to ERPs system needs and facilitated meetings for requirement and feasibility analysis. Facilitated requirement gathering session onmessage exchange patterns, Input/output schema (XML), Transformation, routing logic and Volume of data/transactions. Acted as a liaison between business area and development team by working with both parties and translating business requirements to use case specifications. Designed and developed Use Cases. Identified theservice trigger points and security requirements.  Prepared data mapping spreadsheet after analyzing the input and output XML schema Identification of routing logic, data transformation requirement. Managed the Change request process and analyzed the impact of the change requests on the project. Defined the error handling process and how the rollback should happen. Defined the notification for the teams involved in the project and reprocessing of the data. Wrote SQL queries to identify and validate the data sources and worked with the system admin for any issues with database Monitoring test preparation activities and environment readiness. Used the guidelines and artifacts of the Agile (Scrum) and laid emphasis on rapid development during the sprint cycles. Performed User Acceptance Testing (UAT) on the application before release. Conducted Gap Analysis to determine deltas between existing system and proposed system that would facilitate enhancement. Participated in the bug review meetings, Updated requirement document as per business user feedback and change in functionality of the application. Environment: SOA Suite, SAP, Oracle apps, XML,UML, MS Word, MS Excel, MS PowerPoint, MS Visio, Oracle CareFirst, Owing Mills, MD                                                                                                                          Jul 2011- Dec 2012 Business System Analyst I worked as an agile business analyst and scope of project was to re-design the website to update and improve user experience especially on content management. Responsibilities: Identified and implemented processes for developing and documenting detailed business requirements. Data was collected from end-users and analysts. Assisted business in developing content and training materials; recommended enhancements and identified new business requirements. Facilitated story authoring sessions on video play, images, and animations.  Worked with Business and responsible for migrating the content from CQ5 library to web site. Gathered requirements for business definition and facilitate story grooming sessions with stakeholders to refine functional requirement Participated in daily scrum, sprint planning and sprint retrospectives meetings Assisted in closing gaps for associated Stories in each individual Sprint. Assisted in entering and updating Issues (Epics, Stories, and Tasks) onto JIRA application. Guided the development teams to break down large and complex user stories into simplified versions for execution Tested the user stories for accuracy and compliance to ensure undisputed acceptance and validation of stories Coordinated project initiatives with software developers, stakeholders, project managers and software testers Participated in preparing templates and guidelines to be used by the project team with detailed screen layouts with regards to various types of corporate actions. Involved and coordinated the tests with the QA team to verify implementation of new features and enhancements.   Environment:  MS Visio, WebEx meeting manager, SharePoint, Scrum, SQL, JIRA, HTML, Bright cove Department of Education, Washington DC\t\t\t\t                                                                                                  Oct 2010\t- Jun 2011\t\t\t\t\t\t\t\t SharePoint Business Analyst   ED's mission is to promote student achievement and preparation for global competitiveness by fostering educational excellence and ensuring equal access. The project was to migrate the platform (VKG) from MOSS2007 to SharePoint 2010.The scope of project was    categorization, management, creation, posting of updates and storage of document as KAM (Knowledge Asset Management). Responsibilities: Responsible for studying the existing system and closely interacting with the Clients to analyze the business requirement Facilitated story authoring sessions and documented detailed user story Actively involved in Business Analysis and Business Solutions process Documents the detailed user story in JIRA Perform gap analysis between package delivered functionality and client's requirements Collaborate with project team members to present inventive ideas; worked closely with solution architects, sales and account directors as needed Created and maintained the Requirements Traceability Matrix  Ensured Use-Cases were consistent and covered all aspects of the Requirements document. Designed and developed SharePoint themes/templates forbranding. Created Master Pages, Sites and Team sites. Customized portal navigation by using navigation controls Initiated user profiling to manage and implement security model through Active Directory. Customized look and feel of the sites by developing custom master pages. Developed Workflows using the SharePoint designer to automate Request Approval Process. Customized library attributes, search and indexing, involving application of proper security permissions for the different departments Document SharePoint policies, procedures and governance policies. Manage content review, approval, and publishing Performed functional and user acceptance testing with newly created departmental sites and custom web parts Actively involved in troubleshooting issues and resolved appropriately Created process flows for documentation purpose  Used MS Visio to design proposed business process flow Environment: Agile, UAT, SharePoint, HTML, JavaScript, Oracle, Microsoft Project, MS Visio, JIRA, MS office, XML, CSS,SQL American Airways,Fort Worth TX\t                                                                                                            May 2009- Sep 2010\t\t\t\t\t\t\t\t\t Technical Analyst I was primarily involved in migration, development, implementation and maintenance of SharePoint 2007/2010 Responsibilities: Involved in design, installation and configuration of SharePoint 2010. Actively involved in upgrade and migration of SharePoint 2007 to 2010 Performed regular review, clean-up, management and configuration of SharePoint accounts and sites Involved in installation and support of patches and upgrades Managed and designed site collections, implement web part pages and site features Involved in creating and managing backup plan for critical SharePoint data Monitored SharePoint trends like site usage and growth, disk space usage and growth on regular basis Involved in setting up alerts and enforcing policies Designed and implemented minimum to no code solutions using out-of-box SharePoint tools and capabilities Created test plans, test cases and documentation for MOSS 2010. Trained end users and drafted training documents for various clients Incorporated social networking including, Yammer, NewsGator into SharePoint. Configured FAST search in SharePoint 2010 Involved in editing and updating web sites using multiple languages, including HTML, XML, and CSS Trained peers on updating these portals and documented the training material for future reference. Environment: Microsoft Office SharePoint Server 2010, Microsoft Office SharePoint Server 2007, FAST Search for SharePoint, Yammer, SQL, JavaScript, VBScript, HTML, XML, CSS,ASP.net,J2EE, SharePoint Designer 2010, Visual Studio 2010, MS Office, Adobe Photoshop, XMetal EDUCATION Master’s in Business Administration, India"}