{"text": "Name: martha martha E-Mail: martha.martha@gmail.com Address: Huizhou, China Github: https://github.com/martha LinkedIn: https://linkedin.com/martha Phone No. 767477711856 SUMMARY: 7 Years of extensive experience on Build Engineering & Release Management process, includingend-to-end code configuration, building binaries & deployments of artifacts and entire life cycle model inEnterprise Applications. In-depth knowledge of Build and Release management methodologies and production deployment which include Compiling, Packaging, Deploying and Application Configurations. Skilled at Software Development Life Cycles (SDLC) and Agile Programming methodologies. Experienced with enterprise level source control repositories such as Subversion (SVN), IBM Rational ClearCase, CVS, Perforce and Harvest. Experienced in Administering SVN. Good experiencein administering version control systems to create daily backups and checkpoint files. Strong command on source controller concepts such as Branches, Merges and Tags. Expertise in using build tools like Maven and Ant for the building of deployable artifacts such as jar, war,& ear from source code. Great understanding on Ant and Maven with respect to theirTags,Tasks and Targets, dependencies and co-ordinates to write pom.xml and build.xml. Involved in Migration activities from Ant to Maven to enhance the build process. Converted build.xml into pom.xml to build the applications using Maven. Managed the artifacts generated by Maven in the Nexus repository Expertise in querying RDBMS such as Oracle, MySQL and SQL Server by using SQL for data integrity.  Experience in using Nexus and Artifactory Repository Managers for Maven builds. Expert in deploying the code through application servers like WebSphere/WebLogic/Apache Tomcat/JBoss. Extensively worked with automation tools like AnthillPro,Hudson, Jenkins,Build Forge and Bamboo to implement the automation and their configuration. Experience in integrating Unit Tests and Code Quality Analysis Tools like JUnit, Cobertura andFindbugs. Ability to build deployment, build scripts and automated solutions (using scripting languages such as Shell, Perl, JavaScript, AWK). Deployed IOS Mobile binary files to production center. Created Build Id for each specific mobile release using Ant Script for IOS. Maintained IIS webserver during deployments and production for .net applications using SVN as a source control. Created batch files for .net applications to automate the deployments. Deployed html, css, js files for android mobile applications. Deployed applications based on VB script using svn. Worked on clearing Akamai cache and NetScalar server cache in order to get the latest content for mobile applications. Good command in working with Tracking tools JIRA, Remedy, HP Quality Center, Merant Tracker. Experience working with automation tool Puppet. Used Puppet to manage Web Applications, Config Files, Data Base, Commands, Users ,Mount Points, Packages. Managed environments DEV, SIT, QA, UAT and PROD for various releases and designed instance strategies. Experience using RPMs to effectively package the applications for product deployments. Used VMware VSphereandVCenter to create VMs, managed these VMs on various ESX hosts. Strong ability to troubleshoot any issues generated while building, deploying and in production support and documenting the build and release process. Good interpersonal skills, team-working attitude and taking initiatives in solving problems and providing best solutions.  Technical Skills: Work Experience: Client \t: AT&T, Dallas, Texas\t\t\t\t\t\t\t\tFeb 2014- Till date Role\t: Build and Release Engineer Roles and Responsibilities: Provided Configuration Management and Build support for more than 5 different applications, built and deployed to the production and lower environments. Defined and Implemented Configuration Management and Release Management Processes, Policies and Procedures. Analyze and resolve compilation and deployment errors related to code development,branching, merging and building of source code. Created and maintained Subversion repositories, branches and tags. Experience in Administering SVN.  Worked on deploying IOS Mobile binary files to production center. Worked on creating Build Id for each specific mobile release using Ant Script for IOS. Maintained IIS webserver during deployments and production for .net applications using SVN as a source control. Created batch files for .net applications to automate the deployments. Deployed html, css, js files for android mobile applications. Worked on clearing Akamai cache and NetScalar server cache in order to get the latest content for mobile applications. Worked on coordinating for assigning release number for each specific mobile release. Acted as an integrator for performing merge, rebase and baseline operations. Enforced development policies using Subversion hooks and other metadata. Coordinate/assist developers with establishing and applying appropriate branching, labeling/naming conventions using Subversion source control. Developed build and deployment script using ANT, Shell to Setup development and QA environments. Troubleshoot the automation of installing and configuring Java applications in the testing and production environments. Used AnthillPro as Continuous Integration tool. Maintained build related scripts developed in ANT and Shell. Modified build configuration files including Ant build.xml. Work with development, testing, deployment, systems/infrastructure and project teams to ensure continuous operation of build and test systems. Deployed code on WebSphereapplication servers for Production, QA, and Development environments. Performance tuning of WebSphereapplication serverincludingJVM, Garbage Collection, JDBCalong with its server logs. Worked on theDB2 databases to keep all the database tables in every environment in sync. Deployed applications based on VB script using svn. Used Puppet to automate Configuration management. Involved in sprints and planned releases with the team using JIRA and Confluence. Used JIRA tool to track all the defects and changes related to Build and Release Team. Environment: Subversion (SVN), ANT, AnthillPro, DB2,JIRA, Confluence, Shell Scripts,WebSphere Servers. Client\t:Xerox, Dallas, Texas.\t\t\t\t\t\t\t\tJune 2012- Jan 2014 Role\t:\tBuild and Release Engineer Roles and Responsibilities:   Analyzed the ANT build projects for conversion. Converting the ANT build projects to Mavenbuild projects. Developed the Maven build pom.xml scripts. Managed Maven project dependencies by creating parent-child relationships between projects. Integrated the Code Quality Analysis tools like FindBugs, JUnit and Checkstyle into the projects. Build and Administered the Jenkins Continuous Integration servers. Build and Configured Jenkins Slaves for Parallel Job execution. Creating new build jobs, integration testing jobs and deploy jobs in Jenkins to automate the process. Installed and configured the WebLogic application servers for Dev and Integration Test Environments. Built and deployed Java/J2EEartifacts onto theWebLogic Application Servers in an Agile continuous integration process. Experience in installation and configuration of Puppet. Using Perforce version control toolsfor developing multiple applications on Source codes repository. Involved in periodic archiving and storage of the source code for disaster recovery. Developed, maintained, and distributed release notes for each scheduled release. Worked on Oracle10g database. Patched different software using RedHat Package Manager and YUM. Installed certain RPM packages, which were not installed default for Oracle. Installed and configured Apache ANT for automated build processing using RPM. Downloaded latest kernel from YUM server, created repo to make it available for the installation of target servers.  Worked withHP Quality Center for Issue Tracking and monitoring. Worked with the Architects on SDLC process being the owner of post development environments. Coordinated the resources by working closely with Project Managers for the release and carried deployments and builds on various environments using Jenkinscontinuous integration tool. Environment: Perforce, ANT, MAVEN, Jenkins, HP Quality Center WebLogic Application Servers,ORACLE. Client\t: Flagstar bank, Troy, Michigan.\t\t\t\t\t\tJan 2010 - May 2012 Role\t:Build Engineer Roles and Responsibilities:   Responsible for versioning the source code, releasing binary files, creating and applying labels on source files and release files. Led Jenkins continuous integration server installation and configuration for all GIT Repositories. Automated application packaging and deployments. Managed Linuxstaging and testing environments.  Established coding standards and enforced them through automated tools. Implemented Gerrit Code review tool and integrated it with Hudson to trigger builds once the commit is been uploaded to Gerrit dashboard. Configured multiple Windows and Linux Slaves for Jenkins Master to distribute the load across all the machines. Applied the test driven development methodology while developing which yielded cohesive, loosely coupled and tested code. Educated team about continuous integration and automated testing practices and supported them throughout development. Configured Jenkins to implement nightly builds on daily basis and generated change log that includes changes happened from last 24 hours. Integrated Testing Tools like Junit inJUnitwhich provide unit testing and code coverage with detailed graphical reports. Connected continuous integration system with GIT version control repository and continually build as the check-in’s come from the developer. Created multiple Make, ANT, MAVEN, Shell scripts for build automation and deployment. Defined branching and merging strategies. Documented the SCM process and policies of the company and recommended some process changes. Build and maintain SQL scripts and execute different scripts for different environments. Responsible for writing the Release Notes, documenting all the useful info about the release, software versions, changes implemented in current release, Defects fixed, Labels applied. Deployed Java/J2EE applications on to Apache Tomcatapplication servers and configured it to host the wiki website.  Deployed application packages on to Apache Tomcat Sever. Coordinated with software development teams and QA teams on issues and solved the problems. Environment: GIT, IBM Rational ClearQuest, Make, ANT, MAVEN, Shell (bash), Apache Tomcat Application Server, Java/J2EE, Linux, SQL Client: CMC, Hyderabad, India.\t\t\t\t\t\tApr 2009 - Oct 2010 Role   :  Release Engineer Roles and Responsibilities: As a member of Release Engineering group, redefined processes and implemented tools for software builds, patch creation, source control, and release tracking and reporting on UNIX platform.  Build and deployedJ2EE application in JBoss. Assist with maintaining current build systems, developed build scripts, and maintained the source control system. Managed the source codes repository of multiple development applications using CVS and Perforce version control tools. Created analytical matrices reports for release services based on Remedy tickets. Trained offshore team members and responsible for knowledge transfer. Performed weekly and on-call deployments of application codes to production environments. Participated in the Change Control Board Meeting to analyze the risk and plan for the successful Releases. Coordinated application releases with Developers, DBAs, QAs and Project Managers. Environment:Concurrent Versions System (CVS), Perforce, ANT, MAVEN, Jenkins, Remedy, JBoss, UNIX Client : Satyam computer services, Hyderabad, India.                                                     Feb 2008 - Mar 2009 Role   :  Linux Administrator\t\t\t\t\t Roles and Responsibilities: Establishes system by planning and executing the selection, installation, configuration, and testing of web application server hardware, software, LANs and WANs. Maintains optimal system performance with system monitoring, analysis, and performance tuning. Involved in creating new users, groups and setup their home directories and appropriate access restrictions to software in the Active Directory environment and NIS domains. Troubleshoots system hardware, software, networks and operating system. Designs and runs system load/stress testing. Secures system by developing system access, monitoring, and controls. Establishes, tests and documents disaster recovery policies and procedures. Developed build and deployment processes. Developed and maintained integration and release processes. Developed and maintained UNIX/Perl/Ant scripts for build and release tasks. Responsible for building and releasing packages to Dev, Itestand QA Environments. Performing clean builds according to the schedule published for a given releases. Responsible for deleting the old deployed code and deploying the newly built code using Web Sphere IDE (Integrated Development Environment). Releasing code to testing regions or staging areas according to the schedule published. Environment: Red Hat Linux 3/4, Solaris 9, Veritas volume manager, SSH, LVM, SVM, WebSphere Servers"}