{"text": "Name: clara clara E-Mail: clara.clara@gmail.com Address: Baghdad, Iraq Github: https://github.com/clara LinkedIn: https://linkedin.com/clara Phone No. 907918563453 PROFESSIONAL SUMMARY: 7 years of professional expertise as a Business Analyst in Health Care domain, and Software Development Life Cycle (SDLC), including analysis, design, development, testing and implementation of software applications.  Good working experience using Software Development Life Cycle (SDLC) models like Agile and Waterfall. Strong Communication and Presentation Skills substantiated in past assignments with developers, project managers, subject-matter experts, stake holders, system implementers, and application end-users. Successfully involved in transitioning the Organizational Structure and Business Processes from traditional Waterfall to Agile. Created Business Requirement Document (BRD) and Functional Requirement Document (FRD) with utilizing a variety of elicitation techniques including interviews, (Joint Application Development) JAD sessions, and meetings with business users, SMEs and development team. Created Business Requirement Document (BRD) and Functional Requirement Document (FRD) with utilizing a variety of elicitation techniques including interviews, (Joint Application Development) JAD sessions, and meetings with business users, SMEs and development team. Created user stories, use case diagrams and process diagrams based on business requirements. Profound knowledge on Medicare, Medicaid, MMP and Health Insurance. Profound knowledge of FACETS database and CARECOMPASS including the entire provider, claims, members, authorization, and appeals tables. Expertise in using Rational tools for creating Use Cases, Version Control, Defect Tracking, monitoring and extensively used the Agile, Scrum, Rational Unified Process (RUP) methodologies in all areas of the Software Development Life Cycle (SDLC). Extensive Knowledge of ICD 9/ICD 10, HIPAA: Electronic Data Interchange (EDI) Transactions ex. 834, 837, 276, 277 etc.  Performed GAP and Risk analysis of existing system and evaluated benefits of new system.  Wrote Test cases and Conducted different integration and regression testing. Involved with UAT team in User Acceptance Testing. Involved in requirement gathering of the Data Warehouse, ETL testing effort, analyzing business requirements, Data Model Design, Data flow from various Sources to Target. Experience with the full Microsoft BI Stack: SQL Server, SSAS, SSRS, and SSIS and SharePoint Expertise in conducting User Acceptance Testing (UAT) TECHNICAL EXPERTISE: PROFESSIONAL EXPERIENCE: Tauck, Wilton, CT\t\t\t\t\t\t\t\tJan 2018 – Present Business Analyst Description: Tauck is an operator of guided tours and cruises on rivers. Tauck offers more than 100 guided land journeys, small- ship ocean cruises, European river cruises, safaris and family travel experiences in more than 70 countries. As a Business Analyst, I was responsible for reviewing and approving changes to our client's digital ecosystem requirement including their public facing website, customer accounts (\"guest connect and agent connect\"), and other customer facing systems(Payments, Request a Quote, Search Page, Product Pages). Responsibilites: Worked in an Agile Software development methodology. Interfaced well with Project Manager, Team Lead and Business Analyst to understand the business requirements and reviewed User stories. Involved in creating Test Scenario and Test case documents as per specifications Performed Functional, Integration and UAT testing of payment gateway service for different scenarios. Performed GUI testing & functionality testing for front end screens. Involved in positive testing, negative testing, smoke testing, load testing, sanity testing, cross platform testing and cross browser testing. Performed testing on QA environment as well as staging environment for different modules of pages. Executed End to End Test cases, captured results and reported results to management using share file and JIRA Logged the defects in JIRA for the issues encountered during execution. Interacted with developers to report and track bugs using Jira. Retested the open tickets and closed the tickets once the issues are resolved in Jira. Developed the test cases for the features added in the new sprints by reviewing the user stories and executed these test cases once the build is released. Retested the bug fixes in newsprints. Performed testing on LoadRunner in Virtual User Generator, Controller and Analyzer. Created  test scripts to meet load-testing requirements according to the SLA (Service Level Agreement) agreed upon. Performed  automated Functional and Performance Testing using BlazeMeter, JMeter, LoadRunner. Performed Regression testing on each and every sprint, verified new defects was caused by new functionality and production fixes. Designed and executed the automation test scripts using Selenium Web driver (Java) for Regression cases.  Involved in reviewing of Business Requirement Documents, and prepared the Test Plan & Test Strategies, Test Cases. Participated in Sprint planning meetings and discussed the progress made in the previous sprint, then planned for the next sprint with brainstorming for ideas with the team. As a member of the QA team, was involved in the Product backlog refinement meetings with the product owner and provided updates involving the QA testing for user stories. Executed SQL queries to verify the database for the relevant test cases. Participated in daily scrum meetings to discuss the daily testing activities. Participated in defect triage meetings and working sessions by providing information required to triage and resolve issues encountered during testing. Participated in test cases and Sprint reviews with stakeholders. Validated Integrations (requests and responses) between Order Capture System, Payment Gateway and Order Management System using Dev Mariposa System.  Interacted and tested with the business closely during User acceptance testing to get a sign-off on user stories from the business. Provided sign-off on user stories/functionalities after completing end-to-end testing before the product went live in production. Environment: Web Services, SQL Server 2012, JIRA, Selenium Web Driver, HP ALM/QC, Java, LoadRunner, Jmeter, Blazemeter, MS Office Suite, Windows 10, Mariposa Reservation System, Sitecore (QA & Staging), Agile   Affinity Health Plan, Bronx, NY   \t                                                           March 2016- November 2017 Business Analyst Affinity Health Plan is an independent, non-profit managed care plan that serves the needs of over 210,000 residents of the New York Area and provides healthcare coverage through its family health plus, Medicare & Medicaid programs. Affinity Health Plan implemented Facets Enterprise administrative system, a new core system built by Trizetto, with updated technology to allow for more efficient claims processing, membership enrollment and provider data maintenance & getting access to customer records. X12 EDI and HIPAA standards were followed thorough the project. Responsibilities: Worked with a cross functional and diverse team of business users and developers to enable accurate communication of requirements and ensure consensus for BRD and FRD and business docs. Analyzed data and created reports using SQL queries for all issued Action Items. Performed the Gap Analysis to find the existing gap between the HIPAA 4010 and HIPAA 5010 EDI transactions. Facilitated Electronic Data Interchange, Eligibility Data, Electronic Claims,  Payer Billing, Revenue Cycle Management, Electronic Claim Submission, e-Statements, Workflow Automation, Patient Accounts, Billing, Class, Denial, Requests, Adjustments, Corrections, Carrier Reimbursements And Electronic Remittance Payment Posting etc. Resolved technical claim processing, delinquent claim reporting, third party payer compliance etc. Conducted JAD sessions with SME, users and other stakeholders for open and pending issues. Involved in the testing of web portal of New MMIS system Acted as a liaison and conducted meetings, JAD sessions and presentations with the teams Involved in preparing several Use Cases, Business Process Flows, and Activity Diagrams using Microsoft Visio. Extensive skill on BillingCenter, PolicyCenter and Claims Center using Guidewire and Duck Creek tool Involved in the full HIPAA compliance lifecycle from GAP analysis, mapping, implementation, and testing for processing of Eligibility. Worked on HIPAA Standard/EDI standard transactions: 270, 271, 276, 277, 278, 834, 835, and 837 (P.I.D), 997 and 999 to identify key data set elements for designated record set. Interacted with Eligibility, Payments and Enrollment hence analyzing and documenting related business processes. Worked on requirements of the 835 HIPAA projects, 276/277, 278, 837, and HIPAA EDI Transactions across enterprise. Initiated with a comparison report of migration of 4010 to 5010. 270 Eligibility, Coverage or Benefit Inquiry (V4010X092A1) vs. 270 Eligibility, Coverage or Benefit Inquiry (V5010X279), 278 Prior Authorizations.  Assisted in Testing the ANSI X12 Version 4010 / EDI transactions (HIPAA) like 270, 271, 276, 277, 278,820, 837P, 837I, 837D, 835 remittances) Used General Equivalence Mappings (GEM) to convert ICD9 to ICD10. Worked on the existing mainframe system, documented the system requirements and came up with Use Cases from the analysis. Interacted with the Subject Matter Experts (SMEs) and stakeholders, gathering business requirements to get a better understanding of client’s business processes. Wrote Test scenarios and test cases for testing the migration of EDI 4010 to 5010 and the processing of member enrollment and benefits, batch jobs corresponding to the claims (837) and real time transactions like 270/271/276/277. Worked with multiple teams and coordinated with them to do various releases. Involved in forward mapping from ICD9 to ICD10 and backward mapping from ICD10 to ICD9 using General Equivalence Mappings (GEM). Performed Gap Analysis for HIPAA 4010 837P and 835 transactions and HIPAA 5010 837P and 835 transactions. Involved in impact analysis of HIPAA 5010 835 and 837P transaction sets on different systems. Re-engineering and capturing of EDI transactions with legacy systems [Enrollment -834, Eligibility Transaction (270/271), Claims (837), Claim Status Request and Response (276/277), Remittance (835)]. Performed Migration and Validation per SDLC standards. Interacted with the Test Team and reviewed Test Plans and Cases. Assisted in Regression Test, System Test, and UAT. Worked with the business/functional unit to assist in the development, documentation, and analysis of functional and technical requirements within FACETS. Environment: MMIS, UAT, ORACLE, MS SQL Server, MS office, MS Visio, Quality Center, WaterFall, Facets Henry Ford Health System, Detroit, MI                                                          \t\tJan 2015- Feb 2016 Business Analyst  HFHS is one of the prominent health care providers, offering a seamless array of acute, primary, tertiary, quaternary and preventive care backed by excellence in research and education. The main purpose of this assignment was to create an integrated solution to deliver quality health care, enhanced process flows, and increased patient flows to the clinic and give excellent experiences in all services provided. The project worked on HIPAA Claims Processing and ICD 10 readiness.  Responsibilities: Responsible for collecting and analyzing Business Requirements, Process Modeling and preparation of Functional Design Specifications by employing use case scenarios, sequence diagrams. Created use cases, activity diagrams and process diagrams using Microsoft Visio. Gathered requirements for HIPAA 5010 migration. Followed the Business Rules, and ensured that HIPAA compliant Rules are followed to display minimum benefit information that the Provider is required to pass on the EDI transactions. Managed the privacy and security environments of healthcare data that was governed by HIPAAand other government mandates. Validated the EDI 837-claim billing (professional, institutional and dental claims) &835 (remittance advice or payment) claims adjudications. Management of few departmental projects including programming for HEDIS measures for NCQA accreditation through FOCUS and SQL programming. Prepared high level and detailed system requirements documents for the application Analyzed ICD-10 standards for 837 transactions, related to providers, payers, subscribers and other related entities. Authored Business Requirements Document [BRD] with project teams. Extracted, discussed, and refined business requirements from business users and SME’s. Identified the requirements for accommodating ICD-10 standards for 837 transactions and captured these requirements to create BRD. Participated in the walkthroughs and meetings specifically for Claims and Membership modules. Validated the process flow for “AS IS” system and understand where exactly ICD-9 Procedural and Diagnosis Codes are used.  Translated the requirements gathered during interview with SME’s and created process flow diagram based on the requirement captured.  Identified various points of integration among the new and existing applications and required integration with other IT components. Practical experience on claims processing system and different types of claims such as 837I (Institutional), 837P (Professional), 837D (Dental) and Pharmacy Claims (NCPDP D.0. Good experience with FACETS Claims Adjudication. Develop ad-hoc reports on data from the other applications on claims, benefit plan, provider and financials using Business Objects Enterprise XI, Desk Intelligence, SQL Developer, MS Access and Excel, SQL, and Oracle. Extract claims detail including ICD-9, procedure codes, diagnosis codes; member eligibility data for analysis, claim overpayment projects. Validate data analysis and extractions against FACETS front-end system. Manage membership analysis; FACETS claims analysis and ad-hoc reports. Compile SQL Queries to validate the data integration between the various Database tables.  Involved in mapping and validation of different EDI transaction used for claims filing like ANSI X12 837 (I, P, D) for claim submission, ASC X 12 270/271 for the eligibility/benefit inquiry and response, ASC X12 276/277 for the claims status enquiry and response and ASC X12 835 for the healthcare claim payments. Involved in mapping data from different EDI files onto database using different routing transformations. Performed gap analysis for migration of HIPAA transactions from 4010 standard version to 5010 standard version. Work together with the architects and team responsible for supporting rules processing tools during the project to assist with the required support. Work closely with the business team, development team and the Quality Assurance team to ensure that desired functionalities have been achieved by the application Assisted the project with Change requests and held responsible for weekly changes to the applications. Maintained and recorded the ticket numbers for request changes on CR manager tool. Involved in testing Facets Member/Subscriber, Billing, Medical Plan, Dental Plan modules. Provide business and technical suggestions and recommendations during the project life cycle. Environment: ICD, Agile, TriZetto Facets 4.71/4.81 /5.01 and, Mercury Quality Center, ANSI X12, JavaScript, HTML, XML, HIPAA, EDI, UML, MS Office, Windows XP/, Java/J2EE. Coventry Healthcare INC, Downers Grove, IL               \t\t\t\tSep 2012- Dec 2014 Business Analyst Involved in production readiness for 837 files in multiple environments. Also responsible for gathering Business Requirements and conducting Risk Analysis/Impact Analysis.  Responsibilities: Modeled the ‘AS-IS’ process flow and the ‘TO-BE’ process flow and analyzed the gap and developed the action steps to fill the gaps. Responsible for the full HIPAA compliance lifecycle; life cycle from gap analysis, mapping, implementation and testing for processing of Medicaid and Medicare Claims. Conducted Risk analysis and developed mitigation plans. Continuous and comprehensive communication with IT, Business and Management and ramping them up on the process change since moving to the Agile Release Train.  Maintained JIRA dashboards including agile metrics like burn down charts for reports for program manager and business teams  Evaluated and suggested changes to agile practices to progressively improve team output.  Collated data and metrics for Inspect and Adapt purposes  Worked with business and PO team to educate and help them navigate the Agile Conducted Impact analysis when there is any change in the requirements and updated the Business Requirements Document (BRD) and Systems Requirements Specification (SRS). In depth knowledge of Medicare/Medicaid Claims processes from Admin/Provider/Payer side which were later part of the training program to vendors. Designing Functional Specifications for the target physical database. Maintained a weekly status report for the requirements team and incorporated the same to the PMO status reports send to CMS. Analyze EDI X12 data elements captured by the existing system to validate it against the data elements required for new system. Participated in developing test plan, test scripts, and test scenarios and designed user documentation. Developed User Requirements for proposed HIPAA 5010 EDI transactions including 834 (Benefit Enrollment), and 837 (Claims Submission) Transactions. Generated difference reports based on pre-run and post-run AP reports. Created ERAs and HIPAA 834 and HIPAA 837 Outbound files using EDI Queue Manager, and EDI EOB Run Manager. Closed the runs for the current Release and generated email, reports, and other necessary documents for the upcoming Release. Environment: Windows 2003/2010, Citrix, IDX LIVE, IDX RM, MS Office suite, MS Outlook, MS Visio, MS SQL Server, SharePoint, HP ALM, Claredi, Beyond Compare, See Beyond, UltraEdit, EDI Environment Management Tool Health Net, Arlington, VA\t\t\t\t\t\t\tOct2011 - Aug 2012 Business Analyst Health Net, Inc. is an American health care insurance provider. The application involved masking of the SSN and DOB of claimant records sent by Health Net to their partners. The partners had applications and systems that used SSN as the unique identifier. This project was to remove the use of 9 digits SSN and DOB as the unique identifier for various third Party processes and Claimants.  Responsibilities:  Gathered requirements and documented Use Cases for the applications that used SSN and DOB as unique identifiers.  Created Requirements Document for all the affected processes due to the truncation of the SSN and DOB fields of the Claimants' Information. Created new application and introduced the On-line Referral System for the Customer Sales Representatives.  Responsible for handling new conversions for the company so that claims can be matched and billing records should not create mismatched records despite belonging to the same patient.  Analyzed Business Requirements, developing, tracking and enhancing them into functional requirements using Rational Requisite Pro as a requirements tool.  Assisted User Acceptance Testing (UAT) - carried out UAT activities associated with each project and presented the results to the business stakeholders.  Successfully conducted JAD sessions which helped synchronize the different stakeholders on their objectives and helped the developers to have a clear cut picture of the project.  Documented Business Requirements using Rational Requisite Pro for the application.  Environment: Rational Rose, Agile, Waterfall. Rational Requisite Pro, RUP, Test Director, MSOffice, UML"}