{"text": "Name: dorothy dorothy E-Mail: dorothy.dorothy@gmail.com Address: Suihua, China Github: https://github.com/dorothy LinkedIn: https://linkedin.com/dorothy Phone No. 983550694338 Summary: A Professional experience as a Business Analyst and Data Analyst in business and functional requirements gathering, analyzing requirements, data analysis, data profiling and data Mapping, unified modeling language (UML), SDLC methodology (RUP, Agile, SCRUM, XP) in finance, investment banking, Asset management, Portfolios management, Accounting domain. Expertise in capital markets such as Equity Investment, Fixed Income Instruments, Derivatives (Options, Futures, Forwards, and Swaps), ETF’s and Mutual Funds securities. Extensive experience in Corporate accounting systems, P&L, Balance Sheet consolidation, General Ledger mergers, securities accounting. Expertise in Data Modeling, Data Analysis, GAP Analysis, Requirement Analysis, Business Modeling, Data profiling. Expertise of creating BRD, FRD, Gap Analysis Document and Data Mapping document, Data requirement Document and Data Dictionary. Generated portfolio analysis and P&L reports by performing risk analysis and risk management (Credit Risk, Market Risk, Reinvestment Risk, and Inflation Risk) based on the client investment objectives. Expert in Planning, Forecasting, Budgeting and utilization of variance analysis to manage project to completion on time and within budget. Experienced in conducting joint application development (JAD) and Rapid application development (RAD) sessions. Well-versed in translating business requirements and user expectations into detailed functional specifications employing Unified Modeling Language (UML). Wide-ranging experience in Accounting, Finance and Investment Banking industries. Proficient in SQL server database for data entry, storage and generation of reports to facilitate management decision making processes. Accomplished at UAT (user acceptance testing), Functionality Testing, Unit testing, System Testing, Integration Testing and Regression Testing. Ability to implore various negotiating strategies to gather resources for project implementation. Experienced with Data Warehousing, Extraction, Transformation and Loading (ETL) and Business Intelligence (BI) tools. EDUCATION: Master’s in Business Administration, Finance, NYIT NY TECHNICAL SKILLS: PROFESSIONAL SUMMARY Wells Fargo, NYC\t\t\t\t\t\t\t\t\tNovember 2018 – Present  ROLE: Business Analyst/Data Analyst The project was about to build strategies for business operations and to support the senior management to make effective decision on consumer loan products by conducting trend analysis and creating models.    Responsibilities: Worked closely with PMO team to present, justify and negotiate the estimate with business stakeholders Created and prioritized the Back Log, coordinated Planning Sessions and maintained User Stories and Acceptance Criteria Involved in Corporate Actions like Bonus, stock splits, mergers and acquisitions for maintenance of portfolios. Developed UML diagrams like Use Cases Diagram and Activity Diagram Performed research and analysis across multiple asset classes to identify attributes that should be incorporated in the portfolio reports Conducted KYC/AML investigations ensuring that risk details (CIP, regulatory oversight, ownership type, product utilization and product pending trade deal) are complete, accurate and current with a comprehensive understanding of investment products and global/local procedures. Used BKFS to integrate the home loan process for better user experience and support the changing regulatory reforms.  Assisted in the administration and review of Client Risk Scoring, Client Identification and KYC documentation oversight/management requirements. Analyze the data elements for Data migration and ETL mapping from source to target data environment  Perform Data Analysis, Pattern Analysis, Data Validation and Data Quality on existing SQL Server Database. Arranged Findings reviews sessions with Business and IT team for potential issue counts, impact on Day 1 release. Involved in designing and preparing test scenarios, test plans, test cases and test data Conducted analysis of the data collected and assured compliance standards. Actively involved in conducting reviews, walkthroughs and facilitating in requirement definition workshops to get consensus on business requirement for the project.  Presented the business workflow to business stakeholders.  Assisted QC team to ensure requirements are translated into executable plans and strategies. Run Ad-hoc reports for management, as well as writing SQL queries and upload reports on SharePoint site. Environment: Agile, MS Office Tools, SQL Server, .NET, MS Visio, MS Project, Jira, Confluence, HP quality Center, Tableau TIAA, NYC\t\t\t\t\t\t\t\t\t\tJanuary 2018 – October 2018 ROLE: Business Analyst/Data Analyst The scope of the project was to develop and enhance the existing application practiced by implementing new features which was originally identified by the Senior Management for improving the wire transfer process Responsibilities: Developed BRD, FRD, Gap Analysis and Data mapping document by performing source to target mapping. Performed Data Analysis by using the SQL from the Relational Database. Created Use Case scenarios and UML diagrams such as Activity Diagram, Use Case Diagram from the Business Requirements and produce the Use case narratives. Conducted evaluation of current system’s data structure and identified gaps in structure, data and systems. Facilitated joint application development (JAD) sessions with different business groups representatives, SMEs’ and technical personnel to gather requirements, then documented those requirements, and took a sign-off on those. Also involved in creating the conversion/cross reference files for each element from old valid values to new valid values. Introduced the compliance programs in the whole wire transaction processing.  Analyzed and implemented various regulatory reforms like KYC, Patriot Act and OFAC. Experience working with the clearing houses to implement the ACH guidelines in the process. Also performed in detail data analysis of the new system (application) and identified the missing information from the previous system.  Conducted analysis of the current data by using SQL and created the report for the “MUST HAVE” data elements, for the business users to understand the impact of the replacing system. Worked with data elements for financial products like equity, fixed income and created source to target mapping for the products. Performed Data Analysis like Data Quality, Data Profiling using SSQL queries and excel to analyze the data Environment: UML, RUP, MS Project, MS Visio, SQL Server, Windows NT/XP, Java, HTML, HP Application Life Cycle Management (ALM). Bank of America, Charlotte NC (Wincert IT Solution, India)\t\t\tMarch 2017 – September 2017 ROLE: Business Analyst/Data Analyst The goal of the project here was to create a new and improved design for the Trading and Portfolio Management Application system to make buying and selling based on closing pricing for trading and post-trading analysis even easier. This system enables brokers with a wide range of business practices to efficiently service their clients. Responsibilities: Assisting the clients Business Analysts in gathering, analysis, review and signoff of business requirements and conducting JAD sessions etc.  Managed project resource allocations, planning and status updates to ensure efficient and responsive operations along with senior management Creating UML Diagrams including Activity Diagrams in the System specification document. Closely worked with Financial Advisors and Industry professionals for Revenue Recognition and Data Analysis according to US GAAP. Identified Use Cases from the requirements. Created Use Cases Diagrams, Activity Diagrams, based on UML Methodology using MS Visio. Investigated, reviewed and analyzed existing system and Trading Life Cycle and post-trade execution life cycle to expand and track activities related to Securities trading, Customer Management and Broker Compliance Responsible for designing Commercial Lending products such as loans and guarantees and market products - Derivatives and Fixed Income Securities  Responsible for creating Source to target data mapping documents identifying key data elements and prepared Data Flow Diagrams. Created the Gap Analysis document and profiled the data from the database by using the SQL. Fulfill all reporting requirements of all relevant government rules and regulations, including the Employee Retirement Income Security Act (ERISA). Environment:  Jira, SQL, Windows XP/2000,  SharePoint, Unix, DB2, MS Visio, MS Excel, MS Word, MS Access, MS PowerPoint, MS Visio, HP quality Center Citibank, Houston TX (Evon IT Solutions, India)\t\t\t\t\t\tJune 2016 – February 2017  ROLE: Business Analyst The scope of the project here was on IOTPS (Integrated Online Transaction Processing System), which includes mortgage loan processing application features enhancement. The goal was to integrate the mortgage loan process inclusive of customer data, credit agencies, pricing and products to process the loan. Responsibilities: Responsibilities include gathering business requirements, creating Business Requirements Document (BRD), Gap Analysis Document, writing functional and technical specifications, creating source to target mapping, designing data profiling and data validation scripts by using SQL in Aqua Data Studio. Crated the Activity and Use Case Diagrams. Also created Use Case Narratives. Created Test Cases, RTM, Test scenarios and test data for validating the requirements. Worked with developers to make sure that they understood the Use Cases.  Conducted Joint Application Development (JAD) sessions with IT groups. Identified the Key Changes, and participated in Stakeholder Management to communicate effectively with them Conducted User Acceptance Testing, gathered and documented User Manuals and Business Rules Identified and validated high potential business opportunities for stakeholders and developed customized business strategies that are aligned with corporate strategic objectives. Prepared Business Process Models that includes modeling of all the activities of business from conceptual to procedural level. Environment: Microsoft Office Suite, Microsoft Visio, Windows NT/XP, Oracle, SQL Noble Management Services \t\t\t\t\t\t\t          January 2014 - April 2016 ROLE: Financial Analyst – Intern  Responsibilities: Performed financial forecasting and created financial models for decision making to be reported to the headquarters.  Worked with the Accounting department to maintain stringent credit control. Evaluated the accounts receivable to ensure accuracy and performed bank reconciliation statement. Compiled all the information and updated it on the automated system to generate reports.  Administered the tax filing on quarterly basis and ensured all the tax laws are complied with."}