{"text": "Name: lorraine lorraine E-Mail: lorraine.lorraine@gmail.com Address: Yiyang, China Github: https://github.com/lorraine LinkedIn: https://linkedin.com/lorraine Phone No. 198307265999       Community Health Systems (CHS) is one of the nation’s largest publicly traded healthcare companies. The organization's affiliates own, operate, or lease more than 206 hospitals in 29 states, with an aggregate of nearly 31,000 licensed beds. In more than 65 percent of the markets served, CHS-affiliated hospitals are the sole provider of healthcare services. The objective of the ACA (Affordable Care Act) 1104 project was to have a Business Analyst to elicit business requirements and to develop the business level design for the transformation from ICD9 to ICD10 and verify the EDI transactions. Worked closely with the client for the creation of RSD (Requirement Specification Document) for Interactive Voice response (IVR) Claim inquiry and response.  Conducted JAD sessions to understand and document the various rules for ACA (Affordable Care Act) 1104 phase I, II and III. Wrote viable detailed user documentation and RSD (Requirement Specification Document) documents with the purpose that developers could formulate application with minimum guidance Worked with users of the MMIS System and provides guidance for the users and assignment of categories, manufacturers, inventory locations and tables. Interacted with Clinical teams, HIIM, and business partners to understand the clinical content requirements in the EHR and address needs to modify and/or update content as necessary to comply with the CHS standards.  Worked with clinical liaisons to determine facility specific services, requirements, and communications related to MU build content. Created a RSD for the ACA 1104 project for implementing the operating rules for various HIPAA transactions such as HIPAA 5010 270/271 transaction, HIPAA 5010 276/277 transaction, and Health Care Electronic Funds Transfers (EFT) and Electronic Remittance Advice (ERA) transactions. Worked in Medicaid Management Information System (MMIS). Expertise in various subsystems of MMIS- Claims, Provider, Recipient, Procedure Drug and Diagnosis (PDD), Explanation of Benefits. Conducted JAD sessions with management, SME, vendors, users and other stakeholders for open and pending issues. Involved in creating the design and technical specifications for the ETL process of the project. Identified gaps and performed gap analysis with respect to CMS requirements. Served as a liaison between the Project manager, testing lead, Developers, Testers and SharePoint site Administration to make sure that all the updates were made to the DSD (Design Specification Document) as requested by the State Client.  Established traceability matrix using Rational Requisite Pro to trace completeness of requirements in different SDLC stages. Performed SQL queries to interface with external database. Accountable for designing future state processes for HIPAA 5010 transaction processing EDI’s 837 and 835.In addition Reviewed HIPAA 5010 related to 837,835, 834 Transactions and conducted gap analysis between HIPAA 4010 AND HIPAA 5010. Proficient in creating and maintaining Workflow plans and artifacts. Implemented the HIPAA privacy and security regulations to enhance the capabilities of the systems to process new products. Identified and documented the dependencies between the business processes. Developed and maintain Use Cases, visual models, including activity diagrams, logical Business process models, and sequence diagrams using UML. Employed JAD sessions for defining the project and decreasing the time frame needed to complete deliverables. Created an Excel spreadsheet for keeping track of all the Defects using Quality Center. Sound Knowledge of Agile methodologies such as SCRUM and adept at keeping track of all Milestones in the project. Environment: Agile, SCRUM, MITS (Medicaid Information Technology System), SQL ,SharePoint, MMIS, Quality Center, iTRACE, ALM (Application Lifecycle Management). Oregon Health Authority, Salem, OR                                                                                              \t\t\t   May 2013 to Dec 2014 Sr. Business Analyst Oregon State Health Insurance Exchange (OR-HIX) Project The Oregon Health Authority (OHA) is a government agency in the U.S. state of Oregon. Established by the passage of Oregon House Bill 2009 by the 75th Oregon Legislative Assembly, the OHA will ultimately oversee most health-related programs of the Oregon government. Performed eligibility, enrollment and claims processing requirements analysis for MMIS Federal and State healthcare programs Patient Protection Affordable Care Act - Medicare, Medicaid, CHIP,TANF-Individual, SHOP and BHP Medicare Part A,B,C and D ) related Health Insurance Exchange (HIX) payer and plan data management, claims and encounter data. As Business Analyst I Created business requirements, use cases, established customer personas and market profiles and assisted in developing financial models to support the new product for the Health Insurance Exchange (HIX) Business for private and public sectors. Responsibilities Responsible for defining the scope and implementing business rules of the project, gathering business requirements and documentation. Responsible for writing Functional Requirement Specifications (FRS) and User Requirement Specification (URS). Provided support to CMS/ Federal and State stakeholders on objectives relative to PPACA -HIX by performing the following duties in an agile (scrum) SDLC environment. Responsible for requirements analysis, design and developing technical requirements.  Gathered technical requirements in an agile environment in line with RUP iterations. Worked extensively in Medicaid Management Information System (MMIS). Expertise in various subsystems of MMIS- Claims, Provider, Recipient, Procedure Drug and Diagnosis (PDD), Explanation of Benefits (EOB). Analyzed Business Requirements and segregated them into high level and low level Use Cases, Activity Diagrams / State Chart Diagrams using Rational Rose according to UML methodology thus defining the Data Process Models. Developed an IV&V Plan to clearly document the nature of the work performed and define the activities, procedures and responsibilities for accomplishing the objectives of the verification and validation. Developed & executed several Optimized queries in SQL on this data. Created detailed Use cases, activity diagrams and flowcharts based on requirements gathering. Interviewed Business Users to gather Requirements and analyzed the feasibility of their needs by coordinating with the project manager and technical lead. Validating the Log Files (999, x12,) for 834/820,277CA, 837IB and 835 Transactions in UNIX and HTM (Healthcare Transaction Manager). Prepared Business Requirement Documents (BRD’s) after the collection of Functional Requirements from System Users that provided appropriate scope of work for technical team to develop prototype and overall system. Comprehensive understanding of MMIS subsystem files, screens and integrated workflow processing. Worked on Healthcare system implementation including enterprise Electronic Medical Records (EMR) software. HIPAA EDI transactions such as 835, 837 (P, D, I) 276, 277, 278. Performed GAP analysis for EDI transactions such as 837,834,820 to support state specified X12 5010 file formats. Contributed to written IV&V project status reports and other deliverable reports and assessed and documented implementation and operational readiness. Utilized corporation developed Agile SDLC methodology. Used ScrumWork Pro and Microsoft Office software to perform required job functions. Created Use cases, activity report, logical components and deployment views to extract business process flows and workflows involved in the project. Carried out defect tracking using Clear Quest Maintained proper communication with the developers ensuring that the modifications and requirements were addressed and also monitored these revisions. Involved in compatibility testing with other software programs, hardware, Operating systems and network environments. Environment: OOAD, UML, RUP, TQM, SDLC, Business Modeling and Data Modeling Rational Rose, Agile, Rational Requisite Pro, MS Visio, Clear Case, Clear Quest.    AmeriHealth Administrators, Fort Washington, PA                                                                                                  Mar 2014 to Present Sr. Business Analyst AmeriHealth Administrators offers tailored, cost-effective, third party administration (TPA) solutions for organizations that self-fund, or may be considering self-funding, their health benefits. Highly competitive nationwide health care network savings,integrated, comprehensive health management and consumer-directed health plan options.The purpose of the project was for AmeriHealth Administrators (AHA) to host business processes of AmeriHealth New Jersey (AHNJ) another subsidiary of its parent company, Independent Blue Cross (IBC). The ultimate goal was to reduce business expense and lower healthcare costs - encouraged by the new Affordable Care Act. I was involved in the Enterprise Data Management teamand as a business system analyst; I was responsible for analyzing the business models, identifying the various data sources for data mapping. Responsibilities Actively resolved day-to-day technology needs of the business unit with a focus on the analysis of processes with various groups, including business owners, SMEs (subject matter experts) and marketing team, for requirements gathering in definition Stage.  Worked as a liaison between business users, testers and application development team so that all teams understand business needs and take them into consideration. Participated in brainstorming sessions and walkthroughs with subject matter experts (SME). Gathered business requirements through interviews, surveys, and observing from account managers and UI (User Interface) of the existing system.  Created process flow diagrams describing provider and member access to the web portals. Involved in business analysis and project management, coordinating between the team members according to the business requirements.   Analyzed data/workflows, defined the scope, and performed GAP analysis.   Created and maintained procedures and documentation. Prepared Business Process Models that includes modeling of all the activities of the business from the conceptual to procedural level and validated the processes with SME.  Prepared test plan and test cases. Supported the testing team during the testing stage by conducting user acceptance testing (UAT). Worked on data mapping to bring data from one system and reside in another system. Created data flow diagrams, data mapping from Source to stage and Stage to Target mapping documents indicating the source tables, columns, data types, transformations required and business rules to be applied. Analyzed the data movement between systems in order to validate the Business Requirements. Performed Data Analysis and Data validation by writing SQL queries. Checked database tables to see whether the data is being updated after the batch process is run.  Worked with the project manager to estimate best/worst case scenarios, track progress with weekly estimates of remaining work to do, conducting informal meetings ad hoc and as needed. Strong experience in conducting User Acceptance Testing (UAT) and documentation of test cases. Expertise in designing and developing test plans and test scripts using MS Excel. Provided overall project management to multiple projects successfully completing them on-schedule. Developed recommendations and designed solutions for process improvements. Contributed in improving the overall customer experience through customer focused business processes. Identified bugs during the UAT phase and reported them using Quality Center. Environment: Windows, XP, ETL, MS -TFS, SQL, SharePoint, MS Office, MS Excel, XML, HTML. Department of Human Services, Little Rock, Arkansas\t\t              \t\t\t       Feb 2013 – Jan 2014 Affordable Care Act - Data Service Team Lead The ‘Affordable Care Act’ was passed as a law, and in order to implement the law, the ‘Arkansas Department of Human Services ’ had to complete a number of changes to its IT systems. The Affordable Care Act implementation involves a change in the ‘Eligibility and enrollment’ framework, which is a set of rules determines whether a person in the state of Arkansas is eligible in the Arkansas Medicaid Program. The Arkansas Department of Human Services installed the CURAM software from IBM to implement the new ‘Eligibility and enrollment’ framework. The Data services team is responsible for the integration of data from the CURAM platform with other Arkansas systems used by Arkansas Department of Human Service. Responsibilities: Leading a team of 7 individuals which included Java Developers, Informatica Developers and System Analysts. Analyze the data in CURAM source system, and design the Web services for ‘MEC Update’. The MEC Update service will determine the Medicaid ID for the person once he/she is determined Eligible in CURAM. Prepare the Data model design in Erwin for tables that will store data. Design of ETL Architecture for the data to be loaded from CURAM to the ‘Landing’ tables and from the Landing tables to the Reference schemas and outbound systems. Design and Development of Informatica power center jobs that will provide data from CURAM to the MEC Common Table as well as external systems like the HP MMIS database and the HP OK Medicaid Card Printing Center. Data sent to HP MMIS database and the HP OK Medicaid Card Printing Center via data files. Design and development of code to extract data from Legacy system, ACES; which is a mainframes database and processing the data to the MEC Reference schema. Design and development of cron scripts to schedule Informatica job. Design UNIX shell scripts to process files and also sftp the files to servers out of DIS Network (Department of Information services) Development of Informatica Data Quality mappings in Informatica Developer, based on Business Rules provided. Also worked to integrate the Informatica DQ mappings with Informatica PowerCenter.  Design and Development of Java code to process data to an EBCDIC file with Packed Decimal data columns, which is the format of the HP MMIS file. This Java code was integrated with Informatica Power Center with the help if Java Transformation. Designed ETL process to load the data provided by CMS – Center for Medicare and Medicaid Service; to the systems operated by Arkansas Department of Health Service. Developing Informatica code for web  service  using web services consumer transformation to integrate the Informatica powercenter with the web service for printing ‘Notices’ for eligible people Implemented Project using Agile methodology, to achieve timely and reliable delivery Environment:  Power Center 9, Oracle 11g, PL/SQL Stored Procedures, Windows 2000, dot net, MS SQL Server This project is on temporary high risk pool program for Ohioans, as created through ACA standards and Impact of federal reform act (PPACA) in order to provide uninsured people with pre-existing conditions the opportunity to purchase more Affordable Health Insurance; also implemented projects on Ohio Medicaid Management Information System (MMIS), MITA, CHIP, Childcare, Payment (EOB, COB), Provider Directory, Provider Data Management as part of Patient Protection Affordable Care Act (PPACA) Roles & Responsibilities:  Gathered requirement and Prepared Data mapping on FACETS as part of transition from legacy system and data analytics on back end SQL and developed front end FACETS for all the modules including Member management, Provider Management, and Claims Processing; Gathered requirement Worked on Data Mapping, Data Modeling, Data Mining on HIPPA 5010 837 to FACETS System and loaded (Data Warehouse) as well as complete Adjudication Process with in MMIS and MCO into Facets tables: validated the following: HIPPA 5010, 837, 835, 270/271, 834, 999as well as claim submission and adjudication process. Facilitated JAR sessions, JAD session, wrote Status Reports, User Stories, Oral Presentations, Emails and coordinated extensive communication network through interviews with end users, Tech team and other non-technical team members. Prepared and maintained project plans, Feature-Driven Development (FDD), Request For Proposal (RFP), Visual aids, User Stories and track activities against the plan, part of Process Improvement providing regular and accurate reports to customers and line management as appropriate.  Experienced working on documentation on SOW, Project Charter, Business Requirement (BRD), Functional Requirements (FRD), System Requirement Documents (SRS), User Acceptance Test (UAT) Plans, UI Prototypes UAT Test Scenarios And Test Scripts along with Wireframe for technical team, test teams and reviewing test cases and ensure alignment of Test cases with requirements. Experienced in User Acceptance Test activities and to maintain proper coverage of requirements. Tracked and maintained Stakeholder requested enhancements and changes using Requirement Traceability Matrix (RTM) and utilized Clear Quest for change requests and defect tracking. Used Rational Requisite Pro to manage the requirements and Creation, modification, implementation as well as tracking of use cases. Developed Use Case Diagrams, Sequence Diagrams, work flow Diagrams, swim lanes Diagrams, Business Objects, Domain Object Model using MS Visio, UI Prototypes to depict process flows and Power Point Presentation. Working closely with Developers and experience in data mart, life cycle development, performed ETL procedure to load data from different sources into Data Marts and Data Warehouse. Knowledge of Project management principles and proficiency with MS Project, JIRA (reporting tool and evaluated development and production process under SDLC). Experience on Variance Analysis for forward mapping from ICD 9 to ICD10 and backward mapping from ICD10 to ICD9 using General equivalence Mappings (GEM) Prepared Project Plans managed and handled changes while project within all project phases. Developed regulatory and ad hoc reports, business rules, submitting data to regulatory agencies with modifications (based on request), assist in ETL development documentation and testing. Use of the HP Quality Center to invoke the scripts, initially performing the baseline testing, organized all the scripts systematically and generated reports. Validation of requirements correctness and completeness, test strategies and test cases to ensure requirements and functional test coverage; Randomly executed test scripts developed by QA team to check main functionality of application. Interacting with Development and QA team to ensure overall quality of software. Environment: Ms-Visio, Axure, Six Sigma, Agile (Scrum), SharePoint, TFS (Team Foundation Server), HL7, HIPAA, JDE one world 9.0, Java (Web service), BPM, Microsoft SQL Server, XML .__ Blue Cross Blue Shield of Florida (FLORIDA BLUE)                                                     April 2013 to Present Siebel Design Systems Analyst II The Blue Cross Blue Shield Association is a federation of 38 separate health insurance organizations and companies in the United States. Combined, they directly or indirectly provide health insurance to over 99 million Americans. Was responsible for multiple projects – including many that were a result of the Annual Enrollment Changes based on CMS guidelines, ACA Changes mandated by the government. Responsible for requirement gathering from the client, writing the URS, FSD's and TSD's in accordance with the Rational Unified Process   Prepared documents for the federal health care law known as the Affordable Care Act Worked on multiple projects surrounding the sweeping changes that the Patient Protection and Affordable Care Act has brought to the health care [Insurance] industry  Worked on consuming the 834 that is being sent from the Exchange through HPS to Florida Blue Worked on several projects involving UI design changes to the Consumer/ Member facing tools (Member Website for Florida Blue) Improved Member and Agent experience by re-designing the UI for the Individual Sales Tool. Involved in UX design by indentify functional vs cosmetic changes driven based on business expectation Worked closely with the SharePoint team in maintaing documentations and layouts for several cross-functional teams per Prodiction release. Worked on the Annual Enrollment Processing for the year 2014 and 2015 based on guidelines received from CMS for all enrollment channels (internal/external) to Florida Blue Determined process flows for Large Group Sales and processing for Renewals for Assigned and Unassigned Renewals. Collected requirements and performed system and Integration testing for the Java Receiver which was the gateway for all Application enrollment channels at Florida blue Captured requirements and assisted in the UX design/Build for SBC (Summaray of Benefits and Coverage) tool for Agents, Benefit Administrators, Contact Center Representatives and Members by setting up security and permissions for different screens based on the role of the logged in user. Worked with the [PMT] Product Management Tool which detailed out the Plan & Benefit information for over 600 Plans in both the Individual & Group Space Involved in requirements gathering, estimation, documentation, demos, BTI [Build, Testing, and Integration], Bug Triage, Bug Resolution, Production Support, Testing Support, and UAT Generated mock-up reports  using SQL Closely worked in the Sales, Enrollment and Service departments of Florida Blue as part of the Siebel Design team. Siebel Sales & highly customized application [Company Flavor of Siebel] AARP, Washington, DC                         \t\t\t\t\t\t          Jul 2011 to Feb 2013 Salesforce (SFDC) Business Analyst  Experience Corps has designed a new National Program Database on a Salesforce platform to help local affiliates manage their daily program operations and aggregate information about members and students across the country. Responsibilities: Developed and delivered solutions to real customer problems with an emphasis on Sales and Customer Service. Assisted in the development and maintenance of Visual force, AppExchange packages installation (Google Ad words), Force.com pages and integration to other third party solutions to be parallel with overall business strategies. Developed a web-to-lead functionality which directs leads to Sales force CRM. UI development/design to creates seamless customer experience for high traffice website through desktop, mobile and smartphone interfaces. Involved in technical design, configuration, development and testing of Force.com custom applications, interfaces and reports Knowledge on Salesforce customization using Apex Extensions and Triggers. Implementation of new enhancements including creation of custom objects, workflows, email alerts templates, reports, and campaigns as needed. Ability to analyze and assess business requirements, mapping the capabilities to the salesforce.com application. Worked with National Office database team to support and train new end users on the salesforce.com application Prepared progress reports, status reports and Dashboards and submitted to the management on an ongoing basis to monitor data quality and integrity. Performed GAP analysis with different business groups to ensure that the company standards and initiatives are met. Worked on SharePoint platform Involved in writing and modifying procedures, SQL Queries, views and triggers using the local application framework Assisted in creating HTML/XHTML pages with CSS fot UI/UX design based on business requirements captured  Created, maintained and negotiated skillfully to convince and obtain mutual agreement on business/functional requirements with stakeholders prior to achieving signoff Ensured business/functional requirements can be traced back to high-level requirements by means of data flow diagrams(DFD) and Requirement traceability Matrix (RTM) Created use cases, activity diagrams, workflows diagrams for current/future business process flows using MS Visio Identified and documented process changes and system enhancements. Implemented process improvements through redesign are at the forefront of all initiatives through prototyping. Evaluated measurable project benefits, i.e. efficiency and control; track and present metrics feasibility analysis. Conducted calls with the offshore development team to ensure progress and represent development on client calls. Provided alternative methods/options for business and technical requirements, taking into consideration long term maintenance, ease of use, scalability, data quality and security Assisted with required data analysis, interpretation, correction and documentation presentation"}