{"text": "Name: dorothy dorothy E-Mail: dorothy.dorothy@gmail.com Address: Xinyang, China Github: https://github.com/dorothy LinkedIn: https://linkedin.com/dorothy Phone No. 592649630064 PROFESSIONAL SUMMARY\t 7+ years of working experience as Business Analyst in E-Commerce / Retail industry.  Comprehensive knowledge and experience acting as a liaison between business and technology in phases of Software Development Life Cycle (SDLC) methodologies like Agile and Waterfall.  Supported Business Partners in a matrix environment and managed the activities of third party software vendors. Experience in overseeing the design, development, and implementation of software and hardware solutions, systems, or products provided via third party solution providers. Sound knowledge of E-Commerce and the POS system. Expertise in Supply chain management systems. Well-developed business and supply chain understanding attained through diverse assignments in logistics, sales, and business analysis at both staff and manufacturing locations. Prepared detailed reports analyzing the supply chain practices and offered suggestions for improvement Experience in designing Workflows in SharePoint platform. Expertise in defining and developing analysis of Business Requirement Documents, Functional Specification Documents, Test Plans and reports. Organized Joint Application Developments (JAD), Interviews, workshops and requirement elicitation sessions with end-user/clients/stake holders. Proficient in Microsoft Excel (Pivot Tables, Vlookup, Hlookup, VBA, etc.) Proficient in using UML in behavioral, structural and architectural modeling – in creating Use Case and Activity diagrams using Microsoft Visio. Experience in coordinating and conducting User Acceptance Testing and GAP analysis.   Exposure to testing methods, such as Regression, Performance, Load, Functionality, Smoke, and Usability Testing for web and Client/Server application. Good knowledge of System Testing and Integration Testing. Responsible for writing Test Plans and Test Cases for (UAT). Experience in creating End User Training Manuals. Excellent communication, documentation and organization skills with the ability to adapt to new environment Excellent critical thinking skills, sound judgment, and an ability to influence others over whom there is no direct authority.   Hands on knowledge and experience on Training & Mentoring, Managing Diversity, Organizational Development, Leadership, Change Management, Crisis Management and Conflict Resolution. Technical Skills  Professional Experience Bath & Body Works, Reynoldsburg, OH Sep 2015-Feb 2018 E-Commerce Business Analyst  The project was based on implementing new E-commerce application that focused on integrating the Web based POS system to assist streamline process, integrate channels and maximize profitability. Its main functionality included integrating the E-commerce &POS system to promote cashier activities, operations management, and assortment planning and customer relationship management I also worked on The Order Management System which was part of the e-commerce application that was being developed for Bath & Body Works’ retail website. Worked on the shopping cart application, the B2B exchange of data & online transaction processing & electronic funds transfer. Responsibilities: Actively Participated in daily scrum stand ups, sprint planning/grooming, tech reviews, story development, business meetings, sprint demos and sprint retrospectives in an agile environment. Responsible for maintaining a focus on the user requirements and what the team needed to achieve in each sprint. Participated in Design Phase, together with members of the Product team, developers, and DBAs for e-commerce testing.  Attended weekly meetings in order to address any new developments. Assisted the testing team in E-commerce Application testing. Created user stories, use cases as well as acceptance criteria in supporting the implementation of functionality in every sprint, planning the iterations and releases and testing the developed functionality. Created extensive SharePoint documentation for end users, business owners and site collection administrators. Conducted SharePoint training sessions for site collection administrators, site owners and high-end power users. Developed various how-to’s on using complex features of SharePoint as needed. Utilized corporation developed Agile SDLC methodology. Used Scrum Work Pro and Microsoft Office software to perform required job functions. Used Website Wireframes for graphic presentations. Create daily reports in designed MS Excel spreadsheet with pivot tables. Used MS Excel to analyze, communicate, & examine organizational change. Conducted Analysis of business scenarios using MS Excel. Conducted analysis of client business processes and functional or reporting requirements.  Reviewed and analyzed the effectiveness and efficiency of existing systems and develop strategies for improving or further leveraging the application under test. Prepared and delivered solutions, recommendations, or alternatives that addressed existing and potential trouble areas in retail systems across the organization. Analyze “AS IS” and “TO BE” scenarios, designed new process flows and documented the business process and various business scenarios Interact with business partners to perform the Initial Project Analysis  define new and document retail sales reporting requirements and Change Requests (CRs). Performed the Back-End Testing to ensure data consistency and accuracy by writing and executing SQL statements on Oracle Database Extensively used SQL statements to query the Oracle Database for Data Validation and Data Integrity. Managed requirements using JIRA for Agile. Use SQL and MS Excel using macros for all Data validation based on the Business Rules. Extensively wrote standard and complex SQL queries to perform data validation to make sure test results matched. Coordinated projects, activities and resolving issues with third party vendors to ensure that desired results are delivered as per the project schedule. Participated in meetings with Developers, Project Managers and Quality Analysts to discuss business requirements, test planning, resource utilization, and defect tracking (using JIRA). Analyzed Business Requirements and created Use Cases, Use Case Diagrams, for applications and created Activity Diagrams using MS Visio. Coordinated with testers to write test cases for the functional requirements according to acceptance criteria. Used JIRA for version control and defect management. Conducted User Acceptance Testing (UAT) and System Integration Testing (SIT). Proactively searched ways to enhance the E-commerce Divisions performance through enhanced information, system processes and business processes. Led portion of JAD meetings for large enterprise-wide BI projects and addressed gaps during requirements Evaluated and tested new or modified software functionality to verify that software functions according to user requirements and conform to establishment guidelines. Includes the writing and executing of test plans, test cases, and test scripts.  Used SQL Server Database query for analysis. Coordinated and verified successful completion of UAT for the program and provided end user training. Best Buy, Minneapolis, MN\t August 2012- June 2015 E-commerce Business Analyst Best Buy Customers have an option to purchase the merchandise sold at Best Buy’s stores online through online shopping application bestbuy.com. Checkout Redesign:  Best Buy redesigned its checkout for bestbuy.com, the online shopping application for Best Buy to enhance its user experience and increase its performance. Bestbuy.com Site Redesign: bestbuy.com site was redesigned to include Softlines to its online shopping options. This project was to include functionalities such as Gift Registry.  Responsibilities: Discovery session for gathering and updating requirements. Worked with the clients on the final signing process in the User Acceptance stages. Facilitated JAD sessions to collect requirements from system users and prepared business requirement that provided appropriate scope of work for technical team to develop prototype and overall system. Provide SharePoint support for any content migration issues. Provide SharePoint and MS Office training to end users and site admins. Analysis of business requirements for SharePoint based projects. Participated in Daily Agile Scrum “Stand-up”, Biweekly Sprint Planning and Retrospective Sessions and update the team on status of upcoming User Stories. Initiated and crafted project charter by collaborating with senior business executives and technical architects; facilitated document through the global enterprise dispatch process resulting in an expedited approval of project time lines, resources and scope. Use Agile systems and strategies to provide quick and feasible solutions, based on Agile system, to the organization. Involved in writing complex SQL queries to extract the data from Oracle database Work in Agile, scrum, and sprint environment in order to change the requirements and features set. Work closely SCRUM team to create test scripts and test cases to ensure coverage of all areas of the product/feature(s) Used SQL Queries in Oracle to pull out data from the databases for the data validation and routine report generation.  Created and maintained an Excel database.  Conducted business analysis, acted as a liaison between project manager, business users, & IT team, and used MS Office for the documentation.  Worked with the SME’s (Financial Analysts, Risk Managers, and Project Managers) to define business critical needs and analyze the possible technical solutions. Interacted with database developers for formulating the ER diagrams and data flow diagrams. Prepared Use cases and Activity flow diagrams and Work flow diagrams, considering the scope of the project with MS VISIO. Worked with website wireframes to visually support the business rules and interaction requirements for a screen transform. Analyzed and translated business requirements into system specifications utilizing AGILE methodology Documented, coached, and elicited business requirements from subject matter experts by writing user stories resulting in a clearer, more detailed and more complete understanding of project deliverables. Prepare and update internal status reports to inform leadership of regulatory events and status.  . Monitoring the support request queue in Remedy trouble ticketing system. Involved in implementing the business models including wireframes on different platforms including Android, iOS. Develop and testing on iOS, Android and Windows Apps. Wrote detailed requirements for enhancement of certain features on  Mobile Application Created manuals for UAT testers and external users to explain the features of mobile application. Coordinated testing for various mobile devices including iPhone, Android Phones or tablets (iPads, Android). Used JIRA for Defect Management. Conducted walkthrough and lead work sessions to the end users. Developed functional requirements and specifications. Involved in gathering, documenting and verifying Business and Functional requirements. Worked closely with stakeholders for requirements gathering. Identified end-to end requirements for all systems and business units that may be impacted by the project. Translated user requirements into business requirements that are testable and traceable through business and functional requirements and/or workflow changes. Nordstrom, Seattle, WA\t\t\t Nov 2010 – July 2012 E-commerce Business Analyst Nordstrom, Inc. is an upscale fashion retailer that sells eyewear, clothing, accessories, handbags, jewelry, cosmetics, and fragrances. The project was to enhance and improve the e-commerce application for official web portal www.nordstrom.com. It focused on inventory tracking and optimal stock maintenance. The application required integration of the centralized database to the e-commerce application. Responsibilities: Extracted the Business Requirements from the Business Users and documented it for the developers conducting JAD sessions and Interviews. Interacted with client and the Technical Team for requirement gathering and translation of Business Requirement to Technical specifications. Conducted Web Meetings with Off-Shore team members to ensure that everybody is on the same page. Collected weekly status reports to ensure that all deliverables are met on time and on schedule. Created Use Cases from the list of requirements and prepared use case diagrams Involved in integration testing with added features like color and size. Wrote detailed requirements for enhancement of certain features on  E-Commerce Application Created manuals for UAT testers and external users to explain the features of E-commerce application. Transfer Excel audit reports to a more automated solution. Use established pivots as the basis for creating parameterized reports and data-driven subscriptions Implemented SDLC for the development life cycle and followed the standard process in the application development through agile methodology.   Attended in daily standup status meeting for outlining goals for the day and discussion of current or potential blockers, enhancement and modification.  Created project plans, detailing projects Scope, process flow, timelines, and requirement documents and analyze risks. Used wireframes to visually support the business rules and interaction requirements for a screen transform. Developed the business and functional requirements specification describing and prioritizing of the requirements in detail. Participated with QA team to conduct major functionality testing of the different module such as enrollment, report etc. manually. Designed and implemented SQL queries for reports and data validation. Analyzed “AS IS” and “TO BE” scenarios, designed new process flows and documented the business process and various business scenarios. Wrote use cases and relevant UML diagrams such as Use Cases, Activity and Sequence diagrams.  Worked on requirements for various modules covered under Retail and Global E-Commerce and POS apps. Assisted testing teams in defect management using Quality Center. Participated in meetings with other developers and testers on a regular basis to overcome the communication gap. Created SQL scripts to extract the data from the operational database into simple flat text files. Performed regression tests on each module and collectively to check for functionality. Education  Master’sdegree"}