{"text": "Name: ruth ruth E-Mail: ruth.ruth@gmail.com Address: Jiujiang, China Github: https://github.com/ruth LinkedIn: https://linkedin.com/ruth Phone No. 433593912258 SUMMARY: 5+ years experience as a Business Analyst in the HealthCare domain. Specific expertise in Business Analysis, GAP Analysis, Data Analysis, Business Rules and developing and creating business process documents. In depth knowledge and hands on experience working with SDLC methodologies like Waterfall, RUP, Scrum, and Agile. Expertise and experience in preparing Business Requirement Documents, Use Case Specifications and Functional Specifications. Good knowledge of important and frequently used UML diagrams such as Use Case Diagram/Template, Activity Diagrams and Sequence Diagrams. Experience in using Joint Requirement Planning (JRP) and Joint Application Deployment (JAD) sessions for gathering requirements and brainstorm ideas. Extensively worked with HTML, creating and developing websites. Managed internal projects improving project planning, resource management, and time billing using MS Project, SharePoint, Visio, CA Clarity, TeamTrack and IQNavigator for prototyping and process simplification. An excellent knowledge of ICD-9 and ICD-10 structures and formats. Have extensive knowledge in Insurance products like HMO, PPO, POS and HIPAA and Regulations. Well experienced with the complex tasks of ICD 9 to ICD 10conversion and mapping. Strong understanding of EDI Claims, Member Enrollment, Eligibility, and HIPAA 5010 standards Knowledge of different modules within Healthcare Claims Adjudication Process (Membership process, billing process and enrollment & Claims process). Strong expertise in Health Insurance Claim process, social services, Medicaid. Experience in the Data Analysis and Testing of Data Warehousing using Data Conversions, Data Extraction, Data Transformation and Data Loading (ETL) Experience with HIPAA compliance in the Healthcare systems. Experience providing analysis for business processes running on EDI (Electronic Data Interchange) standard. Expertise in impact analysis on the key application systems (claims processing, reporting, payments) and business process of health insurance companies. Excellent working knowledge of requirement management tools like Microsoft SharePoint. Excellent presentation & communication skills, can act as an excellent mediator between business & technical teams. Experience with handling and coordinatingUAT. TECHNICAL EXPERTISE: Project Methodologies\t:\tSDLC, RUP, UML, Agile, Waterfall,  Business Modeling Tools:\tMicrosoft Visio, Rational Rose Platforms:\t\t\tWindows, UNIX, Sun Solaris, IBM AIX  Defect Tracking Tools:\tRational Clear Quest, Quality Center, HP Application Life Cycle Management, Clear Case, Win runner, Mercury Quality Center  Change Management Tools:\tRational Clear Quest Office Tools:\t\t\tMS Project, MS Office, MS Visio Business Applications:              MS Office 2013 (Word, Excel, PowerPoint, Outlook), Adobe Acrobat, MS  Visio, MS  Project, Data warehouse, Business Objects, Business Intelligence      Database:\t\t\tMS SQL Server, MS Access, and Oracle PROFESSIONAL EXPERIENCE: Assurant Health, Milwaukee, WI          \t\t\t\t\t                         Jan 2017- Present Business System Analyst Assurant Health is part of Assurant, a premier provider of specialized insurance products and related services in North America and selects worldwide markets. It is the brand name for a family of health insurance products focused on providing a variety of affordable plan choices to consumers. The portfolio of health care products includes major medical, supplemental and fixed-benefit plans for individuals, families and small employers. Also integrate the Medicare (Part A, Part B, Part C, Part D) data all in one single system for a smooth flow through the claims processing system. I was also involved in providing support through the entire lifecycle for multiple projects involving web service and user interface development, covering Provider, Claims, modifying MMIS (Medicaid Management Information Systems) and Reimbursement Processing domains. Responsibilities: Performed a project analysis on new projects, including requirements, personnel, and costs. Developed and maintained a work plan for system projects. Facilitate daily scrum, sprint planning and sprint retrospectives meeting. Worked on release on multiple sprints after successful completion of sprints. Performed Gap Analysis for HIPAA 5010. Met with Supervisors and business users and defined the scope of the project, gathered business requirements, and conducted gap analysis. Managing and Billing Medicare, Commercial HMO/PPO claims on a daily basis. Involved in the documentation of extraction, of the data from various tables in the Data warehouse.  Worked closely with Business Team, SME’s, Infrastructure team, and coordinated with Offshore Team. Expertise in Claims, Subscriber/Member, Plan/Product, Claims, Provider, Commissions and Billing Modules of Facets. Participated in creating Facets data model. Worked on the EDI 834-file load to Facets through MMS (Membership maintenance sub-system) Worked with providers and Medicare or Medicaid entities to validate EDI transaction sets or Internet portals. Worked on ICD 10 with respect to the claims related to Medicare (Part A, Part B, Part C, Part D) Work with solutions/delivery teams to implement data quality processes during acquisition, ETL, and delivery stages for Business Intelligence solutions and changes to Data Warehouses Worked on the MMIS (Medicaid Management Information Systems).\t Designed Claims Inquiry screen within the MMIS and executed Testing Scenarios, Cases & Conditions involving User Acceptance testing, Regression, Integration and System testing Wrote BRD’s for 834(member Eligibility),Provider files and Claims tracking system, Use-Case Narratives including business process workflow diagrams and Requirements Traceability based on any of the projects need. Worked on Business requirement for payer information in geographical area and contact payers to facilitate contracting. Documented and gathered Functional specifications for 837 (claims), 278(Authorizations) and 270/271 (Eligibility and Benefit Response)  Conducted Requirements Walk-Thru JAD Sessions and resolved all issues/findings. Lead & Facilitated numerous meetings to help answer any question on requirements during Design, Development, Testing and Implementation phase. Organized brainstorming and JAD sessions with stake holders, business users, technical teams, testing team to analyze and validate the business requirements, system life cycle and explained the key performance indicators and documented the specifications. Created Use Case diagrams by analyzing the business process followed by Activity diagrams using MS-Visio and participate in production of HIPAA 5010 EDI Test data. Developed use case Designed process flow diagrams using MS-Visio and also Business Context Diagram. Environment: Agile, UAT, MS Office (MS Word, MS Excel, MS PowerPoint, MS Visio), MMIS, HP ALM, SQL Server. Cardinal Health, Dublin, OH\t\t\t\t\t\t                     Aug 2015- Dec 2016 Business Analyst The project was based on the transition from a mainframe based legacy system to a new Enterprise open systems-based solution. Adhered to strict compliance, policies and regulations and configured Facets modules such as claims, membership, benefit and plan. I was involved in migrating application functionality and converting data. I supported migration of ICD 9-CM (Clinical modification) to ICD-10-CM/PCS (Clinical modification/procedure coding system). Also worked on internet-based application to improve its health insurance claim processing by automating receiving and processing health benefit claims including Medicare . Responsibilities: Conducted meetings with business process owners, SME (subject matter experts) and Trading Partners for requirement gathering during the definition stage. Involved in FACETS Implementation Testing, involved end to end testing of  FACETS Billing, Claim Processing and Subscriber/Member module. Analyzed data/workflows, defined the scope, and performed GAP analysis.   Analyzed the data movement between systems in order to validate the Business Requirements. Worked on data mapping to bring data from one system and reside in another system. Ensured that EDI files were in compliance with new ICD-10 standards Carried out forward/ backward mapping when necessary. Submitted claims to insurances and Processed payment from insurance companies. Subscriber/Member module.  Prepared documents such as Project Scope, Project Vision, Project Success, Business Requirements, Functional Specification, Data Warehouse Process Flow (SQL queries & Crystal Reports) using MS Office (Word, Excel, Visio) and dashboards Interacted with DBA for the process of data extraction, data transformation, data load, data integration and conversion processes using business intelligence tools on the Benefit Plan functionality. Validating the site for HTML syntax errors and defects for website functionality. Created Use Cases and maintained the traceability matrix.   Conducted series of meetings, joint sessions, and interviews with the health insurance experts, operations experts, subscribers, and technical people to properly identify and understand the problems with claims management  Performed Data verification and validation against the user requirements. Reviewed complex SQL queries to extract and validate the data from the Facets database Performed Gap Analysis of short term business requirements with long term business   requirements and reported the GAP to the management. Used Teradata SQL assistance to write SQL queries for data extraction. Created and provided Ad hoc data request to the users with quick time around. Work closely with Health Insurance Trading Partners and with other contractor companies to ensure the quality of the cases. Involved in testing the EDI transactions 834, 837, 835. 270/271 & 276/277 conversion to Facets.  Created HTML Mock-up screens & Prototypes to obtain user feedback on implementation of key requirements. Worked on FACETS claims processing, payment adjustments, claims inquiry, benefits, Conducted JAD sessions to understand the detailed requirements. Worked closely with the business analyst and Data warehouse architect to understand the source data and need of the Warehouse. Derived BPMN for batch loading of Provider and Member data into FACETS.  Managing the implementation and delivery of medium to large websites and web applications  Participated in for website backend testing with Linux and UNIX environment. Processed claims in Facets and verified 835X12's are generated and sent to Provider. Extensively involved in updating the official changes to the tabular list, instruction manual and alphabetical index of ICD- 9 to ICD-10 in regards to data transactions. Actively participated in status report meetings & interacted with developers to discuss the technical issues. Conducted walkthroughs and defect meetings periodically to assess the status of the testing process. Set claim processing data for different Facets Modules Helped developers with the following list of HIPAA-EDI Transaction Code Sets:  (837, 835, 834) Followed workgroup for EDI standards for testing that need to comply with the HIPAA guidelines. Conducted UAT (user acceptance testing). Used SharePoint for UAT bug tracking. Used SharePoint for document sharing and version control. Environment:  Facets, Windows, MS office, Oracle, MS-Visio, Microsoft Project, HP ALM. BCBS, Chicago, IL                                                                                                                     Mar 2013- July 2015                                                                                                                  Business Analyst Implementation of the new processing system for Benefit Enrollment files (834)and Payer and Claims (837) along with review, design and reconfigure of the following FACETS functional areas: Enrollment Claim Billing Provider Member Information. Responsibilities: Participated in creating Facets data model. Worked on the EDI 834-file load to Facets through MMS (Membership maintenance sub-system) Performed Requirement Gathering by interacting with Business users and documented the requirements  Worked with Business Users and Solution Engineers to solve the capture defects in the MMS system and to effectively solve them. Performed Database management reporting on Model 204 Platform Performed Data Mapping to map the EDI 834 data to XML. Worked on solving the errors of EDI 834 load to Facets through MMS. Conducted JAD Sessions, Peer Review sessions with the SMEs, Solution Engineers, developers, Business users. Analyzed the scope of the project to review it with the customers for different review sessions of the application. Intensively involved in project testing efforts by doing System Integration Testing, Regression Testing and by helping UAT team in User Acceptance Testing Used to execute test cases for several transactions such as 837, 835, 820, 834, 277, 278, 270/271 Create SQL queries to read data from databases. Requirements Gathering & Analysis always ensured HIPAA Compliance Auditing Worked with the Testing team to test the system extensively and log defects.  Defined the maps from the existing BizTalk solution and validated it with the client for any changes. Performed data mapping and tracing data from system to system in order to solve a given business or system problem. Environment: Ms Office Tools, MS Project, MS-PowerPoint, SQL Server 2005, XML, Mercury Quality Center, Agile framework."}