{"text": "Name: ethel ethel E-Mail: ethel.ethel@gmail.com Address: Zibo, China Github: https://github.com/ethel LinkedIn: https://linkedin.com/ethel Phone No. 287693523121 SPECIFIC EXPERTISE IT professional with experience in the areas of Business Systems Analysis and Project management.  Hands on experience gathering requirements, interviewing senior level company officials to gather requirements for documenting project functional specification. Over 7+ years of experience and advance knowledge of the Systems Development Life Cycle (SDLC), Waterfall, Spiral, Rapid Application Development (RAD), Extreme Programming (XP),Rational Unified Process (RUP) Good experience working with Claims Processing ITS, HEDIS measures, Subscriber/Member enrollment, and Billing and Provider applications in FACETS. Strong knowledge & understanding of industry standard methodologies including Software Development Life Cycle (SDLC) and Iterative Software Development Life Cycle Process as per Rational Unified Process (RUP) and Agile Methodology. Expertise in gathering, analyzing, defining and documenting end user business requirements and system requirement specifications. Expertise in planning and development of Test Plans, Test Cases and Test Scenario to meet product’s business requirements. Good Knowledge of compliances such as Health Insurance Portability and Accountability Act (HIPAA), Regulations, 21 CFR Part 11 etc.  Masters in Software Engineering with experience in the development, implementation and integration of strategies within a team oriented environment, utilizing quantitative and qualitative analytical skills. Conducted User Acceptance Testing (UAT). Experience in working with different modules of Quality Center such as Requirements, BPT, Test Plan, Test Lab and Defects. Proficient in using UML in behavioral, structural and architectural modeling – in creating Use Case, State, Activity, Class and Sequence diagrams. Experience in gathering user requirements, application development, testing and documentation using Rational Requisite Pro Experience in development methodologies like RUP, SDLC, AGILE and Waterfall Well-versed in project management tool (MS Project) for status reporting, planning and resource allocation. Experience in working with QA Testing Team, creating Test Plans, Test Cases and Test Scripts. Expertise in the management of System/User Request Change, and handle User Conflicts. TECHNICAL SKILLS Project Methodologies\tRational Unified Process (RUP), UML EXPERIENCE Molina HealthCare, Boise, ID\t\t\t\t\t\t\t\tAug‘13 – Present Business Analyst\t \t Idaho Base MMIS project is to provide the Base component of the MMIS, which receives and processes prior authorizations, referrals, claims, and remittance advices for medical and dental services. The project also manages provider enrollment for all Idaho Medicaid providers along with Idaho Medicaid Member. This includes the files and data conversion and migration of all application functionality from the legacy MMIS system to the client-server application (Health PAS system). Responsibilities: Communicated with Line of Business and created Business Requirements Document (BRD), High Level Diagram (HLD), and part of Low level Diagram (LLD). Conducted walkthrough for Line of Business, Development team, and Quality Assurance team.  Executed EDI related test cases for functional, regression and business scenario.  Worked on different EDI scenarios for batch processing. Involved in project planning, coordination and QA methodology in the implementation of the Facets in the EDI transaction of the claims module.  Validate EDI Claim Process according to HIPAA compliance.  Managed requirement activities using an iterative and incremental methodology such as Agile using User stories and Acceptance Criteria Facilitated system maintenance and enhancement through design documents, process flow diagrams, use case diagrams etc.  Analyzed system impacts as a result of proposed changes. It entailed interaction with other systems users and Subject Matter Experts (SME) s. Utilized Agile to configure and develop processes, standards, and procedures. Designed screen layouts for proposed solutions, user interactions.  Tracked the project flow and acquired sign-offs from Business, System Development and Quality Analysis team. Implemented new policy changes, legal requirements by creating the Business Requirement, Detailed Technical Requirement, User Requirement documents etc. Used different in house software to track data flow, system interactions, system defects, service requests and responses. Coordinated work plans between project manager and client using Microsoft Project. \nScheduled and tracked progress of team members through project completion.  Evaluated application testing results against ANSI standards and recorded the discrepancies using Quality Center to track, analyze and report on them.  Helped testing team to create UAT test cases, managing implementation and analyzing results to finalize software design for rollout.\n Environment:  Windows, SQL, UAT, MS Office, MS Visio, Agile, ALM/Quality Center, MS Office, MS Access Xerox, West Sacramento, CA\t\t\t\t\t\t\t\tFeb ’11 – Jul’13  Sr. Business Systems Analyst Conversion of ICD-9 CM and to ICD-10 (Clinical Modification and Procedure Coding System)codes and conversion of all EDI HIPAA X12N-4010 transactions to HIPAA X12N-5010 version and preparesnecessary supporting mapping/crosswalk documents as part of project deliverables. Responsibilities: Gathering business requirements from clients and project stakeholders Organized JAD Sessions to collect requirements from system users and prepared business requirement that provided appropriate scope of work for technical team to develop prototype and overall system. Worked with the Project Manager on various Project Management activities like keeping track of Project Status, Deadlines, Environment Request, and Compliance Issues. Working knowledge of implementing software development projects using methodologies such as Waterfall, Rational Unified Process, Agile/Scrum.  Defined Functional Test Cases, documented , Executed test script in Facets system Conducted Validations for different FACETS modules Providers, Claims and Membership  Develop, design & implement department plan to operationalize new FACETS integrated processing system, to include but not limited to, workflow, management oversight and performance analysis. Identified end to end requirements for all systems and business units that may be impacted by the project. EDI data in the back end repository and supported integrated EDI batch processing Responsible for checking member eligibility, provider enrollment, member enrollment for Medicaid and Medicare claims. Documented and reported defects within established process and tracking systems using Rational Quality Management Followed the RUP methodology for the entire SDLC. Interacting with other teams through walkthroughs, teleconferences, meetings, etc. to resolve various issues.    Validated the scripts to make sure they have been executed correctly and meets the scenario description. Carried out GUI, Functionality, Integration and Regression testing using RQM. Developed solutions in compliance with the industry models / standards and implementation of Quality Management Systems & HIPPA regulation.  Involved in project status meetings, QA review meeting, and System Test meeting. Executed business process analysis “As-Is” system & “To-Be” systems & perform gap analysis.  Coordinated and facilitated the execution of User Acceptance testing. Was involved in writing SOP’s for various projects/processes. Environment: Windows XP, RQM, HTML, Facets, UML, SQL, Rational Tools, MS Visio, MS Word, Excel, PowerPoint, Access Deloitte, Sacramento, CA\t\t\t\t\t\t\t\tJan ‘10 – Jan ‘12 Business Analyst\t Project: ISAWS (Interim Statewide Automated Welfare System) ISAWS is an on-line interactive system to provide public assistance benefits. ISAWS application is statewide interfaces such as Statewide Client Index (SCI), Child Support and Child Welfare. The system has been divided into components like Application Registration, Application Screening, Application Entry, Case Utilities, Case Data Inquiry, Periodic Reporting etc., The ISAWS provides uniformity and consistency in the application of public assistance programs and policies through the use of interactive screens with a full complement of case action support tools. ISAWS consists of CalWORKs, Food Stamp, Medi-Cal, County Medi-Cal Services Program (CMSP), Foster Care, and TANF programs. The ISAWS application contains over 6000 eligibility rules which are used in making the eligibility determination for these public assistance programs Responsibilities: Involved in gathering, documenting and verifying business requirements. Organized JAD Sessions to collect requirements from system users and prepared business requirement that provided appropriate scope of work for technical team to develop prototype and overall system. Performed gap and impact analysis between current and desired state. Discover, document, organize, and consolidate batch processing requirements and facilitate the conversion of these requirements into documented and traceable technical specifications that support development and maintenance of the batch workload Responsible for Requirement gathering, Business Process flow, Business Process Modeling and Business Analysis with Document and Records Management Assist in root-cause problem analysis and provide alternative solution recommendations and estimates for batch processing defect resolutions Developed Web Services scripts for a Web Service call sing SOAP UI Functionally validated Web Services delivered in SOAPXML format as provided in specification document Investigating and resolving data issues across platforms and applications, including discrepancies of definition, format and function. Assist with continuous improvement cycles by analyzing gaps between forecast and actual batch performance characteristics My additional Responsibilities included Managing Tickets for Incident Management Used Quality Center to perform test management activities. Authored and reviewed user acceptance test plans (UAT), interim and final test reports.  Collaborated closely with IT developers and quality assurance staff to ensure that requirements are clearly defined and understood, and supported by solution outputs. Writing Complex SQL queries and optimizing SQL Queries Environment:Windows, Web Services, UML, UAT, MS Office, BPML, MS Project,  MS Visio, Agile, Quality Center, SQL, SQL Server MVP HealthCare, Schenectady, NY\t\t\t\t\t\t\t     Aug‘08– Dec‘10 Business Analyst  \t MVP HealthCare is a leading insurance organization that caters to the health insurance needs of the residents in NY. A FACET has been widely used across the network for the claim adjudication, claim processing and Provider Management. They provide health, life, vision, dental, long-term care coverage, and other related services. As a BA I also worked on a conversion project to upgrade their claims system FACETS which was required to accommodate EDI 5010 CMS compliance. Responsibilities:  Participated and organized requirement gathering sessions with the stakeholders to elicit and analyze requirements.  Assisted in preparing Scope Document by analyzing - various business domains interdependencies, end to end business processes of claims adjudication, various business domains scope statement, current business process flows and current system documentations. Developed solutions in compliance with the industry models / standards and implementation of Quality Management Systems & HIPPA regulation.  Involved in FACETS Implementation, FACETS billing, enrollment, and Claim Processing and Subscriber/Membership module.  Followed Workgroup for Facets Electronic Data Interchange standards for testing that need to comply with the HIPAA guidelines. Comprehensive understanding of specific provider type reimbursement methodologies. Including Dental, Anesthesia and DME Worked on Member Management, Eligibility, Claims and Billing modules within FACETS. Actively analyzed current business processes (Claims, Billing, Recipient eligibility and enrollment etc.) and worked with management to improve and implement enterprise solutions to ensure compliance Used Star Schema methodology in building the design of the logical data model into the Dimensional data modeling. Creation of  Gap/Impact Analysis and Operational Analysis  Document for Medicaid Subrogation Created and performed automated (SQL-based) report scrubbing to improve operational efficiency to define requirements and executing to delivery. Created and managed project templates, Use Case project templates, requirement types and trace-ability relationships in Requisite Pro. Produced various artifacts e.g. Functional Requirement Specifications (FRS) and Wireframes. As a point person responsible for resolving business rules/conflict resolution for the development team. As member of system architecture team designed and reviewed user interface. Developed Business case and assessed the ROI. Environment: Windows, SQL, RUP, visual basic, Oracle, Quality Center,MS Office, MS Project EDUCATION Bachelors in Business Administration"}