{"text": "Name: vera vera E-Mail: vera.vera@gmail.com Address: Atlanta, United States Github: https://github.com/vera LinkedIn: https://linkedin.com/vera Phone No. 637106884712 Summary Around 6+ years of experience in Database Administration, Development and Design Extensive experience with SQL Server 2016/2014/ 2012/2008/2008r2/2005/2000. Experience in managing Windows 2000/2003/2008 servers in a clustered environment. 5+ Years’ experience in upgrading and Migration to SQL Server 2012/2014. 5+ Years’ experience in Clustering (Active/Active, Active/Passive) 4+ Years’ experience in Setting up Always ON availability groups 5+ Years’ experience in Mirroring, Log Shipping and Replication Handled multiple SQL Instances on Cluster environment and worked on configuring logical disks and RAID levels. Extensive experience in planning and controlling the User Privileges, Monitoring the Security and Audit issues as per Standards. Experienced in performing Migration from Livelink to Microsoft Office SharePoint Server (MOSS) 2010. Strong knowledge on Active Directory Domain Services like creating users, groups and permissions Experienced in developing search scopes to customize search functionality. Experience in customization and setting workflow using SharePoint Designer 2010. Experience in configuration of users, group and permissions in domain controller. Experience in Replication – Snapshot and Transactional and extensive knowledge in Merge replication. Extensively worked on 32-bit, 64 bit and i64 clustered and standalone server environments. Experience in Filtered Indexes and Data Compressions for Performance and Optimum space utilization in SQL Server 2008 R2 Experience in automation of administrative tasks like creating maintenance plans, creating Jobs, Alerts using SQL Server agent and monitoring and troubleshooting the jobs. Identifying the bottle necks using SQL Server Profiler and Perfmon. Experience in performing Online Indexing. Experience with monitoring, troubleshooting related issues. SQL Server Management Studio(SSMS) for Developers Experience in migrating sysbase, oracle and salesforce databases to SQL server Databases. Experience in Backup tools like SQL Safe and LITE SPEED for fast and efficient database backups. Expertise in SQL Server 2005 Reporting Services (SSRS) and SQL Server 2005 Integration Services (SSIS) in Business Intelligence. Proficient with SQL Server Analysis Services. (SSAS) Experience working Oracle 11g Extensively worked on RDBMS concepts to design Relational Database model  Extensively worked on VMware and Implemented SQL Server 2005/2008/2008R2. Rebuilding the indexes at regular intervals for better performance. Implementation of SQL Logins, Roles and Authentication Modes as a part of Security Policies for various categories of users Truncated the tables of size 3TB for the replication purpose.  Involved in Monitoring and troubleshooting replication issues. Configured Server Memory for maximum Performance and effective utilization. Tools and Software Education Bachelor of Technology, Jawaharlal Nehru institute of technology, Hyderabad, India Master’s, University of Houston-Clear Lake \t\t\t\t\t\t\t\t State of California, Sacramento, CA\t\t\t\t                                March 2017 – Present                         (Employee Development Division)\t\t\t\t                               \t\t Role: MSSQL Developer/DBA\t\t\t\t   The Disability Insurance (DI) Branch of the Employment Development Department (EDD) provides temporary, partial wage replacement to eligible disabled workers of California who suffers a loss of wages when they are unable to work due to illness or injury. DI processes initial disability compensation claims and promptly pays DI benefits to those who prove eligible. Disability Insurance Automation (DIA) is an online application that automates many of the manual work processes carried out by internal DI staff. Access to DIA is also made available to external, online users to submit electronic disability claim forms through the EDD website. Responsibilities: Installed and Configured SQL Server 2014, 2012 and 2008r2 in enterprise cluster and standalone environments.  Maintained High Availability by designing proper backup strategy. Prepare systems for disaster recovery and high availability using log shipping and SQL clustering Improve database performance by examining long running SQL queries and creating appropriate indexes on the tables. Implemented regular patch management on various production, development and test SQL 2008/2008 R2 servers along with applying the latest service packs in both stand alone and clustered environment. Created Database(s) on SQL AZURE Setting up SQL Azure Firewall Create, manage SQL Server AZURE Databases Setting up Connection Strings and connecting SQL Server AZURE Databases from locally Installed Migrating legacy database systems from SQL 2000, 2005, 2008 version to higher versions of SQL server which include SQL 2008R2, 2012 and 2014. Utilized Pentaho ETL Tool for ETL Understanding AD groups in the new server, creating new logins with proper privileges. Checking error logs, SQL logs and fixing the issues to validate and to let them go live. Developed Automated Backup jobs and DBCC scripts for databases and transaction logs. Refreshing databases of 300 GB - 1.5 TB size and configuring replication, creating local publications and subscriptions to replicate data between prod and DR server for few applications. Partitioning large tables with over billion rows to effectively archive the aged data in different environments including replication environments. Create a disaster recovery strategy for the mission critical databases using SQL Log shipping to a different data centre in other states and perform a yearly disaster recovery test Installed SQL 2012 AlwaysOn Availability groups in production server systems for DR and High availability Experience in deploying SQL Databases in AZURE Improve database performance by examining long running SQL queries and creating appropriate indexes on the tables Scheduled and created Maintenance plans on databases and also created automated jobs. Implemented SAN replication and performed test failover. Experience in deploying SQL Databases in CLOUD AZURE AMAZON Designed and developed client/server applications utilizing VB 5 and Oracle to increase capacity and usability. Managed Security using Roles for various users in Development\t Use extended events functionality to monitor dead lock events. Tuning Queries and Database performance using tools SQL Server Tuning Advisor, SQL Server Profiler. Design and implement Backups and Restore database policies. Experience with Point-in-Time Recovery of backups (Full, differential and Logs). Managing security roles in SQL Suite. Scheduling and Maintaining FULL, DIFF, and LOG database backups as per the company strategy to meet the recovery point objectives Environment: Windows 2003/2008/2008R2/2012, MS SQL Server 2008/2008 R2/2012/2014, Microsoft.NET, SSRS, SSAS, SSIS, MS Visual Studio 6.0, VSS, TFS, Azure. Affiliated Computer Services\t\t\t                                                         June 2016 – March 2017 Role: SharePoint Administrator/ Developer Affiliated Computer Services Inc. (A Xerox Company) provides information technology services as well as business process outsourcing solutions to businesses, government agencies, and non-profit organizations. ACS is providing claims (CA-MMIS) processing services to California Department of Health Care Services.  Responsibilities Analysis and design structure for the CA-MMIS SharePoint systems which is replacement of live link systems. Migration of legacy Livelink systems to SharePoint 2007. Installed and Configured SharePoint Server 2007 on prod, Test Dev environments. Installed and Configured Redact it and Brave, for redacting and viewing the secure information (SSN, DOB, PHI) in the documents loaded into the SharePoint. Installed and Configured Cut and Paste tool and Bamboo list rollup webpart. Design, integration and management of Amazon Web Services cloud solutions. Provisioning of EC2 instances, built via puppet, and integrated into local area offices in 5 time zones. Amazon RDS, VPC construction, Security Group policies, IAM, Route 53, Cloud Formation, S3, Glacier, OpsWorks. Maintained and managed custom Managed Metadata Term Store for Global and site navigation Used Metalogix Content Management tool to migrate pages, lists and content types from existing legacy Farm to new SharePoint 2013 environment Migrated various Schools SharePoint sites from the legacy farm, updated all SharePoint Master Pages and Page Layouts to accommodate SharePoint 2013 needs and look and feel Installed and configured IFilter to retrieve the PDF and RFT extension files in the search results. Coordinated with Active Directory administration team for creating AD groups and revoking permissions. Using JavaScript displayed Custom List unique ID on Display/Edit form. Management of enterprise puppet environments. Maintaining test and production catalogues and writing reusable modules for use in configuration management. Created and Configured Initial web applications. Created and configure General Application Settings for InfoPath Forms Services, SharePoint Designer, Reporting Services, Content Deployment, etc. Configured incoming and outgoing email functionality Implement an effective Backup and Recovery strategy Created Custom Structure in SharePoint to replicate the Livelink folder structure. Created workflows based on the customer requirement to full fill the business processes. Created various Custom lists, Libraries and Discussions, Form Libraries, Site and List Templates and alerts. Implemented and maintained target audiences. Daily activities involved backup and restore of sites, editing permissions, maintaining alerts and end user support and Maintenance. Environment: Microsoft Office SharePoint Server 2007, Microsoft office SharePoint Designer 2007, Visual Studio.NET 2008, IIS 7.0, Windows 2008, Web Services, Visual Source Safe 6.0, CAML, XML, InfoPath, SQL Server 2008. Bank of America, NYC, NY\t\t\t                                                    February 2013 – June 2016 Role: SQL Server DBA Bank of America Corporation is a multinational banking and financial services corporation headquartered in Charlotte, North Carolina, United States. It is ranked 2nd on the list of largest banks in the United States by assets. The application that I worked on was based on retirement fund management and platform pricing application. I was also a part of asset management and fixed income management applications. Responsibilities: Installed and worked on installing SQL 2012\\2014 SQL servers. Experience in implementing High availability solutions like different Replication models (Snapshot and Transactional), Log shipping, clustering and mirroring on physical and virtual machines Performed the database full and differential backup’ for database size more than 7TB. Created and managed linked servers to Oracle and SQL Server databases Migrated the SQL jobs, SQL logins using the SQL server data tools and SSIS packages. Designed and implemented stored procedures and triggers for automating tasks Manually configured the 3 PAR SAN, Power Vault (MD3220), Local disks for the cluster servers. Configured the Mirroring between the required databases with and without witness server. Configured the required end points for the mirroring. Configured the log shipping between the databases. Experience in deploying SQL Databases in AZURE Creating SQL Server Logins and assigning Roles and Authentication Modes as a part of Security Policies for various categories of User Support. Managed Security using SQL Logins, Roles and Security Modes for various users. Developed ETL Packages and deployed them Experience in Moving Data in and out of Windows Azure SQL Databases and Blob Storage. Experience working with SQL Database Migration Wizard SQLAzureMW and Azure SQL Database Preview v12. Configured Database Mail for SQL Servers for the Positive Mail Notification. Created Maintenance Plans that helped in effective disk utilization and index maintenance. Worked extensively on SQL Server Transactional Replication with sync_type as automatic and none. Extensively worked on snapshot replication. Used to create the tables manually and then use the snapshot replication for dumping the data. Configured Server Memory for maximum Performance and effective utilization. Involved in adding the subscribers to the exiting live publishers and running the snapshots. Dropped all the publishers and subscribers on the retired servers. Created Maintenance Plans for scheduling the full, diff and T-Log Backup’s. Effectively managed disk space using LITE SPEED for Data Base Backups Extensively worked on 24 X 7 Production Database on Call Support and involved in troubleshooting SQL Server issues in various levels Environment: Windows 2003/2008/2008R2/2012, MS SQL Server 2008/2008 R2/2012/2014, Microsoft.NET, SSRS, SSAS, SSIS, MS Visual Studio 6.0, VSS, TFS, Azure JOHNSON CONTROLS, Racine, WI\t\t\t                                  March 2011 – February 2013 ROLE: SQL Server DBA  Johnson Controls International Plc is a multinational company that produces automotive parts such as batteries and electronics and HVAC equipment for buildings Responsibilities: Manage the SQL Server data systems architecture, including production OLTP/OLAP systems, reporting servers and data warehouses. Automation and standardization of SQL Server environment to operationalize repetitive tasks.  Install and configured SQL Server 2008 R2/2012on Windows Server 2008 R2 enterprise server in standalone, and extended 5 node Active/Active/Active/Active/Passive cluster environment. Implement SQL Transactional and Snapshot replication for the client databases every quarter and provide support for issues that arise with transactional and snapshot replication. Assist the team of developers with best development practices in Development, Test and production environments. Analyze and tune SQL Server for various workloads including tuning Transact-SQL code, creating Indexes, SQL Server configurations changes, and operating systems for optimal performance.  Apply Windows WSUS and SQL server patches every quarter with suitable planning and documentation. Implementation of SQL Logins, Roles and Authentication Modes as a part of Security Policies for various categories of users. Install and configured third party tools like Disk keeper, Idera SQL Diagnostic manager, and Red gate tools to monitor the SQL server regularly. Monitor the SQL servers for space regularly and perform capacity planning every quarter for new client databases. Environment: MS SQL Server 2000/2005/2008/2008R2/2012 Windows 2000/2003/2008, IIS 6.0, Backup, T-SQL, VB.NET, Lite speed, and SQL Job Manager."}