{"text": "Name: barbara barbara E-Mail: barbara.barbara@gmail.com Address: Belo Horizonte, Brazil Github: https://github.com/barbara LinkedIn: https://linkedin.com/barbara Phone No. 270746687309 PROFESSIONAL SUMMARY: 13years of experience of designing and administering VMWare, SAN storage enterprise environments, Backup Infrastructure, DR environments, and consolidation of servers, Project manager and technical lead for multiple projects including upgrades, consolidations and storage. Proven history of implementing, deploying and administering secure environment. SAN Professional having extensive IT industry experience of over 13 years on SAN, System Administration, Backup and Disaster Recovery experience.  Dealt with NetApp Management software's such as OnCommand system manager, DFM, Operations Manager, Protection and Provisioning manager and Snap Manager. Strong working knowledge on different NetApp technologies like Snapshots, Flexvol, Thin provisioning, Deduplication, OSSV, DFM - Operations Manager, Protection Manager and Provisioning Manager and Snap Restore technologies. Experience in Creating aggregates, volumes, Qtrees and LUNS in SAN and NAS environments and provisioned storage to different teams on their requirements. Expertise in building the SAN Networks, Fiber Channel Cabling, installing, configuring, administration of Brocade switches and Cisco MDS switches. Provide, build and maintain the VMware vSphere Infrastructure, Involved in the VMware implementation and expansion work, Configuring and maintaining VMware infrastructure resources including VMware vSphere/ESXi 3.5, 4.0, 5.1 and 5.5; VMware vCenter Server, Expert in Web Client to manage vCenter. Experience in implementing tiered Storage solutions such as FAST Cache and Virtual Provisioning (FAST VP) on VNX as per requirements. Good knowledge on CLARiiON Replication Applications like Snap view (Snapshot & Clone), Mirror view (Synchronous and Asynchronous remote mirroring). Deep understanding & hands-on on developing migration strategies between multiple arrays and between multiple datacenters using various Migration tools including SRDF, Recover point, Open Replicator, Snap mirror, Mirrorview, SanCopy, Veritas Volume Manager, PPME, Open Migrator etc. Experience and through understanding on Migration tools, open Replicator, SAN Copy, Open Migrator, PowerPath Migration Enabler (PPME). Maintained EMC Control Center (ECC), SYMCLI, Unisphere Manager, Navisphere Manager, Data Center Fabric Manager, Connectrix Manager, Fabric Manager and Device Manager. Effective interpersonal communication skills, learning agility and ability to handle critical situations are plus. Hands-on experience with installation, configuration, patching and troubleshooting, Experience in updating vSphere hosts using update manager, troubleshooting Windows Installer (MSI) & Windows Installer Ability to work in teams, adaptive to new environments and provide on-call support for SAN environments Demonstrated ability to interact successfully with diverse individuals and groups Excellent decision-making skills with a positive approach Technical Skills Storage – NetApp- AFF 8080, FAS 8200, 6030, FAS 6040, FAS 3170, & FAS 3020 Clusters, EMC – VNX & Clarion, DELL, QNAP Virtualization - vSphere 5.x, 6.x, ESXi 3.5, 4.0, 5.1 and 5.5, vCenter, VMotion, VDI, VBlock 300 series FC switches & Zoning – Brocade & Cisco Switches and zoning software, Connectrix Manager, Brocade / Cisco Fabric Manager OS: Windows 2003,2008,2012,2016 Volume Manager – VERITAS Volume Manager, Solstice Disk suite, ZFS mirroring Naming Services – NIS, DNS BACKUP – DataDomain, Net backup, Snap mirror, Snapshot, RMAN,  NDMP & VTL backup  Protocol: FC, NFS, CIFS, FTP, Ethernet and TCP/IP Malware protection: Falcon, Symantec, Cisco AMP PROFESSIONAL EXPERIENCE Conning,Hartford, CT\t\t\t\t\t\tOct2017 – Present Sr. System Consultant  Responsible for Data center migration to Colo facility.  Migrate Virtualized work load from Primary DC to colocation Data center, includes NetApp upgrades, vCenter versions upgrade, Cisco UCS and ESX builds Build new Citrix server, add them to farm. Test application of new servers and Migrate Citrix work load to new DC  Storage allocation to different hosts from NetApp and Xiotech using Oncommand Manager Anchor proof of concept (POC) to validate proposed solution and reduce technical risk. Design of Backup tool and configuring policies for backup and replication. Defining different tiers for backup and configuring in tool as designed  Define and implement best practice for SAN storage, VMWare infrastructure, AD and servers across all the location for Conning Backup and restoration using Veeam, NetApp andUnitrends Maintaining replication using Snapmirror for Volumes and Qtree across multiple locations   Perform all storage management tasks remotely from the data center using NetApp OnCommand Unified Manager Migrating netapp CIFS using 7 mode migration tools to new cluster ontapNetApps Performed a Host Analysis, document recommendations for any required Upgrades on Host's for smooth migration. Perform zoning, masking and mapping of storage with Brocade switches in an enterprise storage environment.  Extensive experience with Brocade switches and CISCO fiber switches Prepare OS templates for Azure, working with vendors to finalize process for VM creation VMWare Administration and managing Virtual center. Install and remove Data Center hardware to include servers, storage, network devices. Update applicable documentation. Environment:VMWare, Windows, NetApp, EMC, Veeam, Unitrends, Citrix, Azure PROFESSIONAL EXPERIENCE Nuance Communications Inc,Burlington, MA\t\t\t\tSept 2015 – Sep2017 SAN StorageAdmin Responsible for Remote Site Maintenance of servers, application, storage and backups.  Performed storage allocation to different hosts from NetApp and Hitachi HUS130 through VPLEX using Oncommand Manager and Hitachi storage navigator  Requirement gathering and design Maintain and update NAS Volumes/Qtrees business database Maintain NAS architecture documentation, policies & procedures. Space & quota management among various volumes and QtreesCreated Flex Volumes, and Data Replications based upon best practices and company standards. Define and implement best practice for SAN storage, VMWare infrastructure, AD and servers across all the location for Nuance Designed and administrated server consolidation program through use of VMware ESX server and VMware Virtual Center Administration of Clarion, Symmetrix and Celerra Backup and restoration using Veritas and Datadomain Maintaining replication using Snapmirrorfor Volumes and Qtreeacross multiple locations   Perform all storage management tasks remotely from the data center using tools such as NetApp OnCommand Unified Manager and Hitachi storage navigator Experience deploying and or managing large fiber network with strong understanding of data center to Data Center connectivity Implemented FAST policy based on the performance required and extensively worked on FAST/VP and FAST pool/policy administration. Performed a Host Analysis, document recommendations for any required Upgrades on Host's for smooth migration. Perform zoning, masking and mapping of storage with Brocade switches in an enterprise storage environment.  Engaging the EMC resources and coordinating for smooth and successful completion of the code upgrade. Extensive experience with Brocade switches and CISCO fiber switches VMWare Administration and managing Virtual center. Install and remove Data Center hardware to include servers, storage, network devices. Update applicable documentation. Environment:VMWare, Hitachi, Windows, NetApp, EMC, Netbackup, Datadomain, RMAN Employer : Zensar Technologies, Nov 2010 – Aug 2015 SAN Storage Admin Project # 1 Client Name:  Nortel Support Nortel \t\t\t\tJan 2014 to August 2015 Pune, India Roles and Responsibilities:  Design of servers and racks for relocation. Design and implementation for new backup infrastructure.  Creation of existing process document for infrastructure.  Administration of all SAN devices.  Enforcement of Change control mechanisms: Maintaining control of changes to hardware, software, and security mechanisms. Changes to information system specifications prepared and reviewed Work on different projects of IT Consulting regarding Systems and consolidation Providing technical support to team for issues Management of NAS devices like NetApp and Qnap. Vendor coordination for H/W failures. Environment:  NetApp, EMC, QNAP, Brocade, NetBackup  Project # 2 National Pen DC migration   Pune, India\t\t\t\tAug 2013 to Dec 2013  Roles and Responsibilities:  Worked as architect for VMware and EMC Create design document for EMC VNX, Vblock, Brocade switches and Data domain. Initial baseline configuration of EMC VNX and Brocade switches. Zoning of Brocade switches with storage and servers.  VNX configuration and allocation as per the design document.  Implementation of storage best practice for various applications like Exchanges and oracle.  Configuration of EMC Data domain and space allocation of backups and CIFS. Environment: EMC VNX, Vblock 300 series, EMC Data domain, Brocade. Project # 3 Data Center Migration& consolidation, Navisite,Pune, India\t\t\tAug 2012 to July 2013 Worked as architect for VMWare and NetApp Developing and deploying Data Centre Migration strategies for different Data Centre.  Develop Storage migration plan and implement as per site requirement.  Mapping of IT Infrastructure for building a consolidated platform at NaviSite Data Centre.  Execution of Proof-of-Concept for each Data Centre before Live Data migration. Environment: NetApp, VMWare, EMC, Dell, Scripting Project # 4 Due diligence for Storage consolidation, John Lewis Partnership,London, UK\tNov 2012 to Dec 2012 Understand current data handling practices. Features and configuration of current installed storage devices. Usage and data growth of storage devices. Usage and load testing on backbone FC infrastructure. Analysis of current backup process. Provide different solution for storage consolidation. Environment:NetApp, IBM, Oracle, Hitachi Project # 5 Support, Data Center Migration Value Retail.  Pune, India\t\t\tNov 2010 to July 2012 Monitoring the SAN environment with EMC Control Center and Navisphere Manager.  Providing the details for the approval for the firmware upgrade and the impact on the servers, users if any in the change ticket approval meetings. Executing seamless upgrades of vBlock infrastructure from vSphere, Cisco UCS, Cisco Nexus switches to EMC VNX arrays per VCE released certification matrix. Experience of data center technology design, configuration, and troubleshooting, and usage of NetApp and Brocade Managing backup policies, volume pools for daily, weekly & monthly backups and troubleshooting the failed backups.  On-call support and Troubleshoot issues related to Storage, Configuration Errors and HBA Connectivity Issues. In-depth understanding of NFS, CIFS, Fibre Channel administration in a NetApp Environment Performed zoning operations and backup active zoning set on brocade and cisco san switches using web tools and CLI. Involved in analyzing and implementing OS patches and hot fixes as well as other OS configurations and updates as well as Antivirus management. Updating vSphere hosts using update manager, Troubleshooting Windows Installer (MSI) Managing VMWare container and Virtual Machines, and Integrated Dell Remote Access Controller (iDRAC) Participating in the meeting for decommissioning of storage arrays which are of end of life support. Environment: NetApp, VMware, Symantec. GGCL, Subsidiary of BG Group of companies, India, \t\t\tDec 2007 – Oct 2010 System Engineer Developing specific goals to plan organize and prioritize the work. Designing, Building, Managing and maintaining highly available IT Infrastructure that includes Messaging, Directory Services, Intranet, Shared Storage, Internet Distribution and Data Backup/Restore etc for Data Center, and Disaster Recovery Site. Accountable for all the IT Infrastructure Management - Servers / Storage / VMWARE, and Vendor Management. Designing & preparing BCP / DR test plan considering classification of processes as per Standards Handling NetApp FAS3020, 2050, FAS270 maintaining production and DR site for NetApp, technologies used: Snapmirror for DR, FCP, iSCSI, CIFS, Snapdrive, and SAN Handling Bluecoat 510 series includes daily monitoring, improvisation and tracking unwanted access Served as a Team member for the Integration of IT systems for different offices locations Handling NetApp filer at multiple locations. Prepared and presented the different tiers of Storage Environment:NetApp, VMWare, Bluecoat, Exchange, Windows, EMC ITCG, India \t\t\t\t\t\t\t\t\t Jan 2006 – Nov 2007 System Engineer Installing Windows server, AD configuration, group policy implementation Accountable for the installation of various antivirus servers and backup servers Over all IT Infrastructure Management - Servers / Antivirus Server / SUS Server/ Systems & Network management, Vendors and Spares Management & User coordination. Team member for the Integration of IT systems for different offices across India such as Bangalore & Chennai. Responsible for the installation & maintenance of various Engineering software’s ICENET.NET Ltd, India\t\t\t\t\t\t\t\t Jan 2005 – Dec 2005 Network Engineer Executing&implementing the Network - Hardware Maintenance & Troubleshooting Responsible for clients PCs troubleshooting and Network connectivity Bandwidth management and network management Education: Bachelor's in Computer Engineering(B.E.), Sardar Patel University, India 2005"}