{"text": "Name: mildred mildred E-Mail: mildred.mildred@gmail.com Address: Ganzhou, China Github: https://github.com/mildred LinkedIn: https://linkedin.com/mildred Phone No. 721190338186 PROFESSIONAL SUMMARY:   Certified Business Analysis Professional with 7 years of professional and diversified experience in Business Analysis, Quality assurance, Software Validation and Business Process Re-engineering with proven ability to articulate business values. With over seven years working experience in Manufacturing, Financial and Insurance Institutions, Mortgage and corresponding Lending, Home Equity and Lines of Credit, Credit Card, Equity Markets, DerivativeMarkets, Portfolio Analysis, Mutual Fund and Property & Casualty Insurance, Claims systems In Depth knowledge of Business Intelligence and Data Warehousing and MDM concepts with emphasis on ETL and Life Cycle Development including requirements analysis, design, development, testing and implementation. Proficient with SQL queries using MS SQL Server & Oracle SQL Server Extensive experience in Business Intelligence in generating various complex reports using Business Intelligence Tools Working knowledge of System Engineering Proficient Experience working with Hadoop. Proficient experience working with Saleforce CRM, ORACLE ERP. Adept at eliciting business and functional requirements through 1-1 meeting, team meeting, interviewing, questionnaires, the Joint Application Development (JAD) sessions. Extensive experience organizing Joint Application Development (JAD) and Joint Requirement Planning (JRP) sessions, Interviews, workshops, Requirement Elicitation sessions and Rapid Application Development (RAD) sessions with end-users/clients/stakeholders and the development group. Excellent skills in documenting Business Requirements Document (BRD), Use Case Specifications, Functional Specifications, Systems Requirements Specification (SRS), Data Dictionary, Workflows Sound proficiency in analyzing and creating Use Case Diagrams, Activity diagrams, Class diagrams, Data Flow Diagrams, Business Flow Diagrams and Sequence diagrams using MS Visio. Performed an End to End web services testing and XML validation using the SOAP UI tool. Expertise in implementing Test scenarios, Test cases, System testing, Regression testing and writing. Defect Report, and Weekly Status Reporting while maintaining Requirement Traceability Matrices for baseline documents  Experience in conducting Gap Analysis and Impact Analysis, SWOT analysis, Risk Analysis, and modeling Business Process Experience working with Agile/Scrum Methodology, Waterfall and Rational Unified process in Software Development Lifecycle. Manually tested the web application to ensure the flow of the application functionality Handle the tasks of explaining UAT scope, criteria and entry/exit strategy to less trained professionals, execute UAT test cases Performed Smoke test for each New Environment and New build and Middleware. Experienced performing quality assurance, user acceptance testing, and change management control Implemented major business process assignment involving multiple, simultaneous project in onsite-offshore mode working with project managers throughout project lifecycle to manage scope, schedule, budget, and resources EDUCATIONS AND CERTIFICATIONS: Certified Business Analysis Professional (CBAP), International Institute of Business Analysis Certified Scrum Master (CSM), International Scrum Institute M.A Economics, Cleveland State University, Cleveland Ohio BSc Economics, Covenant University, Ota Nigeria TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE: J P Morgan Chase, Jersey city, NJ\t\t\t\t\t                                          January 2013 to Present Senior Business System Analyst JP Morgan Chase is a financial service company offering a variety of investment banking products. The Project implemented OTC derivatives trading platform for various products like Equities, Commodities, Fixed Income, Bonds, Interest Rate Swaps (IRS), Credit Default Swaps (CDS), Options and forward FX. An OTC derivatives trade involves multiple stages, each of which requires specific activities to be performed. The platform provides a comprehensive suite of connectivity solutions designed to meet the complex needs of the global trading community. The project also involved migration of databases from an older version of SQL server 2000 to SQL server 2008. Responsibilities: Documented system requirements and supplementary requirements, complying with industry regulations of International Swaps and Derivatives Association (ISDA), Commodity Futures Trading Commission (CFTC) and NFA (National Futures Association). Queried questions up front to determine key issues and foresee potential show-stoppers that might arise later and in-depth understanding of OTC derivatives operations Performed the as-is and to-be analysis. Interacted with front office to gather requirements and acted as the liaison between IT and business departments.  Responsible for mapping of various data elements including business, user-interface, and schema path (services) in coordination with various groups and using various tools like XML spy. Analyzed application requirements and developed an exhaustive Test Plan for testing. This involved active participation in walkthroughs and inspections on a regular basis. Performed data validation by testing source table against target table database using SQL queries through TOAD. Involved in financial analysis using investment data Enhanced end-user access to a wide variety of data using Data warehouse modeling techniques. Maintain SOX and Dodd frank documentation templates, protocols and user instructions. Using Agile SDLC Methodology, I organized and facilitated daily scrum meetings, Sprints planning meeting and sprint review meeting. Identified, analyzed, defined and documented business processes and Use Case Scenarios. Conducted joint interactive sessions with the team to decide the new enhancements and project change requests to be included in new releases. Created high level functional requirements and broke them down into User Stories. Also created Functional Requirement Documents, conducted analysis and prioritized requirements. Responsible to track, document, manage and communicate the requirements using Rational RequisitePro which helped in controlling artifacts produced by teams who are working on the same projects by keeping track of simultaneous updates and change notifications. Performed Risk Analysis of the requirements to identify the key business risk areas for the project and prioritized the application development and testing. Maintained a requirement repository for tracing requirements to test cases and solutions. Worked on web service and SOA testing. Involved in API testing for the functionalities using XML scripts. Developed the application on J2EE platform with Oracle 8i database programming. Combined the latest e-commerce technology –enterprise business XML (ebXML), SOAP. Played a key role in planning the UAT, and implementation of system enhancements and data migration and conversions Processed Testing files using Web services and make sure it’s converted into standard XML. Validated SOAP and REST services using SOAP UI pro Expertise in database testing in Microsoft SQL Server environments including designing and manipulating test data, validating stored process, jobs, triggers and replication. Perform Functionality, System Integration, Workflow Integration, Interface testing, Negative testing, smoke testing, ad hoc testing, Data Integration testing between systems, share point testing, Regression Testing Objectively identified problems and proposed design alternatives where required. Participated in the bug review meetings. Updated requirement document as per business user feedback and changes in functionality of the application.  Translated business requirements and user expectations into detailed specifications employing Unified Modeling Language (UML) using MS Visio.  Verified and maintained Data Quality, Integrity, data completeness, ETL rules, business logic. Written shell scripts to invoke the SQL Loader to load the data into oracle DB from flat files using control files Coordinating with offshore QA and Dev teams to plan and execute cross-browser and cross-device validation. Worked on payment processing system- (SQL queries for backend verification, Batch files and RUN ACH JOBS) Created functions in Java for performing operations using the objects in Locator Repository Generated the test execution report in Quality Center to be reviewed by the QA Manager and development team. Developed script and performed Web Services testing using soap UI pro tool for functional and regression testing.  Environment: Rational Rose, Rational Requisite Pro, MS Project, MS Visio, MS Office Suite (Word, PowerPoint, Access, Excel, Outlook), MS SQL 2008, Agile, cognos, Markit EDM/Cadis, Oracle ERP, Saleforce Key Bank, Cleveland, OH\t\t\t\t\t\t                           January 2011 to December 2012 Senior Business System Analyst Key Bank is a diversified banking that offers a broad range of financial operations and online services.  The project involved design, introduction and implementation of new ETF (Exchange Traded Funds) trading and risk technologies for Capital Market Equity desk. Responsibilities: Collected Business Requirements, analyzed data/workflows, defined scope, financial projections and performed cost/benefit analysis.  the gathering, designing and documenting ETF, Equities, Markit MDM and Murex specific business and technical requirements (Front and Back Office)   Acted as an interface between the business planning team and the technical development team to understand the requirements and constraints and work around these to deliver the project execution plan.  Created business process models such as data flow diagrams and Entity Relationship diagrams (ER-Diagrams) to illustrate the design of the new system. Conducted internal Technology meetings with Data Modelers, Architects and Developers to formulate  a design including Data Models and the ETL Process to source the data and to distribute data to downstream partners through XML interface   Maintain SOX and Dodd frank documentation templates, protocols and user instructions Participated in the UI work sessions and responsible for communicating the same to the team. Liaised with the technical team and created the functional specs document tying the requirements back to the scope and business requirement document. Designed and developed project document templates based on agile (scrum) SDLC methodology Facilitated daily scrum meeting, sprint planning meeting, Sprint review meeting, requirement prioritizing under Agile Environment. Created and reviewed lists of backlogs to make sure the requirements are accurately met Under Agile Methodology.  Planned and defined system requirements to Use Case, Use Case Scenario and Use Case Narrative using the UML (Unified Modeling Language) methodologies. Employed Rational Requisite Pro as a user to analyze the Business Requirements and developed test plans, test cases and test strategy using Rational Test Manager Verified and validated all defined Business Requirements and associated functionality by administering Test Strategies Reviewed and analyzed Use Cases and formulated system design and test plan templates Involved in XML testing. Involved in the executing and retrieving the data for SQL Queries. Used shell scripting to run the scripts as a part of creation of test environment and then validate the data.  Played a key role in planning the UAT, and implementation of system enhancements and data migration and conversions. Involved in Database testing by writing & executing SQL &PL/SQL queries by using SQL to validate that data is being populated in an appropriate tables & manually comparing the results with front-end values. Developed prototype of new information processing application. Facilitated collection of functional requirements from system user Worked as an Interface among users and different teams involved in the application development to promote a better understanding of the business and IT processes Performed and co-ordinated system testing, regression testing of various builds during integration, performance and user acceptance testing using Rational Test Suite Environment: Agile, MS Visio, Rational Requisite Pro, MS- Project, MS-Visio, MS-Office, Oracle, Windows NT/2007, Saleforce CRM. Wells Fargo, San Francisco, CA\t\t\t\t\t\t                              February 2010 to January 2011 Business System Analyst  Wells Fargo N.A. is an American multinational banking and financial services holding company with operations around the world. Project was about web based portfolio management and asset management system. Basel II compliance system was developed to calculate more accurately the capital provisions against credit, commercial and operational risk. The proposed system allows customers to access their accounts, update market information, trade online and evaluate their investments. The supported products included Equities and Commodities, Fixed Income derivative products. I was involved in the redesigning of these Brokerage portfolio modules. Responsibilities: Interacted with Fixed Income Traders and portfolio managers to gather derivative trading requirements.  Worked closely with Fixed Income traders to implement Eagle Pace hub and portfolio management system.  Involved in implementation of Eagle Pace system that would analyze fixed income portfolio as compared to benchmark. .  Collected Business Requirements, analyzed data/workflows, defined scope, financial projections and performed cost/benefit analysis.  Designed and developed project document templates based on agile (scrum) SDLC methodology Involved in daily scrum meeting sprint planning, requirement prioritizing. Created and reviewed lists of backlogs to make sure the requirements are accurately met.  Planned and defined system requirements to Use Case, Use Case Scenario and Use Case Narrative using the UML (Unified Modeling Language) methodologies. Employed Rational Requisite Pro as a user to analyze the Business Requirements and developed test plans, test cases and test strategy using Rational Test Manager Tested web services by generating XML SOAP requests and validated the corresponding XML SOAP responses. Verified and validated all defined Business Requirements and associated functionality by administering Test Strategies Reviewed and analyzed Use Cases and formulated system design and test plan templates Developed prototype of new information processing application. Facilitated collection of functional requirements from system user Extracted different reports as per the Business user’s Request using SQL. Worked as an Interface among users and different teams involved in the application development to promote a better understanding of the business and IT processes Analyzed data and created reports using SQL queries. Performed and co-ordinated system testing, regression testing of various builds during integration, performance and user acceptance testing using Rational Test Suite Environment: Agile (Scrum) Methodology, MS Office, MS Project, MS Visio, SQL, MS SQL 2005, XML, HP Quality Center, Eagle Pace Credit Suisse, NYC, NY\t\t\t\t\t\t\t                                       Aug 2008 to January 2010 Business Analyst  Credit Suisse is a financial firm that operates in three global divisions like Private Banking, Investment Banking, Brokerage and Asset Management. The project involved the development of the bank's new order management system. It provides Equity Portfolio Manager and Traders with a highly customizable Order Blotter, pre-trade and post-execution compliance monitoring tools, modeling, and what-if analysis. Functionalities of the system were to manage and trade equities. Responsibilities: Gathered requirement from the Business team and evaluating information gathered from operational procedures for business teams in documenting Business Requirement Document and Functional Requirement Document. Involved in identifying functional and non-functional requirements and created the Functional System Design document (FSD) Proactively communicated and collaborated with internal customers to analyze information needs and functional requirements and delivered the following artifacts as needed, including: User Stories, Test Scripts, and Mockups for business review. Possessed a thorough understanding of how to interpret customer business needs and translate them into application and operational requirements.  Served as the conduit between the customer community, the software development team, and the QA/Test Team through which requirements flow.  Developed requirements specifications via User Stories utilizing AGILE. Using Agile SDLC Methodology, I organized and facilitated daily scrum meetings, Sprints planning meeting and sprint review meeting. Collaborated with developers and subject matter experts to establish the technical vision and analyze tradeoffs between usability and performance needs. Wrote User Guide detailing Business Process Management system, allowing each team to access their specific section of the entire Business Process separately. Reviewed Stored Procedures for reports and wrote test queries against the source system (SQL Server) to match the results with the actual report against the Data mart (Oracle) Coordinate UAT with 7 individual teams and provide support. Environment: Oracle 9i, JAVA, SQL server 2005, Windows 2000, UNIX, UML, IBM Clear Case, MS Visio, MS Project"}