{"text": "Name: rose rose E-Mail: rose.rose@gmail.com Address: Yulin, China Github: https://github.com/rose LinkedIn: https://linkedin.com/rose Phone No. 278398349411 SUMMARY 5 plus years of progressive experience in all the phases of software development life cycle that includes Requirement Analysis, Design, Development, Integration, Re-Engineering, maintenance, installation, testing and support of various client/server and N-tier web applications.  Strong experience of doing Level 1, 2 and 3 Support. Experience in Data Transformation, Data Loading, Modeling and Performance Tuning. IBM Certified Curam Developer V 6. Strong in database design, domain modeling and ER diagrams design Good Experience of translating functional requirements into technical requirements. Worked extensively on web applications development and maintenance using Technologies: HTML, JSP, and JavaScript. Extensive Experience in Architecture, Design and Building Complex Business Components Developing Multi-Tier Web Applications and Server side Business Logic using XML, Servlets, JSP, Struts, JDBC, MS SQL Server, Oracle, PL/SQL. Demonstrated knowledge of J2EE design patterns MVC, Session Facade, Front Controller, Service Locator, Business Delegate, Value Object and Data Access Object patterns. Expertise in spring MVC and Web frameworks. Hands on experience with apache, tomcat and oracle application server. 5 years of Data Modeling experience using Erwin. Strong experience in Object oriented design and analysis. Good experience in Database development including schema design, SQL queries, stored procedure and user defined function creation. Good Experience of writing technical documentation. Strong interpersonal communication skills and the ability to maintain effective working relationships with co-workers, vendors, and the public. COMPUTER SKILLS Databases Access, Oracle 9i /10g, MS SQL Languages/Scripts/API C , Java, CSS, Visual Basic.net, Java Script Java Core Java, Servlet, JSP, JDBC, Multithreading Environment Tools Eclipse, Crystal reports, Visio, Word, Excel Application Servers Oracle Application Server, Apache Tomcat, IIS Web Related Others JSP, HTML, XML, UML, Rational Rose Operating systems Windows xp, 2000/2003 vista, Linux EXPERIENCE RedMane Technology, Chicago, IL\t\t                                                                 May 2015 - Present Curam Developer   \t\t\t\t\t\t\t\t The company was formerly known as Food Stamp Program provides food assistance to eligible households to cover a portion of a household's food budget. This program helps people with low income get the food they need for good health. SNAP benefits are used in place of cash to buy food. Most people must spend some cash along with their SNAP benefits to buy enough food for a month. Annually over 200 million in benefits are authorized for eligible participants in the SNAP Program. SNAP has integrated with the main HCR project developed by the State of Arkansas project. Responsibilities: Involved in creating detailed designs and implementing Snap modules. Created Interfaces to communicate with external systems. Using Java, J2ee, DB2 database and other client environment specific tools to design the client module. Used IEG script, UIM's, VIM's and JavaScript for front end development. Customized DMX, metadata, nav and tab files. Worked on Modeling of struts, facades, service layers, and entity. Implemented Junit test cases in Curam framework. Worked in scrum environment of agile development. Worked on Curam Workflow API for the Enactment of task. Software/ Environment: DB2, Web Sphere, C ram 6.0.5 Bravo Solutions\t, Washington DC\t\t\t                                                Jan 2013 – May 2015 Curam developer\t\t\t\t\t\t\t\t Confidential is leading Supply Management solutions provider, uniquely positioned to significantly enhance the performance of a company's entire sourcing cycle. Bravo's solutions provide cohesion between robust technology and professional services expertise, a combination that guarantees businesses will receive optimal support in achieving their strategic procurement objectives.  Responsibilities: Involved in data loading to web applications. Used JDBC for accessing embedded and legacy data sources. Utilized MS SQL Server Management Studio to generate SQL queries, Views, and Stored Procedures. Worked with Spring MVC Architecture. Designed and developed several dynamic web pages using JSP, HTML, CSS, Custom Tags, and JavaScript to perform client and server side validations. Applied core J2EE design patterns like Business Delegate, Service Locator, and Singleton in the business logic. Responsible for Configuration of JSP based software and implement proposed customizations in a timely and cost-effective manner. Gathering specific requirements, analyzing existing systems and finalizing various technical and functional specifications. Involved in coding, testing, and implementation of core functionality of the BravoSolution Collaborative Sourcing BCS platform software. Involved in designing of customized solutions using the BCS software to meet client needs and requirements. Involved in project-based software development and /or configuration using the BCS platform, and 3rd party software, in a timely and cost-effective manner. Contributed to the on-going design and development of enhancements to the BCS software. Effectively communicating the proposed solutions to the client and/or client-facing consulting team. Assist in analyzing client's procurement procedures in order to identify how BravoSolution's offerings can be best implemented. Make recommendations to clients and client-facing consultants on ways in which delivery can be made more efficient and cost effective. Involved in training and Level 2 support of end users on the use of BravoSolution's BCS software package. Software/ Environment: Java 1.7, Servlet, JSP, Eclipse, SQL Server, T-SQL, Win CVS, XML, XSLT, JavaScript, JRUN, JBOSS, Spring"}