{"text": "Name: anna anna E-Mail: anna.anna@gmail.com Address: Yancheng, China Github: https://github.com/anna LinkedIn: https://linkedin.com/anna Phone No. 208464661095 Data Quality Business Analyst with 7 plus years of diverse experience in Information Technology with focus on Business Analysis, Technical Analysis, Business Modeling, Requirement Gathering, Systems Analysis, Technical Documentation, System architecture, Software Validation, Development Design, Quality Assurance. In-depth understanding of all phases of Software Development Life Cycle SDLC, with focus on translating business requirements into viable technical solutions. Rich Experience in requirement analysis, client interaction, development, testing and maintenance of the Data warehouse applications. Thorough understanding of the issues involved in Data mappings, creation of technical specifications documents and design process diagrams and also development and integration of warehouse Applications. Extensive experience in developing Use Cases and documenting AS-IS and TO-BE scenarios, creating Screen Mockups, conducting Gap Analysis and Impact Analysis, SWOT analysis, Cost Benefit Analysis, Risk Analysis and Impact analyses. Experience implementing operational and dimensional logical and physical design for Data Marts, Data Warehouse and Business intelligence solutions. Experienced in development and design of reports and dashboards for supporting the business analysis in a corporate wide reporting using Business Objects (BO).  Hands-on experience in end-to-end Data warehousing process methodologies, which includes developing warehouse SQL scripts and data quality processes. Proficient in End to End testing, Functionality Testing, System Testing, Integration Testing, and Regression Testing and UAT. Extensive experience in working collaboratively with Senior Quality Assurance Analysts to develop and implement quality assurance standards, procedures. Determined testing measures for monitoring the business functions of new or enhanced systems. Expertise in Problem solving and generating Bug Reports using Defect Tracking Tools. Strong knowledge of MS Office product suite. Experience Working on Agile development methodologies Worked with Scrum Team in developing the Artifacts such as Product Backlog, Sprint Backlog, Sprint Burndown and Release Burndown. Participated in Change Advisory Board CAB meetings on the implementation of Production Changes. Assessment of risk and business continuity, change impact, resource requirements and Change approvals. Expertise in broad range of technologies, including business process tools such as Microsoft Project, MS Excel, MS Access, MS Visio, technical assessment tools and Data Warehousing concepts. SunTrust Bank, Atlanta, GA\t\t\t\tSeptember 2016- September 2018 Data Quality Business Analyst As a Data Quality Business Analyst, I was involved in working on multiple projects managing product data quality management changes to support the standardization and migration of single family loan applications.  Responsibilities: Interacted on a daily basis with the business users of the application being developed Worked independently to gather, analyze and document the requirements. Analyzed the data mapping and developed scenarios to verify the data migration from different data sources. Designed and created Data Quality baseline flow diagrams, which includes error handling and test plan flow data Performed requirements gathering, process mapping, Business process reengineering, Release management, test, and end-user support. Facilitated design negotiation and decision making between applications teams (Data Management, Metadata, Data Supply Chain, Content Management, Product Creation etc.) Chaired brainstorming session: talked with various SME’s and users and the project managers. Analyzed system specifications, business requirements for full understanding of the project. Coordinated with end users to discuss the functionality of the tool and also to discuss detected defects. Used JIRA as Requirement Management tool.  Prepared documents such as Project Scope, Project Vision, Project Success, Business Requirements, Functional Specification, Data Warehouse Process Flow (SQL queries & Crystal Reports) using MS Office (Word, Excel, Visio) and dashboards Updated the team on status of upcoming User Stories. Defined and reviewed the Data Warehouse requirements with the business users for getting the right data from the source systems for reporting purposes. Performed a GAP analysis which involved understanding the reports in the oldfinancial management system. Performed data analysis using MS Excel. Created data quality rules, involved in data quality analysis to determine cleansing requirements. Performed data mappings from the data source to the destination. Worked on profiling the data for understanding the data and mapping document. Initiated and crafted project charter by collaborating with senior business executives and technical architects; facilitated document through the global enterprise dispatch process resulting in an expedited approval of project time lines, resources and scope. Maintained user stories in JIRA and updated them accordingly. Developed Test plans, Test cases and analyzed Test results; involved in Defect tracking using HP ALM. Used SQL statements to retrieve data for reporting purposes. Created the AB Initio mapping for the Data Quality Assurance in order to match the data with the source and to find out the missing records from the Source to the Fact table. Involved in Gap Analysis and assisted the development team to understand the To-Be process.  Used MS Project to maintain the project schedule and track its status. Groomed stories effectively using OneNote as an effective tool and gathered business requirements through discussions and brainstorming sessions and conducted specification reviews and walkthroughs with the designers, developers and stakeholder. Extensively used TOAD to run SQL Queries for reporting purposes. Worked extensively with client requirements to generate customized SQL reports. Performed GAP Analysis to identify the deficiencies in the system by comparing the actual objectives with the system objectives. Created test cases for End to End testing, Functional testing and regression testing of the web based applications. Interviewed areas experts; asking detailed questions and carefully noting the requirements in a format that can be reviewed and understood by both business people and technical people. Involved in converting user requirements into business requirements, functional requirements and technical requirements.  Also created business process models from the requirements specs. Verified the business scenarios on new builds for testing by QA team. Helped the testing team to port the non-critical data from the production database to the test environment and contributing in overall testing effort by identifying the key testing areas. Worked closely with the Quality Assurance team and developed test cases, test scripts using the developed use cases as the platform. Conducted User Acceptance Testing (UAT). TD Bank, Cherry Hill, NJ\t\t\t\t\tJune 2014 – August 2016 Data Quality Business Analyst As a Data Quality Business Analyst, I worked on updating and testing an intranet application used by the agents to process mortgage applications and qualify customers for mortgage loans. Responsibilities: Created use case templates about how credit check process happened. Analysis of Business requirements & Design Specification Document to determine the functionality of the Data Warehousing and BI Processes. Wrote business scenarios for how the credit scores can be validated for each customer from the three credit bureaus (Equifax, TransUnion and Experian). Created UML diagrams to differentiate and break down the processes involved in pre-qualification, pre-approval and final loan approval. Developed Test Cases for Deployment Verification, Data Validation, End to End testing, Cube Testing and Report testing. Involved in designing, development and testing phase of Data Models and Data Marts that support the Business Intelligence Data Warehouse. Promoted UNIX/Informatica application releases from development to QA and to UAT environments as required. Use Agile systems and strategies to provide quick and feasible solutions, based on Agile system, to the organization. Worked with SQL queries such as select, insert, update and delete for data manipulations. Worked extensively with client requirements to generate customized SQL reports.  Defining and reviewing the Data Warehouse requirements with the business users for getting the right data from the source systems for reporting purposes.  Performed a GAP analysis which involved understanding the reports in the old financial management system. Created the metadata and also maintained it for all the data models and also for the newly added functionality. Created Logical and Physical data models. Involved in planning, analysis and documentation of data migration.  Managed data analysis elements on all business initiative projects. Initiated measures in validating data quality and wrote PL/SQL queries to implement data access, storage and validation routines on the database server. Interpreted logical and physical data models for Business users to determine common data definitions and established referential integrity of the system using ERWin. Data profiling and Data quality checks along with System integration rules determination and documentation. Extensively used SQL for data quality issues. Teradata utilities used for loading data into different tables.  Involved in designing and developing Data Models and Data Marts that support the Business Intelligence Data Warehouse. Developed Test estimates, training material, BI reports using Cognos. Involved in testing the Cognos reports by writing complex SQL queries. Tested SQL Packages to transform/load the staging data into schema using business logic. Worked on data quality management improvement and reconciliation. Worked on data integrity and ongoing quality control of delivered reports. Validated source data is consistent with data mappings. Work in Agile, scrum, and sprint environment in order to change the requirements and features set. Work closely SCRUM team to create test scripts and test cases to ensure coverage of all areas of the product/feature(s). Documented, coached, and elicited business requirements from subject matter experts by writing user stories resulting in a clearer, more detailed and more complete understanding of project deliverables. Responsible for documenting business specifications from the client, users, developers, designers and Subject Matter Experts for complete understanding of the business process and application so as to transform them into meaningful technical specifications and functional specification for the software development. Analyze business requirements and segregate them into high level and low level Use Cases, Activity Diagram. Defect tracking, assigning, getting defects resolved, submission, documentation and change requests. Involved in preparing Test Plans based on User Requirements Document and prepared the Test cases. Interacted with the developers to resolve the technical and implementing issues. Involved in User Acceptance Testing with the users. Hawthorne Capital Corp, Brooklyn, NY                  \t\t\tMarch 2012 – May 2014 Data Quality Business Analyst The project involved working with several teams to develop an enterprise data management system supporting primarily the mortgage loan origination and processing for Multi-family applications. This application facilitated loan officers and underwriters to maintain loan origination, Escrow analysis and Loan processing. Responsibilities:  Extensively worked with Risk Management, Mortgage Loan Servicing, Commercial and Residential Mortgage. Facilitated and managed meeting with from various business areas including mortgage servicing, loan monitoring and asset management. Obtained business requirements in form of user’s stories from users and stakeholders using JAD sessions, brain storming sessions, focus groups and personal interviews. Analyzed the as-is and to-be state of the project and performed Gap analysis, Impact analysis and SWOT analysis.\nConducted user interviews, gathered requirements, analyzed and documented the high level requirements and converted it to detail level requirement and managed changes. Performed extensive Cost benefit analysis, Requirement Analysis including data analysis and gap analysis. Identified and managed data requirements scope, risks and issues. Create daily reports in designed MS Excel spreadsheet with pivot tables. Used MS Excel to analyze, communicate, & examine organizational change. Conducted Analysis of business scenarios using MS Excel. Prioritized requirements and performed feasibility analysis and risk analysis on the application  Worked on data integrity and ongoing quality control of delivered reports. Validated source data is consistent with data mappings. Extracting the business requirements from the end users keeping in mind their need for the application. Involved in gathering and documenting the requirements that were critical to the business process and using those requirements to design application software using a Use Case approach. Conducted End to End testing. Involved in converting the business requirements into functional requirements and also created business process models from the requirement specs. Performed database integrity check using SQL and Unix Shell Scripts Updated QA Manager and Lead weekly with the testing status, which included Test Task Plan, Defect Management, and Test Metrics Executed SQL queries to verify the number of records and validated the referential integrity rules as per the design specifications.  Played a substantial role in the process identification and definition and functional requirements gathering, in an effort to develop a practical technology solution for automating the system.  Prepared Business Workflow models and used agile software development methodology to build new business processes. Outlined and modeled the process using UML to create use case diagrams and activity diagrams. Used JIRA for version control and requirement management. Logged defects in HP Quality Center. Worked extensively with the QA team for testing to ensure all quality requirements are met. Designed and developed Use Cases, Activity and data flow Diagrams, Sequence Diagrams and flow charts using UML  Documented and delivered Functional and Non-Functional Specification Document to the project team. Conducted User Acceptance Testing (UAT). Sandy Spring Bank, Olney, MDJuly 2011 – February 2012 Data Quality Business Analyst As a Data Quality Business Analyst, I was involved in Salesforce CRM project developing an application that would allow employees to access their information and manage their portfolio while maintaining a huge database to store all this information. Responsibilities: Wrote requirements about creating and maintaining database indexes. Prepared use cases for index defragmentation. Wrote test cases for integrity checks. Worked in Agile Testing and participated meetings every day in iterative environment Created and maintained detailed test cases to perform various types of testing including End to End testing, regression testing. Using Agile methodology and engage in an iterative workflow and incremental delivery of working. Prepared, scheduled and lead meetings between enterprise business and technical resources and multiple vendors in preparation for demonstrations and site visits resulting in more efficient and productive meetings with fewer follow up questions and communications. Created and maintained an Excel database.  Created process flow diagrams in MS Visio. Performed the back-end testing by using SQL Queries and verified the data integrity.  Assisted in closing gaps for associated Stories in each individual Sprint. Assisted in entering and updating Issues (Epics, Stories, and Tasks) onto JIRA Agile application. Responsible for process reengineering, change management, Business case development, project requirements management using Agile methodology. Used HP Quality Center for defect management. Co-authored business requirements document, functional requirement document with project teams. Extracted, discussed, and refined business requirements from business users and team members Designed and developed Use Cases, Use Case Diagram, Activity Diagrams, and Sequence Diagrams Assisted with users during User Acceptance Testing (UAT), developing and maintaining quality procedures, and ensuring that appropriate documentation is in place Education:  Master’s Degree SAS certified base programmer for SAS 9"}