{"text": "Name: katie katie E-Mail: katie.katie@gmail.com Address: Hengshui, China Github: https://github.com/katie LinkedIn: https://linkedin.com/katie Phone No. 52481108465 SUMMARY About 7 years experience in Data modeling and Data analysis for online transactional processing (OLTP), Data warehouse (OLAP) and Business Intelligence (BI) applications for healthcare, insurance and banking applications. \nSummary: Participated in all phases of Software Development Cycle (SDLC). Experience working with Agile and Waterfall data modeling technologies. Proficient in conceptual and logical data modeling skills using ERWIN, Sybase power designer and Embarcadero E-R Studio. Experienced in gathering requirements, creating data mapping documents, queries. Experience with gathering requirements, conducting Joint Application Development (JAD) and Joint Requirement Planning (JRP) sessions, User Acceptance Testing (UAT), Gap Analysis. Well experienced in Forward and Reverse Engineering Principles. Hands on Experience in system analysis, Relational and Dimensional Data modeling, designing the database and implementing the RDBMS specific features. Efficient in analyzing and documenting Business Requirement Documents (BRD) and Functional Requirement Documents (FRD) along with User Case Modeling and UML. Proficient in Normalizing (Using 1NF, 2NF and 3NF) and De Normalizing Techniques for optimum performance in relational and dimensional database environments. Experience in creating and documenting Data marts while designing OLTP and OLAP system Environments. Experience in identifying Facts and Dimensions and strong understanding of principles of data Warehousing, Fact Tables, Dimension Tables, Slow changing Dimension (SCD) Type I and Type II. Experience in Ralph Kimball and Bill Inmon approaches. Business Process Reengineering in Health Care Sector with prime focus on Membership, claims adjudication, migration, provider, eligibility and prior authorization for Medicaid and Medicare programs. Involved in Extracting, Transforming and Loading (ETL) data from spreadsheets, database tables and other sources using Microsoft Data Transformation Service (DTS), and Informatica along with ETL team. Experience in performance analysis and created partitions, indexes and Aggregate tables where necessary.  Facilitated data requirement meetings with business and technical stakeholders and resolved conflicts to drive decisions. Strong experience in SQL queries and functions and in creating Database Objects like Procedures, Triggers, Packages and User defined functions. Exported huge volumes of data from Teradata tables and views for processing and reporting, using Teradata Export Load utility. Experience in SQL Server DTS and SSIS (Integration Service) package design, constructing, and deployment. Experience in Data Migration, Data conversation, Data extraction, Transforming and loading (ETL) data from spreadsheets, database tables and other sources using Microsoft SSIS. Building reports using SQL SERVER Reporting Services (SSRS 2005/2008), Crystal Reports and Business Objects. Good understanding on data governance and master data management. Excellent communication skills, analytical and inter-personal skills, self-starter with ability to work with minimal guidance and interact with individuals at all levels in SDLC. Technical Skills: Professional Experience: Client Name: Sage, Mt Laurel, NJ                                                                                                                         May 2016- Present Role:   Sr Data Modeler Responsibilities:  Gathered requirements and created use case diagrams as part of requirements analysis. Created a high-level industry standard, generalized data model to convert it into logical and physical model. Defined and Identified attributes, entities and relationships in the data model as per new specifications in Visio after analyzing the database systems currently in use.  Used forward engineering to create a Physical Data Model with DDL, based on the requirements from the Logical Data Model. Used ERWIN to create logical and physical data models for enterprise wide OLAP system. Handled and maintained model versioning using ERWIN. Designed an industry based model, specific to the company with group insurance offerings, translated the business requirements into detailed production level using Sequence Diagrams, Workflow Diagrams, Activity Diagrams and Use Case Modeling.  Frequently used Teradata Utilities such as BTEQ and Mload for loading small amounts of data and Fastload for loading huge amounts of the data into the tables. Generated various presentable reports using report designer and pinned reports in ERWIN. Created action filters, parameters and calculated sets for preparing dashboards and worksheets in Tableau. Access dashboards from any browser or tablet. Created Tableau scorecards, dashboards using stack bars, bar graphs, scattered plots, geographical maps, Gantt charts using show me functionality.  Designed a STAR schema for sales data involving shared dimensions (Conformed) for other subject areas using Erwin Data Modeler. Created and maintained Logical Data Model (LDM) for the project. Includes documentation of all entities, attributes, data relationships, primary and foreign key structures, allowed values, codes, business rules, glossary terms, etc. Validated and updated the appropriate LDM's to process mappings, screen designs, use cases, business object model, and system object model as they evolve and change. Worked on Snow-flaking the Dimensions to remove redundancy. Experience in migration of AS400,Oracle to SQL Server 2012  using Informatica 9.6.  Involved in source to target(MDM) data mapping sessions with IBM as they master the target. Enforced OLTP data model referential integrity for consistent relationship between tables and efficient database design.  Identified and tracked the slowly changing dimensions (SCD I and II) and determined the hierarchies in Time and Branch Dimensions. Generated comprehensive analytical reports by running SQL queries against current databases to conduct data analysis. Performed Data Mapping activities for the Data Warehouse. Experience in Informatica data quality and analytics tools. Experience with Relational Modeling, Entity relationship modeling principles and techniques. Also created 3NF business area data modelling with de-normalized physical implementation data and information requirement analysis using ERWIN tool. Written a customized  Sql procedures to parse the  JSON data of Web application responses and load into SQL server database tables. Employed naming standard editor for defining new naming standards for the entities, attributes, domains, columns and tables that applied consistently all over the enterprise. Developed Data Mapping, Data Governance, and Transformation and cleansing rules for the Master Data Management Architecture involving OLTP, ODS. Worked on Metadata exchange among various proprietary systems using XML. Performed Data Mapping of documents to an entity using MongoDB. Handled performance requirements for databases in OLTP and OLAP models. Worked with ad-hoc reporting using Crystal Reports 9 and T-SQL. Created Data Model Using Erwin for DQM. Gathered requirements for Reporting needs of the end user SSRS. Generated comprehensive analytical reports by running SQL queries against current databases to conduct data analysis. Implemented slowly changing dimensions Type2 and Type3 for accessing history of reference data changes. Provided source to target mappings to the ETL team to perform initial, full, and Incremental loads into the target data mart. Environment: MS Visio, ERWIN, Oracle, Teradata, Oracle Designer, SQL Server, Tableau, Oracle SQL developer, Crystal. Owensboro Medical Hospital, Louisville, KY                         Role:   Sr. Data Modeler                                                                                                                                  Jun-2015-June 2016\n OMHS serves the medical needs of nine counties in western Kentucky and two counties in southern Indiana. OMHS proud to provide our community quality health care that’s ranked nationally in the top 5 percent for clinical excellence. As a Report Writer, I have worked with various departments and gathered requirements to fulfill their Reporting needs and created suitable Reports. \nResponsibilities:  Accurately Designed and Created Clarity Reports for the following applications: Inpatient, Ambulatory, HIM, ASAP and ADT. Developed various Ambulatory Reports - Open and Closed Encounters Report, My Patients with Diabetes Report, My Patients Medication Search Report, Encounter Cycle Department Report, and High Risk Medication Report etc. Procedural/Surgical Results Report, Pediatric, Oncology, Nephrology, Podiatry   Results Report etc. Developed various Willow Reports - Drug Warning by Type, Epic Rx Charge Details, Formulary Compliance, Epic Rx Charges by Medication and NDC etc. Extensive involvement in data mapping using Facets data model. Apply knowledge experience of HIPAA Act Rules and Regulations HIPAA transactions. Extensive involvement in data mapping using Facets data model. Designed and Developed Cross Tab Reports to display the Daily Census for a period of a month Created reports with sub-reports (linked and un-linked) to show the information from unrelated sources in one report Proficient in Developing Commands to be used in Reports Used forward engineering to create a Physical Data Model with DDL, based on the requirements from the Logical Data Model. Performed highly complex data analysis for a business intelligence solution. Used ERWIN to create logical and physical data models for enterprise wide OLAP system. Handled and maintained model versioning using ERWIN. Designed an industry based model, specific to the company with group insurance offerings, translated the business requirements into detailed production level using Sequence Diagrams, Workflow Diagrams, Activity Diagrams and Use Case Modeling.  Actuated Business Intelligence and Reporting. Generated various presentable reports using report designer and pinned reports in ERWIN.  Designed a STAR schema for sales data involving shared dimensions (Conformed) for other subject areas using Erwin Data Modeler. Created and maintained Logical Data Model (LDM) for the project. Includes documentation of all entities, attributes, data relationships, primary and foreign key structures, allowed values, codes, business rules, glossary terms, etc. Validated and updated the appropriate LDM's to process mappings, screen designs, use cases, business object model, and system object model as they evolve and change. Worked on Snow-flaking the Dimensions to remove redundancy.  Enforced OLTP data model referential integrity for consistent relationship between tables and efficient database design.  Identified and tracked the slowly changing dimensions (SCD I and II) and determined the hierarchies in Time and Branch Dimensions. Generated comprehensive analytical reports by running SQL queries against current databases to conduct data analysis. Performed Data Mapping activities for the Data Warehouse. Experience with Relational Modeling, Entity relationship modeling principles and techniques. Also created 3NF business area data modelling with de-normalized physical implementation data and information requirement analysis using ERWIN tool. Employed naming standard editor for defining new naming standards for the entities, attributes, domains, columns and tables that applied consistently all over the enterprise. Worked on Metadata exchange among various proprietary systems using XML. Handled performance requirements for databases in OLTP and OLAP models. Worked with ad-hoc reporting using Crystal Reports 9 and T-SQL. Created Data Model Using Erwin for DQM. Gathered requirements for Reporting needs of the end user SSRS. Generated comprehensive analytical reports by running SQL queries against current databases to conduct data analysis. Implemented slowly changing dimensions Type2 and Type3 for accessing history of reference data changes. Provided source to target mappings to the ETL team to perform initial, full, and Incremental loads into the target data mart. Environment: MS Visio, ERWIN, Oracle, Teradata, Oracle Designer, SQL Server, Oracle SQL developer, Crystal Reports, FACETS 4.71/ 5.01,HIPAA 4010/5010 Care Science Inc, Philadelphia, PA                           Role:  Sr. Data Modeler                                                                                                                                        June 2014-May 2015\n Care Science provides health care management to various clients over a web based application front-end tool with 24/7 access. Data was modeled and analyzed for clinical data management related to medical and patient information data. \nResponsibilities:  Involved in all stages of Software Development Cycle (SDLC), gathered and translated business requirements into detailed, production-level technical specifications and made enhancements to the existing technical business functionality. Responsible for analyzing Design Implementation from the business solution and business requirements. Conducted live JAR & JAD sessions with SMEs, and all the placeholders to develop High Level Requirement and then formalized those requirements into Detail Level Requirements. Worked in close co-ordination with Business People, Architects, Developers, Testers and Project Managers and also at times reported to the higher leadership. Worked on FACETS Data tables and created audit reports using queries. Manually loaded data in FACETS and have good knowledge on FACETS business rules. Did the forward and backward data mapping between the fields in mainframe and FACETS. Conducted discussion sessions to make sure that systems built are in complaint to HIPAA. Created Conceptual, Logical, and Physical data models using ER studio for new system. Developed normalized logical and physical database models to design OLTP system for applications. Worked to cleanse and organize various tables in a presentable manner to help with better understanding of already existing models. Enforced referential integrity in the OLTP data model for consistent relationship between tables and efficient database design. Business Intelligence (BI) has been engaged to work with Accounting/Finance teams to build the data warehouse and the data model to cater the reports/analytic for those specific loans. Used ER studio tool for effective model management for dividing, sharing and reusing model information. Used reverse engineering to create Graphical Representation (E-R diagram) and to connect to existing database. Created Data flow diagrams for current system. Development of ETL Processes using SSIS Packages. Migration of DTS Packages to SSIS Packages. Create ETL Jobs and Custom Transfer Components to move data from Oracle Source Systems to SQL Server using SSIS. Conducted sessions with designers, business and advancement groups to comprehend the Change Requests (CR's), and impacts brought on the framework by the change demands. Created entity / process association matrices, entity-relationship diagrams, functional decomposition diagrams and data flow diagrams. Created Technical Mapping documents for the development team to develop mapping workflows. Checked for all the modeling standards including naming standards, entity relationships on model and for comments and history in the model. Generated customized report solutions for metadata reports. Developed Data Mapping, Data Governance, and Transformation and cleansing rules for the Master Data Management Architecture involving OLTP, ODS. Generated the ad-hoc SQL queries using joins, database connections and transformation rules to get the data from oracle databases. Hands-on experience with ad-hoc reports using Crystal Reports. Improved data integrity by adding foreign keys and normalizing the underline data structure. Performed Performance tuning. Worked extensively on Forward and Reverse engineering processes. Created DDL Scripts for implementing Data Modeling changes. Created documentation and test cases, worked with users for new module enhancements and testing. Environment: ER studio, Informatica, Windows 7, Oracle, MS Excel, MS Visio, DB2, Microsoft Transaction Server, Crystal Reports, FACETS 4.71/ 5.01,HIPAA 4010/5010 Client Name: AIG, Dallas, TX                                                                                  \t\t                April 2013-June 2014 Role:   Data Modeler Responsibilities: Gathered requirements and created ER (entity-relationship) diagrams as part of requirements analysis using ERWIN. Mapped the business requirements and new databases to the logical data model which defines the project delivery needs. Redefined many attributes and relationships in the reverse engineered model and cleansed unwanted tables/columns as part of data analysis responsibilities. Worked with analysts to create reporting universes in Business Objects.  Responsible to collect, analyze and summarize data and for Data Mapping. Worked at conceptual/logical/physical data model level using Erwin according to requirements. Designed the data marts using the Ralph Kimball’s Dimensional Data Mart modelling techniques.  Identified the measures and dimensions and organizing these into facts in creating the Dimensional Model within the business requirements. Designed Fact tables, Dimension and aggregate tables for Data warehouse. Implemented naming standards, and warehouse metadata for fact and dimension of Logical and Physical Data Model. Developed Star Schema and Snowflake Schema in designing the Logical Model into Dimensional Model.  Translated the Logical Data Model into Physical Data Model with Forward Engineering in Erwin tool. De-normalized the database to put them into the star schema of the data warehouse. Extensively used star schema methodologies in building and designing the logical data model into dimensional models. Worked on slowly changing dimension tables and hierarchies in dimensions. Worked on data mapping process from source system to target system. Extracted the Metadata from the Metadata repositories to generate the Mapping Documents. Establish and maintain processes to support and grow data modeling practices, conceptual, intermediate logical/ canonical and physical data models per company direction, Solution designs, options and recommendations relating to data models and databases.  Create and deploy reports using SSRS.  Maintaining requirements documents, creating reports and spread sheets readable by the users and developers. Environment: SQL Server, SQL Server Analysis Services, SSIS, SSRS, Crystal Reports, Windows 2000, Micro strategy, Crystal Enterprise, Erwin, CSV files, XML files, Business Objects. \nClient Name: Michaels, Irving, TX                             Data Modeler/Analyst                                       \t\t\t\t\t\t\t    Oct 2012-March 2013\n Michaels is the largest arts and crafts specialty retailer in North America. Project involved mainly in creating financial static reports, worked on Tableau Desktop and Server The projects were aimed to bring new and current territories' Sales data, Master Data, and other respective fields into in-house Data warehouse, budget and forecast on those sales, and finally display Daily Sales reports. The final accepted system helped the business to make better decision on their sales, Budget, and operational efficiency of the Budget and Forecast management.\n\nResponsibilities: Connecting with data, Using the Tableau interface / paradigm to effectively create powerful visualizations. Gathered and translated business requirements into detailed, production-level technical specifications, new features, and enhancements to existing technical business functionality. Used Erwin r7.3 for effective model management of sharing, dividing and reusing model information and design for productivity improvement. Involved in the creation, maintenance of Data Warehouse and repositories containing Metadata. Responsible as a member of development team to provide business data requirements analysis services, producing Logical and Physical data models using Power Designer Worked with DBA group to create Best-Fit Physical Data Model from the Logical Data Model using Forward Engineering. Developed Data Migration and Cleansing rules for the Integration Architecture (OLTP, ODS, DW) Created documentation and test cases, worked with users for new module enhancements and testing. Utilized Power Designer's forward/reverse engineering tools and target database schema conversion process. Documented logical, physical, relational and dimensional data models. Designed the data marts in dimensional data modeling using star and snowflake schemas. Developed SQL Queries to fetch complex data from different tables in remote databases using joins, database links and Bulk collects. Used Data Stage Manager for importing metadata from repository, new job categories and creating new data elements. Written Procedures and Functions using Dynamic SQL and written complex SQL queries using joins, subqueries and correlated sub queries. Designed and developed Use Cases, Activity Diagrams, Sequence Diagrams, OOD (Object oriented Design) using UML and Visio. Environment: SQL Server, SQL Server Analysis Services, SSIS, SSRS, Crystal Reports, ERWIN ER/Studio, Oracle, SQL server, MS Excel, MS Visio, Rational Rose, Requisite Pro, PL/SQL,MS Office, MS Access. Oriental insurance Group, India     Role: Data Modeler/ Data Analyst                                                                                                           Feb 2011- Sep 2012 Responsibilities: Interacted with users and business analysts for requirement gathering. Involved in creating entity relational and dimensional relational data models using Sybase Power Designer tool.  Worked on Bill Inmon methodologies for modeling. Created tables, views, procedures and SQL scripts and mapping documents. Create logical and physical models using best practices to ensure high quality and reduced redundancy Developed Cleansing and data migration rules for the Integration Architecture (OLTP, ODS, DW) Analyzed conceptual into logical data and had JAD sessions and also communicated data related issues and standards. Expertise in the forward engineering of the logical models to generate the physical tables using Sybase Power Designer. Created tables, views, triggers, stored procedures and indexes.  Created integrity rules and defaults.  Created ftp connections, database connections for the sources and targets. Developed several forms & reports using Crystal Reports. Analyzed existing logical data model (LDM) and made appropriate changes to make it compatible with business requirements.  Resolved the data type inconsistencies between the source systems and the target system using the mapping documents and analyzing the database using SQL queries.  Maintained security and data integrity of the database. Environment: Sybase Power Designer, Visio, Excel, Word, Power Point, Microsoft Project and MS Excel, SQL Server, SQL PLUS, Windows XP, Crystal Reports. Client Name: Integrated Wireless Systems, India                                                                                      June 2009-Jan 2011 Role: Data Modeler/ Data Analyst Responsibilities: Involved in all the Functional requirements gathering sessions with the Business Analysts.  Design and Development of Requirements Specification document, business process modelling using UML.  Used SQL*Loader to load the database from flat files. Created a logical design of the central relational database using Erwin. Expertise in the forward engineering of the logical models to generate the physical tables using Erwin. Done SQL Server configuration database size estimation, database creation logins & user’s creation, granting object level permission, estimation of indexes on tables. Configured the DTS packages to run in periodic intervals. Extensively worked with DTS for Data Migration from source systems. Involved in writing Triggers which internally called procedures and functions. Maintained Data Security and Data Integrity of the Database. Environment: SQL server, Erwin, UML, Windows NT, Crystal Reports"}