{"text": "Name: sophie sophie E-Mail: sophie.sophie@gmail.com Address: Changde, China Github: https://github.com/sophie LinkedIn: https://linkedin.com/sophie Phone No. 834787159380 PROFESSIONAL SUMMARY\t 6+ years of extensive experience in Data Analysis, Business System Analysis, Software Validation and business process re-engineering with proven ability to articulate business values. Strong experience in Business and Data Analysis, Data Profiling, Data Migration, Data Conversion, Data Quality, Data Governance, Data Integration, and Metadata Management Services, Business Requirement gathering, Business Process flow, Business Process Modelling, Data Warehouse Design, ETL, OLAP. Elicited requirements from the business users using various requirements elicitation techniques and skilled in creation of BRD (Business Requirements Document), FRD (Functional Requirements Document) and SRS (Software Requirements Specification) documents. Conducted (JAD) Joint Application Development, (JAR) Joint Application Review sessions to develop a clarity on the business users requirements. Extensive Knowledge of Data Quality Analyst with strong understanding of Data Governance principles. Facilitated several project kick off meetings, reviewed information from business owners to produce clear and concise agenda for the project. Exposure to Enterprise Information Management (EIM). Extensive knowledge of annuities, rating, commercial(automobile, BOP, CPP, Property, Liability, Worker’s Compensation) and life insurance products  Experience creating BI reports using Tableau and IBM Cognos. Experience in creating SSIS packages. Experience in testing complex reports generated by reporting tools like Cognos, SSIS. Knowledge of policy ratings, investigating claims, negotiating settlements, and authorizing payments Worked with Technical Writers to decide manual policy ratings for claims and loss controls. Worked for Workers Compensation Lines and Products and various Business Owner Property Products. Customized data extractions and loading into micro-sites with different user access and authorization using Microsoft SharePoint. Satisfied the end clients with data collection and analysis to provide a comprehensive metric performance reports. Seasoned in (UAT) User Acceptance Testing, creation of user acceptance test cases, documenting test results and follow up activities to meet business user’s requirements. Ensured project performance in AGILE environment using SCRUM methodologies, worked as a SCRUM Master collaborating in activities which involved sprint/standup meeting, sprint planning, review and retrospective meetings. Technical Skills  Professional Experience PROFESSIONAL EXPERIENCE: Finance of America Mortgage, Charlotte, NC\t\t                        February 2017 – September 2018 Technical Business Analyst/Data Analyst/BI\t The project involved working with several teams to develop an enterprise Business Intelligence (BI) system supporting primarily the mortgage loan origination and processing for Multi-family applications. This application facilitated loan officers and underwriters to maintain loan origination and Loan processing. As a Technical Business Analyst/ Data Analyst, I worked on multiple data migration projects helping technical teams, Data Warehousing, Business Intelligence (BI) and Data Management. I was involved in business processes analysis and assist stakeholders in navigating \"as-is vs. \"to-be decisions. I developed various business deliverables such as Process Flow and sequence diagrams, functional designs, user stories, Business Rules documents, real-time scenarios covering rules and functionality, also created requirement matrix and assessment report.   Responsibilities: Elicited business requirements through interviews, surveys, and artifact digging from process documentation, account managers views and UI (User Interface). Worked with client on their Data Governance Strategic Planning initiatives and developed a Unified Data Model. Participated in Daily Agile Scrum “Stand-up”, Biweekly Sprint Planning and Retrospective Sessions and update the team on status of upcoming User Stories. Initiated and crafted project charter by collaborating with senior business executives and technical architects; facilitated document through the global enterprise dispatch process resulting in an expedited approval of project time lines, resources and scope. Use Agile systems and strategies to provide quick and feasible solutions, based on Agile system, to the organization. Coordinate with business units for gathering, elucidation, scoping, phasing, feasibility analysis of requirements on SharePoint platform. Conducted JRP sessions with management, SMEs (Subject Matter Expertise), vendors, users and other stakeholders for open and pending issues to develop specifications.  Prepared Dashboards using calculations, parameters in Tableau. Provided programming support of ad-hoc JIRA requests and special projects as assigned directly or through AGILE.  Project interactions with business analysts and business users to communicate and clarify the results and business needs.  Interacted with SMEs to encourage best practices for Enterprise Information Management (EIM).  Conducted analysis of client Business Intelligence (BI) processes and functional or reporting requirements.  Data manipulations including the usage of standard SAS procedures and use of SAS Macros.  Executed peer reviews for design and code and elaborate documentation of standards, best practices, and test procedures.  Used Tableau to generate and manage custom and ad-hoc Business Intelligence reports. Understand and articulate business requirements from user interviews and then translate requirements into functional and technical specifications.  Documentation of Gap Analysis, Workflow Development, Requirements, Governance Policies & Procedures, Roadmaps. Extensively used SQL statements to query the Oracle Database for Data Validation and Data Integrity. Extensively wrote standard and complex SQL queries to perform data validation to make sure test results matched. Cooperated in the development of documentation for the sites and custom SharePoint applications also created and maintain test cases and test script documentation for custom applications. Interacted with fixed income business heads to finalize the Business Requirements for the Risk Management process. Performed Data mining of the application to determine data properties and structure. Created SQL scripts to extract the data from the operational database into simple flat text files. Created BI reports in Tableau. Involved in building, publishing customized interactive reports and dashboards, report scheduling using Tableau server. Created action filters, parameters and calculated sets for preparing dashboards and worksheets in Tableau. Effectively used data blending feature in tableau. Defined best practices for Tableau report development. Administered user, user groups, and scheduled instances for reports in Tableau. Involved in all mapping documents from source to target, maintaining field names to comply with internal database administrators, data owners, data governance. Performed System and Integration Testing along with testers. Conducted UAT with the business.  Assisted testing teams in defect management using HP ALM. State Street Bank, Boston, MA\t\t\t\t\t\tJuly 2014-December 2016 Technical Business Analyst/BI As a Technical Business Analyst/BI, I worked on the data migration project for Loan Origination applications used by the agents to process mortgage loans and select qualified customers. Responsibilities: Interacted with the SMEs and stakeholders to get a better understanding of client business processes and gather business requirements.  Modeling the as-Is system and doing the complete Gap Analysis for the existing system in order to map it to the To-Be system.  Using Agile methodology and engage in an iterative workflow and incremental delivery of working. Prepared, scheduled and lead meetings between enterprise business and technical resources and multiple vendors in preparation for demonstrations and site visits resulting in more efficient and productive meetings with fewer follow up questions and communications. Assisted in closing gaps for associated Stories in each individual Sprint. Assisted in entering and updating Issues (Epics, Stories, and Tasks) onto JIRA Agile application. Was part of daily Scrum work meetings and weekly project progress meetings Identified Use cases from the requirements and wrote Use Case Specifications  Served as a Peer review member to verify, validate and modify necessary changes made considering technical and business aspects in the deliverable documents and thereby uploading it on SharePoint.  Worked on SharePoint Insights and create links in site for client access to reports. Worked with data quality governance teams to ensure each work-stream and project within the Basel II framework adhered to strict data quality and maintenance standards. Conducted JAD sessions for communicating with the all Project directors and stakeholders. Generated Business Intelligence (BI) reports using Tableau. Reviewed client's Data Governance policies, standards, and procedures requirements along with future data management needs and developed the best practices for data management services. Data analysis/mapping/modeling reference data repository project to improve quality of credit risk exposure information across business units for a leading fixed income financial guarantor Focus was on designing the RDB, use cases requirements, activity, and class/data models.   Used HP ALM for defect management. Extensive use of SAS, SQL by handling complex joins and conditions. Created dynamic Macro arrays by SQL and with data step programs.  Involved in creation and updates of several SQL Index, Views, complex stored procedures, triggers and appropriate user defined functions.  Created physical, conceptual and logical data models for clear understanding of the requirements.  Created various views, volatile and permanent tables to load data into the database tables. The above was accomplished by choosing a good primary index. Generated Business Intelligence reports in Tableau. Conducted User Acceptance Testing (UAT) and System Integration Testing (SIT). Evaluated and tested new or modified software functionality to verify that software functions according to user requirements and conform to establishment guidelines. Includes the writing and executing of test plans, test cases, and test scripts.  Created adhoc reports to users in Tableau by connecting various data sources. Handled Tableau admin activities granting access, managing extracts and Installations. Used SQL Server Database query for analysis. Conducted data analysis and participated in the design of the conceptual model, data warehouse and overall data architecture including evaluation of data management options and data governance. Linked business processes to organizational objectives, perform critical path analysis, and identify opportunities for business process improvement  Communicated extensively with the clients and with different levels of management to identify requirements, use cases and to develop functional specifications. Created Use-Cases and Business Use-Case Model after accessing the status and scope of the project and understanding the business processes Reporting and updating any issues to SharePoint repository, as necessary. Created test plan and test cases for User Acceptance Testing (UAT).  Franklin Templeton Investments, Fort Lauderdale, FL          \t\tMay 2013– June 2014 Technical Business Analyst/BI This project was developed to involved in developing a portfolio management system that provided access to comprehensive information for examining and modeling any aspect of a prospective transaction for immediate execution Responsibilities: Gathered and documented requirements for the Master Data Management perspective with the help of various Tools including but not limited to Use Cases, Process Flow Diagrams, Business Rules for Source-To-Target Mapping Importing all Reports from web report studio, Stored Process, BI Dashboard and Information Map to Information  Coordinating agile based planning/review activities and meetings, followed Iterative Software Development Life Cycle Process, Agile using Scrum Understood and articulated business requirements from user interviews, weekly requirement gathering sessions and then converted requirements into technical specifications Created Mockup screen/ Wireframe and Swim Lanes using MS Visio. Involved in detailed discussions for End-to-End Process for various business processes like Account level Reporting, Balance Transaction Reporting, Payments and Statements Processing  Performed Data Profiling of current state of data in the Data Warehouse by doing Data Analysis using advanced SQL Queries and Microsoft Excel, finding Gaps in Data and formulating solutions for the same Developed, implemented and managed data governance processes. Involved in data migration project.  Responsible for Documentation on Fixed Income & Credit Derivatives to understand the business workflow. Conducting Daily Stand up Meetings & Creating Meeting Minutes & Update them in SharePoint. Ensured that Business, Data Governance and Integration team are deeply involved in critical design issues and decisions. Involved in continued development and maintenance of Tableau dashboards and Crystal reports. Used SQL Server Database query for analysis. Coordinated and verified successful completion of UAT for the program and provided end user training. Conducted internal Technology meetings with Data Modelers, Architects and Developers to formulate a design including Data Models and the ETL Process to source the data and to distribute data to downstream partners through XML interface  Column profiling done for generation of basic statistics like number of Distinct, Duplicate, Null values on each columns in the customer tables using Teradata.  Created summary columns which are used for analysis  Integration between SharePoint and alternative solutions in Microsoft Access, Excel and SharePoint Excel Services to aggregate budget and distribution data for dashboard reporting Served as a Subject-Matter-Expert for the Master Data Management’s project to provide Cash Management Services for scoping and analyzing future requirements Work with external consultants to define investment functions, data governance, and improvements to the quality and timeliness of data.  Developed Source-To-Target Mapping for the Data Mart incorporating various Business Rules Analyzed and verified the integrity and reliability of the Loss Data, Exposure Data and Risk rating calculations in the Lending Repository  Collaborated with the QA Team to help build test scenarios and test cases and also do some ad-hoc manual testing using SQL First Financial Bank, Terre Haute, IN                                                              August 2012 – April 2013 Business Analyst I was involved in the data/business analysis of an online banking application that enables the bank’s customers to access their accounts through the Internet. Account holders enter their user ID and password to access their personal accounts, which includes checking, savings and money market account. The application provides the accounts lists, account summary, transactions records for various accounts and the ability to transfer funds between the various accounts using wire transfers. Responsibilities: Prepared departmental reports, meeting minutes providing analytical framework related to the budget process Gathered Business Requirements, analyzed data/workflows, defined the scope, and performed GAP analysis.    Facilitated and managed meeting sessions with SMEs from various business areas to capture requirements for enhancements in the application.  Assisted with Business Requirements Document (BRD) and Functional Requirement Document (FRD) for the business and technical sides. Conducted System Integration testing (SIT). Checked the data flow through the frontend to backend and used SQL Queries to extract the data from the database. Created ad-hoc and Business Intelligence  (BI) Reports using Tableau. Created and maintained SQL Queries for back-end testing from MS SQL Server. Followed established formats and procedures, created new formats, as well as researched, created, edited technical and business data documents.  Designed and executed performance and functional test scripts. Worked with the Senior Business Analyst to conduct JAD sessions with business and technical units. Acted as main point of contact for all in-bound HRIS related requests from Managers and HR staff. Implemented continuous HRIS process improvements. Used UML diagrams to visually express the core functionality of the System under Development.  Used Quality Center to run manual and automated tests, report execution results. Interacted with the developers to report and track bugs using HP ALM. Followed up with developers on defects status on a daily basis. Worked with the BA / QA team to develop test plan and test cases for User Acceptance Testing (UAT) Education: Bachelors "}