{"text": "Name: pauline pauline E-Mail: pauline.pauline@gmail.com Address: Dar es Salaam, Tanzania Github: https://github.com/pauline LinkedIn: https://linkedin.com/pauline Phone No. 147369232528 SUMMARY: Around 8 years of IT Experience in designing, developing, testing and implementing of various stand-alone and client-server architecture-based enterprise application software in Python on different domains. Good experience in developing web applications implementing Model View Control architecture using Django, Flask and Pyramid Python web application frameworks. Basic understanding of protocols/technologies like HTTP, LDAP, JDBC, SSL, Servlet/JSP, SQL, HTML, XML. Good knowledge on front end frame works like CSS, Bootstrap. Experience with Design, code, and debug operations, reporting, data analysis and web applications utilizing Python. Strong experience in Big data, Bigdata Integration and Analytics technologies including Apache Spark, Hadoop, Kafka. Good Experience with Django and Flask, high-level Python Web frameworks. Sound experience in Object Oriented Programming using concepts like Multi-Threading, Exception Handling and Collections. Knowledge about setting up Python REST API Frame work using Django and Flask. Good Knowledge in implementation of Python best Practices (PEP-8). Good at writing SQL Queries, Stored procedures, functions, packages, tables, views, triggers using relational databases like Oracle, MySQL, PostgreSQL, DB2. Proficient in using editors Eclipse, Visual Studio Code, PyCharm, PyScripter, Notepad++ and Sublime Text while developing different applications. Having good knowledge in using NoSQL databases like Apache Cassandra (1.2, 2.0 and 2.1), Couchbase, Kubernetes and Mongo DB (2.6, 2.4), Orient DBF net. Having experienced in Agile Methodologies, PCI, Scrum stories and sprints experience in a Python based environment, Data analytics, data wrangling and Excel data extracts. Worked on various operating systems like Windows, UNIX and LINUX. Experienced in Shell Scripting and UNIX commands. Shares expertise throughout the organization and may provide user training for products Excellent in Business Analytics. Interpersonal and communication skills, efficient time management and organization skills, ability to handle multiple tasks and work well in team environment. Authorized to work in United States for any employer. Technical Skills: \n Education: Bachelor's in Computer Science, Osmania University Hyderabad, Telangana Work Experience\n Samsonite - Mansfield, MA                                                                                      Jan 2017 - Present Python Developer \nDescription: Samsonite is the worldwide leader in superior travel bags, luggage, and accessories combining notable style with the latest design technology and the utmost attention to quality and durability. We are principally engaged in the design, manufacturing, sourcing, and distribution of luggage, business and computer bags, outdoor, casual bags, travel accessories and slim protective cases for personal electronic devices.\nResponsibilities: Designed and developed the server module and resolved issues and responsible for its enhancements. Architected and developed Python with Flask for the backend development and front-end application using Angular and PostgreSQL for the database. Defined different Django API profiling techniques for faster rendering information. Used Ansible, Vagrant, and Docker for managing the application environments. Implemented various Validation Controls for form validation and implemented custom validation controls using Object Oriented JavaScript. Working close together with QA and Operations teams to understand, design, and develop and end-to-end data flow requirements. Developed Restful MicroServices using Flask and deployed on AWS servers using EBS and EC2. Developed views and templates with Flask WTForms to create a user-friendly website interface. Use SQLAlchemy queries  Worked on RabbitMQ queues. Imported data using Sqoop to load data from MySQL to HDFS on regular basis. Used Circle CI for continuous integration and delivery platform over GIT. Used Flask Migrations for designing and expanding of the database. Automated most of the daily task using python scripting. Involved in the CI/CD pipeline management for managing the weekly releases. Worked on Jira for managing the tasks and improving the individual performance. Making recommendations to the team in terms of appropriate testing techniques, shared testing tasks. Environment: Python 3.6, Flask, Rest, Flask, Angular, Redux, Circle CI, Vagrant, Splunk, New Relic Server, GitHub, Ansible, HTML5/CSS, PostgreSQL, Toad, Amazon Web Service (AWS), S3, EC2, EBS, PyCharm, Microsoft Visual Code, Linux, Shell Scripting, JIRA. \nTarget, Minneapolis, MN                                                                                    Mar 2015 – Dec 2016                                                                                    \nPython Developer \nDescription: Target is recognized as a leader in innovation across the retail industry. From pioneering the concept of designer partnerships to consistently being best in class in store design, Target remains focused on not only meeting, but exceeding, its guests' needs.\nResponsibilities: Involved in analysis, specification, design, and implementation and testing phases of Software Development Life Cycle (SDLC) and used agile methodology for developing application. Upgraded existing UI with HTML, CSS, jQuery and Bootstrap. Working as an application developer experienced with controllers, views and models in Django. Used Salt Stack to configure and manage the infrastructure. Restful web services using Python REST API Framework Implemented the application using Python Spring IOC (Inversion of Control), Django Framework and handled the security using Python Spring Security. Tested entire frontend and backend modules using Python on Django Web Framework. Responsible for handling the integration of database systems. Developed Server-side automation using Node JS scripting and connecting different types of SQL and NoSQL stores from Node JS. Used object-relational mapping (ORM) solution, technique of mapping data representation from MVC model to Oracle Relational data model with an SQL-based schema Implemented Performance tuning and improved the Performance of Stored Procedures and Raw Queries for independent REST services. Installed and configured py Builder for application builds and deploying it. Used Selenium Library to write fully functioning test automation process that allowed the simulation of submitting different we request from multiple browser to web application Used Jenkins for continuous integration for code quality inspection and worked on building local repository mirror and source code management using Git hub. Used IDE tool to develop the application and JIRA for bug and issue tracking. Wrote unit testing codes using unit test, resolving bugs and other defects using Firebug, Used JIRA to assign, track, report and audit the issues. Used GIT to coordinate team development. Environment: Python, Django Web Framework, HTML, CSS, Oracle, NoSQL, JavaScript, jQuery, Sublime Text, Jira, GIT, py Builder, unit test, Firebug, Toad, Web Services. Nielsen, Tampa, FL                                                                                                Jul 2013 – Feb 2015 Senior Python Developer\n\nDescription: Nielsen Holdings PLC is a global information, data and measurement company with headquarters in New York City, USA. Nielsen operates in over 100 countries and employs approximately 44,000 people worldwide.  Responsibilities: Used UML Rational Rose to develop Use-case, Class and Object diagrams for OOA/OOD techniques. Built database Model, Views and API's using Python for interactive web-based solutions. Placed data into JSON files using Python to test Django websites. Used Python scripts to update the content in database and manipulate files. Developed web-based application using Django framework with python concepts. Generated Python Django forms to maintain the record of online users. Used Django API's to access the database. Involved in Python OOP code for quality, logging, monitoring, and debugging code optimization. Developed tools to automate some base tasks using Python, Shell scripting and XML. Created Unit test/ regression test framework for working/new code. Used PyQt to implement GUI for the user to create, modify and view reports based on client data. Installed and maintained web servers Tomcat and Apache HTTP in UNIX. Developed efficient Angular.js for client web-based application. Working in team of Architects and Developers to build and deploy Python Flask Peewee Linux AWS. Responsible for designing, developing, testing, deploying and maintaining the web application. Designed and developed the UI for the website with HTML, XHTML, CSS, Java Script and AJAX. Involved in working with Python open stock API's. Design, develop, and deploy engaging web applications using Python. Develop applications that use MongoDB. Wrote Python code embedded with JSON and XML to produce HTTP GET request, parsing HTML data from websites. Wrote Python code to simplify lists in Python with list comprehension and Python OOP. Worked with POSTMAN for API testing. Developed REST APIs and created User Model for application. Developed a complete front-end application with Bootstrap. Developed remote integration with third party platforms by using RESTful web services. Environment:  Python, Django, JSON, HTML, XHTML, CSS, Java Script, RESTful web services, UNIX, PyQt, AWS, Shell. \nPar Pharmaceutical - Montebello, NY                                                                Nov 2011 – Jun 2013\nPython Developer \nDescription: The Project is to development of drug development and treatment tracking system. Also, there was Worked on conversion of Sales/Back Office Integration system from PHP to Python/Django System.\nResponsibilities: Involved understanding the current business process, defining scope of the project along with position statement. Re-engineered various modules for implementing changes and creating efficient system. Developed dynamic web pages using python Django Frameworks. Used Python and Django creating graphics, XML processing, data exchange and business logic implementation. Supported Apache Server on Linux Platform. Installation and setting up Python/Unix test beds. Created use-case scenarios and storyboards in MS Word and MS PowerPoint for better visualization of the application. Write Automation/test python scripts to test. Used HTML, CSS for front-end applications. Used python scripts to update content in the database and manipulate files. Resolved issues and improvised the process to ensure a stable and accurate solution. Generated Python Django Forms to record data of online users Python OO Design code for manufacturing quality, monitoring, logging, and debugging code optimization Responsible for analysis, design, development and integration of Market Risk applications with PYTHON. Held meetings with client and worked all alone for the entire project with limited help from the client. Worked on writing and as well as read data from csv and excel file formats Provided technical and business knowledge to clients. Analyzed data using Excel VBA scripts and Macros Working with the architect, developers on business and technical issues, helping in designing the system; and testers to ensure all requirements are correctly translated. Managed requirements and tasks using JIRA Automate the outbound/inbound EDI document to drop files in the client ftp server Data mapping, logical data modeling, created class diagrams and ER diagrams and used SQL queries to filter data within the Oracle database. Environment: MS Visio, JIRA, UML, Python 2.7, Sublime text2(IDE) Windows 7, SQL, Requests, urllib, urllib2, Beautiful soup, Django. \nNorth Face Holdings - Hyderabad, Telangana                                                  Aug 2009 – Oct 2011 Python Developer Responsibilities: Work with team of developers on python applications for RISK management. Design, develop, test, deploy and maintain the website. Designed and developed the UI of the website using HTML, AJAX, CSS and JavaScript. Designed and developed data management system using MySQL. Rewrite existing Python/Django modules to deliver certain format of data. Used Django Database API's to access database objects. Wrote python scripts to parse XML documents and load the data in database. Handled all the client-side validation using JavaScript. Expertise in writing Constraints, Indexes, Views, Stored Procedures, Cursors, Triggers, and User Defined function. I have also used Selenium Library to write fully functioning test automation process that allowed the simulation of submitting different we request from multiple browser to web application. Used JQuery for all client-side Java script manipulation. Created unit test framework for working/new code Using Subversion control tool to coordinate team-development. Developed entire frontend and backend modules using Python on Django Web Framework. Responsible for debugging and troubleshooting the web application. Developed views and templates with Python and Django's view controller and templating language to create a user-friendly website interface. Environment: Python, Django 1.3, MySQL, Linux, HTML, XHTML, SVN, CSS, AJAX, Bugzilla, JavaScript, Apache Web Server, Django"}