{"text": "Name: josephine josephine E-Mail: josephine.josephine@gmail.com Address: Huaihua, China Github: https://github.com/josephine LinkedIn: https://linkedin.com/josephine Phone No. 683310510273 PROFESSIONAL SUMMARY: About 7+ years of IT experience in Design, Development, Testing and Administration spanning all facets of package software and Saas application implementation.  Over 6years of experience in the Salesforce.com CRM space that includes Business Analysis, Administration, Configuration, Implementation, Development and Support experience.  Experienced in Discovery Phase, Scoping Phase, Analysis and Implementation Phase. Proficient in Agile Methodology. Strong Requirements gathering experience and documentation skills which includes Conducting User Interviews, transforming business requirements into user requirement specification, Functional Requirement Specifications Document (FRD) and Use Case Narratives. Implementation experience of Salesforce.com applications like the Sales, Marketing and Service and Support Modules. Extensively worked in integration using Cast Iron Tool. Used different data tools - Apex Data Loader, Import Wizard, SFDC Data Export, Mass Delete. Experience in producing and consuming Rest based web services. Experience in performing data migration from Legacy Systems using Data Loader. Expertise in Service Cloud console with exposure to CTI adapters and mobileapplication integrations. Proficient in Case Management using assignment, escalation, workflow rules and actions. Worked on various salesforce.com standard objects like Accounts, Contacts, opportunities, Products, Price books, Cases, Leads, Campaigns, Reports andDashboards.  Have in depth Knowledge and understanding of CRM business processes like Forecasting, Campaign Management, Lead Management, Order Management, Account Management, and Case Management. Designed Custom Formula Fields, Field Dependencies, Validation Rules, Work Flows, and Approval Processes for automated alerts, field updates, and Email generation according to application requirements.  Extensive experience of using declarative features like validation rules, workflows, approval process, dynamic approval process, sharing rules automation for satisfying complex business process automations.  Implemented security and sharing rules at object, field, and record level for different users at different levels of organization, also created various profiles and configured the permissions based on the organizational hierarchy.  Expertise in Force.com technology stack: APEX, Visual Force, SOQL, SOSL.  Experience in building Visual Force Pages, Visual Force Custom Controllers/ Components, Advanced Search Functionality, Reports, Dashboards, Tabs. Installed Salesforce Apps, configured and maintained user security permissions in compliance with organizational Needs . Created page layouts, search layouts to organize fields, custom links, related lists and other components on a record detail and edit pages.   Experience integrating SFDC with applications like Microsoft Outlook, ACT, etc. Knowledge in developing web-based applications using Java, PHP, XML, CSS, HTML, DHTML, XHTML, JavaScript and AJAX Technology. Basic understanding of SOAP Based web services and WSDL. Proficient in developing and implementing Web service integration. Experience in J2EE architecture, design patterns, objects modeling using various J2EE technologies and frameworks. Developed applications by using JSP, JSTL, HTML, Java Scripts, and Ajax. Experience in designing, developing and deploying J2EE applications on Apache Tomcat, JBossetc.  Good Knowledge of RDBMS, SQL, Microsoft Excel and Access. Expert in tasks such as data extraction, transforming and loading using SQL* Loader, Oracle External tables, database links in Oracle and DTS transformations in SQL Server for various file formats. Flexible, enthusiastic and project oriented team player with solid communication and leadership skills to develop creative solution for challenging client needs. Experience of working with diverse database platforms including Oracle, SQL server, MS Access. Involved in requirement gathering from the client location, knowledge transfer and setting expectations on project progress at the client end.  Excellent communication and inter-personal skills, accustomed to working in both large and small team environments.  A team player with a strong work ethic, a positive attitude and the ability to make the best use of individual resources.  Technical Skills: Professional Experience: Hewlett Packard, Aug 14 to Present Location: Houston, TX Role: Salesforce Admin/Developer                                                            \t The Hewlett-Packard Company(HP) is an American global information technology company headquartered in Palo Alto,California, United States. It develops and provides a wide variety of hardware components as well as software and related services to consumers, small- and medium-sized businesses (SMBs) and large enterprises, including customers in the government, health and education sectors. Responsibilities:  A team of 6 developers provide guidance to the team and involved in designing phase. Supporting of the complete salesforce activities for the entire organization after the initial package deployed by Salesforce.com. Used Salesforce Chatter to provide real time notifications of changes in accounts, leads and opportunities to help sales and service teams to be more efficient. Worked in three different production instances within the organization, involved in various configuration and setup activities and in production support. Identified as the Premier Support contact person for the organization, open cases with Salesforce, follow up until the issues are resolved. Imported data by mapping to business objects in CRM system using Apex data loader and Import/Export wizard. Worked with REST based Web Services. Extensively worked for both person and Company  Accounts of the organization Involved in developing visualforce pages, triggers and apex classes based on the requirements. Proficient in creating record-types, page-layouts and profiles to hide/show visibility to various fields. Implemented pick lists, dependent pick lists, lookups, junction objects, master detail relationships, validationrules and formula fields to the custom objects Used REST API for communicating with internal PHP system. Exposure to various latest features of salesforce like Permission Sets to give user-specific permissions, content management, documents and libraries. Manage users, public groups, profiles within the SalesforceCRM. Use Data Loader for insert, update, and bulk import or export of data from Salesforce.com Objects. Use to read, extract, and load data from comma separated values (CSV) files. Perform imports of accounts and contacts data via data Import Wizard. Extensively worked in real-time Web service integration of Salesforce with J2EE web applications. Directly interacted with various user groups to understand and gather requirements and conducted demos to show prototypes. Experience in Working with SOAP and REST Based Web Services and working on XML and JSON formats also by creating Parsers Implemented Case Management by creating record-types specific to the user groups, assignments rules, escalation rules, case templates,workflow rules and actions, etc. Customized events and tasks as per user convenience to schedule meetings, follow-up, sharing calendars with other groups, etc. Involved in creating, monitoring, and measuring campaigns with Salesforce CRM Marketing. Worked in Single sign-on, SAML settings to enable the user to login to various applications simultaneously. Enabled and configured E-mail Relay feature for the e-mail administration for the entire organization. Worked extensively in customization of Service Cloud Console by embedding Visualforce pages in custom console components, highlight panel and interaction log . Resolved issues connected to Call Centers, usage of CTI adapters and Mobile applications. Worked on integration using Cast Iron tool. Incharge of the deployment and complete setup in 3 production instances, used Eclipse and changeSet for deploying. Environment: Saleforce.com platform, Visual Force (Pages, Component & Controllers), Workflow & Approvals, Reports, Dashboards, Custom Objects, Custom Tabs, Email Administration, SSO, Service Cloud Console, Change Set,  Force.com Eclipse, HTML, JavaScript, CSS, Apex Explorer, Apex DataLoader, Cast Iron. BALDOR\tJan 13 – July2014 Location: Fort Smith, AR Role: Sr. Salesforce Admin  Baldor Electric Company markets, designs, and manufactures industrial electric motors, mechanical power transmission products, drives, and generator sets.It has a long-term focus on energy-efficiency and was the first in the industry to introduce a line of premium-efficiency industrial electric motors, the Super-E in 1983. It strategy is to be the highest value provider, focusing on quality, service and time.\n Responsibilities: Designed, developed and deployed Apex Classes, Controller Classes and Apex Triggers for various functional needs in the application. Responsible for controlling security and sharing of sales reports and dashboards, providing regulated, auditable cross-functional access for anyone in the organization via Cloud9. Developed various Custom Objects, Components and Visual Force Pages. Worked on creating and assigning Profiles, Field level security, Roles, and Public Groups for the users. Experience in using Apex Data Loader for various data related operations like data inserting, updating, deleting and exporting.  Created workflow rules and defined related tasks, time triggered tasks, email alerts, field updates to implement business logic. Created custom Dashboards and gave accessibility to dashboards for authorized   Worked on various Salesforce.com standard objects like Accounts, Contacts, Leads, and Opportunities. Proficiency in web service applications both producing and consuming REST (JAX-RS) API. Developed Validation Rules, Workflow Rules, and Approval Process on the object to achieve the functionality as per the business requirement. Worked on Data Cleansing for various standard objects and custom objects to have better and clean data in the company. Hands on experience on implementing electronic signature using DocuSign - Rest APIs. Used Data Loader for insert, update, and bulk import or export of data from Salesforce.com objects. Used it to read, extract and load data from comma separated values (CSV) files. Used sandbox for testing and configuration, assisted in deploying to the production system.  Created page layouts, search layouts to organize fields, custom links, related lists, and other components on a record detail and edit pages. Environment:Saleforce.com platform, Apex Language, Pages, , App exchange, HTML, Java Script, Apex Triggers, Visual Force (Pages, Component & Controllers), Data Loader, Web Services, Reports, Custom Objects, Custom Tabs, Email Services, Security Controls,  Customer Portals, Eclipse IDE, Windows XP. 3M (Minnesota Mining & Manufacturing) \tSep 2011 – Jan 2013 Location: St. Paul, MN Role: SalesforceAdmin/Developer                                                             3M (Minnesota Mining & Manufacturing) is a global industrial conglomerate that manufactures products ranging from household and office goods to specialty products used in industries such as aerospace and automobile industry.  The company classifies its business under five main segments: Consumer and Office, Electronics and Energy, Healthcare, Industrial and Transportation, and Safety and Graphics. Responsibilities: Business interaction for Gathering customer requirements. Analyzing the requirements. Converting them into functional/technical Specifications. Writing Codes for Classes, Triggers, VF Pages, Test classes. Studying the systems and documenting the functionality. Preparing and getting approval of design, functional and technical specifications from business. Configuration changes as per the Client’s requirements. Unit testing of completed modules in Different Sandboxes. Handle relevant technical communication with Client/Onsite Coordinator. Designed and deployed the Custom objects, Custom tabs,  validation rules, Workflow Rules, Auto-Response Rules, Page layouts, Components, Visualforce Pages to suit to the needs of the application. Wrote SOQL and SOSL statements within custom controllers, extensions and triggers. Performed detailed analysis of business and technical requirements and developed the Apex classes using other Platform based technologies like Visual Force, Force.com IDE. Integrated Salesforce.com with Siebel,.Net systems using SalesForce Web Services  Used Data Loader for insert, update, and bulk import or export of data from Salesforce.com objects. Used it  to read, extract and load data from comma separated values (CSV) files. Developed and configured various Reports and Report Folders for different user profiles based on the need in the organization. Environment: salesforce.com, Apex Classes, Controller Classes, Triggers, Visualforce, Dashboards, Reports, Pick lists, Roles, SOQL, Web Services, agile, JQuery, WSDL, windows. Mindray North AmericaOct 2009 – Aug 11 Location: New Jersey Role: Salesforce Developer Mindray North America manufactures hospital products, and largely focused in the areas of anesthesia, emergency medicine and critical care.   They are the developer, manufacturer and exporter of medical devices for patient monitoring, diagnostics and ultrasound imaging systems. Responsibilities: Performed detailed analysis of business and technical requirements and designed the solution by customizing various standard objects of Salesforce.com (SFDC) and other platform based technologies like Visualforce, force.com API, and web services. Developed various Custom Objects, Tabs, Entity-Relationship data model, validation rules on the objects and tabs, Components and Visualforce Pages. Created workflow rules and defined related tasks, time triggered tasks, email alerts, filed updates to implement business logic. Designed and developed SFA based Application on force.com platform in salesforce.com environment with Apex programming language at backend and Visual-Force pages as user interface. Created test scenarios on Sandbox environment, created packages and moved it between Sandboxes and Production environments to place final implementations.. Used salesforce Automation (SFA) for Territory Management and Opportunity Management. Implemented the requirements on Salesforce.com platform and Force.com IDE Plug-in using Eclipse. Developed Apex Classesand Apex Triggers for various functional needs in the application. Created various Scheduled and Batch apex jobs based on the business requirements. Used SOQL & SOSL for data manipulation needs of the application using platform database objects. Created profiles and implemented Object and field level security to hide critical information on the profile users. Created users, roles, public groups and implemented role hierarchies, sharing rules and record level permissions to provide shared access among different users. Created automations of emails to Opportunity owners based on business requirements.  Resolved major issues in previously exisiting integrations betweeen SAP and Salesforce in the Cast Iron environment. Created orchestrations for bi-directional integration of Salesforce and SAP using Cast Iron tool. Environment: Saleforce.com platform, Apex Language, Visualforce (Pages, Component & Controllers), Pages, Data Loader, HTML, Java Script, Workflow & Approvals, Reports, Custom Objects, Custom Tabs, Email Services, Cast Iron, Security Controls, Eclipse IDE Plug-in, Windows XP. Compunnel Software group June 2008 – Aug 2009\t Location: India Role:SQL Developer  Responsibilities: Database Administrator for Development, Test and Production servers with MS SQL Server 2000 on Windows 2000. Installed, administered and secured SQL Server 2000 on Server and Clients. Designed and implemented logical and physical data models using Vision and Erwin. Created database objects like tables, views, indexes etc.  Created and modified stored- procedures, triggers, cursors. Wrote T-SQL for the retrieval of the data. Created DTS package to export and import data from SQL Server to Access, text and EXCEL files.  Checked Performance Tuning, Indexing, Query Optimization. Generated reports using Microsoft Reporting Services.  Provided consultation to development teams. Documented SQL Server architecture and overall system network diagrams using Visio. Monitored Database using system tools Environment: Flash Action scripting (AS 2.0), Flash CS4, Adobe Captivate and Adobe PhotoShop, Windows NT, 2000, XP.  IE 5.5 and 6.0"}