{"text": "Name: margaret margaret E-Mail: margaret.margaret@gmail.com Address: Toronto, Canada Github: https://github.com/margaret LinkedIn: https://linkedin.com/margaret Phone No. 936558040751 Over 7 years of experience in analysis, design, development, management and implementation of various web and client-server applications using Microsoft .NET technologies. Experience in software development life cycle (SDLC) including requirement gathering, analysis, design and development on Microsoft Technology Stack. Experience in implementation, architecture and iterative,  of various stand-alone, intranets, client-server and web based applications using SharePoint 2016/2013/2010/2007, MOSS 2007, SharePoint Designer 2013/2010/2007, and .Net 4.5/4.0/3.5/3.0/2.0 technologies. Experienced in configuring shared service provider in SharePoint 2013, SharePoint Online/Office 365, SharePoint 2010 and MOSS 2007 utilizing Web services to integrate different Line of Business Systems and integrating business data using BDC. Expertise in SharePoint Administration activities such as Installation, Configuration, and Deployment of SharePoint Farms and writing custom batch files for the creation of pages, sub-sites and ability to create and deploy custom Workflows, using Visual Studio 2013/2010/2008 and SharePoint Designer. Worked with, Site Columns, Content Types, Lists, Libraries, CAML Queries, Web Parts, Workflows, Event Handlers, Page Layouts and Object Model. Configuring SharePoint Enterprise features like BCS, Chat web parts, search, Business Intelligence and Performance Point Services.  Strong Experience in developing applications using ASP.NET, ADO.NET, C#, IIS, Web services, WCF, REST API’sJavaScript, J Query, XML, HTML, CSS, CAML, LINQ and Entity Framework (.NET 3.5/4.0) etc. Experience in developing Site Collection, Sites, Site Templates, Custom Site Definitions, List Definitions, Document Libraries and Lists, Business data catalog (BDC), Work Flows, Custom Content Types, Features, Timer jobs, Audiences, User Control and Web Control, Web Service, Wiki Sites, Blogs  using SharePoint Designer, Visual Studio, and SQL Server . Experienced with Microsoft Application building blocks for .NET projects (Data Access, Exception Handling, User Interface Process, Caching and Configuration Management Application Blocks). Extensive knowledge in Database Security, Database maintenance, SSRS (Reports) and Queries (Stored Procedures, Triggers, cursors).  Extensive knowledge in SQL SERVER 2005/2008/2012, TFS (Building, Maintenance, Template Changing). Good Understanding in Security, Office Integration Advanced Document Management, Web Content Management, Enterprise Content Management and Shared Services. Experience with ASP.NET Security, including Forms Authentication using SQL and Active Directory providers. Good Understanding in integrating KPI and Excel Report with Dashboard pages. Technical Skills: Professional Experience: Munich Reinsurance America, Princeton NJ\t\t\t\t\t Jan 2016 to Present Sr. SharePoint Developer/Administrator The Project was in need of a SharePoint 2016 and Online 365 based dashboard tool for the senior management to track the process milestones. I was involved in designing/developing application via integrated dashboard tool that provided a centralized repository for the process milestones to be tracked by the senior management. Responsibilities: Heavy involvement in regards to requirements gathering, development, design, and deployment of new environment.  Worked with offshore team in developing custom pages with jQuery and Java script. Created timer job that sent hourly alerts to higher management of progress for milestones. Worked on custom development using C# which includes web-parts, features, workflow using SharePoint designer and visual studio, InfoPath, Business Communication Services, Excel Services, Form Services, etc. Automation of installation & configuration scripts to build SharePoint farms (SharePoint 2016/2013/2010) from ground up and maintain the Farm with regular updates as suggested by Microsoft. Migrate clients from older versions of SharePoint to SharePoint 2013 and SharePoint 2016, from building the new environment to migrating the data.  Constructed multiple sub-sites, pages, and libraries with the deployment of the new SharePoint 2016.  Worked on creating and customizing Master Pages, Page layouts, and workflows using SharePoint 2013 Designer. Created and managed Custom Site Definitions, Site Templates, Site Columns, Document & Picture Libraries, Lists, List Views, User Alerts, RSS News, Links, Events and Content Type for various departments. Modified the look and feel of public and internal sites by utilizing CSS. Developed Workflows for Form Libraries and lists by using SharePoint designer2013 to provide a flow of approval process in the organization. Created web part that is used to read data from an external list that was managed through BCS. In charge of conducting offshore team calls to track progress of tasks. Performed setting up Office 365 online based solution including migration of content from existing SharePoint online custom workflow and reporting capabilities. Customized Office 365 Team Sites Out of the Box (OOB) functionality (custom list, libraries, content types, etc.) to reflect the company business information architecture. Designed and created Office 365/SharePoint 2016 site architecture to reflect company project assets. Created forms using InfoPath 2013 that check for several rules/validations and save data to SharePoint lists. Created workflow initiation forms using InfoPath 2013. Environment: Agile/SCRUM, SQL Server 2014/2016, MY SQL, PL/SQL, SharePoint Server 2013/2016, SharePoint Designer 2013, InfoPath 2013, Office 365, MS Office, MS Visio, HTML, JavaScript, TFS, MS Project, MS Office, Visual Studio, Nintex Workflow, SSIS, SSRS, Crystal Reports, PowerShell Scripting, Power BI, LINQ, CAML. UNUM Insurance, Chattanooga, TN\t June 2014 to Jan 2016 Sr. SharePoint Developer/Administrator Provided Site administration services for existing SharePoint sites including permissions and Management of Custom Developed Web Parts. By implementing SharePoint 2013 and its automated workflow and document tracking, auditors can reduce time spent on projects. Responsibilities: Involved in Requirement gathering, Analysis, Design, Development, Testing and Deployment of entire portal. Created Sites and Sub-sites within the site collections for Various Departments and accordingly created new Site Permission levels and Groups for SharePoint 2013 site. Migrated content SharePoint 2010 to SharePoint 2013 online. Used Metalogix, third party tool for migrating site collections and gave support.    Created and managed Custom Site Definitions, Site Templates, Site Columns, Document & Picture Libraries, Lists, List Views, User Alerts, RSS News, Links, Events and Content Type on Windows SharePoint Services for various departments. Design and Developed Custom Page Layouts for Branding and Chroming of portal by SharePoint Designer 2013 & also look and feel of portal by modifying Master Pages. Extensively worked on creating Master Pages, Theme and Site Definition using CSS to enrich the portal.  Created & Deployed advanced & connectable Web Parts by using C# and SharePoint Object Model. Extensively created and used custom web parts, and created out of box web parts to support the web forms used for getting user information. Used Out-of-box workflows and developed several complex custom Workflows using Windows Workflow Foundation (WWF) for handling documents flow. Designed different Approval Processes with the help of workflows and implement them for Document Library. Provided Search Services that allows the users to search their documents inside the website and also modified search settings to deny access to all the documents to all of its users for security concerns of the client. Worked on creating REST API services to read SQL Data and called the service from NINTEX workflow and store it in SharePoint List. Created Client Hosted Web Parts using Asp.net, C#, HTML 5, JQuery, JavaScript to provide users to orders forms through online. Extensively used CAML queries to filter list items from SharePoint List and libraries. Created the InfoPath 2013 solutions and published into SharePoint Document Libraries for gathering and sharing information. Created JS Links to change views of SharePoint Lists and Libraries. Written centralized JavaScript methods to create lists, libraries, adding columns and creating SharePoint Pages. Other developers will be able to reuse the methods. Track, troubleshoot and resolve production issues in a timely manner. Environment: Agile/SCRUM, MY SQL, PL/SQL, SQL Server 2014, SharePoint Server 2013, SharePoint Designer 2013, InfoPath 2013, Visual Studio, CAML,LINQ, Crystal Report, SSIS, SSRS, PowerShell Scripting, Power BI, J2EE, JavaScript, JQuery, C#.Net, Nintex Work Flow, Active Directory, MS Office, MS Visio, MS Project. Alere Healthcare, Marietta, GA\t\t\t\t\t March 2012 to June 2014 Sr. SharePoint Developer/Administrator This project involves development of Sales Portal in SharePoint 2010, which includes development of super widget framework, which is used by the users to post pages, documents, links and any other list item to the publishing page. Responsibilities: Configured SharePoint Server 2010 document management features such as check-in and check-out in the document library. Designed and implemented Document Management, Meeting Management Solution workspace site, document Collaboration Solution team site. Designed and built a SharePoint Portal Site, accompanying pages, layouts and libraries to improve customer collaboration and streamline processing workflow. Designed and developed enterprise content management system and Search solution. Created Advanced Search Web Partthat matches with the document metadata fields and filters out content based on the document type. Developed document library, custom view and custom content type at system and each level to manage document and make search easier. Created List, View and Alert with inheritance hierarchy required for the application. Created Version history on all documents to track changes. Auditing an important feature of Information Management Policy was also enabled, so that administrators can see who has changed, approved, and viewed any document. Created sequential workflows using SharePoint designer 2010. Effectively used Custom View Web Part to show the Procedures description.  Created Bamboo List Rollup Web Part to aggregate all policies. Created KPI using data in SharePoint lists to display on Dashboard Pages that gives the detailed information about the policies and procedures data. Worked on BCS to connect to the external LOB system. Worked on SharePoint Designer to create reusable workflow and assigned to Content Types. Designed handful of sandboxed solutions for “Policies” and “Procedures” Effectively deployed solution packages at site collection scope in a sandboxed environment. Created custom Ribbon interface using JavaScript Object Model. Environment: Agile/Scrum, SQL Server 2008/2012, SharePoint 2010, SharePoint Designer 2010, InfoPath 2010, C#.NET, J2EE, JQuery, JavaScript, Active Directory, Nintex Work Flow, BCS, SSRS, Crystal Reports, MS Office, MS Project, MS Visio, MS Project. Hartford Steam Boiler, Hartford, CT\t\t\t\t\t\t Jan 2011 to March 2012 SharePoint Developer Various different modules are composed in this project such as Innovation Dashboard, Business Strategy and Launch Planning & Marketing Calendar, which will bolster the overall flow of Innovation funnel.  Responsibilities: Involved in installation and customization of MOSS 2007,SharePoint Designer 2007and Visual Studio 2008 Extension of SharePoint.  Configured Shared Service Provider (SSP) for InfoPath forms services, Incoming and Outgoing emails, User Profile Management and Search.  Created custom security permission levels and assigned them to user to override their existing permission on Sites, Lists and List Items according to their actions.  Created the Active Directorygroups and add the users into AD groups.  Created the custom master page using the CSS and JavaScript for the business operation portal. Created the Action Item web part to display the available tasks within the site collection for current logged in user by using Content Query Web part.  Created the XSLT to customize the result render by out-of-box CQWP. Invoked in the design of the database for respective modules and developed Stored Procedures and Triggers using T-SQL. Created Site Columns, Content Types to apply schema of columns in different lists in each site.  Designed Browser compatible InfoPath 2007 forms and integrated them into Form Library of MOSS 2007. Used SharePoint object model for manipulating tasks from InfoPath code, managing item level permissions, registering event handlers. Created synchronous and asynchronous Event Handlers using .NET Class Libraries and SharePoint object model to handle different Site, List, and List Item events.  Worked on Branding and customizing and AM SharePoint portal 2007using the SharePoint Designer.  Worked extensively with the SharePoint AM Web services (Account Management) to retrieve the data from list and site. Worked with XSL, XML, XPATH,DHTML and JavaScript to display the data from the web services.  Collected search data using SQL Server 2008stored procedures and created a custom web part to display it using C#. Developed Summary reports, Sub-reports, Graphs using SQL Server Reporting Services (SSRS). Developed several Class Libraries and assembles to implement Business logic using C# using theSharePoint Object Model. Worked on SharePoint Deployment API and STSADM export import to move the content from development to QA and QA to Production.  Created the Feature to deploy the Master page, Content Type, Web part and Event Handler. Created documentation (TSD) for entire portal and also engaged in training for end users.  Environment: Agile/Scrum, SharePoint Designer 2007, InfoPath, MOSS 2007, Active Directory, Visual Studio 2008, MS Office, MS Project, MS Visio, SQL Server 2008, MY SQL, PL/SQL, MS Project, MS Office, XSLT, C#, X Path, DHTML, JavaScript, XSL, SSRS. St, Francis Hospital, Columbus, GA\t\t March 2010 to Jan 2011 .Net Developer This project was basically for creating reports and charts for the company about their day-to-day and monthly business Process. Responsibilities: Development of building blocks that involved business logic. Designed N-tier architecture for application. Designed different layers (Presentation, Business, and Data Layer). Worked on creating a UI, CSS, and Master Page.  Designed and developed Business Access Layer (BAL) and Data Access Layer (DAL).   Implemented the Data Access Layer that used ADO.NET. C#.NET code behind for base page class creation. Used various AJAX controls for attractive and user-friendly web pages. JavaScript implementation for client side validations. Created several stored procedures in SQL Server. Worked on Fusion Chart tool to create different animated charts. Used export utility to export the reports in EXCEL/ PDF format. Implemented web security by using Form Authentication concept. Implemented the web configuration file security using MD5 encryption algorithm. Worked on XAML for creating dynamic UI.  Environment: .NET Framework, C#, .NET, Web services, Web Forms, SSIS AJAX, SQL Server, ADO.NET, SQL, JavaScript, XML, XAML Fusion Chart tool. Education: BS in Applied Mathematics, Columbus State University, Columbus, GA"}