{"text": "Name: katherine katherine E-Mail: katherine.katherine@gmail.com Address: Jinan, China Github: https://github.com/katherine LinkedIn: https://linkedin.com/katherine Phone No. 922426923585 Professional Profile Around 6 years of IT experience with 4 years of experience in the Salesforce.com CRM platform both as Administrator and Developer in Salesforce.com and around 1years of experience in Java/J2EE Technologies. Experience working with salesforce.com sandbox and production environments. Extensive experience in designing, creating and maintaining Salesforce.com Workflow Rules,              Approvals, Email Templates (HTML & Visual Force Templates). Worked on the designing of custom objects, custom fields, role based page layouts, custom Tabs,         custom reports, design of Visual Force Pages, Snapshots, Dashboards. Used Data loader for data management in force.com platform. Expertise in developing, deploying and integrating Salesforce.com CRM solutions. Expertise with J2EE complaints IDE’s such as Eclipse. Implemented and delivered projects under Agile Development Environment and Test Driven Environments with large & small project teams Expertise in complete Software Development Life Cycle (SDLC) like analysis, design and development of Multi-Tier Client/Server and Web based applications. Expertise in SQL, PL/SQL, Oracle 9i and MySQL databases. Experienced in UI Technologies – HTML, Java Script. Experienced in Software development and business modelling of Web applications, Client/Server Systems, Distributed applications and other custom built projects on Windows NT/9x/2000/XP. Possess exposure of working for projects spanning Financial, Business Process Management. Have a good Knowledge of various methodologies like Waterfall, Agile methodology (FAM). Experience in providing functional and technical support to peer Team members. Excellent Client interaction skills and proven experience in working independently as well as in a team. Technical Skills Certifications & Education  Salesforce Certified Administrator Certificate No: 17636667 Amberton University, Garland, TX Major: MBA in Management, GPA: 3.45  Graduation Date: 02/2017  Tribhuwan University, Nepal Bachelor in Business Studies, First Division Graduation Date: 12/2009                                        Organizational Experience Company: Fidelity Investments                                                                                              Nov 2016 - Till Date Location: Dallas, TX                                                                          Role: Salesforce Consultant Responsibilities: Assisted in analysis of the existing functionality to identify the enhancements and gaps in the standard functionality, design and documented the solutions to fill the gaps. Interacted with various business user groups to perform detailed analysis of business and technical      requirements and to design solutions using various standard objects in Salesforce.  Implemented security and sharing rules at object, field, and record level for different users at different levels of organization. Also created various profiles and configured the permissions based on the organizational hierarchy. Worked with various custom as well as standard Salesforce objects like Accounts, Contacts. Developed Custom business logic using Apex Classes, Triggers, Components, Visual Force pages and Controller Classes for various functional needs. Worked with Apex Scheduler to invoke batch Apex classes at regular intervals. Wrote SOQL and SOSL within custom controllers, extensions and triggers. Created Visual force pages that could be rendered as PDFs, build dashboard components and define email templates. Created Workflows, Approval processes and developed validation rules. Used Pick lists, Dependent Pick lists, and Record Types to enforce data quality. Created Work flow rules and defined related tasks, email alerts and field updates. Utilized various third party AppExchange tools for Reporting and Data handling. Designed and modified Approval processes and created Approval steps which used email alerts and field updates. Monitored and resolved the Service Requests, specifically, visibility issues involving Custom Profiles, Public Groups, and Sharing Rules. Created as well as Customized Various Dashboards and Reports with Salesforce CRM.  Used Agile methodology to achieve high performance. Deployed meta-data changes and Apex classes from a Developer organization to a production organization using Change Sets. Created Many-to-Many relationships and created Junction objects to implement Roll-up Summary fields to aggregate data from child records on the parent. Supported data migration using Sales force Data Loader. Designed Validation Rules along with Roll-Up Summary Fields to maintain data quantity and data consistency. Environment: Force.com IDE, Apex Classes, Java, Apex Triggers, Visual Force pages, Validation Rules, Formula Fields, Data Loader, Reports and Dashboards, HTML, Lightning components, Marketing Cloud, Exact Target, Service Cloud, Workflow & Approvals, Web Services. AppExchange, Workflow & Approvals, Reports, Custom Objects.   \t\t Company: Eagle Creek Software Services                                                                       Sep2015 -Oct2016 Location: Boston MA Role: Salesforce Admin                                                                              Responsibilities: Worked on Standard objects such as leads, Opportunities, Accounts, Contacts, Campaigns associated with Sales Cloud. Involved in Salesforce.com Application Set up activities and customized the applications to match the functional needs of the organization. Developed various custom objects, Tabs, Components and Visual Force pages and Controllers. Created and deployed several reports using force.com platform. Customized User Roles, Role hierarchies, Profiles and Sharing settings to ensure that the protected data is available only to the authorized users. Developed Apex classes, Controller Classes, Apex triggers and API integration for various functional needs in the application. Apex code to convert lead to a contact and associate the contacts with accounts. Developed and deployed approval processes for leads conversion, opportunities and products/Assets management. Implemented the requirements on Sandbox and Force.com IDE plug in for Eclipse and deploying it in production using Change Sets. Created work flow rules and defined related tasks, email alerts, and field updates. Created page layouts, search layouts to organize fields, custom links, related lists and other components on record detail pages and edit pages. Experienced with Web-to-Lead and Web-to-Case scenarios along with Escalation rules and Assignment Rules. Worked on role hierarchy & sharing rules to configure visibility. Maintained Organizational Hierarchy created Profiles, Roles and maintained Sharing/Security for FLS, Record-level Security. Customized the dashboards to track usage for productivity and performance of business centres and their sales team. Environment: Saleforce.com platform, Force.com Sites, Apex, Visual Force (Pages, Component &  Controllers), Pages, Data Loader, Work flow & Approvals, Reports, Custom Objects, Custom Tabs, Email Services Company: Ann Taylor                                                                                                                Mar2014-Sept2015 Location:  New York City, NY                                                                                                 Role: Salesforce Admin Responsibilities: Worked on Standard objects such as leads, Opportunities, Accounts, Contacts, Campaigns associated with Sales Cloud. Developed various custom objects, Tabs, Components and Visual Force pages and Controllers. Created and deployed several reports using force.com platform. Developed Apex classes, Controller Classes, Apex triggers and API integration for various functional needs in the application. Apex code to convert lead to a contact and associate the contacts with accounts. Developed and deployed approval processes for leads conversion, opportunities and products, and Assets. Implemented the requirements on Sandbox and Force.com IDE plug in during Eclipse and deploying it in production. Implemented the integration of Salesforce to Oracle Eloqua for marketing. Created work flow rules and defined related tasks, email alerts, and field updates. Created page layouts, search layouts to organize fields, custom links, related lists and other components on record detail pages and edit pages. Experienced with Web-to-Lead and Web-to-Case scenarios along with Escalation rules and Assignment Rules. Customized the dashboards to track usage for productivity and performance of business centres and their sales team. Environment: Saleforce.com platform, Force.com Sites, Apex, Visual Force (Pages, Component &  Controllers), Pages, Data Loader, Workflow & Approvals, Reports, Custom Objects, Custom Tabs.  Company:  Acquia                                                                                                          Jan 2012 – Dec2013 Location: Burlington, MA                                                                       Role: Java Developer Responsibilities: Responsible for enhancing existing user interface functionality built using HTML, CSS, JavaScript & XML. Participated in data base design and writing complex queries to read the data from MS SQL Server. Developed front-end using HTML and performed validations using Java Script. Implemented unit testing.  Developed test scripts for the other developers based on the module they are working. Used CVS for Source Control and Version Management. Wrote the code for the new and existing programs as per coding standards. Communicated with the testing team in writing test plans and test cases and execution of test cases. Environment: Java, JavaScript, SQL Server, CVS, Struts, Eclipse, HTML, CSS. \n"}