{"text": "Name: martha martha E-Mail: martha.martha@gmail.com Address: Xiangyang, China Github: https://github.com/martha LinkedIn: https://linkedin.com/martha Phone No. 71689870643 \t\t\t\t\t\t\t SUMMARY OF QUALIFICATION: Around 7 years of experience in Configuration Management, TFS ADMINISTRATION, DevOps, Build and Release Engineer. Extensively worked with Hudson, Continuous Integration and End to End Automation Tools. Deployed code on Websphere Application Servers for Production, QA, and Development environments using WSADMIN scripts and integrated then with Python/Jython scripts to enhance the functionality of the deployment process. Experienced in Build and Deployment of Java, .NET, C#, IOS, ASP.NET applications on to different environments like Development, QA, UAT and Production, which includes designing, development and implementation. Automation of Build, deployment and smoke testing of .Net applications using TFS 2010/2012/2013 and 2015. Proficient in working and Administrating UNIX (RedHatLinux), Windows, AIX and Solaris. Expertise building and monitoring software projects continuously with a CI tool, Bamboo, Hudson, Cruise Control, Build Forge, Visual Build Professional. Experience in using Subversion (SVN), perforce and CVS Version Controls. Good experience in Microsoft Products and their deployment including octopus and PowerShell. Experienced working on Chef with Azure to spin up resources quickly, to automate infrastructures, enabling an Apache site, for dynamic service discovery and for launching multiple instances on Azure at once. Managed the source code control of multiple development efforts using ClearCase, Subversion, TFS, Git and CVS version control tools.  Worked on JIRA Administration including user management, workflow & field creation/modification, issue migration/import/export, plugin installation, Jira- Subversion (SVN), Jira-Git, Jira-Confluence integration Good knowledge of UCM ClearCase, ClearQuest and experience with additional version control tools such as SVN, Perforce, CVS and TFS. Worked extensively on cross-platforms (Windows and UNIX) with UCM ClearCase, Subversion (SVN), TFS and GIT. Exposure to Jython, Python scripting. Expert knowledge in Technical and Functional features of TFS which includes SharePoint, Source Control, Work Items, TFS Builds, Reporting. Having Experience of BluePrism(RPA Robotic process automation)Development for 6 months PROFESSIONAL SUMMARY WellCare, Tampa, FL\t\t\t\t\t\t\t\t\t\tJune 2016 – Present  TFS ADMIN/Release Engineer Responsibilities: Administrator of TFS2015. Upgraded from TFS 2013 to TFS 2015 Implemented AWS solutions using EC2, S3, RDS, EBS, Elastic Load Balancer, Auto scaling groups. Implementing new projects builds framework using Jenkins & maven as build framework. Implementing a Continuous Delivery framework using Jenkins, Chef, Maven & Nexus in Linux environment  Experience with Atlassian products – Jira, Agile, Fisheye, Crucible, Bitbucket, Confluence and Crowd.  Built and managed a large deployment of Red Hat Linux instances systems with Chef Automation and provision virtual servers using vagrant and kitchen in Oracle VM virtual box, provisioned servers in Amazon EC2 TFS workflow and work item management. Integrate new application changes to existing servers by performing deployments using tools such as Octopus Deploy and Team City.  Extensively worked on Hudson, Jenkins Team City and Bamboo for continuous integration and for End to End automation for all build and deployments. Setup TFS reporting server and built various reports. Skilled at software development life cycles and agile programming methodologies. Extensive experience in installation, configuration and administration of Subversion (SVN), GIT, UCM  ClearCase and TFS. Managed Chef cookbooks to automate system operations and AWS Cloud management  Setting up SQL Azure Firewall Involved in migration of Bamboo server, Artifactory & Git server. Setup and administration of BizTalk Server and regular deployment of BizTalk applications. The automated process was built using Final Builder Scripts to execute    shell commands, ftp, telnet, e-mail to interact with the Windows and UNIX environments; it was scheduled from Windows 2000 scheduler.  Troubleshooter builds issues, MS Build and TFS Build.Proj file changes, issues related to TFS application SharePoint, Reports, TFS Permission, Build server etc Good Work Knowledge in Saleforce Integration with Microsoft Team Foundation Server for case / issue / Bug tracking solution and this is a complete automated 2 way Sync solution for pulling / pushing records from SFDC to TFS / TFS to SFDC. Integrate the Powershell, batch scripting with the Urban Code Deploy scripts. Responsible for managing Code Repository in TFS 2015 Defining Release Process & Policy for projects early in SDLC and responsible for code build, release and configuration  Perform Deployment of Release to various  QA & UAT in Linux environments.  Experience with Integration of Code Review Tools like GIT and Gerrit Setting up Connection Strings and connecting SQL Server AZURE Databases from locally Installed SQL Server Management Studio(SSMS) for Developers Hosted OMS components in Azure Exported Requirements, test plans and test cases to TFS. Good knowledge of OOPS programming techniques in C# and C++. Automate and configure all basic setting of server including DNS setting, yum configuration, mount disk space and make server to behave as chef-client using Cookbooks on various Platform. Build tools (Ant, Maven, Make, Gradle), Artifact repositories (Nexus, JFrog, ArtiFactory), CI tools (Jenkins, Teamcity) Known about REST APIs and skilled with JSON Maintain continuous build automation – currently within anthill-pro, Hudson/Jenkins and team city Created defects, manage defect reports and defect status in TFS. Hands on experience in SCM Tools like Git, gerrit, Crucible and IDEs like Eclipse, PyCharm. Environment: GIT, TFS 2015/2013/2012, Unix, Jenkins, MS Build, Cloud Foundry, UDeploy, GoCD, Team City, JIRA, Biztalk, Azure, Octopus, Visual Studio(VSTS), , Artifactory, Jenkins, UCM, Python, BASH Scripts, Shell scripts. AT&T                                                                                                                                     Dec 2015 – May 2016 Release Engineer/TFS ADMIN Responsibilities Enabling customers to better manage software development, deployments and infrastructure with tools such as Chef, Jenkins and GITHub. Maintained the Team Foundation Server (TFS 2015) source code repository for North Carolina Medicaid Management information systems (NCMMIS) health care project. Setup and installed single and multi-tier TFS 2015 server. Defined dependencies and plugins in Maven pom.xml for various activities and integrated Maven with GIT to manage and deploy project related tags.  Supervised and guided team to establish quality and CM standards as per agile methodology and implemented the agile templates in TFS. Configured local Maven repositories and multi-component Ant projects with Nexus repositories and scheduled projects in Jenkins for continuous integration. Integrated Subversion (SVN) into Jenkins to automate the code check-out process  Installed TFS 2013/2012/10 on the windows 2008 server which includes application tier and database tier. Actively participated in the automation effort. Wrote security & web architecture provisioning scripts for Ops code Chef, in Ruby. Promotion of Code – includes both manually compiling and builds through TFS. Experience in Microsoft Windows Azure Cloud Services Install and configured GoCD services and agents Develop/execution of automated scripts using Microsoft custom .NET framework in Visual Studio VSTS 2015. Expert in writing scripts using PowerShell, MS Build, Nant, Apache Ant, VBScript, Perl and Python. Automating The Build process using Subversion (SVN), and Maven. Developed and scheduled bash shell scripts for various activities (deployed environment verification, running database scripts, file manipulations, Subversion (SVN) etc.,) Implemented Continuous Integration Environment (Jenkins, SonarQube, Nexus and artifactory) and Continuous Delivery Environment. Built Jenkins jobs to create AWS infrastructure from GitHub repos containing terraform code. Extensively experienced in writing Jenkins file for the pipeline using Groovy scripting Guiding the team and organization on how to use Agile/Scrum practices and values to delight customers Performed IIS Website deployment automation using MS Web Deploy tool with PowerShell. Trained developers to get familiar on TFS 2015 Work Items, Queue New Builds, and Work Spaces with Visual Studio 2010. Involvement in Websphere Process Server Replacement Project, with another instance of Websphere Application Server. Administered and Implemented Continuous integration tools:   Hudson/Jenkins and Atlassian Bamboo (For automating the build and deployment process). Worked in integrating TFS with Visual Studio  Created the Clustering Topology in WebSphere Application Server ND V6.x to achieve Work Load Management (WLM), High availability, Load Balancing and Hardware fail over. Worked on TFS 2012 Sandbox as well Azure. Configuration of Jenkins along with Maven and Jython Scripts for Automated build and deployment Process. Assist Clients in BluePrism Automation, UAT and Production Deployment of Automation. Environment: SVN(Subversion), TFS 2015/2013, Anthill Pro, Team City, ANT, and Maven, Chef, DevOps, Jenkins, MS Build,  GoCD, Visual Studio(VSTS), Perl, Bash, , Agile, Bamboo, Azure, Git, JIRA, Shell Script, NUnit, Web sphere, Selenium. Dignity Health - Tempe, AZ                                                                  \t\t\t\t\tMay 2014 - Nov 2015 Devops/Build & Release Engineer Responsibilities: Automating The Build process using Subversion (SVN), and ANT   Managed builds and wrote Build scripts for JAVA and Websphere based applications  Maintained source code repository in Subversion (SVN).  Configured TFS to run continuous integration of builds and execute unit test on all check-ins for ASP .NET Web Applications. Configured Git with Jenkins and schedule jobs using Poll SCM option. Good experience on Databases and Migration from TFS 2008 to 2010, 2012 & 2013 Setup the Security, Roles & Responsibilities for different Groups for Team Projects using TFS 2013 Admin Console. Successfully administrated Subversion (SVN), Cruise Control and Anthill Pro. Perform server configuration management on apache products, MySql, and Weblogic using tools such as Puppet. Automated deployment of builds to different environments using AnthillPro.  Setup various Team Projects into different Team Project Collections in TFS 2010 Implementation of TFS 2013 Release Management Functionality for entire corporate codebases. Performed and deployed Builds for various Environments like QA, Integration, UAT using Customized XAML files in TFS 2013 Provided on-going support and administration for Subversion (SVN), ClearCase, ClearQuest and ANT build automation. Implemented continuous integration using the Hudson, which tracks the source code changes  Create and setup automated nightly build environment for Java projects using Maven. Studied the current build and release process and automated the process using Shell scripts.  Debugged Build failures and worked with developers and QA people to resolve the related issues.  Perform various builds for the QA, and Production Environments.  Resolved ADC Mailbox queries related to TFS/Buildissues. Experienced in building Java application using make files (Ant utility), Shell Scripts.  Integrating GIT and ClearCase with CruiseControl, Jenkins. Redesigned and redeployed the Nagios implementation. Nodes automatically added/removed themselves. Managed builds and made necessary changes to Ant build scripts for Java/ Websphere based applications.  Support development engineers with Configuration Management issues. Assist my seniors and Project Leaders in technical issues.  Environment: SVN(Subversion), Anthill Pro, ANT, Nant, and Maven, Clearcase, MS Build, Unix, AWS, Google Cloud, Perl, Python, TFS 2013/2012,, Bamboo, Hudson, Java, Git, JIRA, PowerShell, Puppet,  Shell Script, Jenkins, cruise control, Web sphere server. Tower’s InfoTech, Bangalore, India                                     \t\t\t\tMar 2012 – April 2014 Build release Engineer Responsibilities:  Primary duties include Build and Deployment of the java applications onto different environments Dev, QA and UAT.  Generated Ant, Maven, Perl & UNIX scripts for build activities in QA, Staging and Production environments.  Worked on the transition project which involves migration activities from Ant to Maven in order to standardize the build across all the applications.  Managed Users and Groups in SVN and involved in troubleshooting client spec issues and user issues.  Automated the deployment and server bounce process is by creating the scripts using WebLogic Scripting Tool (WLST).  Build artifacts (WAR's and EAR's) are deployed into a Weblogic app server by integrating the WLST scripts to Shell Scripts.  Maintained configuration files for each application for build purpose and installed on different environments.  Directed the Release Management Calls to synchronize with the Developers, Testers and DBA teams for successful Release.  Used Maven dependency management system to deploy snapshot and release artifacts to Nexus to share artifacts across projects.  Configured and maintained Jenkins to implement the CI process and integrated the tool with Ant and Maven to schedule the builds.  Work with development/testing, deployment, systems/infrastructure and project teams to ensure continuous operation of build and test systems.  Presented reports to the Project manager about the progress and issues tracking key project Milestones, plans and resources.  Environment: Java, SVN, ANT, MAVEN, Hudson, SVN, Web logic, UNIX, Perl/Shell, C++."}