{"text": "Name: irene irene E-Mail: irene.irene@gmail.com Address: Dalian, China Github: https://github.com/irene LinkedIn: https://linkedin.com/irene Phone No. 338620068202                                                        Professional Summary 7 Years of experience in IT industry comprising Software configuration management (SCM) & Linux Systems Administration. Extensive experience includes SCM, DevOps Build/Release Management, Change/Incident Management and Cloud Management. Skilled at Software Development Life Cycles and Agile Programming Methodologies . Extensively worked with Version Control Systems CVS, SVN (Subversion), GIT, Perforce and Clearcase Experience with Linux/UNIX environments and scripting for Build & Release automation. Supported AWS Cloud environment with 200+ AWS instances and configured Elastic IP and also experience working on implementing security groups. Experienced in Amazon EC2 setting up instances as well as migrating data to AWS from data Center, Configuring and Networking of virtual private cloud (VPCs), and security groups.  Worked on AWS Cloud platform and its services which includes EC2, VPC, EBS, AMI, SNS, RDS, EBS, Cloud Watch, Cloud Trail, Cloud Formation, Auto scaling, Cloud Front, IAM and S3.  Proficiency in writing automation scripts using Chef, Puppet, bash/Shell and Perl. Experience in Installing, configuring and maintaining Tomcat, Web Sphere & Web Logic Application Servers.  Experience in working with Tracking Tools like JIRA, ServiceNow and Rally Softwares. Experience in Installing and configuration of Web hosting administration HTTP, FTP, SSH, & RSH Experience in Package management using RPM, YUM and APTGET in different flavors of Linux.\t Experience in configuring and managing Puppet master server and also updating and creating modules and pushing them to puppet clients.  Experience in administering and configuring Nexus Repository Manager for Maven builds and Jfrog Artifactory Extensively worked with automation tools like Hudson, Jenkins and Build Forge to implement the End to End Automation.  Strong working knowledge in defect tracking and ticketing tool HP SERVICE MANAGER, JIRA, Confluence and Service now. Configured and used apache as a load balancer to route the requests from users to the web applications hosted on two different WebLogic servers. Responsible for Implementing, creating change records in Change Management Process. Loading, testing and creating profiles for virtual and physical workstations using VMware vSphere Web Client and VMware Remote Console. Good Interpersonal Skills, team-working attitude, takes initiatives and very proactive in solving problems and providing best solutions. Certifications AWS Certified Solutions Architect – Associate Level Technical Skills  Professional Experience  Gannett, McLean/ Chesapeake, VA\t\t\t                                                April 2016 – Till Date DevOps Cloud Integrator \t Responsibilities: Implemented AWS solutions using EC2, S3, RDS, EBS, Elastic Load Balancer, Auto scaling groups, Route 53. Used IAM to create and manage AWS users and groups, and designed user's credentials and profiles using AWS IAM. Created monitors, alarms and notifications for EC2 instances using CloudWatch. Defined AWS Security Groups which acted as virtual firewalls that controlled the traffic allowed to reach one or more AWS EC2 instances. Supported AWS Cloud environment with 200+ AWS EC2 instances and configured Elastic IP and Elastic storage and defined AWS Security Groups. Used AWS Route 53 to route end users to Internet applications by setting up DNS. Used Ruby scripting on Chef Automation for creating cookbooks comprising all resources, data bags, templates, attributes.  Written wrapper scripts to automate deployment of cookbooks on nodes and running the chef client on them in a Chef-Solo environment. Developed Chef Cookbooks for Tomcat, MySQL, Windows applications and versioned them on GIT repositories and Chef Server. Involved in testing cookbooks using Chef Test Kitchen. Installed, Configured and maintained Jenkins for implementing CI and CD. Used Jenkins AWS Code Deploy plugin to deploy to AWS. Configured and maintained different scripts for monitoring server’s health, getting versions running and deploying applications. Expertise in using build tools like MAVEN and ANT for the building of deployable artifacts such as war & ear from source code.  Configured and managed IBM Urban Code Deploy. Created branches, performed merges in GIT version control system. Configured Nexus Repository Manager. Responsible for provisioning servers, creating components, applications, processes and agent in various environments for large deployments and troubleshooting deployment issues for various teams using UDeploy. Deployed using Admin console into Tomcat Application Servers. Developed Shell/Perl Scripts for automation purpose. Monitoring HP Service Manager Incidents and service requests and resolving them. SSL Certification Installation on both Windows and UNIX based web servers 24*7 on-call support on Infrastructure production issues. Environment: AWS, EC2, RDS, S3, IAM, VPC, Cloud Watch, SNS, Route 53, ELB, Elastic Bean Stack, SVN, GIT, ANT, IBM Urban Code Deploy, WebLogic, Jenkins, Maven, Chef, HP Service Manager, Tomcat, Ruby, Perl, Shell Script, UNIX, Windows, Linux. Limelight Health Inc, SFO, CA\t                                                                                            Aug 2015 - Mar 2016 DevOps Engineer  Responsibilities:   Created branches in Subversion to implement the parallel development process to support quarterly releases. Merged release branches to the trunk after the production release and resolved the conflicts rose during the merge in Subversion. Responsible for Parent pom to mandate use of code coverage tools in maven based projects. Managed the Maven Repository using Nexus tool and used the same to share the snapshots and releases of internal projects. Reduced build and deployment times by designing and implementing Docker workflow and configured Docker container for branching purposes. Implementing a Continuous Delivery framework using Jenkins, Puppet, Maven & Nexus in Linux environment. Responsible for creating puppet modules and manifest files from scratch and experience in editing existing puppet manifests and automated manual installation processes using puppet. Created and maintained build scripts using MAVEN to perform builds efficiently. Designed the project workflows/pipelines using Jenkins as CI tool.  Expert in User Management, Disaster Recovery Processes and Plugin Management for Jenkins. Involved in several production Implementations and managed deployment processes via home grown scripts and Puppet. Expertise in Puppet Administration tool (Ingrown tool), a tool which acts as a puppet dashboard for managing puppet profiles, modules, classes and top scope variables.  Worked on setting up the life cycle policies to archive the data from AWS S3 to AWS Glacier.  Design roles and groups using AWS Identity and Access Management (IAM).   Configured Elastic Load Balancers with EC2 Auto scaling groups.  Used IAM to create and manage AWS users and groups, and use permissions to allow and deny their access to AWS resources. Developed Cloud Formation scripts to automate EC2 instances. Used AWS CloudFront (content delivery network) to deliver content from AWS edge locations drastically improving user experience and latency.   Managed the triage process of complex build/deployment problems, release and environment issues and bugs in a multi-component environment. Implemented project workflow on Jira and created bill of materials prior to the production deployment. Worked on creation of Change requests and Service requests using tool Service Now. Environment: SVN, AWS, EC2, S3, IAM, Maven, Ant, Jenkins, Nexus, Confluence, Apache Tomcat, Puppet, Shell, Perl script, Docker, Find Bugs, Service now, Jira, IBM WebSphere, Confluence. Gilead Sciences, Foster City, CA\t\t                                                                               Oct 2014 - July 2015 Sr. Build & Release Engineer\t\t\t\t\t\t\t Responsibilities:   Primarily involved in creating the build and release deployment scripts in UNIX shell as well as Perl scripts.  Control branching and merging of the code base in subversion. Wrote Make and Ant build scripts to automate the build process Deployed code to Web logic environments.  Worked with Web Services Admin Team and DBA Team to debug environment issues in Web logic and Oracle servers.  Created documents on build process and flow, build script maintenance, user guide for developers for local builds. Installed and Configured Nexus to manage the artifacts in different Repositories.  Automated the build and release management process including monitoring changes between releases.  Developed utilities for developers to check the checkouts, elements modified based on project and branch.  Pushed releases to QA, Beta, and production environments.  Presented reports to the Project manager about the progress and issues tracking key project Milestones, plans and resources.  Responsible for conducting and a key person in the Change Management Board (CMB).  Jenkins is the CI/Automation tool for Build and Release activities.  Responsible for setup and troubleshooting activities for Automation using Jenkins and Nexus.  Partially administered the Dev Linux Environments (VM's).  Used JIRA for Issue tracking and scrum/agile planning Environment: Subversion, Maven, Oracle 10g, Perl Scripting, Shell scripting, Perl Scripts, Nexus, Windows, UNIX, Web logic, JIRA Model N Technologies, Hyderabad, India\t\t                                                  Jan 2012 - Sep 2014 Build & Release Coordinator Responsibilities:              Involved in Setting up automation around build and deployment using BuildForge. Created Environment, processes, User management in Build Forge. Maintaining the version control system (branching model, security), creation and maintenance of build definitions scripts, and the setup of work item areas and iterations. Developed scripts using Bash, Perl and Batch files for Automation of Activities and builds.  Tweaked ANT build.xml’s to reduce build timings and handle dependency management Responsible for automated Scheduled Builds/Emergency Builds and Release using ANT scripts for Enterprise application (J2EE) Analyzed the ANT Build projects for conversion.  Create and setup automated nightly build environment for java projects using maven.  Deployed the Java applications into Apache Tomcat Application Servers.  Established and implemented Change Control standards for different tasks. Setting up Clear Case clients for developers by installing Clear Case software. Worked with both Base and UCM versions of clearcase for version control. Used Clear Quest as change management and ticket tracking tool. On-call Production Support (24x7) on weekly rotation within the team. Environment: Red Hat Linux, SVN, ANT, Jenkins, Maven, Web Logic, Apache Tomcat, Shell, Ansible, Nexus, Clear Case, Clear Quest. Smart Soft Solutions, Hyderabad, India\t\t\t                                                 Nov 2009 - Dec 2011 System Administrator \t\t\t\t\t\t\t Responsibilities:  \n Responsible for maintaining Version Control repositories, User Management in SVN. Capable of Creating new database instances & managing table Spaces, users & roles. Installed and configured Hudson for implementing automation and orchestration. Maintaining technical support for Infrastructure Services on Microsoft Windows technologies.  Configured Users & Security administration, backup, recovery and maintenance of various activities. Installation, Configuration and Troubleshooting of Linux and Windows Servers.  Involved in design, configuration, installation, implementation, management, maintain and support for the Corporate Linux servers RHEL 4.x, 5.x, SLES 9, CENTOS 5.x.  Installed and configured Samba server for Windows and Linux connectivity.  Monitored System Activities like CPU, Memory, Disk and Swap space usage to avoid any performance issues. Worked on Routers and firewalls Define/setup network protocols, Network File Services (NFS) and Network Information Services (NIS) on Linux and AIX servers.  Created and modified users and groups with sudo permission. Configured LAN and WAN  Environment: RHEL 3.x/4.x,5.x, Windows 2008, Veritas Volume Manager (VVM), LDAP, Web Sphere MQ Series 6.0/5.3, EMC Storage SAN, VMware Servers, Jboss 5.0 Education:   Bachelor of Technology from SRM University, Chennai, India."}