{"text": "Name: frances frances E-Mail: frances.frances@gmail.com Address: Lima, Peru Github: https://github.com/frances LinkedIn: https://linkedin.com/frances Phone No. 560171850566                                            Profile: Having around 8 years of experience in IT industry comprising of delivery management, design, development, release & deployment, and cloud implementation Amazon Web Services certified solutions architect. Good experience on DevOps tools such as Chef, Vagrant, Virtual Box, Puppet, Ansible, Jenkins, Maven, ANT, SVN, GIT, and Docker. Implemented puppet modules to automate the installation and configuration for a broad range of services. Well versed with creation of puppet profiles and role modules. Leveraged Hiera to create various re-usable puppet modules. Written Chef Cookbooks for various DB configurations to modularize and optimize end product configuration Implemented Chef Recipes for Deployment on build on internal Data Centre Servers. Also re-used and modified same Chef Recipes to create a Deployment directly into Amazon EC2 instances. Used Chef for server provisioning and automating infrastructure. Development and version control of Chef Cookbooks, testing of Cookbooks using Food critic and Test Kitchen and running recipes on nodes managed by on premise Chef Server. Well versed with Ansible Playbooks, modules and roles. Experience in Infrastructure Development and Operations involving AWS Cloud platforms, EC2, EBS, S3, VPC, RDS, SES, ELB, Autoscaling, CloudFront, CloudFormation, ElacticCache, CloudWatch, SNS. Strong Experience on AWS platform and its dimensions of scalability including VPC, EC2, ELB, S3, and EBS, ROUTE 53. Ensure data integrity and data security on AWS technology by implementing AWS best practices. Ability to identify and gather requirements to define a solution to be build and operated on AWS.  Experienced in cloud automation using AWS cloud Formation Templates, Chef, Puppet. Well versed with Openstack based cloud infrastructure. Set up Continuous Integration for major releases in Jenkins. Knowledge on SaaS, PaaS and IaaS concepts of cloud computing architecture.  Implementation of AWS (IaaS) and Openstack. Used security groups to develop a logical firewall to ensure high security for control applications. Extensively worked on Jenkins for continuous integration and for End-to-End automation for all build and deployments. Knowledge and experience in creating Jenkins Pipeline. Experienced with build automation tools like Ant and Maven. Experienced with Docker container service. Dockerized applications by creating Docker images from Dockerfile. Experienced in Branching, Merging, Tagging and maintaining the version across the environments using SCM tools like GIT and Subversion (SVN) on Linux platforms.  Used GIT to keep track of all changes in source code. Experience in various IaaS architectures including Redhat OpenStack, VMware vCloud suite, Eucalyptus, and Cloud Stack, hypervisor technologies including Redhat KVM, VMware VSphere and Microsoft HyperV. Integration, deployment and automation of application servers Tomcat, WebLogic across Linux platforms. Experience in implementing and administering monitoring tools Splunk and Nagios.  Experience in using Bug Tracking tools like JIRA and HP Quality center. Extensively experienced in Bash, Perl, Python, Ruby scripting on Linux. Automated the process of launching and stopping/terminating EC2 instances on Amazon AWS with BOTO. Used Python fabric for AWS instance provisioning. Experience in administrating, deploying and managing UBUNTU and centOS servers. Expertise in Agile Testing Methodologies &Software Test Life Cycle (STLC). Experience of the full Software Development Life Cycle (SDLC) and Methodologies & Validations to ensure the Quality Assurance Control.  Extensive experience in UNIX performance tuning and Capacity Planning. Experience in deploying system stacks for different environments like Dev, UAT, Prod in both on premise and cloud infrastructure. Strong experience in working in Linux and Windows environments. Good analytical, problem solving, communication skills and have the ability to work either independently with little or no supervision or as a member of a team. Excellent written and verbal communication skills, strong organizational skills, and a hard-working team player. Certifications: Amazon Web Services Certified Solutions Architect Associate. Technical Skills: Work Experience: Capital One – Chicago, IL\t \t\t    \t\t\t                       Jan 2015 - Till Date DevOps Engineer Responsibilities: Migrating and maintaining build and test environments into the Cloud Infrastructure. Designing and implementing CI (Continuous Integration) system: configuring Jenkins servers, Jenkins nodes, creating required scripts (Perl & Python), and creating/configuring VMs (Windows/Linux). Coordinate/assist developers with establishing and applying appropriate branching, labeling/naming conventions using Subversion (SVN) and Git source control. Developed AWS Cloud formation templates to create VPC, subnets, NAT, EC2 instances, ELB, Security Groups. Managed Git repository, code merging, and production deployments. Analyze and resolve conflicts related to merging of source code for SVN and Git. Integrate and implement a complete cloud services framework (IaaS, PaaS, and SaaS) and cloud deployment model. Implement, maintain and support reliable, timely and reproducible builds for project teams. Reduce release time for staging and production releases through automation using ansible, python and shell and PowerShell scripts, integrated with Selenium/SOAPUI tests. Maintained build related scripts developed in shell for Maven builds. Created and modified build configuration files including POM.xml. Involved in monitoring and metering for Infrastructure as a Service (IaaS) for Open Stack Cloud. Work with development/testing, deployment, systems/infrastructure and project teams to ensure continuous operation of build and test systems. Used Openstack to deploy IaaS. Created Docker images using a Dockerfile, worked on Docker container snapshots, removing images and managing Docker volumes. Used BOTO and Fabric for launching and deploying instances in AWS. Developed AWS Cloud formation templates to create VPC, subnets, NAT, EC2 instances, ELB, Security Groups. Used Cloud watch logs to move application logs to S3 and create alarms based on a few exceptions raised by applications.  Used Cloud Front to deliver content from AWS edge locations to users, allowing for further reduction of load on front-end servers. Worked on moving middleware applications - infrastructure (IAAS) automation on AWS EC2. Manage network security using Load balancer, Auto scaling, Security groups and NACLS.  Built Cloud infrastructure for Multi-Tier Applications with Failover and High Availability Mode. Support current migration of Data Center to Amazon Cloud.  Used Azure cloud migrations/deployments - Web Roles, Worker Roles, Azure SQL - PAAS and IAAS. Experience configuring and updating the servers using configuration management tools like Chef, Puppet and Ansible. Worked with LDAP, Active Directory, DNS and VLAN technologies. Built Continuous Integration environment (Jenkins, Nexus and Continuous delivery environment (puppet, Yum, rsync Integrated delivery (CI and CD process) Using Jenkins, Nexus, Yum and puppet. Focus on continuous integration and deployment, promoting Enterprise Solutions to target environments.  Implement and maintain the monitoring and alerting of production and corporate servers/storage using CloudWatch.  Document system configurations, Instance, OS, and AMI build practices, backup procedures, troubleshooting guides, and keep infrastructure and architecture drawings current with changes.  Provide oversight and guidance for the architecture, development best practices for application hosting, and infrastructure deployment for each application.  Utilize AWS CLI to automate backups of ephemeral data-stores to S3 buckets, EBS and create nightly AMIs for mission critical production servers as backups.  Use puppet Automation tools for configuration management in different systems.  Responsible for maintaining 4-5 Different Testing/QA Environments and erection of the PROD Environment in AWS Experience with analysis of logs and performing root cause analysis for various issues coming up on daily basis  Monitoring Live Traffic, logs, Memory utilization, Disk utilization and various other factors which are important for deployment.  Utilize Puppet for configuration management of hosted Instances within AWS.Configuring and Networking of Virtual Private Cloud (VPC). Utilize S3 bucket and Glacier for storage and backup on AWS.  Develop CloudFormation scripts to automate EC2 instances.  Environment:Java, Linux, Maven, Nexus, Puppet, Jenkins, Docker, Ansible,  Nginix, Nagios, IaaS, PaaS, SaaS, GIT,AWS EC-2, Route 53, S3, VPC,  EMR, SQS, Autoscaling, Active directory, security groups, ELB, Shell Scripts, Unix/ Linux environment. Barclaycard -Henderson, NV \t\t\t\t\t\t\t    May 2013 – Dec 2014 DevOps Engineer Responsibilities: Involved in DevOps migration/automation processes for build and deploy systems. Implemented the Build automation process for all the assigned projects in Vertical Apps domain. Monitor the UAT/Production Environments for any down time issues by performing regular cron job updates in servers. Evolving new tools/methodologies to improve this existing process and show better results to all stakeholders. Setup various Team Projects into different Team Project Collections in TFS 2013. Support the code builds by integrating with continuous integration tool (Jenkins) Written Maven scripts, Installed Jenkins, written shell script for end to end build and deployment automation. Used Multi Factor Authentication to secure the AWS Account. Build server deployment on Cloud (EC2) servers with help of devops tools like Puppet. Implemented JShint/JSlint testing tool to automate the code review process and published the results on Jenkins as well the graph by comparing everyday nightly builds. Written the Ansible YAML scripts to configure the remote servers. To configure and maintain codebase to support the build and deployment of code on servers. Deployed JAVA/J2EE applications through Web Logic/Web Sphere Application servers. Comfortable and flexible with installing, updating and configuring various flavors of UNIX and Windows. JIRA is used as ticket tracking, change management and Agile/SCRUM tool. Manage Github, gitlab, mercurial, SVN, TFS, HPALM in agile SDLC. Worked on distributed version control system GIT for data integrity. Support for distributed and non-linear workflows. Architected and designed Rapid deployment method using Chef and Ansible to auto deploy servers as needed. Converted and automated builds using ANT. Scheduled automated nightly builds using Subversion.  Maintained Continuous integration effort with Subversion along with scheduled builds. Created Dockerfile for each microservices and also changed some of the tomcat configuration file which are required to deploy Java based application to the Docker container. Merging and tagging need to be done after the code went live in environment. Maintain a Live Like environment to test any production issues on the setup and push it into production. Responsible for distributed applications across hybrid AWS and physical data centers. Configure and maintain stress server in different geographical location and provide setup in every release to perform stress testing. Configured Docker container for branching purposes. Configuration Management using Subversion(SVN) and maintaining admin related files. Automating the regular tasks in Subversion and streamlining the process of access to SVN. Migrated Projects from SVN to GIT. Environment: Java/J2EE, Subversion, Jenkins, JIRA, TFS, Team city, Maven, GIT, ANT, Puppet, AWS, Python, Remedy, Docker, Ansible, Weblogic, Unix, Shell Scripting. Payless Shoes – Topeka, KS\t\t\t\t\t\t\tJuly 2012 – Mar 2013 Devops Engineer Responsibilities:  Involved in setting up JIRAas defect tracking system and configured various workflows, customizations and plug-ins for the JIRA bug/issue tracker. Wrote and maintained various Ansible modules for the upstream Ansible repository. Integrated Maven with Perforce to manage and deploy project related tags. Installed and administered Tomcat repository to deploy the artifacts generated by Maven and to store the dependent jars which are used during the build. Mentor Business Areas on Subversion Branching, Merging strategies concepts. Resolved update, merge and password authentication issues in Jenkins and JIRA. Involved in implementing Tool Suite (JIRA, Jenkins). Setting up continuous integration and formal builds using Jenkins with Maven and Tomcat repository. Built Open stack based infrastructure for Database as a service(DBaaS) and Load Balancer as a service(LBaaS). Installed and configured Confluence as the enterprise wiki to document development and change management procedures. Involved partially in deploying WARs/EARs (backend) through Weblogic Application Server console. Performed setup of clustered environment with Weblogic Application Server. Used Shell script to configure the Weblogic application server in all the environments Managed all the bugs and changes into a production environment using the Jira tracking tool Environment: Java, Maven, Open stack, Ansible, Jenkins, Jira, Jenkins, Linux, Weblogic, Subversion, Shell scripting. Syscon Labs -Hyderabad, India \t\t\t\t\t\t\t   Dec 2010 – June 2012 Build & Release Engineer Responsibilities Release Engineer for a team that involved different development teams and multiple simultaneous software releases. Participated in weekly release meetings with Technology stakeholders to identify and mitigate potential risks associated with the releases and using Version Control Tools likes Rational Clear Case, Rational Team Concert(RTC). Imported and managed multiple corporate applications into Tortoise SVN. Provided end-user straining for all Tortoise SVN, JIRA users to effectively use the tool. Deployed J2EE applications to Application servers in an Agile continuous integration environment and also automated the whole process. Build scripts using ANT and MAVEN build tools in Jenkins, Sonar to move from one environment to other environments. Reduce release time for staging and production releases through automation using python and shell and PowerShell scripts, integrated with Selenium/SOAPUI tests. Created and maintained the Python deployment scripts for Web Sphere web application server. Developed Perl and shell scripts for automation of the build and release process. Involved in editing the existing ANT/MAVEN files in case of errors or changes in the project requirements. Managed Maven project dependencies by creating parent-child relationships between Projects. Jenkins is used as a continuous integration tool for automation of daily process. Documented the entire build and release engineering process and provided on call support. Environment: Tortoise SVN, Jenkins, Sonar, Java/J2EE, ANT, MAVEN, Web Sphere, Perl Scripts, Shell Scripts, Ruby, XML, UNIX, Oracle10g, 11g, JIRA, Python. Aurobindo Pharma -Hyderabad, India \t\t\t\t\t                     Apr 2008–Nov 2010\t Installer development and configuration Responsibilities: Leading the Install module of entire Agile PLM suite. Develop custom plugins to support product installer customizations. Debug and fix installer for major and patch releases of product. Installation and configuration on App Servers (OAS and WLS) on different operating Systems (Win/Sol/Linux/ AIX and HPUX) in both stand alone and cluster mode. Closely work with release team and Product managers to update the platform matrix with respect to Hardware Resource and timelines as per the release road map. Weekly Build validation and update the status to Product manager. Deployment of Agile Application on different Application Servers and troubleshooting the deployment failures. Validating the Install Documents. Work with Product support Team to resolve customer install and Deployment issues and help them go live. Internal training on installation, deployment configuration changes to Doc team, support team and all the QA/Dev. Environment: Windows, Solaris (SPARC, X86), Linux (RHEL, OEL), AIX and HP UX Application Servers: Oracle Application Server, WebLogic Server."}