{"text": "Name: elsie elsie E-Mail: elsie.elsie@gmail.com Address: Bangkok, Thailand Github: https://github.com/elsie LinkedIn: https://linkedin.com/elsie Phone No. 22837537911 Summary: Designed and Implemented CI & CD Pipelines achieving the end to end automation from code checking toartifacts deployment. Supported server/VM provisioning activities, middleware installation and deployment activities via Ansible. Written Ansible playbooks Provision several pre-prod environments. DB installations, Web Logic domain creations and several proprietary middleware installations. Written Ansible playbooks to automate our build/deployment process and do an overall process improvement toany manual processes. Designed, Installed and Implemented / Ansible. Built multiple playbooks in Ansible. Implemented environments, roles, data bags for better environmentmanagement. Good Knowledge in automation by using Ansible. Performed AWS EC2 instance mirroring, WebLogic domain creations and several proprietary middlewareInstallations. Worked in agile projects delivering end to end continuous integration/continuous delivery pipeline by Integration of tools like Jenkins,  Ansible and AWS for VM provisioning. Evaluating performance of EC2 instances their CPU, memory usage and setting up EC2 Security Groupsand VPC. Configured and Managed Jenkins in various Environments, linux and Windows. Administered Version Control systems GIT,  to create daily backups and checkpoint files. Created various branches in GIT, merged from development branch to release branch and created tags for releases. Experience creating, managing and performing container based deployments using Docker images containing Middleware and Applications together. Technical Skills: WORK EXPERIENCE: Change Healthcare, Seattle, WA\t\t\t\t\t\tSept 2017- Till Date Devops/Cloud Engineer Responsibilities: Responsible for build, design and maintain the platform automation infrastructure using Ansible. Developed Ansible Playbooks for automation of manual processes. Implemented playbooks on AWS infrastructure for automation of creation of resources. Build pipelines in Jenkins for deployment processes. Maintain source code repository and local mirrors; perform branching, tagging, and merging. Used yaml coding for automation processes. Created an automation playbook for lambda execution. Created a playbook for infrastructure of lambda servers. Worked on AWS to create resources, manage functions , create stacks Worked on AWS code build and code pipeline, code commit Helped Developers to setup Workstations in Windows, Linux to work with Ansible. Supported server/VM provisioning activities, middleware installation and deployment activities via Ansible. Integration of Configuration Management Systems like playbooks with AWS for code deployment. Created VPC and enabled access between public and private subnets. Experience working with Docker. Provided end-user training for /GIT users to effectively use the tool. Developed build using ANT and MAVEN as build tools and used Jenkins to kick off the builds move fromone environment to other non-prod environments. Built and Deployed java/J2EE to a web application server in an Agile continuous integration environmentand also automated the whole process. Responsible for the development and maintenance of processes and associated scripts/tools for automatedbuild, testing and deployment of the products to various developments.. Worked on several build tools like ANT, Maven and Gradle etc. Troubleshooting deployment, infrastructure and start up issues on various application server’s product line. Automated webserver content deployments via shell scripts. Environment:UNIX, Java, Maven, Serverless server (Lambda), Jenkins, Jira, SVN, Hudson, Java, Linux. State Farm, Bloomington, IL\t\t\t\t\t\t\tJan 2014-August 2017 DevOps engineer Responsibilities Responsible for build, design and maintain the platform automation infrastructure using Ansible. Developed Ansible Playbooks to install and configure Apache, Tomcat,  Jenkins, WebLogic, and deployment automation and Integrated Jenkins. Implementing Test Driven Development (TDD). Worked on automating processes using Ansible. Create release pipelines using GIT, and jenkins operations orchestration tool for automatic Workflow. Maintained high availability clustered and standalone server environments and refined automation components with scripting and configuration management Ansible.  Helped Developers to setup Workstations in Windows, Linux and Mac to work with Ansible. Supported server/VM provisioning activities, middleware installation and deployment activities via Ansible. Integration of Configuration Management Systems like Ansible with AWS for code deployment. Created VPC and enabled access between public and private subnets. Experience working with Docker Hub, Internal Docker Registry and Docker Engine. Provided end-user training for all Subversion (SVN)/GIT users to effectively use the tool. Developed build using ANT and MAVEN as build tools and used Jenkins to kick off the builds move fromone environment to other non-prod environments. Built and Deployed Java/J2EE to a web application server in an Agile continuous integration environmentand also automated the whole process. Responsible for the development and maintenance of processes and associated scripts/tools for automatedbuild, testing and deployment of the products to various developments. Responsible in deploying the application WARs, EARs in WebLogic application servers and troubleshoot anydeployment issue. Configured the JNDIs, Data Sources, and JDBC to connect the application to the backend Oracle Database. Experience in migrating source code repositories from between various version control systems like SVNto Git, SVN. Worked on several build tools like ANT, Maven and Gradle etc. Deployed Applications into PROD & Pre-Prod environments with various Application server technologies likeWebLogic, Jboss& Apache Tomcat. Troubleshooting deployment, infrastructure and start up issues on various application server’s product line. Automated webserver content deployments via shell scripts. \nEnvironment: Solaris, Unix, Java, Maven, WebSphere Application Server (WAS), Cygwin, Jenkins, Jira, Merant Tracker, PVCS, WMB, SVN, Hudson, Java, Linux. American Airlines, Dallas, TX\t\t\t\t\tMay 2012- Dec 2014 Software Release Engineer Responsibilities: Actively participated in the improvement of the software configuration and change management processes to guarantee build accuracy, version control of software artifacts, and re-creation/migration of build environments(from Build Bot to Build brain and from perforce to Git). Maintain source code repository and local mirrors; perform branching, tagging, merging and maintenance tasks for windows host and Mac builds. Performed Daily/Weekly/fortnightly customer releases through Git pushes to shared, private and publicservers. Automated daily manual tasks/tests by running cron jobs. These jobs were actually BASH (shell), TCL, Perl,Python Scripts that report on a user specified frequency about various issues. Manage Version Control Systems tools like Git, GitHub to implement revision control systems to track, document and control changes to the repository source code. Developed and maintained UNIX/Perl/Ant scripts for build and release tasks. Modified ANT scripts to build the JAR's, Class files, WAR files and EAR files. Developed utilities for developers to check the checkouts, elements modified based on project and branch. Created Subversion configuration record for builds using derived objects generated during build audit process. Performing clean builds according to the schedule published for a given release. Installed Cruise Control and performed troubleshooting during installation. Worked with Cruise Control for automated build and release. Verifying that the methods used to create and recreate software builds are reliable and repeatable. Research the project application architecture to support/resolve build, compile, and test issues/problems. Releasing code to testing regions or staging areas according to the schedule published. \nEnvironment: Ant, Java, Maven, SVN, Jenkins, Linux, Solaris, Web Logic, Perl, Shell scripting, Nexus, Sonar, JIRA, Eclipse. XO Communications, Dallas, TX\t\t\t\t\t\tJan 2011- April 2012 Build Engineer\t\t\t\t\t Responsibilities: Modified ANT scripts to build the JAR's, Class files, WAR files and EAR files. Created Subversion configuration record for builds using derived objects generated during build auditprocess. Responsible for building and releasing packages for testing. Performing clean builds according to the schedule published for a given release. Responsible for deleting the old deployed code and deploying the newly built code using Web Logic AdminConsole. Releasing code to testing regions or staging areas according to the schedule published. Updated and automated Release reports for Change Management. Supporting Local System Administrators to troubleshoot Configuration Management and Network issues. Analyzing and recommending hardware and software needs and installing them. Documented release, builds and source control processes and plans. Worked closely with development team and SQA team for product releases. Coordinated the build and deployment bottlenecks with the development team. In charge of reviewing existing manual Software Builds, developing scripts to automate repeated tasks thatare more susceptible to errors and risks using PERL, Shell scripting. Strengthening security by implementing and maintaining Network Address Translation in company's network Performed Java/J2EE development using Struts. Deployed the applications to WebSphere Application Server and static content to apache web servers. Environment:  Linux/UNIX,, Java, Eclipse, Ant, Iplanet WebSphere, Web logic, Hudson, Multisite, Perl, Maven, Make, WSAD, Microsoft .net, SQL Server."}