{"text": "Name: alice alice E-Mail: alice.alice@gmail.com Address: Chicago, United States Github: https://github.com/alice LinkedIn: https://linkedin.com/alice Phone No. 187785854084 Experience Summary: 7 years of enhanced functional experience in System analysis in Health care, with FACETS and extensive interaction with client.  Insightful knowledge of business process analysis and design, domain & technology expertise with strong integration skills.  Experienced as a Facets System Analyst in gathering the business requirements from the existing stored procedures, supporting the Interfaces and reports development in explaining the functional requirements, proposing technical solutions, supporting the unit testing and system integration testing with the functional flow. Experience in mapping business requirements, designing customized solutions with strong analytical skills and ability to analyze business practices and define optimal procedures. Experience with Claim/Encounter Management, claim data collection, claim quality check, filter claims, etc. Functional experience in health Care Industry with vast knowledge on Medicare and Medicaid & Payers, including Home Health. Immense knowledge in Health care payer operations, Interfaces, Reports, Letters and system Migrations, Health Administration – Claims processing (auto adjudication), Claims pricing and testing, HIPAA, enrollment, Medicare, Medicaid, etc Expertise in HealthCare Administration/Managed Care Systems working with various Claims Systems/Applications with multiple healthcare client systems, with prime focus on claims adjudication, provider, eligibility. Expert in SDLC (System Development Life Cycle) methodologies like the RUP and the waterfall. Knowledge of the following HealthCare EDI Transactions for 4010/5010 like (278) Referral Certification and Authorization, (834) Benefit and Enrollment, (835) Payment & Remittance Advice, (837 I & P) Institutional and Professional HC Claim Functional experience with concentration on Use Case modeling using UML, Business Process Modeling, Data Modeling, Change Management, Technical Training, Software Development methodologies, QA testing, and Systems Testing interfaces, Reports, Letters. Hands on experience in creating SQL and PL/SQL Queries, Stored Procedures, Triggers, Views, Indexes in SQL Server with a strong understanding of data & analytics.  Developed, executed and maintained Test Scripts, Reviewed and documented system and implementation Test Strategy Documents for Parallel Testing, and system integration testing.  Great communication skills, client relations, presentation and negotiations with creative approach to problem solving through use of excellent analytical skills. Involved in building the Health care center of Excellence across by involving in creating and sharing the knowledge base and conducting sessions across the organizations.    Managing requirements traceability information and tracking requirements status throughout the project. TECHNICAL SKILLS: Professional Experience: Client: Molina HealthCare, Long beach, CA Duration: Apr 2015 – Dec 2017 Role: FACETSSystem Analyst This application helps its Membership and Claims Management Information Tracking System, Finance and Utilization management System modules. As a BA I worked on a conversion project to upgrade their claims system FACETS 5.01 to FACETS 5.03. In strict compliance to complex policies/regulations, configured FACETS modules such as Benefit Plans and Contracts as well as related modules such as Claims Finance, Configuration, Fee Tables and Carrier/Programs. Analyzed FACETS Benefit Plans and Contracts module as well as related modules in order to identify data requirements for script design developers. Responsibilities: Gather Business Requirements from the Business users, Subject Matter Experts (SMEs) and document the requirements in the BRD.  Utilized data flow diagrams, use case diagrams and process flow diagrams to represent information provided by the Business Owners. Involved in gathering, documenting and verifying business requirements. Drafted the Physical Data Mapping document for the data flow from FACETS to the data warehouse Organized JAD Sessions to collect requirements from system users and prepared business requirement that provided appropriate scope of work for technical team to develop prototype and overall system. Served as a liaison between the internal and external business community (Claims, Billing, Membership, Capitation, Customer service, membership management, provider management, advanced Healthcare management, provider agreement management) and the project team Responsible for documentation of different Medicare/Medicaid Benefit terms. Used SOAP UI for validating Web Services. Used Rational RequisitePro as requirement gathering tool. Extensively used SQL statements to query the Oracle Database for data modeling, data analysis, data Validation and data Integrity. Extensively wrote standard and complex SQL queries to perform data validation to make sure test results matched. Create daily reports in designed MS Excel spreadsheet with pivot tables. Used MS Excel to analyze, communicate, & examine organizational change. Analyzed XML Data and produced Data Flow Diagrams.  Conducted Analysis of business scenarios using MS Excel. Worked on Member Management, Eligibility, Claims and Billing modules within FACETS Develop, coordinate and support Information Technology Division on all operational requirements of FACETS claims processing system and production management. Used SOAP UI for XML validation and Web Services testing. Prepared and analyzed dataflow, workflow, and process flow for business users using MS Visio.  Analysis of inbound and outbound interfaces and extensions to Trizetto’s FACETS Claims Processing system. Worked in FACETS Reconfiguration of member/subscriber, Data Element Definition and Usage with values and completed configuring FACETS Applications like Related Entity, Parent Group, Group, and Subgroup. Worked closely with stakeholders and SME’s for requirements gathering. Involved in writing complex SQL queries to extract the data from Oracle database Identified end to end requirements for all systems and business units that may be impacted by the project. Developed requirements integrating Use Case diagrams and designed the testing process flows. Established and maintained traceability matrix until business requirements were signed off. Conducted walkthrough and lead work sessions. Designed and implemented SQL queries for reports and data validation. Participated in solving Billing issues from the FACETS Problem Log for Trizetto’s and Billing Entities. Analysis and Design of the Trizetto’s FACETS Data Model to ensure optimal system performance and tuning. Developed a Business Acceptance testing strategy and plan. Created test files and analyzed test results using MS-Excel. Involved in Claim Processing from End to End and major work was involved with 837 P/I Claims Processing systems. Involved in project status meetings, QA review meeting, and System Test meeting. Coordinated and facilitated the execution of User Acceptance testing. Client: Geisinger, Danville, PA Duration: March 2013 – Jan 2015 Role: System Analyst   I was involved in developing fully automated, real-time Facets claims processing system for complete, on-line mediation of medical, dental, vision, and disability claims and encounters as per HIPAA guidelines. System allowed the efficient and timely management of all relevant data clinical, financial, and administrative throughout the organization enabling the sharing of information between subsystems. Responsibilities Extensively involved in implementation of effective requirements practices, including gathering User Requirements, and analyzing User Requirement Document (URD), and functional specification document (FSD), use and continuous improvement of a requirement gathering processes. Applied RUP methodology with its various workflows, artifacts and activities to manage life cycle from Inception to Transition phase. Knowledgeable on the Claims, Membership & Provider modules along with FACETS functionalities & Data Model Analyzed business requirements and segregated them into high level and low level Use Case Diagrams, Activity diagrams using MS Visio according to UML methodology thus defining the Flow Diagrams. Worked and performed maintenance FACETS data with Member/Subscriber & billing module Involved in HIPAA EDI transactions such as 270, 271,837 (P, D, I), 276, 277, 834, 820, 278,999/TA1, and 277 CA Drafted the Physical Data Mapping document for the data flow from FACETS to the data warehouse Involved in the integration of FACETS Communication module to other sub modules for inbound and outbound communication. Used SQL Queries in Oracle to pull out data from the databases for the data validation and routine report generation.  Wrote technical requirements for the interface between FACETS and other modules within the system Acted as liaison between external clients and SMEs to generate and standardize product requirements specification documents such as URS/FRS/Use Cases. Worked on analysis of FACETS claims processing system and gathered requirements to comply with HIPAA 5010 requirements. Used MS Excel to analyze XML data. Used SOAP UI for XML validation and Web Services testing. Responsible for documentation of different Medicare Benefit terms and Programs Configuration library. Employed UML methodology in creating UML Diagrams such as Use Cases, Sequence Diagrams, and State Diagrams, Activity Diagrams and business process and workflows. Was engaged in applying CMM standards which provided guidance for improving organization's processes and the ability to manage the development, acquisition, and maintenance of products or services was providing to its clients. Assisted JAD sessions to identify the business flows and determine whether any current or proposed systems are impacted by the EDI X12 Transaction, Code set and Identifier aspects of HIPAA. Involved in GAP analysis, mapping, implementation, and testing for processing of Medicaid Claims.  Worked on EDI transactions: 270, 271, 835, and 837 (P.I.D) to identify key data set elements for designated record set. Involved in designing & determined 3-tier architecture for the claim processing system.  Assisted team lead in developing Requirements Traceability Matrix (RTM) to trace the relationship between business and functional requirements to test cases. Prepared and executed different Test Cases and Test Scripts. Involved in conducting Functionality testing, Integration testing, Regression testing and User Acceptance testing (UAT). Provided analysis and insight to QA Team in defects and bugs tracking. Client: Humana, Kentucky, KY           Duration: April 2011 - Feb 2013 Role: System Analyst ICD 10 as the core project assignment. The Project Scope - To implement the various ASC X12 healthcare transactions and to successfully transition from ICD 9 to ICD 10. Also worked on Facets Claims Adjudication systems and gathered requirement of various modules including Membership/Subscriber, Claims, and Providers. Responsibilities: Served as a liaison between the internal and external business community (Claims, Billing, Membership, Capitation, Customer service, membership management, provider management, advanced Healthcare management, provider agreement management) and the project team Coordinated the upgrade of Transaction Sets 837P, 835 and 834 to HIPAA compliance. Responsibilities include the analysis of inbound and outbound interfaces and extensions to FACETS claims processing system Completed Data Mapping for Group and detail Product analysis and report writing Analysis and Design of the FACETS data model to ensure optimal system performance and tuning  Understanding and assessment of the current Pharmacy Transactions from an NCPDP 5.1 perspective Gathered Business Requirements from the Subject Matter Experts (SMEs) for “ICD 10 Project” and documented the requirements in the BRD.  Performed Data Analysis of ICD 9 Procedure and Diagnosis Codes in accordance with ICD 10 CM and ICD 10 PCS Conversion Compliances.  Creation of a Gap/Impact Analysis Document for changes of the EDI Transactions (837, 835, 276/277, 270/271) Creation of a Gap/Impact Analysis Document for changes to Pharmacy Transactions (real time and batch) based on NCPDP 5.1 to NCPDP D.0, specifically concerning the data elements EDI Processing, the retrieval of Medicare/Medicaid HCFA and UB04 claim files, delivery of acknowledgement reports,'835' Remittance Advice,'837' Professional and Institutional claim files, and '999'/'277' response files daily, and the submission of Member, Provider and Encounter files (NCPDP, Dental, Prof, Institutional), using HIPAA compliant data transfer protocols. Experience updating FACETS Billing Configuration of pricings, adjustments, deductibles, accumulators, limit rules, and provider rows to show network affiliation, group affiliation, and provider specialties on the front and back end. Worked in FACETS Reconfiguration of member/subscriber, Data Element Definition and Usage with values and Completed configuring FACETS Applications like Related Entity, Parent Group. Creation of a Mapping Document for ICD9 Codes to ICD 10 Clinical Modifications and Procedural Codes. Creation of Gap/Impact Analysis Document for the Prescription Drug Point of Sale System Documentation for the Drug Utilization Review System Creation of Gap/Impact Analysis and Operational Analysis, document Medicaid Subrogation and the Drug Rebate Analysis and  Management System Managed the encounter data collection effort between the health plan and the medical group. Researched, analyzed and resolved intricate encounter data issues in association with EDI transaction errors. Prepare requirement specifications such as Use cases and System requirement specifications and Supplementary specifications; Tag and trace system requirements to business requirements Develop functional design details and specifications through collaboration with development teams and using system architecture and other technical considerations Maintain test data files and monitor system configuration to ensure data integrity; review data loaded and processed to identify gaps and data anomalies Analyzed the current Business Requirements gathering process with BPM and re-established/optimized the process JAR. Designed and implemented basic SQL queries for QA Testing and Report / Data Validation Used ClearCase to keep different versions of the documents and ClearQuest to report bugs or defect  Used Rational RequisitePro as requirement gathering tool. Participated JAD sessions with developers to review Unit test results. Performed QA including functional testing, System testing and End to End testing.  Client: Spotlite Inc. - Chicago, IL Project Duration: May 2010– Mar 2011 Role: SystemAnalyst   The project dealt with development of a Health Care Cost Containment System and implementation of an automated inter-operable web application that tracks patient medical history and health care plans via Viewer application and Electronic health records. I was also involved in the implementation of Medicare program to include Claims, and member/subscriber modules in the system Responsibilities Gathering and documenting project requirements/specifications and experience with the System Development Life Cycle. Developing and executing SQL queries against data warehouses to support data mapping and ad-hoc analysis. Conducted one on one interviews with high level management team and participated in the JAD session with the SME’s. Worked with Facets Billing Application Configuration, Claims Processing, Guided Benefit Configuration, Medical Plan, Provider, Subscriber/Member, and etc. Worked on Member Management, Eligibility, Claims and Billing modules within FACETS Develop, coordinate and support Information Technology Division on all operational requirements of FACETS claims processing system and production management. Develop, design & implement department plan to operationalize new FACETS integrated processing system, to include but not limited to, workflow, management oversight and performance analysis. Conducted Validations for different FACETS modules Providers, Claims and Membership. Worked extensively with EDI X12, 837I/P/D, 835, 834, 820 and 276/277 transactions. Involved in HIPAA lifecycle with traceability analysis, mapping, implementation, & also worked on different EDI X12 transactions.   Identified end to end requirements for all systems and business units that may be impacted by the project. Developed requirements integrating Use Case diagrams and designed the testing process flows. Established and maintained traceability matrix until business requirements were signed off. Conducted walkthrough and lead work sessions. Using MS-Visio analyzed business requirements and process through Use Cases, Class, Sequence, and Activity diagrams, and adapted UML standards to define modularized Data Process Models. Involved in Testing the Member portal website and worked on the requirement gathering and Analysis for developing the Ad-hoc reports that are extracted from the consumer portal back end data. System issue resolution of critical problems/tickets through data analysis and root cause analysis Responsible for Report scheduling, Extracting and Distributing daily reports to the client leadership team.  Actively working with business users, development, QA teams and onsite/offshore team. Conducting reviews of SRS written by peers and junior colleagues.  Analyzed Business Requirements and segregated them into high level and low level Use Cases, Activity Diagrams / State Chart.  Conducted and participated in walkthroughs to generate consensus, maintaining quality and resolve issues among different stakeholders in the SDLC. Created Process Flow diagrams, Use Case Diagrams, Class Diagrams and Interaction Diagrams. Created Use cases, activity report, logical components and deployment views to extract business process flows and workflows involved in the project. Carried out defect tracking.  Maintained proper communication with the developers ensuring that the modifications and requirements were addressed and also monitored these revisions. Involved in compatibility testing with other software programs, hardware, Operating systems and network environments. Education:Bachelor’s"}