{"text": "Name: dorothy dorothy E-Mail: dorothy.dorothy@gmail.com Address: Shanghai, China Github: https://github.com/dorothy LinkedIn: https://linkedin.com/dorothy Phone No. 89250797036 \t PROFESSIONAL SUMMARY 8+ years of experience in Design & Development of Enterprise Applications, Web Applications, and Web Services in Java/J2EE and related technologies. Extensive working experience with in Design, Development, and Implementation in the field of Web Applications development using HTML, CSS, XHTML, JavaScript, JQuery,BackboneJS, AngularJS, Bootstrap, AJAX, XML, JSON, Restful web services and Responsive web designing. Experience with various MVC Java frameworks like Angular.JS, EXT.JS, JQuery, Backbone.JS, Node.JS, React.JS, Express JS, Ember JS. Developed Single page application using BackboneJS withMVC Framework. Expertise in Core Java concepts – Collection Framework, Exception Handling, IO, Serialization, Multi-threading, Concurrencyetc. Experience in working on various Frameworks like Spring, Struts, JSF, EJB and ORM Technology like Hibernate, and IBatis, which implements JPA Good knowledge of Spring Core, spring batch,Spring security, spring boot, spring MVC and spring's integration with Hibernate and Struts technologies Experience in Service Oriented Architecture (SOA), Web Services design development and deployment using WSDL, REST, UDDI, JAXP, JAXB, SAX, DOM, XSLT, Apache AXIS,SOAP Web Services. IT Strategy Risk Management Cloud Computing / PaaS / SaaS / IaaS Infrastructure Architecture Disaster Recovery. Proficient in using Object Oriented Programming Analysis and Design (OOAD) principles, UML and Rational Rose, Object Oriented Design Patterns in building high performance applications Experience in using JSP and Servlets to create web interfaces and integrating apache tools like Kafka. Worked on (JMS) MQ's like RabbitMQ, IBMMQ and Active MQ. Used karma and jasmine to do unit testing for java script. Experience in software testing, Junit testing, and regression testing, and defect tracking and management using JIRA Good knowledge with Grunt task runner and installed latest version of libraries with Bower based on running in the Node.js environment. Good Understanding of Document Object Model (DOM) and DOM Functions. Hands on experience with various Applications servers and Web servers (IBM Web Sphere Application Server, WebLogic, JBoss, and Tomcat). Well experienced in Design and Development of database systems using RDBMS concepts including Oracle, PostgreSQL, MySQL and experience in writing SQL queries, PL/SQL, T-SQL, Stored procedures, prepared statements and triggers. Performed DevOps for Linux, Mac and Windows platforms Designed and implemented the rules of Business Logic using spring and EJBs. Proven knowledge in one or more NoSQL Document Store databases such as MongoDB, Cassandra Skilled in using automated functional testing tools like Selenium and test-driven development using JUnit and debug tools like log4j. Experience in writing Build Scripts using Shell Scripts, ANT, MAVEN and using CI (Continuation Integration) tools like Continuum, Jenkins and Hudson. Expertise in writing JUnit test cases using Junit Frameworks like Mockito, JMock. Strong knowledge on working with Jasmin-Karma, Protractor for client-side unit testing and Experience on working client-side build tools like npm, Grunt, Gulp, Bower. Vast knowledge of utilizing cloud technologies including Amazon Web Services (AWS), Microsoft Azure and Pivotal Cloud Foundry (PCF).   Involved in CICD process using GIT, Nexus, Jenkins job creation, Maven build Create Dockerimage and deployment in AWS environment  Extensive experience in working on projects with Waterfall and Agile methodologies such as Test-Driven Development (TDD). TECHNICAL SKILLS: EDUCATION Bachelor of Technologyin Electrical & Electronics Engineering, JNTUH, India Professional Experience:  Client: Wells Fargo, MI\t\t\t\t Nov11/7/2016-Till Date Role: Full Stack Developer\t\t Description: Wells Fargo is an American multinational banking and financial services holding company which is headquartered inSanFrancisco, California. Wells Fargo is the second largest bank in deposit, home mortgage servicing and debit cards. My Role is to build, develop and test the portal for Equipment Financing, which acts as Self servicing tool for the customers.  Responsibilities:  Developed Single Page Responsive Web UI using BackboneJS, ReactJS, AngularJS, HTML5, CSS3(using SAAS), Bootstrap, JavaScript. Extremely used Backbonejs collections in the application to create ordered set of models. To create sharable and bookmarkable URLs Backbonejs routers are used.Underscore.js is used to make it more functional and supporting range of useful collection based operations  Involved in testing, identifying, and fixing problems related to bowser compatibility issues (IE, Chrome, and Firefox). Developed the functionalities under Agile Methodology JIRA processes. Worked in all the modules of the application which involved front-end presentation logic developed using Tiles with Spring MVC, JSP, JSTL and java script, Business objects developed using POJOs and data access layer using iBatis, Hibernate framework.  Actively involved in using MVC, HTML to enable client-side data to meet specific criteria by applying various validation variables and used Backbone JS validations. Developer consultant advising on building stable, scalable Backbone js browser applications utilizing transitional APIs. Have been working on Query optimization, functions and Stored Procedures and other database objects. Worked on Oracle, My Sql.  Involved in MVC architecture ofRequire JS in developing the apps, controllers and directives which are totally customized to meet the needs of the application. Involved in writing Thread Safe blocks for multithread access to make valid transactions.  Optimized cleaning up of session level Data Structure's shared across different open tabs, when data is flushed/committed from one of the tabs. Followed mark and sweep algorithm, to clean up tab level data upon next HTTP interaction.  Designed, built, and deployed a multitude application utilizing almost all the AWS stack (Including EC2, MongoDB focusing on high-availability, fault tolerance, and auto-scaling)  Worked on React JS Virtual Dom and React views, rendering using components which contains additional components called custom HTML tags.Responsible for the implementation of application system with Core Java and spring framework.  Develop various screens for the front end using React JS and used various predefined components from NPM (Node Package Manager) and Redux library.Created and injected spring services, spring controllers and DAOs to achieve dependency injection and to wire objects of business classes. Used iBATIS automates the mapping between SQL database and objects in java Worked on Spring Quartz, form based authentication with Cross-Site Request Forgery CSRF token and secured REST endpoints with HTTP Basic authentication Provided Authentication and Authorization for both web-services and web application.  Used Spring Inheritance to develop beans from already developed parent beans. Used Hibernate Transaction Management, Hibernate Batch Transactions, and Hibernate cache concepts. Defined MultiAction, AbstractWizardFormand SimpleForm Controllers using Spring MVC framework providing very clean division between controllers, flexibility with the use of interfaces and providing thin web layer over business layer. Developed RESTful service interface using Spring Boot to the underlying Agent Services API and Implemented RESTful web services. Designed & developed SOAP and Restful web services using WSDL, SOAP, JAX_WS, JAX-RS, and CXF. Developed some standalone Micro services using Spring Boot micro service architectural patterns. Used spring Boot properties like actuators and health checkers to enhance micro service implementations. Involved in tuning the front-end stack for performance (performance tuning). Used AJAX extensively to implement front end /user interface features in the application. Implemented SOA to develop Web services using Apache Axis.  Developed Web Services clients to consume those Web Services as well other enterprise wide Web Services. Exposed the Web Services to the client applications by sharing the WSDL’s. Managed and maintained Oracle and NoSQL (Cassandra) databases in production domain. Database development required creation of new tables, PL/SQL stored procedures, functions, views, indexes and constraints, triggers and required SQL tuning to reduce the response time in the application. As an onsite coordinator, I have interacted with offshore team to give the Functional and Technical knowledge and track the status of the project. Used ALM(Application Life Cycle Management) to keep track of outstanding bugs to reduce downtime and increase productivity. Used Apache Maven for project management and building the application. SVN was used for project management and version management. Environment: HTML, DHTML, CSS, Backbone js, Spring framework, JMeter, Spring MVC, JSP, JSF, Servlets, Hibernate, Swing, JFC, AJAX, Web services, AWS, SOAP, XML, Java Beans, Stream, Apache POI, JQuery, JavaScript, ReactJS, Oracle, IBM RAD, WebSphere, Cassandra, Apache Maven, JUnit, XSLT. ClientCSX- Transportation Jackson Ville, FL\t\t\t\t\tMay 2015-Oct 2016 Role:  Sr. Java Developer Description:CSX is a leading supplier of rail-based freight transportation in North America. At CSX, we hold ourselves accountable for tackling important issues for nation, which is why holding several projects and partnerships with a focus on solving problems related to the environment, traffic congestion and energy independence. We have developed a web application by rewriting the old technology stack into web based integrated application. The application deals with processing the transactions and generating reports and allows modification of customer data, if required. Responsibilities:  Created interactive web pages and applications by usage of HTML, CSS, Angular JS Created Angular JS controllers and services in the application  Used Angular JS controller to control the client-side view rendering and support dynamic content in the Single page application. Called Rest web services through Angular js services to get JSON Object and modified the response object to display in UI. Used React JS for templating for faster compilation and developing reusable components. Implemented React JS to develop UI components and their dynamic rendering based on the actions occurred and the corresponding stores, view components associated with them. Used React Router to develop several complex single page applications. Responsible for React UI and architecture. Building components library, including Tree, Slide-View, and Table Grid. Used Spring framework and J2EE components, Utilized Spring MVC, IOC, AOP and DAO modules.  Developed controller classes, backend processes, complex services and database interaction, which is added security for service layer methods using Spring Security. Implemented Multithreading concepts and thread safe methods in Java classes to avoid deadlocking Involved in the JMS Connection Pool and the implementation of publish and subscribe using Spring JMS. Used the Rest Templates in the spring services to call the rest web services. Used Web Services (SOAP & WSDL) to exchange data between portal and other modules. Created the spring Bean Factory for initializing services. Coded Rest API for Product service using spring boot. Deployed applications on Apache Tomcat application server instances in all the respective environments Coded soap and Rest web services using spring boot to rewrite existing application to micro web application. Used Hibernate, object relational-mapping (ORM) solution, technique of mapping data representation from MVC model to Oracle Relational data model with SQL-based scheme. Involved in creating the Hibernate POJO Objects and mapped using Hibernate Annotations. Integrated spring with Hibernate using configurations and implemented DAO layer to save entities into database.  Extensively used Hibernate ORM in data access layer to write DAOs. Developed hibernate mapping and Configuration files. Designed and Implemented REST web services using JAX-RS, Spring REST.  Wrote AngularJS services to consume Restful web service to load data. Worked with Swing and RCP using Oracle ADF to develop a search application which is a migration project. Used Source Tree for Git (Subversion tool). Used DAO pattern to fetch data from database using Hibernate for performing various database specific operations and avoided redundant database access statements, and thus achieved decoupling and flexibility.  Involved in writing Oracle PL/SQL Stored procedures, triggers, and views. Worked on NoSQL data base MongoDB and Performed CRUD operations like Update, Insert and Delete data. Installed WebSphere Server for handling HTTP Request/Response. The request and response from the client are controlled using Session Tracking in JSP. Written client interfaces and implementation classes to consume the web services. Experience in NoSQL (MongoDB) in using Hierarchy Modelling Techniques like Tree Aggregation, Adjacency Lists and materialized paths. Extensively used Core Java such as Exceptions, and Collections  Experience in using NoSQL (MongoDB) data models document, key-value & wide column, or graph model. Configured the Web sphere application server to connect with DB2, Oracle and SQL Server in the back end by creating JDBC data source and configured MQ Series with IBM RAD and WAS to create new connection factories and queues Extensively worked on TOAD for interacting with database, developing the stored procedures and promoting SQL changes to QA and Production Environments.  Used eclipse standard/plug-in features for editing, debugging, compiling, formatting, build automation, test case template generation, accessory code generation, and version control GIT. Worked in an Agile environment delivering output in sprints and participating in scrums. Environment: JQuery, Angular js, Spring MVC, Node js, IOP, Spring Batch, Oracle, JBoss, SAAS, SOAP UI, JSP, JSF (Rich Faces), Servlets, JDBC, Hibernate, XML, CSS, DOM, Grunts, DHTML, Junit, GIT, Log4j, Oracle, UNIX, Maven, Agile Scrum Client: Bamboo Rose, Boston, MA\t\t\t\t\t\t\t       May-2014 to April-2015 Role:  Sr. Java Developer Description: Bamboo Rose, Inc., a business to business marketplace, provides a digital B2B marketplace for product and supply chain management that enables retailers and suppliers to discover, develop, and deliver ideas and products to markets worldwide.  Responsibilities:  Wrote SQL queries, stored procedures and enhanced performance by running explain plans.  Developed the functionalities under Agile Methodology JIRA processes. Worked in all the modules of the application which involved front-end presentation logic developed using Tiles with Spring MVC, JSP, JSTL and java script, Business objects developed using POJOs and data access layer using Hibernate framework.  Developed and tested Apache JMeter Java Request Sampler Plugins Extensions using methods inside of Linux Desktop Testing Project (LDTP) Java libraries for Graphical User Interface (GUI) Automation Testing  Used to building rich Internet applications, backbone JS to optimize in-browser use and to load the module and to improve the Speed. Front-end development utilizing Java script frameworks such as JQuery, Backbone Js. Have been working on Query optimization, functions and Stored Procedures and other database objects. Worked on Oracle, My Sql.  Involved in writing Thread Safe blocks for multithread access to make valid transactions.  Optimized cleaning up of session level Data Structure's shared across different open tabs, when data is flushed/committed from one of the tabs. Followed mark and sweep algorithm, to clean up tab level data upon next HTTP interaction.  Solid understanding of the Software as a Service (SaaS) model in the online environment. Developed algorithms and programs in C for embedded control systems Designed, built, and deployed a multitude application utilizing almost all of the AWS stack (Including EC2, MongoDB focusing on high-availability, fault tolerance, and auto-scaling)  Enhanced user experience by designing new web features using MVC Framework like BackboneJS accommodate these advanced and fast technologies.  Responsible for the implementation of application system with Core Java and spring framework.  Created and injected spring services, spring controllers and DAOs to achieve dependency injection and to wire objects of business classes. Worked on Spring Quartz, form based authentication with Cross-Site Request Forgery CSRF token and secured REST endpoints with HTTP Basic authentication Used Spring Inheritance to develop beans from already developed parent beans. Designed and Implemented REST web services using JAX-RS, Spring REST.  Wrote AngularJS services to consume Restful web service to load data. Worked with Swing and RCP using Oracle ADF to develop a search application which is a migration project. Used Source Tree for Git (Subversion tool). Used DAO pattern to fetch data from database using Hibernate for performing various database specific operations and avoided redundant database access statements, and thus achieved decoupling and flexibility.  Used Hibernate Transaction Management, Hibernate Batch Transactions, and Hibernate cache concepts. Defined MultiAction, AbstractWizardFormand SimpleForm Controllers using Spring MVC framework providing very clean division between controllers, flexibility with the use of interfaces and providing thin web layer over business layer. Involved in tuning the front-end stack for performance (performance tuning). Developed screens using JSP, JavaScript, AJAX and Ext JS. Designed and implemented a complex Ext Jstree component for selecting company division information. Developed entire user interface using various Ext JS components like Form panels, Tab panels, View port and Editable grids. Used JENKINS to build and deploy the code in Dev and SIT environments.  Deployed the application Code to various Remediation engines using JENKINS.  Used AJAX extensively to implement front end /user interface features in the application. Implemented SOA to develop Web services using Apache Axis.  Developed Web Services clients to consume those Web Services as well other enterprise wide Web Services. Exposed the Web Services to the client applications by sharing the WSDL’s. Developed unit test cases using Mockito framework for testing accuracy of code and logging is done using SLF4j + Log4j. Managed and maintained Oracle and NoSQL (Cassandra) databases in production domain. Database development required creation of new tables, PL/SQL stored procedures, functions, views, indexes and constraints, triggers and required SQL tuning to reduce the response time in the application. Focused on Test Driven Development (TDD) thereby creating detailed JUnit tests for every single piece of functionality before actually writing the functionality. Implemented unit test with karma test runner. Created Test cases, performed testing using JUnit, Selenium and documented the process.  Experience in NoSQL (MongoDB) in using Hierarchy Modelling Techniques like Tree Aggregation, Adjacency Lists and materialized paths. Integrated the Java code (API) in JSP pages and responsible for setting up AngularJS framework for UI development. Developed HTML views with HTML5, CSS3, bootstrap, NodeJs and AngularJS.  Implemented code according to coding standards and Created AngularJS Controller Which Isolate scopes perform operations.  Extensively used Core Java such as Exceptions, and Collections  Experience in using NoSQL (MongoDB) data models document, key-value & wide column, or graph model. Configured the Web sphere application server to connect with DB2, Oracle and SQL Server in the back end by creating JDBC data source and configured MQ Series with IBM RAD and WAS to create new connection factories and queues Extensively worked on TOAD for interacting with database, developing the stored procedures and promoting SQL changes to QA and Production Environments.  Used Apache Maven for project management and building the application. CVS was used for project management and version management. Environment: HTML, DHTML, CSS, Backbone js, Spring framework, JMeter, Spring MVC, JSP, JSF, Servlets, Hibernate, Swing, JFC, AJAX, Web services, AWS, SOAP, XML, Saas, Java Beans, Stream, Apache POI, Ext JS, Angular JS, NodeJs, JQuery, JavaScript, ReactJS, Oracle, IBM RAD, WebSphere, Cassandra, Apache Maven, JUnit, XSLT. Bank of the West, CA                                                                                                                        Aug-2013 to Apr-2014                                                                                                            Role: Java Full Stack Developer Description:The Scope of this project (Legal Entity On boarding) is to obtain and check the pre requisites of the customers to avail account in Bank of the West. CRM deals with this, and risk plays a role in this process. Risks vary depending on the country rules as identity and credit track of the customer. It uses BPM (Business Process Modeling) to increase process speed or reduce cycle time to increase quality. Responsibilities: Involved in the complete Software Development Life Cycle including Requirement Analysis, Design, Implementation, Testing and Maintenance. Deliver new and complex high quality solutions to clients in response to varying business requirements Designing the front end using JSP, JQuery, CSS and Html as per the requirements that are provided.  Extensively used JQuery selectors, events, Traversal and JQuery AJAX with JSON Objects JQuery library has been used for creation of powerful dynamic Web Pages and web applications by using its advanced and cross browser functionality. Developed payment flow using AJAX partial page refresh, validation and dynamic drop down list. Utilize in-depth knowledge of functional and Technical experience in Java/J2EE and other leading-edge products and technology in conjunction with industry and business skills to deliver solutions to customer Designed application modules, base classes and utility classes using core java. Developed enterprise reference architecture, SOA & Cloud strategy in a SaaS driven enterprise business model. Used Spring validation and wrote validation rules. Primarily focused on the spring components such as Dispatcher Servlets, Controllers, Model and View Objects. Implemented the application following the J2EE best practices and patterns like Singleton, Factory, Session Façade, MVC and DAO. Developed Business components using Java Objects and used Hibernate framework to map the Java classes to the database. Implemented Singleton, Service Locator design patterns in MVC framework and developed command, delegate, model action script classes to interact with the backend. Designed and developed components for order entry usi-ng EJB with a Java Swing client application. Implemented Model View Controller (MVC) Architecture and coded Java Beans (as the model), Java Swing. Taken care of complete Java multi-threading part in back end components. Designed and implemented customized exception handling to handle the exceptions in the application. Involved in developing code for obtaining bean references in spring framework using Dependency Injection (DI) or Inversion of Control (IOC) using annotations. Used Hibernate, object/relational-mapping (ORM) solution, technique of mapping data representation from MVC model to Oracle Relational data model with a SQL-based schema. Developed Hibernate DAO classes and with the spring frame work manager classes retrieve and save the data from the database. Implemented Spring ORM with Hibernate taking advantage of Java features like annotation metadata, auto wiring, and generic collections using plain EJB3’s JPA specification that is used to implement the DAO layer with Hibernate Entity Manager’s Session Factory, HQL, and SQL. Used Spring IOC framework to integrate with Hibernate. Experience in SOA and developing Web services using SOAP, XML, WSDL and JAXP. Built model jar files and rule flow, helped design the large numbers of rules, extracted rules data from the database and decision tables. Invoked rules from Java side. Used Drools Decision Table using excels sheets with a Spring MVC project.  Implemented log4j for logging purposes and debug the application. Involved in developing Unix scripts for a higher level of Automation for the Data loading process of the research database. Designed and developed the application presentation layer using JSTL. Responsible for the technical direction and implementation of the Spring Batch framework. Created POC for Spring Batch for running batch jobs. Documented how Spring Batch is useful for the current project. Prepared Junit test cases and executed the test cases using Junit in eclipse. Involved in bug fixing during the System testing, Joint System testing and User acceptance testing. Implemented Maven Script to create JAR, WAR, EAR & dependency JARS and deploy the entire project onto the WebSphere Application Server Environment: Spring, Eclipse, Oracle, WebSphere Application server, JSP, JQuery, JSF Framework, JDBC, Hibernate, XML, XSLT, CSS, DOM, DHTML, REST, Event Driven Architecture, Junit, Log4j, SaaS, Oracle10g, TOAD, UNIX, Ant, Agile Scrum, JBoss Application Server, Jenkins. Client: Gapvak, India                                                                             \t\t\t\t Feb-2011 to Sep-2012 Role:   Java Developer Description: GAPVAK Technologies is a leading solution provider for Internet based applications. It possesses not only the latest technology gadgets but also the most knowledgeable and experienced hands to offer most user friendly customized solutions. GAPVAK Technologies provides high quality on site services for software development and the end users on a broad range of software platforms and latest technologies. ﻿ Experienced at creating state of art enterprise grade products, Gapvak is dedicated to delivering advanced marketing solutions for the global organizations. Responsibilities: Involved in the Requirements collection & Analysis from the business team.  Created the design documents with use case diagram, class diagrams, and sequence diagrams using Rational Rose. Implemented the MVC architecture using Apache Struts Framework. Implemented Action Classes and server-side validations for account activity, payment history and Transactions. Implemented views using Struts tags, JSTL and Expression Language. Implemented Tiles Framework for the views layout.  Implemented session beans to handle business logic for fund transfer, loan, credit card & fixed deposit modules. Worked with various java patterns such as Service Locater and Factory Pattern at the business layer for effective object behaviors. Worked on the JAVA Collections API for handling the data objects between the business layers and the front end.  Worked with JAXB, SAXP and XML Schema for exporting data into XML format and importing data from XML format to data base and JAXB in the web service's request response data marshalling as well as un marshalling process.  Implemented the web services client to consume the third-party service API for validating credit cards. Used XMLWeb Services using SOAP to transfer the amount to transfer application that is remote and global to different financial institutions. Used Java Messaging Services (JMS) for reliable and asynchronous exchange of important information such as payment status report.  Developed Unit test cases using JUnit. Developed Ant scripts and developed builds using Apache ANT. Used Log4J to capture the log that includes runtime exceptions. Used Clear Case for source code maintenance. Environment:  Struts, Tiles, JSP, JNDI, Clear Case, SOAP, WSDL, UDDI, JAXB, JAXP, Schema (XST), EJB, ANT, JavaScript, JMS, Rational Rose, WSAD, DB. Client: System & Service Limited                                          \t\t\tAug-2009 to Dec-2010 Role:  Junior Java Developer Description: This is a comprehensive and integrated Hospital Management System for a Super Specialty Hospital. This package is used to computerize the activities of a servicing system. This package contains four modules. They are Administration, Patient Care System, Health Services and Auxiliary Services. Each module is having sub modules with in this sub modules will maintain storing, registering, details of joining patient details, and over all day activities maintains one particular database Responsibilities: Designed the application using the J2EE design patterns such as Session Façade, Business Delegate, Service Locator, Value Object and Singleton.  Developed presentation tier as HTML, JSPs using Struts Framework. Used AJAX for faster page rendering. Developed the middle tier using EJBs Stateless Session Bean, Java Servlets.  Entity Beans used for accessing data from the Oracle database.  Worked on Hibernate for data persistence. Prepared high and low-level design documents for the business modules for future references and updates.  Deployed the application in JBoss Application Server in development and production environment.  Implemented CVS as Version control system. Code Walkthrough/ Test cases and Test Plans. Used ANT as build tool. Used Junit for writing Unit tests. Environment:HTML, Java Script, CoreJava, JUnit, JSP, Servlets, JDBC, Oracle , AJAX, CVS and JBoss Application Server."}