{"text": "Name: agnes agnes E-Mail: agnes.agnes@gmail.com Address: Dhaka, Bangladesh Github: https://github.com/agnes LinkedIn: https://linkedin.com/agnes Phone No. 566062025048 ____________________________________________________________________________________ SUMMARY: Over 8 years of extensive experience as a Front-End UI Developer with solid understanding of database designing, development, JavaScript Libraries and installation of different modules.  Specialized in development and implementation of Application, mobile and Web based Technology Solutions using J2EE Architecture Frameworks.  Solid experience working with plain/vanilla JavaScript on both browser and Node.JS. Experience building dashboards and websites in Responsive Design  Experience in building web applications using jQuery, JSON, AJAX, Augular.JS, Angular 2, Node.js, Backbone.JS, Bootstrap and React.JS.  Expert in HTML5/CSS3 development and have experience in Backbone.js, Require.js, Node.js, Angular.js, Knockout.js, Express.js,Underscore.js, React.js, Ember.js, Pdf.js, Spine.js, Ext.JS, Responsive design. Experience using React.JS, Node.js, Flux, Common JS, Babel+ES6, Web-Pack for SPA development.  Developed User Interface utilizing HTML5, CSS3, Angular.js, Node.js with JavaScript and Kendo MVVM framework for view models while integrating jQuery, AJAX and JSON to call Web API methods.  Experience applying the latest development approaches including MVC in the browser, event-driven applications using AJAX, Object Oriented (OO) JavaScript, JSON, JSONP, and XML, Node.js, Angular.js.  Experience in working with frameworks like Struts, spring, JSF and implementing various J2EE design patterns such as Singleton, Session Façade Pattern, Data Access Object and Factory design patterns. Experience working with RESTful Web Services and implementing RESTful API's.  Experience of working on CSS Preprocessors like LESS and SASS along with JavaScript task runners like Grunt.  Experience Developing Redux, NGRX, Grid Stack. Extensive experience in developing web pages quickly and effectively using jQuery and in making web pages with cross browser compatible.  Used Angular modules like Angular-animate, Angular-Cookies, Angular-Filter, Angular-Mocks, Angular - Resource, Angular- Route, Angular-Sanitize, Angular-Touch and Angular-Ui-Bootstrap.  Extensively used Node.js tools like Gulp, Grunt, Web pack; Developed internal CLI applications using Commander Module for application build. Familiarity with Play.2X framework. Deep understanding in implementing the business rules in different layers like UI, services and backend database.  Implemented generating the verification hash code using crypto package on Node.JS and added user validations and user permissions by using the Node.js. Implemented load-balancing with NGINX to allow dozens of Node.JS instances to handle thousands of concurrent users. Used Bootstrap and AngularJS, React.js and Node.js in effective web design. Experience working on scalable environment using Agile/SCRUM, Test driven development (TDD) methodologies.  Experience working with GIT repository and maintaining version control using GIT.  Experience on Oracle (9i, 10g), IBM DB2, MySQL, MongoDB, PostgreSQL and usage of tools like Toad for Oracle. Experience with build tools such as ANT&MAVEN.  Experience with Performance tuning tools like JS Profiler, Fiddler and Debugging tools like ULS viewer.  Developed and prepared test cases for unit testing with Jasmine, karma.  Good experience in unit testing with Karma, Mocha, Jasmine, Protractor. Experience in all stages of testing namely Functional testing, Performance testing, Integration testing, Regression testing and User Acceptance testing.  Technical Expertise: Professional Experience: MetLife – Cary, NC\t\t\t\t\t\t\t\tJuly 2017 to Present Full Stack Developer MetLife global team helps their customers navigate life’s journey in many regions and cultures. In turn, MetLife helps their employees grow and thrive by providing training and development, emphasizing health and wellness, and promoting diversity and inclusion. Responsibilities:    Implemented various screens for the front end using React.js and used various predefined components from NPM (Node Package Manager) and redux library. Implemented React-Router, React Redux architecture, ES6, web pack and Grunt to turn application into Single Page Application. Participated in using React JS components, Forms, Events, Keys, Router, Animations and Flux concept. Expertise in client scripting language and server-side scripting languages like JavaScript, D3 Js, RDBMS, Angular js, Node.js, React.js, Go JS. Designed Frontend with in object-oriented JavaScript Framework like AngularJS, Node.js, Backbone.js, Require.js, Express.js, React.js, Underscore.js, Pdf.js, Ember.js and Ext.js. Used CSS Sprites to decrease the load time of web pages.  Involved in the Development of node modules. Good hands on experience and knowledge on Redux and ngrx store to manage the State, Subscribing and unsubscribing the state changes and dispatching the actions in Angular 2 for existing. Experience in working with REDUX architecture and REDUX for state management in maintaining the application when the state is updated. Used REDUX Thunk for maintaining the dispatch either if the state is delayed or if the condition is met. Responsible for developing front-end application using React.js and FLUX architecture for internal team's productivity use. Worked with backend engineers to optimize existing API calls to create efficiencies by deprecating unneeded API calls. Successfully handled JSON data and carried out JSON parsing for form submissions and DOM manipulation.  Maintained Cross Browser compatibility & implement Responsive Design using Twitter Bootstrap, custom media queries, etc.  Implemented the SEO Techniques to improve the search results on the web.  Involved with bug fixing on functionality, performance and designing issues with JavaScript and JQuery. Use Node and Express Framework to set up routing mechanism to respond to HTTP requests Use Node Package Manager (NPM) to manage the modules and used it to install useful tools such as Grunt, Express. Worked on integrating jQuery API's, Loopback API's with MVC pattern. Developed Address book, Order Return, Track order form components using Redux Form. Used ES6, JSX with react for component development make react look more elegant. Used Babel.js to transpile ES6 and JSX into JavaScript. Experience with props and states in react to manage data and used Rally for task tracking and to build user stories. Used Node.js to run Web pack tasks and help build the project. Have used Jenkins for build process and Continuous integration. Tested React components and application using Jasmine and Karma. Used Git for version controlling and regularly pushed the code to GitHub Environment: HTML, CSS, Bootstrap, SASS, LESS, JavaScript, jQuery, ReactJS, D3, Redux, Flux, NodeJS, Typescript, ES6, NPM, Webpack, GIT, Jasmine, Karma, Protractor Altice – Woodbury, NY\t\t\t \t\t\t \tJune 2016 – June 2017 Full Stack Developer Altice is creating the path to the world we dream of. This path is our reality brought to life through the convergence of media and content, telecom, and advertising and data. Together, as one unified global brand with one strategy and one mission, we are turning the promise of convergence into reality where continuous innovation is the only way forward. Responsibilities:  Developed an effective HTML5 User Interface using new HTML5 form elements.  Developed an Angular based front end including custom widget, controls, event handlers and effects.  Created custom filters which parses $http response to match the wireframes.  Created custom Angular directive and services.  Designed and developed web pages using with HTML5, CSS3, Ajax, Twitter Bootstrap, Angular JS, Angular bootstrap and jQuery.  Used various jQuery plugins like date picker, dialog boxes etc.  Extensively used Angular-grid and UI components.  Used popular Node.js frameworks like Express and Restify to mock a Restful API. Used AngularJS and JQuery library functions for the logical implementation part at client side for all the application.  Used Angular 2 for multiple implementations along with other web technologies. Created some reusable components using web-pack. Extensively used SASS (Syntactically Awesome Style Sheets) while styling with CSS3.  Involved in writing application level code to interact with APIs, RESTful Web Services using $http.  Redesigned and re-implemented services using NGINX, Node JS, Express JS, Mongo DB, and MySQL. Utilized various jQuery plugins to build Rich Internet Application (RIA) to make it look more intuitive.  Created proof-of-concept using responsive web design, Node.js, Angularjs, React JS, HTML5 and CSS3. Used JIRA as the bug tracking system to track and maintain the history of bugs/issues on everyday basis.  Used Node.js to run Grunt tasks and build properly the project (compile, minify, concat etc.)   Involved in parsing JSON API to JDOs and use them in frontend handlebar.js  Used JIRA for bug tracking and issue tracking.  Created Single Page Applications (SPA) using handlebars, backbone.js and node.js.  Involved in designing and developing the JSON, XML Objects with MySQL.  Extensively used HTML5 for audio and video playback. Worked on the MVP architecture for the GWT.  Used jQuery plugins autocomplete, validation, drag and drop and more exceptionally. Used jQuery template for markup. Used Ajax, JSON with jQuery for request data and response processing.  Developed programs to port the XML data to database to make the website XML driven.  Involved Finding out the bugs, broken links and missing images etc. and rectifying them.  Environment: OO JavaScript, JQuery, JSON, Ajax, HTML5, CSS3, Handlebar.js, Angular.js, Angular 2, Node.js, Backbone.js, Agile methodology, Dreamweaver, MVP, Bootstrap, Usability Testing, Karma and Jasmine, SSAS, LESS, GIT, MySQL. Silicon Valley Bank –Tempe, AZ\t\t\t\t \tFebruary 2015 – May 2016 Full Stack Developer Supporting Benefits department with various projects and tasks with emphasis in Workday release testing for benefits module. Responsibilities: Reviewing business requirements and functional designs for application. Created User Stories from the requirements in JIRA. Implemented Routing in AngularJS using $routeProvider Designed and developed around 8 screens in the application and handled all UI Validations and routing for each. Designed and developed reusable charting custom directives using D3.js (Donut chart, Pie Chart) Developed Services to share data across controllers in Angular JS. Developed Services for common utilities such as truncation feature, Data Unit Conversion etc. Used $http to make Ajax calls and consume JSON response across various services Developed user panels and confirmation pop ups as a reusable component which were implemented as custom directives. Worked with Express.js for development of RESTful web services and middleware configurations. Implemented generating the verification hash code using crypto package on Node.JS and added user validations and user permissions by using the Node.js. Evaluated converting the current implementation of the front-end to using React JS. Developed a chat portlet using Node.JS and Socket.IO Worked closely with the UX designer to incorporate CSS changes. Developed various Controllers following Angularjs framework to fulfill business requirements Used Grunt as a build tool and to validate JavaScript code with JSHint Developed left hand navigation as a custom component which was made responsive with the help of Media Queries. Used Node.js NPM (node package manager) module Grunt to run tasks and build properly the project (compile, minify etc.) Used bootstrap grid layout in the application for responsiveness and for general layout  Worked in Agile Environment, attending everyday scrums, sprint planning and sprint review meetings Transformed design mock-ups into cross-browser compatible HTML/CSS layouts Wrote AJAX calls to populate tables, tab menu and other components with JSON data in Angular.js. Extensively used Angular validations for forms and to validate user input data  Wrote AJAX calls to populate tables, tab menu and other components with JSON data.  Debugged and resolved many cross-browser issues (mainly CSS issues) Worked with the team of architect’s middle tier and back-end Developers to gather requirements and enhance the application functionality and add new features. Debugging the application using Chrome Batarang and Mozilla firebug Performed unit testing with Karma (Test Runner) and Jasmine (Testing Framework) Incorporated Videos with HTML5. Environment: Angular.js 1.2/1.3, ReactJS, HTML5, CSS3, JavaScript, AJAX, Node.js, SocketIO, Bootstrap 3, MongoDB, JSON, Karma, Grunt, D3.js, Jasmine, Windows 7. TIAA-CREF Financial Services – Hyderabad, India\t\t\tMarch 2012 – November 2014 Java UI Developer TIAA-CREF is a privately-owned investment manager. The firm also provides investment advisory services and research services to its clients. It primarily provides its services to investment companies. The firm manages separate client-focused equity and fixed income portfolios. Project was to build a Portfolio management application framework. Responsibilities:  Review the system requirements and attending requirements meetings with analysts and users.  Involved in the life cycle of the project from documentation to unit testing making development as priority.  Developed web pages using Struts framework, JSP, XML, JavaScript, sHtml/ Dhtml and CSS, configure struts application, use tag library.  Used Apache Struts framework includes the integrated AJAX.  Played major role in designing & developing JSP pages and XML reports. Developed Servlets and custom tags for JSP pages.  Developed few module Web pages using Springs IOC and Hibernate.  Designed and developed dynamic pages using HTML, CSS- layout techniques, Java script.  Took the various challenges in the enhancement and completed them on time.  Extensive Used Exception handling and Multi-threading for the optimum performance of the application.  Extensive use of multi-threading from synchronization  Involved in design (using RUP, Visio) and implemented (SOA, SOAP) next generation system on distributed platform.  Extensively used XSL as a XML parsing mechanism for showing Dynamic Web Pages in HTML format.  Implemented OWAS (Open web Application Security) mechanisms for secure bank transactions.  Implemented Searching based algorithms for searching key-terms in application  Implemented SOAP protocol to get the requests from the outside System.  Used CVS as a source control for code changes.  Used ANT scripts to build the project and JUnit to develop unit test cases.  Developed coding using SQL, PL/SQL, Queries, Joins, Views, Procedures/Functions, Triggers and Packages.  Provided development support for System Testing, Product Testing, User Acceptance Testing, Data Conversion Testing, Load Testing, and Production.  Deployed application on Web sphere application server.  Environment: Java 1.5, J2EE, AJAX, Servlets, JSP, RUP, Eclipse 3.1, Struts, Spring 2.0, Hibernate, XML, CVS, Java Script, JQuery, GWT, ANT, SOAP, Log4J, DB2, Web Sphere server, UNIX, IBM Web Sphere Portal Server, Message Broker Syntel - Hyderabad, India\t\t\t\t              September 2010 – February 2012 UI/Web Developer\t Our solutions leverage automation to run the business with greater agility and efficiency, while harnessing digital technologies to change the business to drive innovation, business agility and competitive advantage for our clients.\t\t\t\t Responsibilities: Used Microsoft Visio for designing the Use Case Diagrams, Class model, Sequence diagrams, and Activity diagrams for SDLC process of the application.  Prepared Functional and Non-Functional requirements by analyzing the business requirements for MMIS, Prisoner Match, DLEG batch processes by using Java Multi-Threading Implemented GUI pages by using JSP, JSTL, HTML, DHTML, XHTML, CSS, JavaScript, AJAX  Extensively used Java multi-threading to implement batch Jobs with JDK 1.5 features.  Implemented the online application by using Core Java, JDBC, JSP, Servlets, Web Services, SOAP, and WSDL.  Implemented the project by using Struts2 MVC framework and used hibernate to communicate with database.  Configured the project on WebSphere 7 application servers  Communicated with other Health Care info by using Web Services with the help of SOAP, WSDL.  Tested the web services with SOAP UI tool  Implemented Singleton, factory design pattern, DAO Design Patterns based on the application requirements.  Used SAX and DOM parsers to parse the raw XML documents.  Used RAD as Development IDE for web applications.  Tuning complex database queries and joining the tables to improve the performance of the application  Developed back end interfaces using embedded SQL, PL/SQL packages, stored procedures, Functions, Procedures.  Designed and developed base classes, framework classes and common re-usable components.  Used Clear Case for Version Control tool and Clear Quest for bug tracking tool  Wrote shell scripts for batch jobs  Developed test plan documents for all back-end database modules.  Deployed the project in Linux environment.   Environment: JDK 1.5, JSP, Web Sphere7, JDBC, Spring Framework, Hibernate Framework, XML, DOM, SAX, EJB 2.1, CSS, HTML, JNDI, Web Services, WSDL, SOAP, RAD, SQL, PL/SQL, JavaScript, Oracle10g, Toad, Log4j, ANT, Clear Case, Clear Quest, Windows XP, Red Hat Linux."}