{"text": "Name: elsie elsie E-Mail: elsie.elsie@gmail.com Address: Melbourne, Australia Github: https://github.com/elsie LinkedIn: https://linkedin.com/elsie Phone No. 247597960149 PROFESSIONAL SUMMARY\t 7+ years of working experience as Functional Analyst/Retail Operations Analyst in Information & Technology in Retail and E-commerce domain.  Comprehensive knowledge and experience acting as a liaison between business and technology in phases of Software Development Life Cycle (SDLC) methodologies like Agile and Waterfall.  Supported Business Partners in a matrix environment and managed the activities of third party software vendors. Experience in overseeing the design, development, and implementation of software and hardware solutions, systems, or products provided via third party solution providers. Expertise in defining and developing analysis of Business Requirement Documents, Functional Specification Documents, Test Plans and reports. Organized Joint Application Developments (JAD), Interviews, workshops and requirement elicitation sessions with end-user/clients/stake holders. Involved in Oracle EBS, Oracle VCP, Oracle ASCP, Oracle ACCPImplementation Project, including testing, production and support environment. Proficient in using UML in behavioral, structural and architectural modeling – in creating Use Case and Activity diagrams using Microsoft Visio. Experience with Office 365 & SharePoint upgrade, planning and demonstration. Experience in coordinating and conducting User Acceptance Testing and GAP analysis.   Exposure to testing methods, such as Regression, Performance, Functionality, Smoke, and Usability Testing for web and Client/Server application. Good knowledge of Functional, Regression, System Testing and Integration Testing. Responsible for writing Test Plans and Test Cases for (UAT). Experience in creating End User Training Manuals. Excellent communication, documentation and organization skills with the ability to adapt to new environment Excellent critical thinking skills, sound judgment, and an ability to influence others over whom there is no direct authority.   Hands on knowledge and experience on Training & Mentoring, Managing Diversity, Organizational Development, Leadership, Change Management, Crisis Management and Conflict Resolution. TECHNICAL SKILLS PROFESSIONAL SUMMARY DSW, Columbus, OH July 2016-April 2018 SeniorSupply Chain Business Analyst/Retail Operations Analyst As a result of increasing market growth, DSW upgraded its supply chain processes to facilitate an efficient and seamless flow of data (Order and Content Management) between its Manufacturing systems, ware house management system (WHMS) and third partySupply Chain applications. The Preexisting legacy ERP was re-appraised and re-configured to enhance its scalability with the third party Supply Chain applications (Oracle E-Business Suite). I was employed as part of the integration team responsible for project requirements elicitation process and the overall deployment of the new platforms. As a a Supply Chain Business Analyst/Operational Analyst, I worked on multiple Supply Chain projects to promote smoother and more effective IT processes for inventory management, operations management, Supply Chain Management and merchandise/assortment planning and customer relationship management. Responsibilities: As a Functional Analyst/Retail Operations Analyst I worked with Client Services to coordinate deliverables and Oracle EBS integration.  Tracked and communicated the progress of tasks throughout the process. Advised Third-Party retail teams of deadlines and task requirements. Oversaw operations to ensure all vendor and client deadlines were met. Provided analytical information for the senior Vice President of the finance and operations weekly. Actively Participated in daily scrum stand ups, sprint planning/grooming, tech reviews, story development, business meetings, sprint demos and sprint retrospectives in an agile environment. Responsible for maintaining a focus on the user requirements and what the team needed to achieve in each sprint. Assembled specific data and components that require validation for the Oracle E-Business Suite ERP Implementation Project Attended weekly meetings in order to address any new developments. Created user stories, use cases as well as acceptance criteria in supporting the implementation of functionality in every sprint, planning the iterations and releases and testing the developed functionality. Utilized corporation developed Agile SDLC methodology. Used Scrum Work Pro and Microsoft Office software to perform required job functions. Facilitated the company transition over to Oracle EBS system successfully. Used Website Wireframes for graphic presentations. Create daily reports in designed MS Excel spreadsheet with pivot tables. Used MS Excel to analyze, communicate, & examine organizational change. Participated in Daily Agile Scrum “Stand-up”, Biweekly Sprint Planning and Retrospective Sessions and update the team on status of upcoming User Stories. Conducted Analysis of business scenarios for the Integration of Oracle VCP, Oracle ASCP, Oracle APCC, and Oracle EBS. Conducted analysis of client business processes and functional or reporting requirements.  Reviewed and analyzed the effectiveness and efficiency of existing systems and develop strategies for improving or further leveraging the application under test. Prepared and delivered solutions, recommendations, or alternatives that addressed existing and potential trouble areas in retail systems across the organization. Analyze “AS IS” and “TO BE” scenarios, designed new process flows and documented the business process and various business scenarios Interact with business partners to perform the Initial Project Analysis  define new and document retail sales reporting requirements and Change Requests (CRs). Assisted QA and BA teams in creating Test cases and Test plan for the execution of UAT scenarios. Responsible for Performing Integration Testing, UAT testing. Use SQL and MS Excel using macros for all Data validation based on the Business Rules. Extensively wrote standard and complex SQL queries to perform data validation to make sure test results matched. Coordinated projects, activities and resolving issues with third party vendors to ensure that desired results are delivered as per the project schedule. Participated in meetings with Developers, Project Managers and Quality Analysts to discuss business requirements, test planning, resource utilization, and defect tracking (using HP ALM). Analyzed Business Requirements and created Use Cases, Use Case Diagrams, for applications and created Activity Diagrams using MS Visio. Coordinated with testers to write test cases for the functional requirements according to acceptance criteria. Coordinated and verified successful completion of UAT for the program and provided end user training. Nordstrom, Seattle, WA August 2014 – June 2016 Senior Functional Analyst/Retail Operations Analyst Nordstrom implemented Oracle E-Business Suite to update its Supply Chain system, that is developed for for the quantity comparison report for displaying the current in-stock levels versus the quantity sold within a specified date range, other features like customer purchases by department, inventory maintenance, global special pricing, complete invoice storage, invoices on hold, receivables and reports. Responsibilities: As a Functional Analyst/Retail Operations Analyst I provide project management support for a variety of areas such as sales incentive plans, IT, Loss Prevention and service programs Provide feedback to the Team Leader and/or General Manager on how to build organizational capacity and improve our business Indirectly manages, motivates and trains members of the team to achieve maximum performance Effectively communicates between the Area Manager for the team and direct manager ensuring all direction given is consistent Provide timely information of selling priorities to Retail Sales Managers, supervisor and shared resources (marketing, technology and administration) Provide analysis in support of driving key performance indicators to drive revenue Involved in gathering, documenting and verifying business requirements. Organized JAD Sessions to collect requirements from system users and prepared business requirement that provided appropriate scope of work for technical team to develop prototype and overall system. Meet with business users to gather requirements for various Oracle EBS projects. Create and configure SharePoint sites. Developed User Stories throughout the Agile Lifecycle as well as created various UML diagrams such as Use Case, Activity.  Created business process flow charts and work flow diagrams.  Identified end to end requirements for all systems and business units that may be impacted by the Oracle EBS Integration. Developed requirements integrating Use Case diagrams and designed the testing process flows. Established and maintained traceability matrix until business requirements were signed off. Conducted walkthrough and lead work sessions. Use Agile systems and strategies to provide quick and feasible solutions, based on Agile system, to the organization. Work in Agile, scrum, and sprint environment in order to change the requirements and features set. Work closely SCRUM team to create test scripts and test cases to ensure coverage of all areas of the product/feature(s) Test system changes/enhancements related to assigned business processes to ensure changes satisfy business requirements with no negative impact. Assist in development of end user documentation including help document instructions and release notes forOracle VCP, Oracle ASCP, Oracle APCC, and Oracle EBS. Write test cases from the requirements; validate/exercise those test cases in form of integration and regression tests. Used wireframes to visually support the business rules and interaction requirements for a screen transform. Business requirements into functional specifications focus on user interface design (UX), created mockup screens. Conduct Business, Functional, User Acceptance Testing (UAT) and Usability testing. Using MS-Visio analyzed business requirements and process through Use Cases, Class, Sequence, and Activity diagrams, and adapted UML standards to define modularized Data Process Models. Ensured Use-Cases were consistent and covered all aspects of the Requirements document. Developed a Business Acceptance testing strategy and plan. Created test files and analyzed test results using MS-Excel. Documented and tracked all product defects with use of SQL (reporting).  Authored and reviewed user acceptance test plans (UAT), interim and final test reports.  Collaborated closely with IT developers and quality assurance staff to ensure that requirements are clearly defined and understood, and supported by solution outputs. Writing Complex SQL queries and optimizing SQL Queries Worked with Defects management using Team Foundation Server (TFS) and involved in Defect Triage and prioritization.  Nike, Beaverton, OR June 2012 – May 2014 Functional Analyst/Retail Operations Analyst The scope of this project was to deliver the core components for the consolidated ecommerce and retail POS platform. The overarching requirement for the consolidated ecommerce platform solution was to provide flexibility driven by the business community, with the ability for the proposed solution to be maintained by the business users and not require significant IT intervention.  This included migrating nikestore.com, jordan.com, and other Nike owned sites onto a single ecommerce platform.  Responsibilities As a Retail Operations Analyst I developed and document training material for cross training within the team Documentation of timekeeping processes to assist with training / process reviews for employees, management and executives within the Retail teams Compiling and prepared financial performance reports and communicating results to business owners Organized JAD Sessions to collect requirements from system users and prepared business requirement that provided appropriate scope of work for technical team to develop prototype and overall system. Involved in developing database objects in both SQL Server and Sybase environments. Develop, design & implement department plan to operationalize data analytics integrated processing system, to include but not limited to, workflow, and management oversight and performance analysis. Worked in Agile Testing and participated meetings every day in iterative environment Created and maintained detailed test cases to perform various types of testing. Using Agile methodology and engage in an iterative workflow and incremental delivery of working. Worked closely with stakeholders and SME’s for requirements gathering. Identified end to end requirements for all systems and business units that may be impacted by the project. Actively Participated in daily scrum stand ups, sprint planning/grooming, tech reviews, story development, business meetings, sprint demos and sprint retrospectives in an Agile environment. Performed Integration Testing, System Testing, Regression Testing, User Acceptance Testing (UAT), Performance and Back End testing of an application. Interacted with business users and stake holders and performed UAT. Developed requirements integrating E-R diagrams and designed the testing process flows. Develop Process modeling, entity diagrams, data modeling, data mapping and business process flow diagram. Provide clear and concise documentation regarding requirements management plans, Functional Requirements, supplemental Requirements.  Conduct UAT to confirm that all derivative products can be successfully processed through stages of the trade life cycle.\t Design the System Flow, Data Flow diagrams, using these as the base to obtain requirements and wrote Use Cases. Prepare Business Context Diagram, Use Case diagrams and corresponding Activity Diagrams using Rational Rose to depict the workflows to be incorporated into the development of the Business Process Management (BPM) tool. Established and maintained traceability matrix until business requirements were signed off. Conducted walkthrough and lead work sessions. Worked on Data mapping, logical data modeling used SQL queries to filter data within the Oracle database tables. Created test files and analyzed test results using MS-Excel. Used Quality Center for Defect Management. Involved in project status meetings, QA review meeting, and System Test meeting. Coordinated and facilitated the execution of User Acceptance testing. Home Depot, Atlanta, GA\t\t\t February 2011– May 2012 Functional Analyst/Retail Operations Analyst The purpose of this project was to automate the web based POS ordering process. It allowed RETAILstores to enter orders even when the communication line was down, and track order history, as well as control and research invoice discrepancies between store and corporate Accounts Payable department. This project enabled customers an automated, self-service Gift Registry available in stores via a kiosk and online at homedepot.com. This project encompassed necessary deliverables to fully integrate a custom built Gift Registry application with company’s systems and develop reporting on performance metrics. The gift registry was designed to support stores with vastly different technical capabilities. Responsibilities: As a Functional Analyst/Retail Operations Analyst I developed of Key Performance Indicators based on the business situation Provide support and recommendations for improvements to tools and information used within retail analytics Establish a close working relationship with the client, collect essential information and ensure that methodologies and processes are shared and understood Extracted the Business Requirements from the Business Users and documented it for the developers conducting JAD sessions and Interviews. Interacted with client and the Technical Team for requirement gathering and translation of Business Requirement to Technical specifications. Conducted Web Meetings with Off-Shore team members to ensure that everybody is on the same page. Worked on Warehouse Management (WMS) and Order Management System (OMS). Collected weekly status reports to ensure that all deliverables are met on time and on schedule. Created Use Cases from the list of requirements and prepared use case diagrams Involved in integration testing with added features like color and size. Wrote detailed requirements for enhancement of certain features on  E-Commerce Application Implemented SDLC for the development life cycle and followed the standard process in the application development through agile methodology.   Attended in daily standup status meeting for outlining goals for the day and discussion of current or potential blockers, enhancement and modification.  Created project plans, detailing projects Scope, process flow, timelines, and requirement documents and analyze risks. Used Rally for requirement management. Used wireframes to visually support the business rules and interaction requirements for a screen transform. Developed the business and functional requirements specification describing and prioritizing of the requirements in detail. Developed test plans and test cases from functional requirements for System and UAT testing. Participated with QA team to conduct major functionality testing of the different module such as enrollment, report etc. manually. Designed and implemented SQL queries for reports and data validation. Analyzed “AS IS” and “TO BE” scenarios, designed new process flows and documented the business process and various business scenarios. Wrote use cases and relevant UML diagrams such as Use Cases, Activity and Sequence diagrams.  Assisted testing teams in defect management using HP Quality Center. Participated in meetings with other developers and testers on a regular basis to overcome the communication gap. Created SQL scripts to extract the data from the operational database into simple flat text files. Performed regression tests on each module and collectively to check for functionality. EDUCATION Master’sdegree"}