{"text": "Name: lillian lillian E-Mail: lillian.lillian@gmail.com Address: Shenyang, China Github: https://github.com/lillian LinkedIn: https://linkedin.com/lillian Phone No. 408500385711 SUMMary: Over 5years of IT experience as IAM administrator with good working experience on various access management technologies like CA siteminder/Oracle Directory server/Sun one Directory server. Ability to install and configure the siteminder and oracle directory server in all kind of environments. Proficient in onboarding the applications and implement the SSO to meet the business requirements. End to end installation of Siteminder 6, 12, 12.5 on Solaris/Linux/Windows platforms and installing/configuring web agent on across different web servers and Configuring Cross Domain Single sign on (CDSSO) between the applications which are integrated with Policy server in a Clustered environment Deployed Siteminder Web Agents, Web agent Option Pack on various Web Servers like Apache2.x, IIS6.0, IIS7.X and troubleshooting the issues encounter during the registration. Having very good understanding on CA Identity minder policy express/admin tasks/admin roles and related CA IDM components. Very good understanding on network and OS concepts Good understanding on Configuration of CA Siteminder as Identity Provider and Service Provider with HTTP-POSTProfiles and Configuring SAML Federation with CA Siteminder to CA SAML Federation with Partnership and Legacy Federation Involved in the installation and configuration of Siteminder in Linux platforms. Involved in performance tuning activities in LDAP. Experience in installing and configuring ADAM as policy stores to Siteminder and experience in establishing replication between the ADAM instances Managing user entries by adding, modifying and deleting user records using the LDAP commands. Excellent trouble shooting skills on Single Sign-on troubleshooting administration, LDAP configuration/administration and problem resolutions. Adding attributes, the IDM, User store and IDM console as for the new requirement. Worked on Siteminder Authentication Schemes like HTML Forms. Strong Working knowledge in UNIX (Sun Solaris, Linux), Windows 2003/2008 platforms. Strong knowledge on installing and configuring the Webagent on IIS and apache. Highly talented with fast learning skills to work with New Systems, Technologies. Ability to multi task, work in a demanding global team environment, responsive to customer needs, work under tight deadlines, work independently and willingness to take ownership of issues. Education: Bachelor in Computer Science, JNTU, India, 2011 . Technical skills: Professional Experience  Client: Texas Instruments, Dallas, Texas\t\t                                                                 Nov 2013 – Present  Role:  Siteminder Administrator Responsibilities: Configured the siteminder administration console for application on boarding and implemented the single sign on. Installed the web agents on client application machines. Assisted on installing the webservers on windows and Linux platforms. Configured the cross domain single sign on in between the multiple domains. Configuring web agent on multiple Apache, OHS, HIS and configure Apache as proxy to Java application servers Creating groups and roles in the Directory server and managing them by adding/deleting the users from them Apply the password policy to Users/Groups/Roles Configured authentication schemes with custom templates. Involved in deployments to the various environments. Added required attributes in the object class according to the client’s requirement. Configured the System and domains objects as per the client requirements. Troubleshooting the application issues and single sign on issues. Configured the Oracle Directory server. Created the custom schema by adding the attributes and object classes. Managing the user entries in organization in the LDAP. Installation, Configuration and Administration of Siteminder with Active Directory as user store. Administrating the CA IDM and proactive monitoring of the CA IDM components Adding attributes, the IDM, User store and IDM console as for the new requirement. Scheduling the explore-correlate in CA IDM Modified the password policies as per the security requirements. Configured the replication in between the multi master. Configuring the SSO using the Ping Federate. Working with SAML 2.0 and OAuth 2.0 with open ID Connect for the federation Configuring the ACIs for the application service accounts to provide read/modify permissions on the particular node in sun one directory server Configuring the CDSSO between the applications and configure web agents across different web servers. Created and modified the directory server static/dynamic/nested groups. Created and managed the managed/filtered/nested roles. Designed the standard operational procedures that help for the future reference. Environment: Oracle Directory server 11g, CA Siteminder r12.5, IIS, PingFederate, Apache. Client: Genpact, Hyderabad, India\t                                                                           June 2011 –  Aug 2013 Role: Siteminder Administrator  Responsibilities: Provided the L1 and L2 support to the Access management applications. Managed the directory server user entries. Managed the directory server schema/ACI/Groups/Roles. Installed and configured the Apache and IIS web servers. Installed and configured the web agents for application on boarding. Troubleshoot the various web agent and siteminder issues. Worked on various user related issues with directory servers. Provided support to the internal PKI certificate management. Meeting the SLA’s for the categories of incidents Troubleshooting the issues related to Directory server Analyze Siteminder and LDAP logs for performance optimization. Troubleshooting replication issues and customer related issues in LDAP. Manages Windows network (users, computers, etc) with Active Directory   Monitor LDAP, provisioning server, management console IDM (Jboss) and AD on regular intervals to debug any issues Working on Identity Access Management and Ping Federation application development. Configuring the ACIs for the application service accounts to provide read/modify permissions on the particular node in sun one directory server Configuring Referrals to the Consumer instances to redirect the modify requests to the master instances Exporting, importing LDAP data and managing the user entries in Directory server Issued the PKI certificates for applications after request validation. Updating the SSL certificates as and when the Certificates get expire Renewal the SSL certificates in Directory server. Configured OHS as reverse proxy to WebLogic Worked in 24/7 admin support as a team member. Environment: Sun one Directory server 5.2, CA Siteminder 6.0, PingFederate, PKI, Apache, IIS."}