{"text": "Name: julia julia E-Mail: julia.julia@gmail.com Address: Changchun, China Github: https://github.com/julia LinkedIn: https://linkedin.com/julia Phone No. 421729587357 Abhay.despande@gmail.com Professional Summary Very good IT experience in Analysis, Design, and Development of iPhone/iPad applications with Xcode.Good experience in mobile application development, testing iPhone/iPad applications and have extensive knowledge of requirements gathering and documentation. Skilled at progressing from problem statement to well-documented designs. Developing applications oniOS (iPhone/iPad) platform (Cocoa touch framework) with maximum efficiency and low bug rate. Has worked on various b2c (business to development model) development Platforms. Proficient in object oriented programming in Objective-C & iOS SDK 4.0 and above versions. Good knowledge onApple push notifications. Goodknowledgeon Static Libraries and Framework development. Good knowledge on design patterns like MVC, Singleton, KVO & KVC, Observer, Target-Actionand Facade. Good Knowledge on Developing App for Supporting Offline Mode functionality using Core Data. Excellent experience in integrating services like Json, Xml, and third-party IOS frameworks. Good knowledge on App Distribution(Ad-hoc, Drop box and Appaloosa-Store) and Deployment/Updates to App Store, andApp Store Guide lines. Have Knowledge of file sharing sites like Github, Drop box. iOS App Analytics: Worked extensively on flurry analytics. Experience of SDLC(Agile, RUP, Iterative, SCRUM) including SRS, Design & Analysis,Development, Implementation, Build, Deployment, Version Controlling, Testing & Post implementation and UAT issues support, migration   and conversion of existed project. Worked on Manual Memory Management, ARC Memory Management, Testing Memory Leak using instrument Tool. Experienced in Mobile Application Development, Testing and Deployment. Problem solving oriented, able to co-ordinate the analysis and production of a development team with good interpersonal and negotiation skills. Experience in requirement analysis, Object-Oriented Analysis and Design, Project Planning, Architecture and Management. Posses’ expertise in Object-Oriented Analysis/Design. Experience with source control tools like SVN, GitHub. Passionate, self-motivated, dedicated and very good team player with excellent communication skills including mentoring and presentation skills. An excellent team player with good organization, communication and presentation skills. Ability to adapt new changing technologies faster. EDUCATION B.E (E.C.E) from BLDEA's college of engineering & technology India Technical Skills Professional Experience Adeptpros, Scottsdale, AZ\t\t\tMay 2015- Present Project: Wellington2Go iOS Team Lead Enterprise development Description: iPad Client Application and related ER Web Service used to provide iPad Users online/offline access to ER Content. Services are exposed over the Internet and users are authenticated based on NT Login and Serial Number of Device (2 Factors). Responsibilities: Involved on Integrating Web services and base64encoding algorithms in to an iOS app.  Worked on gcd, blocks, NSURLSession. Implemented Parsing for JSON using NSJSONSerialization, SBJSON Lib. Integrated with AFNetworking Lib. Involved in Implementing custom UI for Whole app. Involved in compatibility testing for iPhone (4,4s and 5), iPod touch, and iPad. Expert in using Instruments, and fixing memory leaks, crashes, zombies, memory optimizations. Worked on Manual Memory Management, ARC Memory Management, Testing Memory Leak using instrument Tool. Adeptpros, Scottsdale, AZ\t\t\tJan 2014-May 2015 Project: Riverside Early Assessments of Learning (REAL) iOS Team Lead https://itunes.apple.com/in/app/riverside-early-assessments/id694164993?mt=8 Description: REAL provides you with a comprehensive set of assessments across early childhood programs you need to efficiently and quickly assess the overall development and academic achievement of children from birth to eight years old. The assessment incorporates robust reporting features that enable educators and administrators to measure a child’s progress across programs and multiple years to provide a sound longitudinal view of development in one common online platform Essential early childhood domains covered by the three forms include, \n• Social and Emotional Development \n• Physical Development and Health \n• Adaptive Functioning \n• Motor Skills \n• Cognition \n• Approaches to Learning  \n• Academics \n• Communication, Language and Literacy \n\nThe REAL mobile application is a solution for early childhood professionals who may not always have a computer nearby to manage assessment tasks. Use the application to register children, capture images to support conclusions documented on record forms, and synch data to the REAL web site at real.rpclearning.com. Responsibilities: Involved on Integrating Web services and base64encoding algorithms in to an iOS app.  Worked on gcd, blocks, NSURLSession. Implemented Parsing for JSON using NSJSONSerialization, SBJSON Lib. Integrated with AFNetworking Lib. Involved in Implementing custom UI for Whole app. Involved in compatibility testing for iPhone (4,4s and 5), iPod touch, and iPad. Expert in using Instruments, and fixing memory leaks, crashes, zombies, memory optimizations. Worked on Manual Memory Management, ARC Memory Management, Testing Memory Leak using instrument Tool. Worked on BASE 64 encoding,MD5 Encryption Algorithm. Designed & Programmed backend Database model [Core Data], to support Offline\tfunctionality Worked on NSURLConnection, JSON Parser and other classes for interacting with server. Involved in customizing the UI. Involved in Integrating Social media frameworks. Worked on flurry analytics. Involved in compatibility testing for iPhone (4,4s), iPod touch and iPad. Environment: Xcode 6.0, Objective-C, JSON. Adeptpros ,Scottsdale, AZ\t\t\t\t\t\tSept’13–Dec’2013 Project: Beacon Stream SDK V-1.0 ( Lite and Advanced ) [Static Library] iOS Team Lead http://io.beaconstream.com Description: \t BeaconStream SDK is built as a Static Library to be integrated in any applications that’s follows iBeaon Technology to receive offers and promotions. SDK also includes the functionality of Social Sharing options like Facebook, Twitter, Google +, Pinterest, WhatsApp and Mail. Responsibilities: This app has built with b2c (business to development model) Software requirement analysis, designing of Library. Documentation on release notes. Module designing and testing. Developing user stories and functionality enhancements documentation and release notes. Manage build deliverables. Manage build Environments to support different platforms. Develop and test and release on a Sprint basis. Responsible for server based localization. Environment: Xcode 6.0, Objective-C, JSON. Project: BeaconStream iOS Team Lead https://itunes.apple.com/in/app/beaconstream/id884930345?mt=8 Description: \tBeaconStream is Proximity based Mobile Marketing Application for businesses and consumers using Apple’s latest iBeacon Technology. It enables users to send and receive notifications, data, coupons, promotions and videos using low-cost Bluetooth Low Energy (BLE) transmitters to your mobile phones. BeaconStream App enables an iOS device or other BLE devices to send timely notiﬁcations to other iOS devices in close proximity (up to 70 feet). Application uses BeaconStream SDK to support Ranging,Monitoring of Beacons and Sharing in Social Media. Responsibilities: This app has built with b2c (business to development model) Software requirement analysis, designing of Application. Conduct meetings to discuss best practices and streamlining of code. Documentation on release notes. Module designing and testing. Worked on BASE 64 encoding, MD5 Encryption Algorithm Developing user stories and functionality enhancements documentation and release notes. Manage build deliverables. Manage build Environments to support different platforms. Develop and test and release on a Sprint basis. Responsible for Developing the Database design, entity relationships in CoreData. Responsible for Server based Localization. Responsible for Code Quality and QA releases. Responsible for designing/developing and delivering an application for the launch of the Apple iTunes App Store. Environment: Xcode 6.0, Objective-C, JSON. Adeptpros ,Scottsdale, AZ\t\t\t\t\t\tJune’13–Sep’1333 Project: GeniusMenu iOS Team Lead https://itunes.apple.com/in/app/geniusmenu-restaurant-menu/id593044008?mt=8 Description: \t GeniusMenu - is a FREE, Interactive Digital Menu App specifically designed for Restaurants, Hotels, Casinos and Cruise Lines. GeniusMenu includes unique features such as beautiful menu's, rich visual content, Social Integration and easy to use menu management system Responsibilities: Software requirement analysis, designing of Application. Worked on Integrating Facebook, twitter, Gmail, LinkedIN API for fetching the user contacts. Implemented Parsing for JSON, Excel-Sheet (In XlS format). Involved in Implementing custom UI for Whole app. Implemented functionalities like Call, Text, Email  using OpenURL schemas. Involved in compatibility testing for iPhone (4,4s,5), iPod touch, and iPad. Environment: Xcode 6.0, Objective-C, JSON. Adeptpros ,Scottsdale, AZ\t\t\t\t\t\tSep '12 – Jun'13 Project: SocialSyzzle Sr. iOS Developer https://itunes.apple.com/in/app/socialsyzzle/id633455417?mt=8 Description: Social Syzzle App is Related to the Bar's Promotions and Events for the user's who checked in to \tthe particular bar by specifying their credentials. Once the user checks into a particular bar , they will be getting matches related to Male and Female who ever checked into that bar. Users can \tupload photos, check the bars of a particular location and they will be getting notifications through push notifications whenever there is some special promotions or events in a particular bar.This App will be useful for people who are interested in special events, concerts and promotions going in various bars along with Social Networking with real time chat. Responsibilities: Worked on NSURLConnection, NSThreads and other classes for interacting with server (Web-service will be in PHP). Implemented GPS functionality Using Core-location framework, Automatic checkOut when user is not present in the particular club(out of rang check out). Implemented Push notifications to get the current Events. Implemented chat functionality, using QuickbloxchatAPI . Implemented and customized the Carousel view to display all Events from the Club. Involved in Implementing custom UI for Whole app. Worked on UIImagePickerController to get the images from iPhone Photo Library. Involved in compatibility testing with iPhone (4,4s), iPod touch. Environment: Xcode 5.0, Objective-C, JSON. TLI Software\t,Bangalore\t\tJun' 11 – Aug'12 Project: HardLineChat Software Engineer http://itunes.apple.com/ca/app/hardline-chat/id483152448?mt=8 Description: HARDLINE makes it simple to find guys, browse profiles, chat, and share pics and videos and is \tthe only all-male app enhanced with voice messaging letting you record and listen to voice greetings and send voice clips taking your interaction to the next level. Role & Responsibilities: Worked on Integrating Facebook, twitter, Gmail, LinkedIn API for fetching the user contacts. Implemented Parsing for JSON, Excel-Sheet (In XlS format). Implemented custom calendar UI (day, month, Week) and also implemented Event triggering Using Event Kit Framework. Involved in Implementing custom UI for Whole app. Implemented functionalities like Call, Text, Email  using OpenURL schemas. Involved in compatibility testing for iPhone (4,4s,5), iPod touch, and iPad.  Environment:\tXcode (updates on Xcode), Objective-C, JSON. TLI Software\t,Bangalore\t\t\tJun’ 11 –Aug’12 Project: SpeakUp Software Engineer http://itunes.apple.com/ca/app/speak-up!/id406590336?mt=8 Description: Speak Up! is a party host’s ultimate tool. it will remind a friend who’s been drinking that they shouldn’t be driving, but don’t know how to broach the subject? Send them a reminder with the “Speak Up” tool. It’ll break the ice without breaking the mood and show you care about your \tfriend \tgetting home safely. Want to offer more delicious non-alcoholic options besides pop, water and coffee to guests at your next party? You can, with a variety of easy-to-make, non- alcoholic drink recipes called Mocktails. Role & Responsibilities: Implemented multi language support (Server based localization). Implemented Push notifications. Worked on Facebook, Twitter API integration. Responsible for customizing the UI. Worked on compatibility testing for iPhone (4,4s,5), iPod touch. Environment:\tXcode (updates on Xcode), Objective-C,JSON. TLI Software\t,Bangalore\t\t\t                                                                            Jun’ 11 –Aug’12                                                                     Project: Yellow Cab Magazine Software Engineer http://itunes.apple.com/ca/app/yellowcab-magazine-free/id465884391?mt=8 Description: Yellow Cab Magazine is Fort Lauderdale's To-Do Magazine. It's pocket sized format makes it easy to take with you where ever you go. Role & Responsibilities: Implemented parsing xml file Using NSXMLParser. Implemented Custom UI for magazine feature. Responsible for customizing the UI. Worked on compatibility testing for iPhone (4,4s,5), iPod touch,iPad (Universal app). Environment:\tXcode 4.x, Objective-C, JSON. TLI Software\t,Bangalore\t\t\t                                                                            Jun’ 11 –Aug’12                                                                     Project: Toca Software Engineer Description: This is the iPad app for TOCA Wines where the user has a rich experience of going through a exhaustive wine menu on the iPad with selections like wine by country, wine by grapes, wine by price etc.The app is also dynamically linked to a CMS through which the contents can be modified as per the restaurants preference. Role & Responsibilities: Analyzing and understanding the Business Requirements. Implemented parsing the multiple xml file Using NSXMLParser. Worked on sorting the data w.r.t tags like grape, country, color of wine. Responsible for customizing the UI. Worked on compatibility testing for iPad. Language and Tools used – Objective-C, XML, XCODE 4.5 and later. Environment:\tXcode 4.x, Objective-C, JSON. TLI Software\t,Bangalore\t\t\t                                                                            Jun’ 11 –Aug’12                                                                     Project: The Rosacea App Software Engineer Description: The Rosacea App (iPad App) is a comprehensive resource for people with mild to moderate\trosacea,providing instant access to news articles, facts, information on treatment options, coupons for instant savings and tools for tracking and managing your mild to moderate rosacea. Role & Responsibilities: Analyzing and understanding the Business Requirements. Worked on NSURLConnection, NSThreads and other classes for interacting with server. Implemented GPS functionality using Core-location framework, and google weather api to get the current weather information from different location. Implemented Push notifications. Involved in customizing the UI. Involved in implementing multithreading, post Notifications. Implemented the UITableView Expandable sections. Worked on core Image framework, for image processing. Involved in compatibility testing for iPhone (4,4s), iPod touch. Language and Tools used – Objective-C,JSON,XCODE 4.5 and later. Environment:\tXcode 4.x, Objective-C, JSON. MindTreeLtd\t,Bangalore\tFeb'11 - June'11 Project: AMEX App Sr. Software Engineer Description: Access your account and membership benefits for Personal, Small Business or Corporate Cards virtually anywhere you are with the Amex Mobile app. Role & Responsibilities: Worked on NSURLConnection, NSXMLParser and other classes for interacting with server. Involved in customizing the UI. Involved in Integrating Social media frameworks. Worked on flurry analytics. Involved in compatibility testing for iPhone (4,4s), iPod touch,iPad. Language and Tools used – Objective-C,XCODE 3.1 and later. Bridge TreeResearch, BangaloreApr'10 - Feb'11 Project:AskShagg Junior Web Mobile developer http://itunes.apple.com/us/app/askshagg/id419269870?mt=8 Role & Responsibilities: Worked on NSURLConnection, NSXMLParser and other classes for interacting with server. Involved in customizing the UI. Involved in Integrating Social media frameworks. Worked on flurry analytics. Involved in compatibility testing for iPhone (4,4s), iPod touch,iPad. Language and Tools used – Objective-C,XCODE 3.1 and later. BridgeTreeReaserch, Bangalore                                                                                                Apr '10 - Feb '11 Project:Pickles1 Junior Wen Mobile developer http://itunes.apple.com/us/app/askshagg/id419269870?mt=8 Role & Responsibilities: Worked on NSURLConnection, NSXMLParser and other classes for interacting with server. Involved in customizing the UI. Involved in Integrating Social media frameworks. Worked on flurry analytics. Involved in compatibility testing for iPhone (4,4s), iPod touch,iPad. Language and Tools used – Objective-C,XCODE 3.1 and later. GeniusPort, Bangalore   \tOct’09- March’10  Project :  RCB T20 Cricket App : Junior Software Engineer   http://itunes.apple.com/us/app/rcb-t20-cricket/id362009447?mt=8 Responsibility : Worked on NSURLConnection,NSOperationQueue, NSXMLParser and other classes for interacting with server and \tdownloaded the data in multiple threads. Involved in customizing the UI to display comic strips in different formats. Involved in customizing UITableview. Involved in compatibility testing for iPhone (4,4s), iPod touch,iPad. Language and Tools used – Objective-C,XCODE 3.2 and later. Project:iMeditation App:    Junior Software Engineer \thttp://itunes.apple.com/us/app/imeditation/id354655180?mt=8 Responsibility : Worked on NSURLConnection,NSOperationQueue, NSXMLParser and other classes for interacting with server and \tdownloaded the data in multiple threads. Involved in customizing the UI to display comic strips in different formats. Involved in customizing UITableview. Involved in compatibility testing for iPhone (4,4s), iPod touch,iPad. Language and Tools used – Objective-C,XCODE 3.2 and later. Project Description:An application which helps to balance our materialistic lives with spiritual practices that are practical and effective. This is a comprehensive system of practice and theory that offers an integrated way of life to get in touch with You and the world around you. The in-built ease and safety of practices enables one to make it a lifestyle.This system weaves through self, society and nature to offer a healthy, harmonious and productive way of living. Project:  T20 App:    Junior Software Engineer \thttp://itunes.apple.com/us/app/t20/id370835762?mt=8 Responsibility : Worked on NSURLConnection,NSOperationQueue, NSXMLParser and other classes for interacting with server and \tdownloaded the data in multiple threads. Involved in customizing the UI to display comic strips in different formats. Involved in customizing UITableview. Involved in compatibility testing for iPhone (4,4s), iPod touch,iPad. Language and Tools used – Objective-C,XCODE 3.2 and later. Project Description:ICC World Twenty20: The ICC World Twenty20 is a 20/20 cricket tournament. The tournament is scheduled to take place in West Indies during April - May 2010. It is third World Twenty20 cricket series. There are 12 teams contesting in ICC World Twenty20 2010. The teams are divided into four groups i.e., A, B, C and D.\nThis Application help user to check the following, Teams, Schedule, Live Scores, Live Updates, Cricket News etc. GeniusPort,Bangalore\tSep'08–Oct’09 Project: Margin Management System Junior Software Engineer Description: Houdini is a centralized pricing engine for all loan origination systems of all divisions. It provides an interface (API) for the pricing needs. It encapsulates all the pricing logic such as price guide rule adjustments, Arm Adjustments, Special Adjustments, Index Rates, Servicing Values, Buy Up/Down Points, Loan Program and Commitment Period Enumeration.  Furthermore, it maintains a history of all of these categories. Margin management system is a web application, which allows divisions to define their own profit margins for different loan programs at different levels such as branch, group, note rate, and state.  And also to give or expire special offers at division, branch and business partner levels. MMS also can be used to generate reports of rate sheet, pricing components, branch GPMs and exception reports. Role & Responsibilities: Analyzing and understanding the Business Requirements. Creating Web interface Using XML. Detailed designing of the C++ classes. Writing Business Logic Components using C++. Developed the interface using VC++/multithreading concepts & Designed Template classes for a variety of data storage & used linked-list container for data storage. Design of the SQL Server databases. Writing and testing stored procedures using SQL Server 2000. Environment:\tC++, VC++, Microsoft Visual Studio, XML, T-SQL, Microsoft SQL server 2000"}