{"text": "Name: anna anna E-Mail: anna.anna@gmail.com Address: Jiangmen, China Github: https://github.com/anna LinkedIn: https://linkedin.com/anna Phone No. 25201456007 Summary: Results-oriented software developer with 7+ years of experience in developing Rich User Interface applications, integrating with various Databases and Client-Server applications.  4+ years of expertise in iPhone/iPad application development using Objective-C, Cocoa Touch, Xcode. Experience with Interface Builder, Instruments, Mobility Tester and Static Analyzer including development, debugging, profiling, optimizing, and build process.  Hands on experience in Network protocols, Mac/Pc to iPhone data syncing. Strong knowledge in implementing Core Frameworks –UIKit, Core Data, MapKit, Core Location, Core Graphics. Proficient in source control with Git, SVN, Mercurial.  Used XML parser, JSON, CSV to retrieve data for display on the iPhone/iPad from server, created and customized Views, Table Views, Collection views, action sheets, segmented controls, Tab Bars and Navigation Bars.  Experience in application and web development with emphasis on HTML/ HTML5, XHTML, DHTML, XML, CSS 2/3, AJAX, DOM, JavaScript, jQuery, and JAVA technology. Expert in working with cutting edge front-end technologies/ framework and libraries like JQuery, Prototype, XHTML, DHTML, AngularJS, OO JavaScript, JSON, DOM, CSS, XML/XSLT, AJAX.   Experience in designing websites with W3C standards using HTML4/ 5, CSS2/ 3 to get best cross-browser user experience for long-term user retention and engagement.  Professional in creating Templates, Mockups and Prototypes, Web Interfaces, Layouts and Flow of Future Pages.  Working experience of project management methodologies such as SDLC, Agile andScrum.  Good understanding of Memory Management: ARC and non-ARC in iOS development. Worked on parsing with SBJson and LibXML, as well as NSXML Parser, NSJSON Serialization and Plist. Developed the applications as per specs. This included core development using various iOS frameworks and test drive development using framework.  Capable of analyzing the business requirements, software requirement specifications, functional design documents to write technical design documents and unit test plans.  Worked on MVC design architecture, cocoa design patterns and concepts like delegation, protocols and categories.  Understanding of Apple iPhone App store requirements, HIGs, iTunes Connect, iOS Provisioning Portal (Certificates, App IDs, Provisioning and Distribution) and testing on real device. Experience on NSO peration threads, GCD and blocks to perform multi-threaded development.  Worked with UI Design on Storyboard and interface builder.  Coordinated with the QA team during the process of making the code move to staging server and testing the application for the several test cases and defect testing. Excellent communication, organizational skills, attention to detail and the ability to meet tight deadlines. Technical Skills: Education: Bachelor’s in Electronics and Communication Engineering from JNTU, India   Professional Experience: Liberty Mutual, Dover, NH                                                                                                             Jul 2014 – Till Date Sr. iOS Application Developer  Responsibilities: Worked with Objective-C, Swift and Cocoa Touch Frameworks, which includes UIKit, Foundation and Interface Builder.  Created View controllers both programmatically and through storyboards. Pre-fetching data for different views for smooth screen transition. Worked extensively on table view controller and made customized table view cells according to the client. Worked on fetching data from web services and parsing data using JSON library. Worked with MapKit framework in the application to provide location services.  Worked on UI TableView Controller, UI Collection View and UI Navigation Controller for the architectural implementation of the application using Objective-C, AngularJS and Swift. Formatted the Data as per Business rule to display in UI.  Added animation between UI Views for smooth transitioning and better user experience.  Worked with Backend team to display the correct data format in devices.  Improved response time for user by implementing NSOperation Queue and created dispatch queues using GCD for background tasks. Built on swift but some reusable components which were developed with Objective-C are integrated using bridging header for future product release. Continually improved the user experience by analyzing and optimizing the UI, data storage and network communications. Implemented customized UIAlertView, UICollectionView to build the user interface of the application. Worked on memory management using ARC in swift. Involved in handling session management on client side using NSTimer. Worked with AF Networking in performing IP verification and user login. Worked on custom Activity indicator for better look of the application. Used the storyboard to design for iPhone 6 and iPad, older phones by using Auto-layout.  Followed a work data flow principle for design and development.  Worked closely within a cross functional team of testers and developers.  Worked with GDB and Xcode for debugging.  Worked with GIT to checkout and update the codebase changes.  Environment: iOS 7.1/8.0/9.0, Mac OSX, Objective C, Swift, iPhone, iPad, Xcode 6.0/7.0, Cocoa Touch, JSON, Agile Methodology, GCD. Novartis pharmaceutical, Parsippany, NJ                                                                               Feb 2013 – Jun 2014 iOS Application Developer Responsibilities: Worked extensively on UI Table view controller and made customized table view cells according to the client.  Implemented UI Navigation and UI Tab Bar controllers for easy navigation throughout the app. Worked extensively with objective C and Cocoa Touch frameworks including Core data, foundation, and UIKit. Implemented array of UI Tap Gesture Recognizers to allow users to zoom in for more detail. Implemented UI TabBar Controller and UI Navigation Controller for easy navigation in the app. Created View controllers both programmatically and through storyboards. Worked with Objective-C, and Cocoa Touch Frameworks which includes UIKit, Foundation, UI Image View.  Involved inAGILE practices, attending daily agile (SCRUM) meetings and SPRINT retrospective meetings. Worked with an Agile, Scrum methodology to ensure delivery of high quality work with every iteration. Worked with the backend team to communicate with Restful web services. Parsed JSON objects obtained from the server side and displayed the contents in the app. Implemented NSOpertion Queue and NSURL Connection to integrate with backend web services. Used Instruments to check for processing bottlenecks, memory leaks, and retain cycles. Worked on iPhone SDK and internet connection Protocols. Involved in Core Data Framework using SQLite. Developed critical tools for this project like Customized Navigation bar and Scroll view. Used a Test-Driven Development (TDD) environment in a Scrum development methodology to provide end-to-end development. Designed and developed latest trends for iPhone clients. Made use of Core Animation / UI animation concepts. Environment: iOS 6.0/7.0, Xcode 5.0/6.1 iPhone, iPad, Mac OSX Cocoa Touch, UIKit, Storyboards, Foundation, Restful, NSURL Connection, JSON, SQLite, Agile Methodology.  Hanes-Brand, Winston-Salem, NC                                                                                           Oct 2011 – Jan 2013 iOS Application Developer Responsibilities: Responsible for tech design and architecture of the project and working with user experience design team, business analysts, and clients to create the needed requirements artifacts. Designed the application's architecture using MVC, Singleton and Delegation design patterns. Extensive use of singleton and web service response classes for storing of data.  Involved in designing the database architecture using Core Data framework.  Implemented swipe gestures using UI Gesture Recognizer to allow smooth transition between screens. Built iPhone Application that uses UI Table View Controller, UI Tab Bar, UI Navigation Controllers, UI Image View. Integrated iPhone application with applications across all aspects of the client: performance, memory management, debugging.  Multi-Threaded some of the tasks like downloading images, utilization Logging in iOS by running tasks in a separate thread using GCD blocks and NSOperation Queue for optimizing the performance. Used JSON Parsing and have excellent knowledge of it.  Created Custom UI Table View cells with different styles to accommodate the UX/UI requirements and worked for it with the implementing approach of AngularJS.  Consumed JSON web service to fetch the data, reformatted the data to group the departments under a parent product group and bind it to the customized Table View.  Worked on iPhone SDK and internet connection Protocols. Upgraded to story boards and given ARC support to improve performance and source code organization.  Heavy use of API calls deeply revolving around the use of JSON responses and encrypted data.  Developed unit tests for testing specific functionality and logic.  Fixed bugs as documented by QA team.  Used Instruments to fine tune the app performance and memory management.  Formatted the Data as per Business rule to display in UI. Created notifications to detect the autorotation in the customized sub views.  Followed a work data flow principle for design and development.  Worked closely within a cross functional team of testers and developers.   Worked with GDB and Xcode for debugging.  Worked with Subversion to checkout and update the codebase changes.  Followed scrum methodology, an agile development model with 30 day sprints.  Environment: iOS 4.0/5.1, iPhone, Mac OS X, Objective C, Xcode 3.2/4.x, Cocoa Touch Framework,Core Graphics, JSON, Agile Scrum Methodology, SVN. Netwin Info Solutions, India                                                                                                   May 2010 – Sep 2011 UI Developer \n Responsibilities:  \n• Coordinated with BA group for better understanding of functional requirements analyzed and designed    The business requirements to documented and implemented. \n• Responsible for Design and development of Web pages using PHP, HTML, CSS including Ajax controls and  XML. \n• Coded Business Logic component using PHP. \n• Developed UI using JavaScript, HTML, CSS, JavaScript validations and XML. \n• Implemented applications in JavaScript and MYSQL. \n• Worked extensively with the File management and image libraries. \n• Performed Client-side validations using JavaScript. \n• Fixed bugs and provided support services for the application. \n• Tested/Debugged web browser using Firebug.  • Wrote Python scripts to divide XML documents and load data in database.  • Developed Python modules to extract data from MYSQL database. \n• Managed and implemented all codes changes via SVN. Deploying builds across development, staging and  Production instances and maintained code integrity. \n• Created an inline-edit and widget-collapse feature for the web page.  \n• Performed graphical design and web site contract work for small business and working professionals. \n• Met one-on-one with clients in exploring the best possible options for their web presence. \n• Handled duties ranging from creative design to code implementation. \n Environment: JavaScript, PHP, HTML, CSS, AJAX, Apache, Windows, MYSQL. Svarog Software Solutions, India                                                                                         Jun 2008 – April 2010 UI Developer Responsibilities:  \n• Worked with System Analyst and the project team to understand the requirements. \n• Converted the Photoshop mockups in to hand-written HTML and CSS pages. \n• Developed web pages applying best standards. \n• Designed dynamic and multi-browser compatible pages using HTML, DHTML, CSS and JavaScript. \n• Responsible for creating the screens with table-less designs meeting W3C standards. \n• Applied JQuery scripts for basic animation and end user screen customization purposes. \n• Used AJAX and JSON to make asynchronous calls to the project server to fetch data on the fly. \n• Designed CSS based page layouts that are cross-browser compatible on all the major browsers like Safari, Chrome, Firefox and IE. \n• Implemented various Validation Controls for form validation and implemented custom validation controls with JavaScript validation controls.\n• Responsible for fixing all bugs encountered and communicating back over to the QA team. \n \nEnvironment: HTML, JavaScript, CSS, Eclipse IDE, MS Office, Adobe Photoshop, Oracle, SVN, AJAX."}