{"text": "Name: agnes agnes E-Mail: agnes.agnes@gmail.com Address: Nanning, China Github: https://github.com/agnes LinkedIn: https://linkedin.com/agnes Phone No. 167443250570 PROFESSIONAL SUMMARY Java Programmer with 7 years of IT experience in user interaction, requirement gathering, systems analysis, design, development and implementation of many N-Tier Application Systems. Experienced in Core Java with strong understanding of Collections, Multithreading, Event handling, Concurrency and Exception handling. Expertise in Full Stack web application development using Java, J2EE, SpringMVC, Servlets ,REST and SOAP based Web services, EJB, Struts, Swing, HTML, CSS, JavaScript, JSP, AJAX, JQuery, JSON, Hibernate, MY-Batis, JMS, JDBC, XML, Log4J. Experience with Servers like Web Logic, Apache Tomcat, Jboss, jetty and Web Sphere.  Good experience in Agile and Scrum Methodologies. Excellent ability to analyze problem at hand and find solutions. Experience in PL/SQL programming including writing complex SQL queries using stored procedures and Triggers in Oracle, SQL Server using TOAD and Query Manager. Experience with cross browser compatibility issues with Firebug and IE Tester. Created Sequence and class diagrams using STARUML  Proven expertise in distributed application development including extensive work in Object Oriented Analysis, Design, Development and Implementation of projects in the areas of Client Server Architecture and Database Systems. Established continuous integration (CI) practices and standards for the UFTWF. Set up Jenkins server and build jobs to provide continuous automated builds based on polling the Git source control system during the day and periodic scheduled builds overnight to support development needs using Jenkins, Git, Junit, Selenium and Maven. Possess excellent communication, interpersonal and analytical skills along with can–do attitude. Good team leading skills, efficient performance in a team as well as independently.  TECHNICAL SKILLS  Education:\t Bachelor of Technology in Information Technology from JNTU. PROFESSIONAL EXPERIENCE: Client: CVS Caremark Buffalo Charlotte, North Carolina\t\t                          Jan 2014 - Present Position: Java/J2EE Developer Project Description: CVS Health (formerly CVS Caremark Corporation) is an American retailer and health care company. CVS Health operates over 7,700 CVS Pharmacy and Longs Drugs stores; a pharmacy benefit manager, mail order and specialty pharmacies, a retail-based health clinic subsidiary, MinuteClinic; and an online pharmacy, CVS.com. Develops and Maintains software applications critical to the operations of CVS Caremark by incorporating peripheral knowledge of  other Caremark applications and related technologies in the analysis and design of complex solutions. Responsibilities: Participated in the complete life cycle of the project (Analyzing the client requirements, designing, developing and testing). Actively involved in developing application in MVC architecture, designing the web based UI, and developing the REST and SOAP web services. Generated technical design documents based on the requirements, including the flow diagrams, use case diagrams, class diagrams etc. Applied MVC pattern of Ajax framework which involves creating Controllers for implementing Classic JavaScript event handlers and implemented flexible event model for managing multiple event call backs. Implemented Spring MVC framework which includes writing Controller classes for handling requests, processing form submissions and also performed validations using Commons validator. Designed and developed Java Swing interfaces for Contact, Event and Mail information editing. Responsible for integrating Ajax with Spring Service layer using DWR (Direct Web Routing) Implemented Spring' AOP (Aspect Oriented Programming) in service layer and was responsible for implementing @Aspect aspects for performing Autoproxying and also installed Spring web Flow and integrated it with Java Server Faces. Involved in all layers of applications like Controller Servlets, Service controller, Screening manager and Rule Engine. Architecture JMS with spring which involves setting up Active MQ message Broker, declared Active MQ message destinations and also implemented Spring’s JMS Gateway Support class as a base class for JMS gateway classes. Wrote AngularJS controllers, views, and services for new website features. Developed XML, XML schema and parser using SAX and DOM and implemented System Oriented Architecture Methodology. Designed and developed Business Services using Spring Framework (Dependency Injection), Business Delegate & DAO Design Patterns. Implemented JNDI Object Factory Bean for injecting JNDI Objects in Spring configuration setup for fetching a database connection and also configured a mail sender (JavaMailSenderImpl) for sending email. Efficiently implemented multithreading using Java Concurrency utilities for performance improvements. Implemented JTA service to handle transactions and created a conversation interceptor for handling each event. Implemented Spring's Acegi Security feature which includes configuring Spring Provider Manager for delegating authentication responsibilities to LDAP authentication provider Implemented Hibernate's Polymorphic many-to-one associations for referring instances of subclasses and participated in design of data base and created tables in ORACLE. Conducted code reviews against coding standards and made sure the best practices are maintained in development process. Coordinating with the testing team and fixing Bugs at various stages of the application development Participated in unit testing and functionality testing and used log4j for tracking errors and debugging the code. Used Maven build tool for building the application Developing test requirements by decomposing the functional requirements and interacting with End-users, business analysts and developers. Participated in meetings of internal developer groups for the purpose of development standards. Environment: Java, J2EE, spring 2.0, Servlets, JSP, EJB, Ajax, XML,angularjs, RESTful, Maven, CSS, JavaScript, Ant, RAD6, SQL,Oracle9i, Hibernate, Toad, Log4j, CVS, WebSphere 6.0, Windows NT/2000, UNIX. Gilead Sciences- Foster City, CA        \t\t\t\t    \t     \t         Jan 2012 – Dec 2013  Java/J2EE Developer Project Description: Gilead Sciences is an American biotechnology company that discovers, develops and commercializes therapeutics. The company has fourteen commercially available products. Headquartered and founded in Foster City, California, Gilead has operations in North America, Europe and Australia. .  Responsibilities: Gathered requirements from business users for the requirements analysis phase.  Managed planning of work tasks and delegation to developers assigned to use cases, setting clear objectives, recognizing issues, Monitored progress and reported status of work tasks to the project manager.  Contributed to the definition and creation of the application framework and architecture.  Involved in Object Oriented Design/Object Oriented Analysis with usage of UML Sequence Diagrams and Class Diagrams with Microsoft Visio/Rational Rose.  Worked in Agile Scrum Methodology. Involved in using JPA (Java Persistence API) frameworks . Work involved extensive usage of HTML, DHTML, CSS, JQuery, JavaScript and Ajax for clientside development and validations. Developed the HTML prototypes for the purpose of approval from the business users.  Wrote SPA (Single Page Web Applications) using RESTFUL web services and AngularJS. Involved in implementing and integrating LDAP and Site Minder authentication into the application.  Created quality working J2EE code to design, schedule, and cost to implement use cases.  Implemented Different Design patterns like singleton, factory and J2EE design patterns like Business delegate, session façade, Value object and DAO design patterns.  Involved in writing the database integration code using Hibernate.  Extensively used webservices (SOAP , WSDL) to exchange the data between different applications.  Used Spring Framework's IOC Dependency Injection to inject Service Object using Service Locator Design Pattern into Action Classes.  Involved in writing code to transform XML documents using JAXP (SAX and DOM Parsers)  Contributed in design and development of Struts/MVC web based application.  Used Struts Tiles and Validator framework extensively in developing the applications.  Involved in writing JSP and JSF components. Used JSTL Tag library (Core, Logic, Nested, Bean and Html taglib's) to create standard dynamic web pages.  Effectively prepared for and organized technical inspections to review code and design models with peers  and software architects.  Created SQL queries and used PL/SQL procedures with Oracle Database. Involved in performing Unit and Integration testing (JUnit)  Strictly followed Test Driven Development (TDD Approach) environment using Agile Methodologies.  Used Clear Case for source Version Control.  Used SQL Query Analyzer for writing SQL scripts.  Provided users with training.  Deployed the application onto the production boxes. Environment: Java1.5, J2EE, JSP,JPA, JSTL, JDBC, JSF, RichFaces, Spring Framework, Hibernate, XML, JavaScript,jquery,AngularJS, Oracle 10g, Web services,RESful, SOAP, WSDL, Servlets, DB2, HTML, DHTML, XHTML, CVS, IBM Trivoli , JUnit ,XSL, XSLT, RAD, LDAP, Jakarta Commons Libraries, WebSphere Application Server. Kingsway Amigo, Doral, FL\t\t\t\t\t                                    Oct 2010 –Dec 2011 Java/J2EE Developer  Project Description: Kingsway provides insurance solutions to manage specialty risks for individuals and businesses in the United States and Canada. Its primary business is the insuring of drivers who do not qualify for standard automobile insurance coverage because of their payment history, driving record, place of residence, age, vehicle type or other factors. Other products in the Kingsway portfolio include trucking insurance, commercial automobile insurance, commercial and personal property coverages, standard automobile insurance, motorcycle insurance and other specialty lines. Its subsidiaries include Universal Casualty Company, American Service Insurance Company, Southern United Fire Insurance Company, Lincoln General Insurance Company and Hamelton Insurance Company. Responsibilities: Involved in gathering business requirements, analyzing the project and created UML diagrams such as Use Cases, Class Diagrams, Sequence Diagrams and flowcharts for the optimization Module using Microsoft Visio. Designed and developed Optimization UI screens for Rate Structure, Operating Cost, Temperature and Predicted loads using JSF myfaces, JSP, JavaScript and HTML. Configured faces-config.xml for the page navigation rules and created managed and backing beans for the Optimization module. Developed JSP web pages for rate Structure and Operating cost using JSF HTML and JSF CORE tags library. Involved in system design and development using Collections and multithreading for the action classes. Designed and developed the framework for the IMAT application implementing all the six phases of JSF life cycle and wrote Ant build, deployment scripts to package and deploy on JBoss application server. Designed and developed Simulated annealing algorithm to generate random Optimization schedules and developed neural networks for the CHP system using Session Beans. Integrated EJB 3.0 with JSF and managed application state management, business process management (BPM) using JBoss Seam. Wrote AngularJS controllers, views, and services for new website features. Developed Cost function to calculate the total cost for each CHP Optimization schedule generated by the Simulated Annealing algorithm using EJBs. Implemented Spring web flow for the Diagnostics Module to define page flows with actions and views and created POJOs and used annotations to map them to SQL Server database using EJB. Wrote DAO classes, EJB 3.0 QL queries for Optimization schedule and CHP data retrievals from SQL Server database. Used Eclipse as IDE tool to develop the application and JIRA for bug and issue tracking Created combined deployment descriptors using XML for all the session and entity beans. Wrote JSF and JavaScript validations to validate data on the UI for Optimization and Diagnostics and Developed WebServices to have access to the external system (WCC) for the diagnostics module. Wrote Message Driven Bean to implement the Diagnostic Engine and configured the JMS queue details and involved in performance tuning of the application using JProbe and JProfiler. Wrote JUnit test cases to test the Optimization Module and created functions, sub queries and stored procedures using PL/SQL. Involved in code reviews and performed version guidelines. Environment: Java 1.5, J2EE, Microsoft Vision, EJB 3.0, JSP, JSF, JBoss Seam, JIRA,Webservices,  JMS, JavaScript, AngularJs,HTML, ANT, Agile, JUnit, JBoss 4.2.2, MS SQL Server 2005, My ECLIPSE 6.0.1. Inek Technologies- Hyderabad, India\t\t\t\t\t            Sep 2009- Sep2010 JAVA/J2EE Developer Project Description: Capital IQ is a leading provider of data and analytics for financial professionals. Involved in developing an internal product for Business Information Developers to maintain Listed Company's Stock records. This system collects Stock information from several documents and uploads to a centralized Capital IQ Information Repository and system also does the content analysis to map the incoming content from other systems into a standard XML format.   Environment: JDK1.2, JavaScript, HTML, DHTML, XML, Struts, JSP, JBoss Drools Rule Engine, Servlet, JNDI, J2EE, Tomcat, Rational Rose, Oracle. Atrenta India Pvt Ltd- Bengaluru, India\t\t\t\t\t        June 2008 – Sep 2009 Junior JAVA Developer Project Description: Atrenta is one of the leading suppliers of innovative products addressing early stage Integrated Circuits and system design aimed at improving design efficiency for the world’s leading semiconductor and consumer electronics companies. Environment: Java, JSP, Servlets, JDBC, JavaScript, MySQL, JUnit, Eclipse IDE."}