{"text": "Name: mary mary E-Mail: mary.mary@gmail.com Address: Guiyang, China Github: https://github.com/mary LinkedIn: https://linkedin.com/mary Phone No. 462147272627 SUMMARY Over 6 years of IT experience in the areas of Designing, Developing, Testing, Deploying, Integration and Supporting enterprise web applications using Java/J2EE Web technologies. Experience in designing and developing Multi-Tier Web Applications using Java/J2EE Technologies like JSP, Servlet, JNDI, JMS, JUnit, JDBC and Web Services. Experience in developing web based applications using Hibernate and Spring Frameworks. Hands on experience in documenting the entire life cycle using various methodologies like Waterfall, Agile and SCRUM. Proficient in Java/J2EE Design Patterns including Singleton, Session Factory, Object Pool, Session Facade, MVC, Data Access Controls (DAO, DTO). Experience in developing the presentation layer components with the help of JSPs, Angular JS, HTML, Ajax, jQuery, JavaScript and XML. Good knowledge of Web Services, SOAP, WSDL and experience working with various parsers like SAX and DOM. Proficient in implementing Model-View-Controller (MVC) Architecture for enterprise applications using Spring, Struts, Hibernate, MyBatis, JPA, JSF, EJB and JMS frameworks. Experience in RDBMS and non-relational database design with various databases like Oracle, MySQL, SQL Server, NOSQL etc. Experience in using various Configuration Management tools like GIT, Clear case, SVN, and CVS. Experience in design and developing applications based on Akka using ZeroMQ, written in scala and running on Linux. Extensive experience with Frameworks in ORM (Hibernate, JPA, MyBatis), Spring (Spring DI, Spring ORM, Spring AOP, Spring Transaction, Spring Batch, Spring Security) and Struts . Experienced in writing applications in Maven, ANT and deploying them on to servers.  Very good working knowledge on performance tuning, debugging, testing on platforms. Strong Knowledge in Object Oriented Analysis and Design Skills Problem solver with the ability to rapidly analyze challenges, applying strategic thinking to tactical concerns with strong problem-solving skills and a result oriented attitude. Hands on experience with build tools like ANT, Maven and logging tools like Log4J and SL4J. Extensive knowledge in OOAD concepts of Use Cases, Activity diagrams, Sequence diagrams and class diagrams using UML. Worked on IBM Rational Rose. Well versed in using Software development methodologies like Rational Unified Process (RUP), Rapid Application Development (RAD),Agile Methodology and Scrum software development processes. Good knowledge of Software Development Life Cycle (SDLC). Involved in writing test cases concepts and working knowledge of JUnit . Used Postmen and Apache HTTP Request client for testing Restful web services. Ability to test backend applications like SQL&PLSQL Statements. Excellent troubleshooting skills and proactive problem solving approach with excellent leadership, interpersonal and time management skills. Excellent communication skills, both written (documentation) and verbal (presentation). Reliable, responsible, innovative and versatile team player. Can work independently with minimal supervision or no supervision. Ability to understand the larger context of domain relevance and relate to overall application area. Experience working with Linux and Unix like Ubuntu, Cloudera, VMware Esxi, VCenter   TECHNICAL SKILLS Programming Languages\t\tJava/J2EE, SQL, C, C++, PHP  J2EE Technologies\t\tJSP, Servlet, JNDI, JMS, JUnit, JDBC, Web Services  Web Technologies\t\tJSPs, HTML, Ajax, XML, JSON. Scripting Technologies\t\tJava Script, Jquery  Web Frameworks\t\tSpring, AngularJS, Bootstrap, Hibernate, Mybatis Web Services\t\tSOAP, WSDL, UDDI, XML, XSD, XSL, REST Web/Application Servers\t\tWeb Sphere, Web Logic, JBoss, Apache Tomcat. Testing\t \tJUNIT, Mockito, Spock, Groovy Database\t\tOracle, MySQL, MS SQL Server, NoSQL, MongoDB Version Control\t\tSVN, CVS, GIT Methodology\t\tWaterfall, Agile, Scrum Programming Operating Systems\t\tWindows, Mac, Linux, Unix EDUCATION:  Masters in Information Technology, Virginia International University . WORK EXPERIENCE Client: United Bank, Chantilly, VA\t July 2015 – July 2017 Role: Java/J2EE Developer \t Project Description: United Bank offers banking, mortgage, trading, and financial services. The project involved the implementation of a web based loan tracking application used for tracking various mortgage loans. It also included interfaces with Servicing Vendor, Document Preparation Vendor, Flood/Tax Service Vendor and General Ledger. Responsibilities: Designed the front-end applications and user interactive web pages using Angular JS, HTML5, Bootstrap, CSS3 and JavaScript. Used Action Servlet as controller to process all the user requests and Action Form to provide validations using properties file. Used Spring MVC to bind web parameters to business logic. Used Dependency Injection feature of Spring MVC framework and O/R mapping tool Hibernate for rapid development and ease of maintenance. Worked with is object-oriented and functional software development on the JVM, using Java and Scala, for application development as well as system integration, using SOA, Microservices, ESB-style and message-based integration and related enterprise software technologies. Developed the DAO layer for the application using Spring Hibernate Template support. Wrote Object relational mapping code using hibernate, developed Hibernate mapping files for configuring Hibernate POJOs for relational mapping. Developed MyBatis in Data Access Layer to access and update information in the database. Implemented Transactions using spring framework. Developed on web and desktop visualization tools using Play Framework and Scala. Used Spring IOC in combinations of REST Web Service and Hibernate which provides loose coupling between user interface layer and persistence layer. Used Hadoop as big data processing with Apache Spark Used MyBatis object relational data mapping framework to persist and retrieve the data from Database. Implemented SQL scripts and designed the solution to implement using Scala. Used WebLogic for design, development, and deployment of applications. Used Log4j, JUnit and Easy Mock for debugging, testing and maintaining the system state. Provides technical assistance in identifying, evaluating and developing Agile methodologies and procedures that are efficient, effective and meet good business practice. Environment: Java, J2EE, Spring, Spring MVC, Hibernate, Scala, Servlets, Angular JS, HTML5, JavaScript, Bootstrap, CSS3, Oracle, PL/SQL, Eclipse, REST, ANT, WebLogic, Apache Tomcat, Log4j, JUnit, Easy Mock, GIT, Windows. Client: Citi Group, Melville, NY\tJuly 2013 - June 2015 Role: Java/J2EE Developer \t Project Description: Citi Group used Self Service application where they can pay the loan payment and view the loan details. It will process direct payments for Installment, Lease and Revolving account customers. Responsibilities: Responsible for prompt development of services, features and tools for the Institution's highly interactive based System. Worked on the Spring framework like Spring IOC and Spring DAO. Implemented DAO layer using Hibernate Framework to map Java Objects to database tables. Used Scrum (Agile) as Development methodology. Used Spring MVC for Model View Controller Framework. Designed UI using JSP, HTML and validated with JavaScript for providing the user interface. Wrote JSPs, JavaScript and Servlet to generate dynamic web pages and web content. Used various JQuery and Bootstrap plugins. Implemented design patterns in Scala for the application. Implemented Event Sourcing using Akka. Used JavaScript for client-side validations, and AJAX to create interactive front-end GUI. Used SOAP UI for testing the SOAP based web services by passing XML/JSON data formats. Implemented application level persistence using Hibernate and Spring Frameworks. Developed API using Hibernate to interact with the Oracle database. Develop quality code adhering to Scala coding Standards and best practices. Designed and created database tables in the Oracle and MySQL Database for the development environment. Performed unit testing using JUnit framework and tested DAO's and Business Services. Used Maven for building and deploying Application. Involved in Unit testing and System testing and also responsible for preparing test scripts for the System testing. Involved in helping team members to debug issues with the application and designed and prepared Unit test case using JUnit and removed the maximum bugs before passing on the application to the QA team. Used Source Configuration Management version controller as a subversion (SVN). Environment: Java, J2EE, Spring, Spring MVC, Hibernate, Servlets, JSP, HTML, JavaScript, CSS, XML/JSON, Bootstrap, Scala, JQuery, AJAX, Oracle, MySQL, PL/SQL, Eclipse, SOAP, Maven, WebLogic, SOAP UI, JUnit, SVN, Windows. Client: Swiss RE, Armonk, NY\tJuly 2011 - June 2013 Role: Java Developer \t Project Description: Swiss RE provides re-financing services. The project is a web-based insurance policy application. Administration system allows authorized agents to quote and submit new policy applications, view policy status and submit policy endorsements. The system will guide the agent through the policy application and endorsement. Processes and automatically apply underwriting rules when submitting transactions.. Responsibilities: Involved in various phases of Software Development Life Cycle (SDLC) like analysis, specification, design, implementation and testing Followed AGILE Methodology to promote development process with 3 weeks of iteration and participated in daily SCRUM Meetings throughout the life cycle of project Designed and developed the UI pages using JSP, HTML, CSS and JavaScript. Developed and implemented the MVC Architectural Pattern using Springs Framework. Simplified MySQL database access using JDBC. Used Web services concepts like SOAP, WSDL, and JAXB to interact with other project with in Ease Producer for sharing information. Worked on migrating the old java stack to Type safe stack using Scala for backend programming. Used Scala collection framework to store and process the complex information. Based on the offers setup for each client, the requests were post processed and given offer. Written SQL queries to retrieve the records from database. Performed the product testing using database like MySQL. Deployed and configured Web Applications using WebLogic Application Server. Configured Log4j to enable/disable logging in application. Maven was used for dependency management and structure of the project. Used CVS as version control. Wrote various test cased using JUnit. Used struts framework and interacted with back-end database using JPA API. Extensively used JPA in data access layer to access and update information in the database. Wrote SQL commands and Stored Procedures to retrieve data from MySQL database. Used Internalization, Localization's, tiles and tag libraries to accommodate for different locations. Used Java Mail (JM) API for send and receive email via SMTP and POP3. Involved in using WebLogic Server for deploying and testing the code. Consumed SOAP webservices to expose the business methods and application logic to external Services. Environment: Java, J2EE, Spring, Spring MVC, Scala, JDBC, Servlets, JSP, HTML, JavaScript, CSS, MySQL, Eclipse, SOAP, WSDL, JAXB, Maven, WebLogic, JUnit, CVS, Log4j, Windows."}