{"text": "Name: elizabeth elizabeth E-Mail: elizabeth.elizabeth@gmail.com Address: Nairobi, Kenya Github: https://github.com/elizabeth LinkedIn: https://linkedin.com/elizabeth Phone No. 619514668733 PROFESSIONAL SUMMARY: Dynamic, innovative, skilled and experienced Frontend Developer around 7+ in IT industry with Java/J2EE and Cloud computing infrastructure such as Amazon Web Services (AWS). Experience in Software life cycle phases like Requirement Analysis, Implementation and estimating the timelines for the project.  Conduct systems design, feasibility and cost studies and recommend cost-effective cloud solutions such as Amazon Web Services (AWS) Expertise in working on Front End/User Interface (UI) Technologies like using HTML4/5, CSS2/3,DHTML, JavaScript, jQuery, AngularJS, ReactJS, Bootstrap Framework, AJAX, JSON, and XML.  Working experience on CSS Background, CSS Positioning, CSS Text, CSS Border, CSS Margin, CSS Padding, CSS Table, Pseudo Classes, Pseudo Elements and CSS Behaviors in CSS.  Good Expertise in analyzing the Document Object Model (DOM) Layout, DOM Functions, and JavaScript functions, Cascading Styles across cross-browser using Fire Bug, Developer Tool Bar.  Using JavaScript, jQuery and KendoUI for user interactions in pages creating a responsive web application integrating Twitter Bootstrap with AngularJS and media queries.  Expertise in Designing and Developing Single Page Applications (SPA) using AngularJS, and with other UI technologies such as JavaScript, jQuery,Bootstrap, CSS and HTML Experience in using Core Technologies Cassandra, Java, Servlets, JSP, Custom tags, Spring Boot, JDBC, Microservices, JavaBeans, EJB, JavaScript, Web Services, AngularJS, jQuery, MVC, Struts, spring Bootstrap framework, Ajax, Backbone and Google Web Toolkit (GWT). Experience in developer tools like CodeCommit, CodeBuild, CodeDeploy, and Code Pipeline. Experience in working of MVC Architecture based frameworks like AngularJS.  Expertise in developing front-end of the applications using JavaScript, CSS, XML, HTML, Flex 3.0 and AngularJS  Expertise in creation of angular custom directives Filters and Services.  Expertise in Angular modules like Angular-animate, Angular-Cookies, Angular-Filter, Angular-Mocks, Angular - Recourse, Angular- Route, Angular-Sanitize, Angular-Touch and Angular-UI-Bootstrap.  Expertise in AngularJS structural framework for dynamic web apps and profound knowledge in concepts like Dependency Injection, Promises, Services, Scopes, Controllers and Directives. Experience of responsive web design using Bootstrap framework and CSS3 media queries.  Worked with JavaScript validations and developed Object Oriented code.  Worked on server-side scripting JavaScript framework Node.js, Express.js, created Rest API’s using Node.js and connected to MongoDB.   Extensive experience in jQuery, jQuery plugins, AJAX, dynamic HTML, JSON, JS with Bootstrap and Node.js.  Responsible for checking cross browser compatibility and hence worked on different browsers like Mozilla Firefox, Google chrome, Safari and Internet Explorer. Knowledge on design and build cloud service models including Infrastructure-as-a-Service,Platform-as-a-Service, and Software-as-a-Service.  Excellent experience in Restful Web services and Big Web service development and consumption using (JAX-RS and JAX-WS). Expertise in RESTful, SOAP web services to integrate between Application to Application  Expertise in maintaining, building and deploying Java application server like BEA Web Logic 7.0/8.x/9.x, Bea Web Logic Portal Server 7.0, IBM Web Sphere 5.x, JBoss 4.0.3, Tomcat […] and Oracle application server (OAS).  Extensively used the repositories like GitHub and SVN. Involved in daily SCRUM meetings to keep track of the ongoing project status and issues.  Worked in various development methodologies such as Waterfall, Agile (SCRUM). Experience using modern JavaScript tools like jasmine and karma. Excellent skills in programming using wide variety of languages and ability to adapt new latest technologies & work in Multi-platform environment. TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE: Client: Verizon, San Diego,CA\t\t\t\tApr2016 - Present Role: Java Full StackDeveloper  Responsibilities: Development, Enhancement, Maintenance, Administration of Contract Managementweb application.  Project Management activities – Customer relation, project monitoring and management, Resource Identification and task assignment, Metrics generation etc. Maintain onsite and/or offshore environment for support, maintenance and enhancement of the applications using Service Manager, Change Management tools. Involved in various phases of Software Development Life cycle (SDLC) of the application like requirement gathering, Design, Analysis and code development. Spring framework is used to implement Inversion of Control (IOC) and Model View Controller (MVC) Created an internal browser based text editor using HTML, CSS, JavaScript, Require.js, Backbone, Ember JS, Jasmine, Selenium Built Node.js, npm based web frameworks and Docker based Microservices for deployment of web frameworks for data visualization and analytics user interface toolkits.   Developed user management screens using AngularJS business components. Used AngularJS 2.0 to build a single-page application using type script. Experience in developing Components in Angular 2.0 Developed the administrative UI using Angular(2.0) and Node.js, Jasmine and React.js. Responsible for creating front end applications, user interactive (UI) web pages using web technologies like HTML5, XHTML, CSS3, JavaScript, JQuery, AJAX, JSON, Angular(2.0) and Bootstrap. Spring framework and DAO classes using JPA framework for persistence management and involved in integrating the frameworks for the project. Worked extensively on Web Services (SOAP & REST), XML, JMS and Spring Controller. Actively involved in designing and implementing Business Delegate, Data Access Object. Used AJAX (JQuery) to display data using asynchronous calls. REST (JAX-RS) web services have been developed to be consumed by middleware module to push the communication center messages into web module. Extensively used Java Collections framework for backend services and to display view on frontend. Developed single page applications (SPA’s) using AngularJS, ReactJS and BackboneJS. Developed reusable custom directives using AngularJS using transclude, restrict, event handlers and templating. Used Bootstrap for Responsive Web design. Used Grunt for build UI applications minification, watch for file changes for automated build, code quality check and CSS prefixes for cross browser compatibility.  Used Node.js and Npm modules. Implemented mock services in node.JS with the help of modules using ExpressJS. Created application to View Data in MongoDB. Wrote application level code to perform client side validation using JQUERY. Worked on Rest API calls and integrated with UI.  Responsible in testing the classes and methods using JUnit test case. Used JUnit framework for unit testing of application and Log4j to capture the logs. Developed the application using Spring Framework that uses Model View Controller (MVC) architecture with JSP as the view. Develop Docker based Microservices deployment modules with Jenkins and Ansible based pipelines/frameworks.   Developed web services using HTTP, SOAP and XML technologies.  Used UNIX shell scripts for running java batch components on server. Handled the back-end operations using SQL, Stored procedures, triggers and developed the persistence structure using ORM based Hibernate. Worked with Build Engineer on Maven Configuration to build the application and deployed on WebSphere Application Server. Environment: Java1.8, Hibernate, JPA, Oracle, PL/SQL, AEM, Spring, AWS Cloud, Mockito, Multi-threading, SOAP/REST Services, JMS, HTML5, CSS3, d3.js, AJAX, jQuery 1.4.1, Angular, NodeJS, Ember JS, Apache Flex,Bootstrap, HTML, JavaScript. Client: Wells Fargo, Charlotte,NC\t\t\t\tOct2014 – Apr 2016 Role: Java Full Stack/UI developer  Responsibilities: Involved in Developing of Application based on J2EEusing Hibernate and spring frameworks.  Used Spring framework and worked on different spring modules. Written test cases for Unit testing using JUnit.  Responsible for design and developing Persistence classes using Hibernate and Spring JDBC Template frameworks to save data in database tables.  Generating Hibernate mapping files and domains using tables.   Responsible to enhance the UI using HTML, CSS, Java Script, XML, JSP as per the requirements and provided the client side using jQuery validations. Good usage of JBOSS as an application server and integration middleware software products. Developed application for different browsers and fixed bugs for browser compatibility.  Interacted and worked with cross-functional teams. Used Hibernate as Persistence framework mapping the ORM objects to table using Hibernate annotations. Developed Web API using NodeJS and hosted on multiple load balanced API instances.  Developed code for Responsive web design in JavaScript using frameworks like Angular.js. Worked as Administration, maintenance, support and scaling of Application Servers (WebLogic, Oracle Fusion Middleware SOA, OSB, IBM WebSphere, JBoss, and Tomcat) Experience in consuming RESTful web services using Node JS and Express JS and displayed on the front-end using jQuery and Angular JS. Developed web services component using XML, WSDL and SOAP with DOM parser to transfer and transform data between applications. Designed UX pages using Adobe Illustrator for digital photo manipulation and photorealistic styles of computer illustration. Build responsive application using AngularJS, NodeJS. Application compatible with mobile devices and different web platforms and browser. Used Java script and Angular JS for client side validations. Used SOAP UI for testing the web services by sending a SOAP request. Used AJAX for server communication and seamless user experience. Worked with Web Logic Application Server to deploy the Application(s). Developed the Ant scripts for preparing WAR files used to deploy J2EE components. Experience in developing scalable solutions using NoSQL database, Cassandra, MongoDB.  Performed importing data from various sources to the Cassandra cluster using Java/Python APIs. Used Agile Scrum process. Optimized queries and created new entities in 3NF. Environment: Java 6, Spring, Hibernate, Rest, log4j, JUnit, IBM MQ, JMS, JAXB, Web Services, HTML5, CSS3, AEM, Java Script, JQuery, AJAX, JSON, Angular JS, NodeJS, XML, XSL, JQuery, Mongo DB, Cassandra, MongoDB, Web Logic Application Server. Client: Symantec, Mountain View, CA                                                                      Oct 2012– Oct 2014 Role: Java/UI developer   Responsibilities: Implementing project using Agile SCRUM methodology, involved in daily stand up meetings and sprint showcase and sprint retrospective. Developed the web tier using JSP, Spring MVC. Used Spring Framework for the Implementation of the Application. Integrated Spring Dependency Injection (IOC) among different layers of an application.  Used Hibernate for object Relational Mapping and used JPA for annotations.  Implemented REST web services using Apache-CXF framework.  Involved in creating various Data Access Objects (DAO) for addition, modification and deletion of records using various specification files.  Developed presentation layer using HTML, JSP, Ajax, CSS and jQuery.  Deployed the Application in WebSphere server.  Designed and developed persistence layer using spring JDBC template.  Involved in Unit Testing of various modules in generating the Test Cases.  Used SVN and GitHub as version control tool.  Converted the HTML Pages to JSF Tag Specific Pages.  Developed JSPs and managed beans using JSF.  Environment: Spring framework, Spring MVC, Spring JDBC, Hibernate, J2EE, JSP, Ajax, XML, Log4j Maven, JavaScript, HTML, CSS, jQuery, PL/SQL, SVN, GitHub, WebSphere, Agile, JAX-WS, Apache-CXF, JSF. Client: Tech Mahindra, India.\t\t\t\t\t\tMay 2011 – Sept2012 Role: UI developer Responsibilities: Worked on multiple projects simultaneously Formulate and define system scope and objective based on user needs and thorough understanding of business processes Participated in numerous creative brainstorm sessions with strategists, storyboards, design specifications, and screen layouts that were shared with Directors and other team members Developed web presentation layer using HTML and CSS according to internal standards and guidelines Handled all aspects of the web application including maintaining, testing, debugging, deploying and printing Designed and developed intranet web applications using JavaScript, jQuery, Ajax and CSS Worked with teams where requirements are constantly being implemented, tested and improved Worked on Cross-Browser compatibility and fixed the bugs for several browsers Designed the table less web applications using CSS and with the help of and tags as per W3C standards Continuously provide input to project management activities throughout the project lifecycle influencing scope, risk plan, project plan, issues and status Environment: HTML, CSS, JavaScript, jQuery, AJAX, Agile methodology, Eclipse. Client: Innovative Solutions, India.\t\t\t\t\t   Jun2010 –May 2011 Role: Java developer Responsibilities: Responsible for Functional Specification and System Design based on Business Requirement Document provided by business analyst. Analyzed use cases, created interfaces and designed the core functionality from presentation layer to business logic layer using UML. Actively participated in design and technical discussions. Designed and developed client side GUI using JSP, HTML and JavaScript. Used java core concepts Collection Framework Interfaces like List, Set, Queue and also Map Interface. Used AJAX and JavaScript for validations and integrating business server side components on the client side with in the browser. Used Servlet as an interface between frontend and backend to handle HTTP requests and to send response back to the front end. Worked on JDBC to connect to MySQL for implementing CRUD operations. Responsible for configuring Apache Tomcat Application Server to access the Database by setting up Data source and MySQL Pool. Developed the business objects using EJB for calling data access objects. Used NetBeans IDE to develop the Application. Used CVS for version control across common source code used by developers. Reviewing test cases and bug fixing. Building Software modules using Apache Ant. Used Log4J to capture the log that includes runtime exceptions. Environment: JDK, EJB, Servlets, JSP, JavaScript, CSS, HTML, XML, JDBC, NetBeans IDE, CVS, ANT, Apache Tomcat Application Server, UML, MySQL and Windows XP."}