{"text": "Name: ruth ruth E-Mail: ruth.ruth@gmail.com Address: Philadelphia, United States Github: https://github.com/ruth LinkedIn: https://linkedin.com/ruth Phone No. 549316490050 PROFESSIONAL SUMMARY Over 7 years of professional software development experience in object-oriented analysis, design and development of web applications using Java/J2EE technologies. Involved and experienced in all phases of Software Development Life Cycle- Analysis, Design, Implementation, Testing, Maintenance, and Performance tuning. Extensive experience in design and development of multi-tier applications using Java, J2EE, JSP, Servlets, Struts, Hibernate, JDBC, SpringMVC, XML, Web Services(SOAP, REST), Microservices, HTML, JavaScript, Node.js, AJAX, JMS. Experience in building applications using various technologies like Java, Spring, Hibernate, Struts framework, Servlets. Web application development usingHTML5, XHTML, CSS3, AJAX, and JQuery, JavaScript, AngularJS/2/4/6, React, Node.js, Bootstrap and JSON. Working experience with different Spring Framework modules like Spring Core, Spring Application Context, Spring MVC, Spring AOP, Spring ORM, etc.Experienced in creating Restful Services with Spring MVC Framework and usingHibernate.  Proficient in Object Oriented Programming using Core Java, Multi-threading, Synchronization, Serialization, Collections and Data Structures. Expertise in SQL, PL/SQL programming. Database management experience includes Oracle, MS SQL, MySQL, IBM DB2,NoSQL, Mongo DB, PostgreSQL, Cassandraand Sybase. Experience in build tools such as Ant, Maven, Gradlefor project development and deployment.Experience in building and deploying applications using Jenkins Continuous Integration Tool. Well versed in working on projects using Waterfallmodel and Agile methodologies such as SCRUM and Test Driven Development (TDD). Experience with Object Oriented Analysis and Design methodology using tools like Unified Modeling Language (UML) and Rational Unified Process (RUP) with IBMRational Rose. Experience using Solution Architecture J2EE design patterns like Singleton, Command, Factory, Observer, Front Controller, DAO, MVC, Session Facade, Business Delegate, Service Locator, Transfer Object, and View Object. Experience in developing Web Services using – REST, SOAP, WSDL and developing DTDs, XSD schemas for XML (parsing, processing, and design). Worked with XML parsers like JAXP (SAX and DOM) and JAXB. Experience in working with IBM WebSphere Portal/Application Server, BEA WebLogic, and Apache Tomcat. Expertise in implementing JMS and asynchronous communications between two applications running in different servers. Hands on experience with JUnit, Advanced Rest Client and Log4j in developing test cases and Jira for tracking and logging issues and determining application functionality.Experience working with version control systems like SVN, CVS, GIT, etc. TECHNICAL SKILLS PROFESSIONAL EXPERIENCE RESMED\t\t\t\t\t\t\t\t\t\t\tDec 2017 - Present San Diego, CA Sr.Full Stack Java Developer Resmed is a tech-driven medical device company that manufactures CPAP masks, machines, and other products that diagnose, treat, or help manage sleep-disordered breathing (sleep apnea in particular), chronic obstructive pulmonary disease, or other respiratory conditions.  Responsibilities: Involved in gathering and analyzing business requirements, complete development, testing and maintenance of the applications; followed Agile methodologies. Extensively used Spring Framework modules like MVC, DI(IOC), JDBC Templates, Spring Security, JMS and AOP.Implemented the project structure based on Spring MVC pattern using Spring Boot. Created and injected Spring services, controllers and DAOs for DI and to wire objects of business classes. Extensively used Hibernate Mappings, HQL, Query, Criteria, Lazy LoadingTransactions and Lockings. Developed Stored Procedures, triggered stored procedures using Hibernate. Designed web pages using Angular4Validations, Modules, Events, Expressions, Directives, Controllers and Filters.Design JSON responses according the request send it back to the front end after the logic processing. Used AJAX effectively to create pagination and with client side events like quick search. Created a Front-end application using Bootstrap, Restful, AWS, Angular4, JSPs, and Spring MVC for registering a new patient and configured it to connect to database using Hibernate. Used Bootstrap in combination with Angular4 to develop this website as a responsive website. Used two way data binding features of Angular4with ng-modelto implement Data binding to bind various server controls to the data from database. Created the responsive UI components using React/Redux and to dispatch events to the store. Experience with various persistence mechanisms and APIs like JPA, JDO, Hibernate, EJB. Worked with high volume and complex PL/SQLStoredProcedures and Packages using TOAD.  Developed and consumed Apache CXF based Web Services as part of a payments application. Exposure to JAXB&JAX-WS. Used Spring JMS to post and consume the messages from the IBM MQ Server. Implementing or exposing the Microservice architecture with SpringBoot based services interacting through a combination of REST and ApacheKafka message brokers. Worked with HTML5, CSS3, JSON, JavaScript,React.js and ES6 for developing user interface. Developed a RESTAPI using SpringBoot as a microservice for interacting with notification manager and MongoDB.  Responsible for design of WSDL files and schemas. Designed and hosted SOAP based Web Services on Web Sphere Application Server.  Developed Grunt tasks to run the unittests on Jenkins. Coordinated Kafka operations and monitoring (via JMX) with Dev Ops team.  Set up Jenkins server and build jobs to provide continuousautomatedbuilds based on polling the Git source control system. Environment: Java, Spring, JPA, Hibernate, Web services, HTML, CSS, JavaScript, Angular 4, JSON, Bootstrap, JQuery, JSP, AJAX, JavaScript, Jenkins, MongoDB,  WebSphere, SOA, JBoss, IBM MQ, Spring MVC, SOAP, REST,  WSDL, SQL, GIT, Spring Boot FEDEX\t\t\t\t\t\t\t\t\t\t\tFeb 2017 – Nov 2017 Memphis, TN Sr. Full StackJava Developer FedEx is a courier delivery services company that operates globally. The company is known for its overnight shipping service and pioneering a system that could track packages and provide real-time updates on package location. Responsibilities: Involved in gathering and analyzing business requirements and converting them into technical specifications. Designed and coded application components in an Agile environment utilizing a test driven development (TDD) approach. Designed and developed front-end UI using HTML5, Bootstrap, CSS, JavaScript, XML, XSD, XSLT, Angular4, ReactJS.Created Typescript reusable components and services to consume REST APIs using Component based architecture provided by Angular 4.0. Used Spring-IOC concepts and Spring MVC pattern for developing the application. Used Apache Camel in the JBoss Fuse ESB as the integration platform for SOA Services. Tested the web services using SOAPUI and by writing web service client in Java for transmitting the offender's information in XML data using the WSDL provided. Developed Restful (JAX-RS) web services using REST Easy and Jersey framework, JSON as data exchange format to integrate custom web applications with enterprise systems like LDAP, RDBMS and ServiceNow ticket management tool Used JBoss Fuse for remote console login, JMX management and web server console. Implemented ORM in the persistence layer using Hibernate framework in conjunction with Spring AOP functionality. Experienced in developing web services and worked with Web Sphere Application Server. Worked on server side of the application using Hibernate framework. Developed multiple POC's to create an interface between backend and frontend by using MongoDB, ExpressJS, Angular and Node.js (MEAN). Extensively worked on Java persistence layer in application migration to Cassandra using Spark to load data to and from Cassandra Cluster. Used JMS for vendor communication. Used Java Messaging Services (JMS) for reliable and asynchronous exchange of important information such as payment status report to MQ Server using MQ Series. Used JMS to send messages securely, reliably and asynchronously to Web Sphere. Experience in development and configuration of monitoring solutions to provide full visibility to different platform components using tools and services like AWS, Cloud watch, Splunk.  Developedenhancements to database driven web-based payroll software, back end development and maintenance using PHP and MySQL. Used SOAPUI, Web Logic ANT task to test Web Services running on Web Logic Server. Used JIRA tool for tracking stories progress and follow agile methodology. Set up Jenkins server and wrote build jobs using Jenkins, Maven to provide continuous automated builds and maintenance. Environment: Java, J2EE, Spring MVC, HTML, CSS, JavaScript, JQuery, Angular, Typescript, Bootstrap, AJAX, JMS, JBoss, Cassandra, MongoDB, Log4j, JIRA, ANT, Jenkins, JSON, Web Services,  SOAP, REST API, GIT, Maven, Docker MISSISSIPPI STATE DEPT OF HEALTH\t\t\t\tApr 2016 – Dec 2016 Jackson, MS Java/J2EE Developer The Mississippi State Department of Health protects and advances health throughout Mississippi. Their various operations include health protection, health promotion and health planning. Responsibilities: Followed Agile methodology for application development; attending daily stand-ups and weekly SCRUM meetings.  Implemented Spring MVC architecture and Spring Bean Factory using IOC, AOP concepts. Created RFP micro service to provide RESTful API using Spring Boot with Micro Services.  Worked on thread handling to maintain continuity of execution and extensively implemented multithreading to handle TransactionManagement with isolation. Used Hibernate(ORM)in conjunction with Spring AOP to store persistent data into Oracle database and JDBC for database-independent connectivity. Implemented several agents as Servlets that run regularly to load the data into DB2 database from external systems. Designedtables in Oracle 11g database and implemented stored procedures (PL/SQL)to be integrated in the application using JDBC. Designed asynchronous messaging using JMS to exchange critical business data and events among J2EE components and legacy system. Apache AXIS2 web service implementation including SOAP and WSDL engine. Integrated process into build system which auto-generates REST API documentation from source code improving API documentation quality and availability while reducing maintenance costs. Implemented Java and J2EE Design Patterns like Façade, Abstract Factory, Singleton, Factory, Data Access Object (DAO), Service Locator, and Chain of Responsibility. Involved in unit testing using JUnit, and mock objects (Easy Mock). Implemented classes, interfaces and methods, constructors and object definitions using TypeScript. Registered Angularcomponents in modules using decorator functions like Component, ng-module.  Worked with Rest web servicesandNode Rest framework for backend services, used MongoDB (NoSQL) for database services and RESTful web services using Jersey for JAX-RS implementation. Used POSTMAN to test API end client using REST Web Services.   Used Jenkins as the integration tool and improved scalability of applications on cross-platforms. Used Maven to build and deploy to Tomcat server and Splunkfor log monitoring. Wrote JUnit test cases for unit, integration, and functional tests that run automatically in Jenkins builds.Used SVN for version control and JIRA for bug tracking and Project Management. Environment: Java, Spring MVC, JDBC, JMS,JSON, REST, Jersey, Hibernate, SQL, Oracle,MongoDB,WSDL,PL/SQL, HTML, CSS,JavaScript, Angular, TypeScript, JQuery,Windows, Jenkins, Apache Ant, Maven, SVN, Tomcat, Jira,  JUnit, POSTMAN NORTHERN TRUST BANK\t\t\t\t\t\t\tSep 2015 – Mar 2016 Chicago, IL Java/J2EE Developer Northern Trust is a financial services company catering to corporations, institutional investors and high net worth individuals. It assists its clients in wealth management, asset management, and corporate and institutional services. Responsibilities: Involved in requirements gathering, analysis, design, development, testing and maintenance phases of application. Used Spring framework to inject services, entity services, transaction management and concerns by factory class corresponding to the use case operation executing.  Supported and developed enhancements to existing implementation of correspondence components using JPA and WebServices/JMS. Handled the back-end operations using SQL, Stored procedures, triggers and developed the persistence structure using ORM-based Hibernate. Developed Mongo DB Data Access Layer implementing Mongo Repository interface from Spring Data. Extensively worked on Entity beans in the persistence layer, and their interaction with Oracle DB.Developed Spring Boot Microservices with microservice architecture using REST and ApacheKafka.  Implemented microservices for distributing different responsibilities of the system into different services to enhance cohesion and reduce coupling. Implemented load balancing among servers withSpringRibbon. Used Hibernate, object/relational-mapping (ORM) solution, technique of mapping data representation from MVC model to Oracle relational data model with SQL-based schema. Involved in creation of custom Docker container images, tagging, pushing images, integration of SpringBoot. Created Docker containers and consoles to manage the application life cycle. Used Node.js as a proxy to interact with REST services and also interacting with Database. Developed Web Enabled client FIX interface for order routing and developed test cases. Wrote JUnit and Mockito test cases for unit, integration, and functional tests that run automatically by Jenkins in the builds triggered by each push to GIT. Used Maven for build support. Built a web frontend using Spring MVC Framework with JSP, HTML, CSS, AJAX, and JavaScript. Implemented AJAX functionality using JQuery, JSON and XML. Worked on Angular2 and Bootstrap for building rich internet applications. Involved in WebLogic server configurations set up, setting up data sources and queues, and deploying the application. Environment: Java, Spring MVC, Spring IOC, Spring Boot, JDBC, JMS,HTML, CSS, JSON, JavaScript, AngularJS, JQuery, REST, Apache Kafka, Hibernate, REST, Microservices, Ribbon, MongoDB, SQL, Oracle, Eclipse, XML, Windows, Jenkins, Ant, WebLogic, GIT,  JUnit, Mockito, Maven PHILIPS\t\t\t\t\t\t\t\t\t\t\tMay 2014 – Jul 2015 Andover, MA Java/J2EE Developer Philips manufactures and markets consumer electronic, domestic appliance and personal care products, healthcare solutions, and lighting solutions for North American market. Responsibilities: Analyzed, designed and developed the system to meet the requirements of business users. Designed user interface screens using HTML, Bootstrap, CSS, Backbone.js, with JavaScript for client side validation. Used XML parser APIs such as JAXP (SAX) and JAXB in the web service's request response data. Involved in development of distributed objects like EJBs (session beans), Business objects/Domain objects that fit into the architecture and various components and helper classes that were commonly used throughout the application. Used AngularJS and JQuery to make the pages dynamic and implement two-way data binding. Implemented AJAX functionality using JQuery,JSON and XML. Developed the CRUD API for the POS Engine using Restful Web Services. Extensively used Spring IOC, Spring's Hibernate support, transaction management. Used Adapter Pattern and combined sequential and parallel Enterprise pattern to send and receive data from our third party system. Used Aggregator and Conversional pattern to aggregate the response received. Developed Helper Classes and Value data access objects which interact with Database. Developed and maintained a single-page application using Backbone.js for front-end server side layer, HTMLand CSS to deliver rich user experience. Designed and developed SOA enterprise solution with Talend Open Studio, Apache Karaf and Camel. Created/managed Mongo DB/NoSQL collections. Developed server side automation using Node.js scripting and connecting different types of SQL and NoSQL stores. Deployed the application in Web Sphere Application Server 6.0.1. Used SVN and Git as version control systems. Performed backend unit testing using JUnitand prepared code documentation for future reference and upgrades .Performed front end unit testing using Jasmine Test Framework for the JavaScript utility.  Designed and developed a number of RESTful web services that support JSON for other developers to access and to speed up development using Spring MVC, Spring Web Services, JSON, Log4j, RESTful, MySQL,  and Maven. Performed the code reviews and enforcing the standards. Coordinated with Quality Analysis team and handling issues. Interacted with different teams, and involved in reviewing deliverables. Environment: Core Java, J2EE, Spring MVC, JUnit, JSP, JSON, XML, JDBC, JBoss, Apache Karaf, Apache Camel, JavaScript, AngularJS, Backbone.js, Node.js, Hibernate, Jasmine Test Framework, Maven, REST, Log4j, HTML, CSS, Bootstrap, MongoDB, MySQL Server, SVN, Git, Talend QUINTILES INC.\t\t\t\t\t\t\t\t\tJul 2013 – APR 2014 Durham, NC Java/J2EE Developer Quintiles, Inc. (now IQVIA) was an American multinational company that served the combined industries of health information technologies and clinical research.  Responsibilities: Involved in coding, logic design, development of applications using Java/J2EE, Spring, Servlets, JSON, MVC, HTML. Used J2EE design patterns like MVC, Singleton, Factory, DAO, DTO and Service Locator etc. Worked onweb applications with Model View Controller capability to make development and testing of code efficient.  Developed the code for the tabulated listings, reports and charts for the performance of the employees using MVC design pattern and on Struts Framework(Struts MVC) and data access. Developed RESTful web services using Jersey, Spring framework and JAX-RS. Developed data access objects to encapsulate all access to the data source using Spring DAO module.  DevelopedJSON parser to extract data from the Endpoints using REST clients to display data to the front end. Developed the front-end featuring rich web interface implemented using HTML, CSS, Bootstrap, JavaScript toolkits. Used the Node.js as the web server and AngularJS, MVCframeworks in the development of the web applications. Implemented performance enhancement principles such as browser caching, DB connection pooling.Designed database schema on Oracle and wrote various stored procedures for DB operations. Worked on Service Oriented Architecture(SOA) environment for developing the services for the users. Developed session beans to include the business logic and wrote PL/SQL procedures for intensive database transactions to store data.Used Toad and Oracle9i SQL prompt to interact with the database. Provided quality assurance and cross browser compatibility testing during development phase. Involved in bug fixing during the System testing, Joint System testing and User Acceptance testing. Responsible for code reviews, writing unit test cases and unit test using JUnit. Monitored error logs using Log4j framework. Responsible for design of WSDL, XSD files and schemas. Designed and hosted SOAP based web services on WebSphere Application Server. Environment: Java/J2EE, Spring framework, SpringMVC, REST, SOAP, JSON, Jersey, Node.js, HTML, CSS, Bootstrap, JavaScript, AngularJS, SVN, Toad, Oracle, Spring DAO, PL/SQL, WSDL, XSD, SOA, WebSphere, JUnit, Log4j ENTHRALL TECHNOLOGIES\t\t\t\t\tAug 2011 – May 2013 Hyderabad, India Java/J2EE Developer Enthrall Technologies is an IT-services company delivering e-learning, mobile development, application services and product engineering solutions to clients across various industries. Responsibilities: Involved in several phases of the project including application analysis, technical design, development, debugging, testing & documentation and incorporation of user feedback to plan enhancements in the application system.Designed application architecture using OOAD tools like Rational Rose and MS Visio. Involved in designing and developing the web-based client using HTML5, CSS3, JavaScript, AJAX, JQuery, JSP and JSFs, and XML.Updated CSS layout to reflect the new changes as per the addition of new components.  Involved in development of Web services (SOAP) using CXF, JAX-WS, WSDL, XSD and JAXB to send fusion data to different upstream systems. Used Spring IOC to inject DAO objects into the Business delegate classes. Utilized Spring DI/ORM/JDBC modules. Developed the action classes, logic classes for executing business logic, DAO classes to access the Database using JDBC. Implemented the CRUD operations using different SQL queries onMySQL databases.Used JDBC to connect to back end database Oracle. Used PL/SQLextensively by developing different tables and running SQL queries on them.  Extensively used SOAP Web Services for providing services to other platforms. Developed the custom logging framework used to log transactions executed across the various applications using Log4j. Coordinated with QA Testing Team regarding testing issues like setting up builds, helping in issuing tickets, setting up Test Environment. Wrote JUnit test cases and tested the modules in development and QA environment. Used Antscripts and Maven in building the application and auto deploying it to the environment.  Environment: Core Java, J2EE, Spring, JUnit, JSP, Servlets, XML, JDBC, JBoss, WSDL, XSD, JavaScript, Oracle PL/SQL, HTML, CSS, JQuery, MS SQL Server, MySQL, Agile, Web Services, SOAP EDUCATION Bachelors in Computer and Science Engineering - JNTU, Hyderabad, India-2011."}