{"text": "Name: florence florence E-Mail: florence.florence@gmail.com Address: Luoyang, China Github: https://github.com/florence LinkedIn: https://linkedin.com/florence Phone No. 554950590016 PROFESSIONAL SUMMARY: Over 6 Year of experience in design, analysis, development and testing of web/enterprise based and client/server applications & relational database based applications.  Strong experience in the designing, developing and implementing enterprise applications using Java/J2EE, Core Java, JDBC, Servlets, JSP, Java Beans, XML and Web Services. Expertise in various open source frameworks like Struts2, Spring 4.0, JSF and ORM Technology like Hibernate 4.3. Hands-on experience in developing Microservices solutions using Spring Boot. Hands on experience with MVC (Model View Controller) architecture using  Spring, Struts and Hibernate and spring modules like Spring Boot, Spring IOC, Spring MVC, Spring AOP, Spring DAO and Spring JDBC. Expertise in using Web Service technologies like SOAP, REST API, WSDL, UDDI, and Service Oriented Architecture (SOA), to integrate the web-based applications. Extensive usage and good knowledge on Core Java concepts like OOPS, Multithreading, generics, IO, Collections, File Handling, Exception Handling, Garbage Collection. Experience with multiple web/application Servers like Apache Tomcat, IBM Web Sphere, Web Logic and JBOSS. Experience in Web-Development technologies like HTML, DHTML, CSS, JavaScript, jQuery, Angular JS, Node JS, XML, JSON, XSL/XSLT and AJAX. Strong experience in RDBMS like Oracle 11g, SQL Server, MYSQL, NOSQL like MongoDB, Cassandra, schema development, PL-SQL programming, Stored Procedures, and Triggers. Worked under Agile (XP, Scrum, TTD), RUP methodologies. Experience in writing Ansible scripts, maven build scripts, providing logging facility using Log4j, JUnit test cases and bug tracking. Experience in creating Splunk dashboard and writing SPL for all the search commands, functions and arguments. Strong development experience in different IDE’s like Eclipse, MyEclipse, Netbeans and Rational Application Developer (RAD). Experience in UML Modeling, Design Pattern (J2EE) like Singleton Factory Method, Facade, Front Controller, Delegate Pattern, MVC Architecture. Hands on experience with source control tools like Github, Subversion, CVS and Clear Case. Experience in developing test cases and test plans besides involving in Unit testing, Integration testing and User Acceptance testing.        EDUCATION:         Bachelor in Computer Engineering  TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE: Charter Communications St. Louis MO\t Jan ’18 – Till Date                                                                                            Role: Java/J2EE Developer Spectrum Mobile is the mobile service offered by Spectrum for the existing spectrum cable customers. D2C (Directed to Customer) is an application where customer can login and purchase spectrum mobile phone. In order to be eligible to buy the mobile phone, cable customer should be the primary account holder and should have active HSD service. If all the criteria are fulfilled, the cable customer is eligible to place mobile orders. Customer can also order the phone via Telesales portal where Customer Sales Agent will place the order. In this project we created various micro services using JAVA/J2EE, Spring Boot, Spring modules,  Rest web services, SOAP services, hibernate and other java technologies. Customer Information service will display customer’s information to the buy flow for a better user experience when purchasing a Phone and Plan. Customer information includes account ID, name, email, address and the users on the account. Similarly, we determine the user's eligibility to check if the Customer's current plan and devices are sufficient to enroll in the program. A credit score check is performed on the requesting customer based on User Guid (which is the unique identifier for each customer). Responsibilities: Involved in the analysis, design, development and testing phases of Software Development Lifecycle (SDLC).  Followed Agile and SCRUM methodologies and participate in daily scrum stand up. Designed and developed microservices and restful service endpoints using Spring Boot. Implemented various modules of Spring like Spring IOC for dependency injection, Spring AOP for cross-cutting concerns. Designed and developed Restful web services that communicate with oracle database in the backend and returns data in the JSON format. Expertise in developing and consuming Rest and SOAP based web services. Used Hibernate as the ORM tool to communicate with the database. Worked on Oracle & SQL Server as the backend databases, integrated with Hibernate to retrieve Data Access Objects. Created and configured hibernate annotations, performed persistent logic using HQL (Hibernate Query Language), named Queries and Criteria’s. Experience in database design, creation and management of Schemas, writing stored procedures, sql queries etc. Worked with REDIS server to store the data in the cache and quick retrieval. Designed and developed UI with AJAX, HTML, DHTML and JavaScript for interactive web pages. Designed and prepared Unit test case using JUnit and Log4j and removed the maximum bugs before passing on the application to the QA team. Used Core Java concepts like Collections, generics, multi-threading, file handling etc. to implement business logic. Bitbucket was used for the version control and source code management. Build Maven Script for the application and used Log4J for debugging.  Developed unit and integration tests for microservices using JUnit and Mockito. Involved in Test Driven Development (TDD) for writing Test Cases, Testing Application and Implementation plan. Hands on experience with the scripting languages like Linux and Unix. Used JIRA for task scheduling, quality control activities like defect tracking and fixing. Deploy new releases and ensure production stability and fixed production issues. Environment: Java 1.8, J2EE, Spring Boot 1.5.9, Spring IOC, Hibernate 4.3.11, REST, SOAP, Servlets, HTML, CSS, JSON,  XML, JSP, Spring Tool Suite, SQL Server, Oracle, Sql Developer, Jenkins, TDD, Tomcat, Bitbucket, Maven, LINUX, Unix, Redis Desktop manager, MobaXterm, Postman. Comcast Center, Philadelphia PA \t Aug ’16 – Dec’17                                                                                            Role: Java/J2EE Developer Wireless Gateway Swap (WG-SWAP) project deals with upgrading and replacing the old gateway with the new one in order to increase its feature and performance.  dh-xrs-onboarding is an application that creates a default system rule for all existing Xfinity Home subscribers (and all new subscribers) to notify when one or more security sensors is in low battery or sensor communication failure. The service includes onboarding existing/new XH accounts and provisioning all accounts with the default Battery System Notification Rule. The application is built using Spring Boot, core Java and RESTFUL Web Services. It is deployed in Tomcat Server. Responsibilities: Involved in understanding business requirements and provide technical designs and necessary documentation. Sound knowledge of networking protocols, integration of network and gateways.  Followed Agile and SCRUM methodologies and participate in daily scrum stand up. Implemented Microservices architecture to make application smaller and independent. Developed new Spring Boot application with microservices and added functionality to existing applications using Java/J2EE technologies. Used Hibernate as Object relational mapping tool for mapping Java Objects to database tables. Used Hibernate Query Language(HQL), annotations and Criteria for access and updating data. Implemented REST Web Services and performed the HTTP operations like GET, POST, PUT, Delete. Implemented multithreading to process multiple tasks concurrently in order to perform the read/write operations. Worked extensively with Core Java concepts like Collections, Exception Handling, Java I/O, and Generics to implement business logic. Developed web pages using with HTML, CSS, JavaScript, jQuery and Ajax. Used JavaScript for client side validations in the JSP and HTML pages.  Created Ansible scripts to deploy the application in different servers. Secured the API by implementing Oauth2 token based authentication/authorization scheme using spring security. Created Splunk (SPL) dashboard for searching, monitoring and analyzing data. Used YAML to maintain properties in the application to change dynamically based on the environment we use.  Created SQL queries and stored procedures to create, retrieve and update data from database. Used Postman for testing GET and POST responses of the application. Developed Maven Scripts to build and deploy EAR files.  Github was used for the version control and source code management. Followed Test Driven Development (TDD), responsible for testing, debugging and bug fixing of the application. Used log4j to capture the logs that included runtime exceptions and debug information. The application was deployed in LINUX environment.  Environment: Java 1.7, J2EE, Spring 4.3.1, Spring Boot 1.5.7, Hibernate 3.5, Tomcat 8.5, RESTFUL Web services, Servlets, JSP, core Java, JDBC, HTML, CSS, XML, JavaScript, jQuery, AJAX, Oracle SQL Developer, Ansible 2.3.1, Github, gerrit, Splunk, Log4J, JUNIT, Maven, Jenkin, Linux and Eclipse. JPMorgan Chase, Chicago, IL\t Jan ’15 – Aug ’16                                                                                             Role: Java/J2EE Developer Information Reporting Integrated Service (IRIS) is an information reporting application that consolidates the transaction information from multiple banking systems and organize the data in a structured manner that can be easily accessed and retrieved. This application is built using various Java frameworks like Spring, Struts, Hibernate and Web Services. It is deployed in WebSphere Application Server. Responsibilities: Involved in different activities of software development like analysis, design, development, unit testing and test case creation. Developed the application framework following the MVC architecture using Struts and Spring.    Implemented Struts2 to write Action classes for handling requests and processing form submissions.    Used Struts Validator for server side and client side validations.    Implemented Spring Dependency Injection (Spring IOC) and Spring AOP. Used Spring DAO module to interact with database in DAO layer. Experience with Spring JDBC to connect with the database and execute SQL queries. Implemented Soap based Web Services using JAX-WS framework. Used Spring Batch for processing large amount of data like transaction management, job processing, resource management and logging. Developed the User Interface using HTML, CSS, JavaScript, JSON, JSTL and AJAX. Developed application using Struts, Servlets and JSPs. Used XML, XSL and XSLT for developing a dynamic and flexible system for handling data. Developed Junit test cases for all the developed modules.  Setup and configured WebSphere Application Server for deployment and testing. Built and deployed the application using Maven. Created PL/SQL queries and stored procedures to create, retrieve and update data from database. Subversion was used for the version control. Followed Agile and SCRUM methodologies and participate in daily scrum stand up meetings during development process. Extensively used JUnit for unit testing, integration testing and production testing, following the Test-Driven Development (TD) Environment: Java 1.7, J2EE, Struts2, Spring 3.0, Spring JDBC template, Oracle 11g, WebSphere Application Server 8.5, core Java, Log4J, JUNIT, SOAP, JAX-WS, Servlet, JSP, JDBC, HTML, CSS, XML, AJAX, JavaScript, JSON, Maven, JIRA, Jenkins and Eclipse. Softech Foundations Private Limited, Nepal\t\t\t\t\t\tMar ’11– July ’13                                                                                            Role: Java/J2EE Developer Softech Foundation Private Limited is a software development company, focuses on providing IT consulting services, web development and software development, re-engineering solutions and ready-to-deploy business applications for a number of industries including e-commerce, banking and finance, medicine, manufacturing. Responsibilities:  Involved in different activities of software development like analysis, design, deployment, unit testing and test case creation. Implemented Spring MVC framework which includes writing Controller classes for handling requests, processing form submissions and also performed validations.  Implemented Spring Dependency Injection (Spring IOC). Used Spring AOP for solving crosscutting concerns like keeping logged data and transactions details etc. Hibernate framework was used in persistence layer for mapping an object-oriented domain model to Oracle Database. Developed application DAO layer using Hibernate DAO support. Built Web Services with top-down/bottom-up approach depending on the need. Developed Web Services for data transfer from client to server and vice versa using Apache Axis, SOAP, WSDL and UDDI. Developed SOAP based Web services using JAX-WS framework. Used Java Fundamentals and OOPS concepts like inheritance, polymorphism, abstraction to develop the code. Designed and developed the UI components using JSP, HTML, CSS, JavaScript, AJAX. Used Enterprise Java Bean(EJB) to develop business logic and coded reusable components in Java Beans. Created PL/SQL statements for the effective retrieval and storage of data from the database. Implemented Design Patterns like Front Controller, Business Delegate, Data Access Objects, and Singleton. Developed Unit Tests and Test Suites. Used Maven based scripts to build and deploy the applications on the Server. Used Subversion for Version Control Management. Used log4j for writing into application and error logs. Good knowledge of Data Structure and algorithm. Developed Use Case, Class diagrams, Object diagrams, and Sequence diagrams using UML. Environment: Java 1.5, J2EE, Spring MVC, Hibernate 2.5, Spring IOC, Spring AOP, SOAP, JAX-WS, SOAPUI, Servlets, HTML, CSS, JSP, JavaScript, AJAX, SQL, HQL, Tomcat 5.0, Oracle 10g, PL/SQL, Subversion, Log4J, JUNIT, LINUX."}