{"text": "Name: emma emma E-Mail: emma.emma@gmail.com Address: Changzhou, China Github: https://github.com/emma LinkedIn: https://linkedin.com/emma Phone No. 257482107413 _________________________________________________________________________________________________________________\nSummary: Around 7years of professional experience Java, J2EE technologies and Big Data Hadoop in application cycle implementation from requirement gathering Analysis, design, development, unit integration testing, Deployment, and support. Involved in all phases of software Development Life cycle in large scale enterprise software using Object Oriented Analysis and design. Good working knowledge of Extreme Programming using Agile methodology with iterative and incremental software development. Extensive experience in developing application using Java, JSP, servlets, JavaBeans, JDBC, SQL, Web services with SOA, AJAX, JavaScript and XML. Strong Working Experience in design, development and implementation of several J2EE frameworks like Struts, spring, Hibernate, and EJB. Expertise in web page creation using Java, Java Script, JSF’s, SQL, PL SQL, HTML5,CSS3, XML languages. Strong experience in web services (Soap, Restful) that includes components like SOAP, WSDL and JAX-RS, Apache-CXF.  Developed website using Java Script framework such as Angular.JS, Node.JS, and Backbone.JS. Experience in Developing web applications on framework such as Spring Batch, Spring Security, and Spring MVC. Experience in Working on Oracle and MySQL databases to write complex SQL queries and familiarity with databases like SQL Server, MongoDB. Experienced in developing Ant and Maven 2.x/3.x scripts to automate the compilation, deployment and testing of Web and J2EE applications. Experienced in build, deploy multi module applications using Maven, Ant and CI servers like Jenkins. Experience using persistence framework like Hibernate/JPA for mapping Java classes with database. Proficient in Shell and Perl Scripting. Good Experience in Hadoop Components and message Broker Kafka, and JMS. Worked experience in Object Oriented Analysis, Design and Development of Applications with UML diagrams using Enterprise Architect. Expertise in Developing and Deploying Enterprise Java Beans (EJB) on Application/Web Servers like Web Logic, Eclipse, Tomcat, IBM RAD, WebSphere and JBoss. Hands on experience in Design Patterns, Data Structures, XML Schema/DTD validations and Ant build scripts. Proficient in using CVS, SVN and GIT. Exposure to complete software life cycle from client requirement analysis to deliver. Efficient in Defect Management for resolving Integration Issues, System Testing Issues, User Acceptance Issues, Production Issues. Hands on experience in writing Automation test scripts using Junit and static analysis using JTest, JMeter. Technical Skills: Professional Experience: Rexel Holdings/Gexpro, Shelton, CT                                                                                   Jan ‘16- Nov’16 Java Developer\t Responsibilities: Followed agile methodology to promote Iterations, collaborations and process adaptability and participated in Scrum meetings though out the life cycle of Project. Involved in phases of SDLC in requirements gathering, Analysis, Design, Development and Testing. Developed web UI pages using HTML5, Node JS, Java Script Angular JS, CSS, Ajax, JSP n Tag Libraries under MVC Architecture. Used Spring MVC to define Controller, Model and View, defining internal view resolver in configuration XML. Involved in implementation of application using conventional design practices (SOA-Service Oriented Architecture, MVC-Model View Controller), well versed with core Java concepts like collections, multithreading, serialization, Java beans. Integrated Java Modules on spring framework and implemented J2EE design pattern such as singleton, prototype and DAO.  Used spring framework to define beans for services, Entity Services and corresponding depended services. Involved in implementing Logging, Exception Handling and Transaction Management using spring AOP. Involved in the preparation of WSDL files based on UI pages and worked with Multithreading approach for handling integration of modules while functionality process. Developed RESTful web services using JAX-RS, Apache CXF and spring frameworks and persistence using Hibernate and JPA ORM frameworks. Written code to create EJB stateless session factory to create Hibernate session. Involved in ORM mapping for Associations. Inheritance and fetching strategy, performing CRUD operations using angular JS and Backbone JS, and managing second level cache using Hibernate. Wrote services to store and retrieve user data from the MongoDB for the Application on devices. Used Subversion to implement version control System. Created a deployment procedure utilizing Jenkins CI to run the Unit Tests, build Documentation using Natural Docs and create packages for installation and setup the application and its dependencies. Maintaining existing scripts and writing new scripts to automate the existing environment using Maven. Used Maven build scripts to build the application and deploy on WebSphere Application Server. Performed unit testing using Junit with Mockito, System testing, Regression testing and integration testing. Developed different modules of the application using Eclipse IDE. Worked in RDBMS implementation using SQL, PLSQL on Oracle database. Environment:  Java, Spring frame work, JMS, Rest, Hibernate, EJB’s, Eclipse, HTML5,CSS3, Junit, Java Script, XML, SOA, Design patterns, WebSphere, Jenkins, SQL, Oracle, Angular JS, Maven.\n AIG Houston, TX                                                                                            Nov’14- Dec’15Role: Java Developer Responsibilities: Involved in study of various Functional Specifications of project. Interacting with the Business Analyst and Host to understating the requirements using the Agile methodologies and SCRUM meeting to keep track and optimizing end client needs. Used Maven Scripts to build and deploy war files to QA environment. Extensively used Spring MVC and Hibernate Framework for data handling. Created connections to database using Hibernate Session Factory, have used Hibernate API’s for retrieval of data using Hibernate Transaction Control. Implemented Spring MVC application framework to create and configure of java beans using Spring IOC and Multithreading. Implemented Micro-Services Architecture for various components using Spring Boot and Apache Tomcat. Developed a common event Handling and Validation Module to be used Application Wide Built with JSF’s MVC framework. Used spring framework for removing hard coded dependencies (Dependency injection), integrated with Hibernate, Spring Service Bean and Spring MVC controllers. Involved in writing Spring Configuration using XML file and Annotations that contains object declarations and dependencies. Configured JDBC data source and JMS Connection factories in the application server Coded JSP pages and used JavaScript for client side validations and to achieve another client-side event handling. Created the Node JS server combined with socket.io to build MVC framework from front end too Angular JS to Back end MongoDb, to provide broadcast service as well as chatting service.  Worked on Real time Data Streaming using Kafka to store it in NoSQL DataBase. Composed and executed MongoDb scripts to insert and update NoSQL database automating data changes and reporting. Developed user interface to satisfy the business requirements using Swing, JSP (java script, and jQuery), HTML, CSS, and XML. Designed and created DAO using data modelling in the integration layer. Implemented the application using the concrete principles laid down by several design patterns such as Composite View, Session Façade, Business Delegate, Bean Factory, Singleton, Data Access Object, and Service Locator. Developed the back-end logic layer by using most of the Core Java 8 features such as Collections Framework, Interfaces, Multi-threading and Exception Handling programming.  Using SOAP and Rest web services to retrieve provider's data and used SOAPUI to test the web services. Exposed Stateless session beans as restful web services using Jersey JAX-RS. Customized RESTful web service using Spring RESTful API, sending JSON format data packets between frond-end and middle tier controller. Worked and configured with GIT and Jenkins repository. Used AJAX to implement user friendly and efficient client interface and Involved in designing the front-end using HTML, CSS, Bootstrap, Java Scripts, and AngularJSper the instruction they provided. Preparation and execution of test scripts using JMeter and SOAP UI tool to perform Web Services testing. Involved in integrating Web Sphere Portal Server with WebSphere Process Server involving SOAP Web Services, WS-Security using JAX-WS, and JAXB. Used Log4j for logging for debugging, warnings, errors etc. Used the Java Collections API extensively in the application. Environment: Core Java/J2EE, Angular JS, HTML, CSS, Bootstrap, JMS, JUnit, Kafka, MongoDB, Mockito, Eclipse IDE, Spring MVC, Spring, Node JS,Linux, Hibernate, Maven, JMeter. \nFedEx Corporation, Dallas, TX                                                                                            Sept ’13- Oct’ 14 Role: Java Developer   Responsibilities: Implemented MVC design pattern using Struts Framework.  Form classes of Struts Framework to write the routing logic and to call different services.  Created tile definitions, Struts-config files, validation files and resource bundles for all modules using Struts framework. Developed web application using JSP custom tag libraries, Struts Action classes and Action. Designed Java Servlets and Objects using J2EE standards.  Developed UI pages With JSF Framework. Used JSF frame work in developing user interfaces using JSF UI components, Validator, events and Listeners. Used JSP for presentation layer, developed high performance object/relational persistence and query service for entire application utilizing Hibernate.  Developed the XML Schema and Web services for the data maintenance and structures.  Used Web Sphere Application Server and RAD to develop and deploy the application.  Worked with various Style Sheets like Cascading Style Sheets (CSS).  Designed database and created tables, written the complex SQL Queries and stored procedures as per the requirements.  Involved in coding for JUnit Test cases, ANT for building the application. Environment: Java/J2EE, Oracle 10g, SQL, PL/SQL, WebLogic 8.0,JSF’s, Linux, HTML, AJAX, Java Script, JDBC, XML, UML, JUnit, log4j, ANT, Eclipse IDE. Progressive Insurance                                                                       Oct ’12-Aug’13 Mayfield village, OH Java/J2EE Developer Responsibilities:  Designed the system per J2EE specifications and MVC architecture.  Involved in creating Use Case & Sequence UML diagrams through IBM Rational Rose.  Used Data Access Object (DAO) pattern to introduce an abstraction layer between the business logic tier (Business object) and the persistent storage tier (data source).  Used Struts validator and designed front-end using HTML, JavaScript, CSS, and JSP Pages.  Developed the application under J2EE architecture using Struts 2.x, spring, Spring Batch, Java Beans. Developed application presentation layer using Struts 2.x framework that includes modules, Tiles, Resource bundles for Internationalization.  Design of technical solution for the WebLogic JMS module and Netscape LDAP.  Used JDBCto interact with Oracle database.  Developed complex queries and Multiple Joins in MS SQL. Developed PL/SQL stored procedures and functions in oracle.  Developed Business Delegate classes for loose coupling between Presentation tier and Business tier  Maintained code using GITHUB. Developed and deployed the application on WebLogic server using ANT scripts.  Used Rational Clear Case for version controlling.  Used Rational Clear Quest for tracking errors & bugs in the project source code  Involved JUnit test cases for Business logic & performed unit testing before sending it to User Acceptance testing (UAT).  Environment: JDK 1.7, J2EE, JSP, Servlets, JavaBeans, Struts 2.x, GIT, JMS, Web GUI design, WebLogic Server, Eclipse, Oracle, Tag Libraries, Rational Clear Case, Spring security, Spring Batch, Rational Clear Quest, PL/SQL, LDAP server. \nCountry Club (India) Limited, Hyderabad, India \t\t                       June’10-Aug’12 Role: Java developer Description: This is a site, which operates in the rental markets for student and landlords seeking renters to rent their properties. It reduces the amount of time used by students in their search for apartments for rent and provides a convenient and cost efficient means of reaching students using cutting edge technology. There will be time and cost savings for landlords and rental companies who are in student cities. The various options involved in the site are Posting, Reporting Feature, View list and Wish list, Photo/Image Management, Automatic workflow/information flow within the site and Search Capabilities Responsibilities: Extensively worked on Struts Framework. Created used interfaces using JSP. Developed the Web Interface using Servlets, Java Server Pages, HTML and CSS. Developed the DAO objects using JDBC. Business Services using the Servlets and Java. Developed and modified Servlets to accept and process request from the clients. Developed various objects using java and HTML and DHTML to maintain well-structured GUI and to interact with Controllers to get data from Oracle database. Used JDBC to connect the J2EEserver with the relational database. User input validations done using JavaScript and developed use cases using UML. Involved in front end development of report generation module using Swing. Extreme programming methodologies for replacing the existing code and testing in J2EE environment. Developed java classes for business layer.  Developed database objects like tables, views, stored procedures, indexes.  Involved in testing and fixing the bugs.  Environment: Java, J2EE, JSP, Servlets, Struts, HTML, Maven, Java Script, Swing, JDBC, Oracle (PL/SQL), DAO, Tomcat, JUnit, Eclipse. Education: Bachelor of Technology: Computer Science and Engineering –    Kakatiya University Warangal, India "}