{"text": "Name: margaret margaret E-Mail: margaret.margaret@gmail.com Address: Wuxi, China Github: https://github.com/margaret LinkedIn: https://linkedin.com/margaret Phone No. 13081650603 Career Objective Almost 4+ years of total IT experience with a dedicated professional JIRA Administrator with an excellent knowledge and background working with such programs as JIRA Portfolio, JIRA Service Desk, JIRA Agile, JIRA Capture and a large variety of other programs/plugins. Strong experience with managing JIRA in highly available environment. Designed, built, and managed techniques for deploying specific automated builds to isolated development and built assurance environments. Administration and management of Atlassian tool suites, (installation, deployment, configuration, migration, upgrade, patching, provisioning, server management etc.). Supports the integration of existing and new applications within the current infrastructure, including but not limited to: Fisheye, Crucible, Crowd, Bamboo, and Stash. Experience in writing Jira API Tools to auto-move Service Desk tickets of one issue type to a Jira project of another issue type and to extract the list of Jira users with the respective Jira Groups and Project Roles. Experience in using DOM, SAX, DOM4J and Xml Beans parsers to process, validate, parse and extract data from XML files. Implementing JIRA, JIRA Agile and Confluence best practices. Self-motivated with excellent abilities to learn new languages and other concepts quickly. Possessing excellent interpersonal skills and good abilities to communicate among team members. Experience in maintaining Atlassian products like JIRA, Confluence, Fisheye, Bamboo, Crowd, Cloud instance etc. Good experience working with different Operating systems like Windows, Linux and iOS. Strong at problem solving and understanding new technical concepts quickly and produce meaningful results. Improved the stability and performance of the Atlassian tool suites. TestRail supports integrating with all major JIRA versions, including JIRA Cloud, JIRA Server 5.x - 7.x and any future versions. Implementing JIRA, JIRA Agile and Confluence best practices. Provided multiple branching models for different Application release models. Configured and installed software for end-users' desktops, scanners, terminals, and pos equipment. SKILLS:            Operating Systems:    MS Windows XP/2000/NT/98, UNIX, Linux.            Scripting Languages:  JavaScript, XML, HTML, PERL, Shell Programming Work Experience Faraday future Los Angeles, CA \t\t\t\t\t\t\t June ‘2018 – Till Date Sr. Jira / Atlassian Admin Responsibilities: Supporting complex Atlassian environments and have experience with integrating Atlassian tools with other internal & external systems.  Provided ongoing support and configuration for JIRA projects, workflows, screens, fields, permissions, and other administrative tasks  Addressed user questions and develop training as needed, worked on incoming questions and inquiries related to JIRA applications.  Created JIRA projects, templates, workflows, screens, fields and other administrative activities  Prepared projects, dashboards, reports and questions for all JIRA related services.  Implemented new JIRA workflows for the QA teams and worked on Splitting JIRA servers’ configuration  Users Administration and Handling Licenses Performed JIRA configuration  Worked on JIRA customization - Issue Schemes, Workflow Schemes, Field Configuration Schemes, Screen Schemes, Permission Schemes, Notification Schemes  Worked on Setup JIRA for Test Case Management  Served as Lead Technical resources for all Atlassian projects Extensively worked on UNIX Editor Commands to edit the logs.  Installed and upgraded JIRA in production to keep up to date.  Installed and managed plug-ins for JIRA and Confluence in production environment.  Xerox Corporation Webster, NY\t\t\t\t\t\t\t\t June 17 – June 18 Jira Engineer / Atlassian Admin  Responsibilities: Worked on JIRA for tracking and updating the JIRA tickets and per assigned.  Created SSL or https to all the new migrated application for security purpose.  Implemented new JIRA workflows for the QA teams and worked on Splitting JIRA servers configuration. Worked with JIRA Service Desk 3.0.x to set up service desk, create service desk request types, and make queues for service desk teams.  Worked with various teams on setting new JIRA & Confluence instances for new teams. Setup JIRA \"Timesheet Report\" plugin, to help users for time-tracking on their dashboards using a JQL or by configuring manually.  Provided ongoing support and configuration for JIRA projects, workflows, screens, fields, permissions, and other administrative tasks.  Experience in complete Software Development Life-Cycle (SDLC) process with expertise in Planning, Reviewing Specification, Documentation, Scheduling, Design, Development, Testing, Implementation and Maintenance of Applications.  Contracted to serve as the JIRA Systems Administrator for the international JIRA /Confluence infrastructure, including all associated programs, plugins and systems.  Created Custom workflows, custom screens and custom fields on JIRA.  Created events, email notification schemes and assigned project roles on JIRA.  Worked on JIRA Cloud as part of evaluation.  Help users to have GIT web access.  Installing Bit bucket on windows server and installation of Bit bucket data centre. Created custom dashboards, advance filters and formula based fields.  Created new permission scheme so end users only see the projects they need to see.  Installed and upgraded JIRA in production to keep up to date.  Configure the JIRA workflow for the project for improvement processes for screens, workflow procedures and reports of applications as per business requirement.  Provided End- User training on JIRA Suite and documentation.  Created a step by step guide to create a project in JIRA.  SSL (Secure Socket Layer) implementation. Worked on Tempo Planner plugin and Out of assistance. Created custom templates for use within confluence. Managed and upgraded Jira and confluence 7.x-7.5.2  Environment: JQL, LINUX, UNIX, TOMCAT, SHELL, BASH, Confluence TD Ameritrade,  Bethesda, MD\t\t\t\t\t\t\t           Feb, 16-Jun, 17 Jira Engineer / Atlassian Admin\t Responsibilities:          \t\t Experienced in Installing, Upgrading Atlassian products. Integrated JIRA and Confluence as trusted applications. Implemented Crowd with Single Sign on for the Atlassian applications. Created Confluence pages detailing customer fiscal year goals/objectives and pertinent information regarding JIRA customer configuration. Created and implemented recommendations to improve scalability and performance. Installed software, patching, upgrading and maintenance of operating system. Worked as team JIRA administrator providing access, working assigned tickets, and teaming with project developers to test product requirements/bugs/new improvements. Provided training to technical and non-technical teams to use Atlassian tools. Managed various development tools, testing tools and monitoring tools. Worked on JIRA for Bug Tracking. Worked on JIRA for Test Case Management. Worked on JIRA & Agile (formerly known as Green hopper) Best Practices. Worked on Integrating JIRA with Confluence. Created several customer accounts and maintained users. Involved in Atlassian Plugin Development using Java. Evaluated and repaired existing Atlassian Suite installation in preparation of upgrade. Creating plan for projects with Portfolio plugin. Serve as a sp ecialized advocate and the essential implementer for new capacities in JIRA. Created dashboards, reports and inquiries for all JIRA related administrations. Compile and analyze development and operational bug reports. Environment: JIRA, Java/J2EE, Tomcat, Jboss, SVN, Anthill Pro, Ant, Maven, shell, bash. Thomson Reuters, Hyderabad, India \t\t\t\t\t\t\t\tAug ’13 – Dec ‘14 Linux Admin\t\t\t\t\t\t\t\t Installed and upgraded Linux Red hat OS 5/6: Anaconda and kick start installation. Secured Linux file access by modifying the file and directory permissions, modified file ownership, restrict a file based on a set of specified restrictions using UGO permission scheme, grant or block file access using ACLs. Repair and maintain company computers, peripherals, and telephone equipment. Provided support to internal and external organizations by being the primary data contact for the plan site. Writing scripts for automation using Shell programing, taking back-up of Critical Data backup and mail back up and restoring. Installation and configuration of Red Hat Linux EL5, maintaining all electrical equipment’s which is connected to servers. Basic knowledge of installing a LAMP server and securing it, Installing and configuring the SSH and FTP server in Linux. Setup NFS Servers, Diskless clients and Auto clients and automated the file systems using direct and indirect maps. Also, setup entries in /etc/exports and mounted the disks onto the client systems by adding entries to /etc. / FSTAB. Configure RAID mirroring on Linux platform, executing tasks and Working effectively at the shell command prompt. Configuring, administering and troubleshooting of NFS, AUTOFS, NIS (master, slave and client) and DNS in multi-platform network Security Implementation in servers using different tools, Configured and maintained Fortinet Cyberoam Firewalls. Administration/Configuration of Print Servers/Clients in the Network. Activities include user administration; startup and shutdown scripts; crontab, file system maintenance, backup scripting and automation using shell scripting for Red Hat Linux systems. Environment: RHEL 5/6, UGO, ACL, Shel Scripting, LAMP, SSH, FTP, NFS server, RAID, Firewalld, Crontab. Technical Skills Middleware:\t\t\tApache Tomcat, WebLogic, JBoss,\n\t\t\t\tWebSphere (WAS), IBM. Tools:\t\t\t\tMS Office Suite, Nexus, Confluence, Opnet, Jira, Confluence. Operating systems: \t\tLINUX, MS DOS, UNIX Scripting Language:\t\tJAVASCRIPT, XML, HTML, PERL,\n\t\t\t\tSHELLPROGRAMMING Education:   Bachelor’s in computer science from JNTU Hyderabad (2010-2014) Master’s in computer science(2015-2016)"}