{"text": "Name: agnes agnes E-Mail: agnes.agnes@gmail.com Address: Anqing, China Github: https://github.com/agnes LinkedIn: https://linkedin.com/agnes Phone No. 947862097788 PROFESSIONAL SUMMARY Over 9+ Years of Experience in IT industry and specialized experience in Business Intelligence tool with major focus on MicroStrategy Product Suite (MicroStrategy Desktop, MicroStrategy Intelligence Server, MicroStrategy Narrowcast Server, MicroStrategy Architect, MicroStrategy Administrator, MicroStrategy Web elements) Very strong in Data Warehousing Concepts and good knowledge in ETL process. Good Understanding of Logical and Physical Data Models. Extensive Experience in Software Analysis, Design, Development and Production Support of Business Intelligence application using Microstrategy. Hands on experience working on creating and integrating Microstrategy Reports and Objects (Attributes, Filters, Metrics, Facts, Prompts, Templates, Consolidation and Custom Groups).  Experience in Microstrategy Office, Narrowcast, User security & management, Object Manager & designing reports (grid, drilldown, ad hoc, OLAP cube) and dashboards in Microstrategy10.2/10/9.4.1/9.3.1/9.2.1/9.0/8.1.2. Excellent experience configuring VLDB properties to fine-tune reports. Experience with Data Blending for better Performance and multisourcing. In-depth understanding of fundamental Data-Warehousing concepts such as Dimensional Modeling, Star and Snowflake Schemas, Datamarts, Security and deployment, FACT and Dimensional tables, Logical and Physical data modeling. Experience in Microstrategy schema & application layer, report analysis &report services (dynamic dashboards) design, development, implementation, migration and testing. Strong troubleshooting capabilities in MicroStrategy Desktop and Web. Extensively worked on delivering reports and business intelligence solutions on the web using Microstrategy Narrowcast Server. Specialized in developing stored procedures, functions, packages and database triggers using Oracle SQL and PL/SQL. Proficient in using Oracle 10g/11g, SQL Server 2000/2005. Hands-on experience in creating Mobile (iPad/iPhone) dashboards. Knowledge in Optimization of Data Migration, ETL Processes. Excellent exposure to software development life cycle (SDLC). Provided support for QA, UAT and deployment. Exposure to client interaction, user-requirement analysis and User support. Good leadership qualities with experience in training developers, advising technical groups on coding best practices and problem solving skills. Experience with various project management methodologies including Agile and Water Fall. Team player and self-starter with good communication skills and ability to work independently and as a part of the team. Experience in working with big projects. Excellent multitasking capability, efficiently plan and prioritize projects with strong technical and business management EDUCATION Bachelors in Computer Science from VNSGU, Surat INDIA-2008. TECHNICAL SKILLS PROFESSIONAL EXPERIENCE  Nielsen, Tampa,FL\t\t\t\t\t        June’ 17- Till Date Microstrategy Developer Responsibilities: Worked on creating and integrating Microstrategy Reports and Objects (Attributes, Filters, Metrics, Facts, Prompts, Templates, Consolidation and Custom Groups). Extensively worked in creating and integrating Microstrategy reports and objects (Attributes, Filters, Metrics, Facts, Prompts, Templates, Consolidation and Custom Groups) with the data warehouse. Huge amount of performance improvement done on existing documents by using main strength of MicroStrategy like report cache and intelligent cubes.    Extensive use of dynamic dashboard and scorecard to predict the trend in market and very interactive presentation and use of data. MicroStrategy web (View, interactive, Editable and flash mode), Subscription feature to improve the performance and mobility of the group. Created reports for Daily, Weekly, Monthly, Quarterly and yearly for various transactions of Business. Extensively worked in developing Report Services Documents, HTML Documents according to Business Requirements Expertise in creating complex reports like Drill Down and Sub Reports and implementing Conditional Formatting, Interactive Sorting, Grouping and Filtering. Highly interactive and complex report in MicroStrategy Desktop and web and provide production support. Created advanced grid reports, consisting of data analysis by combining a template with filters. The end-users were able to generate ad-hoc report by drilling up, down, within and across dimension or anywhere. Environment:MicroStrategy 10.3 ,10.4 Product Suite (Architect, Developer, Web, Distribution services, Object Manager) Windmill Lab, Fremont, CA                                                      Mar’ 16- May’ 17 Microstrategy Architect/Developer Responsibilities: Involved in Analyzing, developing and migrating of retail and pharmacy reports. Extensively worked in migrating SSRS , OBIEE, WEB FOCUS reports to MicroStrategyreports Involved in Analyzing, developing and migrating of retail and pharmacy reports. Extensively worked in migrating SSRS , OBIEE, WEB FOCUS reports to MicroStrategyreports Highly analytical in developing the methods and measures to meet requirements and solve any issues that arise in development phase. Possesses excellent communication, documentation and organization skills with the ability to adapt to a new environment & meet stringent deadlines. Created subscriptions to email reports to various groups and individuals Served as a liaison between the development & business requirements teams and between development and QA teams. Conducted data validation testing to ensure data quality. Worked on upgrading and testing the MicroStrategy project created in Micro Strategy version 9.4.1 to Version 10.2,10.3 Involved in documentation and end-user training on using of existing templates for Adhoc reporting. Created and implemented MicroStrategy Reports by creating Schema and Public Objects like attributes facts, hierarchies, metrics, filters, Transformations, custom groups and Consolidations. Used Administrator tools like Project Merge and object Manager to move the objects from one environment to another environment.  Developed free form SQL reports to meet user requirements. Involved in troubleshooting MicroStrategy prompt, filter, template, consolidation, and custom group objects in an Enterprise Data Warehouse team environment. Designed Prompts and Filters to generate reports in grid and graph mode. Created Intelligent Cubes to speed up the process of data retrieval and used Dynamic Sourcing. Worked extensively on Performance tuning to reduce the run time of MicroStrategy, reports drastically by changing the VLDB properties, reducing the number of SQL passes, additional index creation etc. Improved the performance of the report by configuring ODBC connection while using multisource. Created Dynamic Dashboards showing Company’s yearly performance using various graphs and widgets. Created Logical Views for developing reports used in MicroStrategy environment. Extensively worked in both Ad-hoc and standard reporting environments and involved in creating Reports scalable to large volumes of data.  Environment:MicroStrategy 10.2 ,10.3 Product Suite (Architect, Developer, Web, Distribution services, Object Manager), SQL Server 2008R2,2012, Visual Studio 2008, Report Manager, Windows 2010, Composite,Oracle 11g, Toad, OBIEE 10.1.3.3. Essilor, Dallas TX                                                              June’ 15- Feb’ 16 Sr. Microstrategy Developer Responsibilities: Closely involved in gathering requirements, developing and testing  along with business and data analysts  Working on MicroStrategy Desktop, Microstrategy Web, Microstrategy Narrowcast Server.  Worked on creating and integrating Microstrategy Reports and Objects (Attributes, Filters, Metrics, Facts, Prompts, Templates, Consolidation and Custom Groups). Worked on report services (dynamic dashboards) design, & mobile Dashboards Worked on Dynamic Dashboard for sales force, Operational and prescription analysis. Proof of Concept for Mobile development and Implementation of App’s for iPad and iPhone. Did analysis on some of the widgets (Media widget) which can be used in Microstrategy landing page on mobile portal. Worked on Microstrategy mobile portal landing page.  Created dynamic dashboards using widgets for Mobile. Designed and Developed Reports and Dynamic Dashboards with challenging requirements. Worked extensively with the End Users to finalize the dashboard layouts and also worked on fine detail formatting for a desired look and feel.  Worked with data architect to design and build MicroStrategy schema.  Worked on Schema objects (creating attributes and defining their relationship). Customized reports, Documents and deployed them to MicroStrategy web.  Worked on POC project, creating security filters in group level and for users. Responsible for various administration tasks like Tuning, Caching, specifying Query Governing Thresholds, and Report Optimization.  Involved in creation of logical views and Freeform SQL Report. Migrated objects from Dev to QA by creating Packages through object manager. Involved in troubleshooting MicroStrategy prompt, filter, template, consolidations, and custom group objects in an enterprise data warehouse team environment. Worked on delivering reports and business intelligence solutions on the web using Microstrategy Narrowcast Server. Performing Unit test for the reports developed.  Environment: Microstrategy 9.3/9.4.1 (Architect, Desktop, Narrowcast Server, Object Manager) Oracle, Toad, HTML AXA Equitable, Jersey City, NJ                                       \t\tApr’14 – May’15                                                                                MicroStrategy Architect/ Developer. Responsibilities: Involved in Requirements gathering by interacting with the Business Users. Generated and implemented MicroStrategy Reports by creating Schema and Public Objects like attributes facts, hierarchies, metrics, filters, Transformations, custom groups and Consolidations. Used Administrator tools like Project Merge and object Managerto move the objects from one environment to another environment. Involved in troubleshooting MicroStrategy prompt, filter, template, consolidation, and custom group objects in an Enterprise Data Warehouse team environment. Designed Prompts and Filters to generate reports in grid and graph mode. Created Intelligent Cubes to speed up the process of data retrieval andused Dynamic Sourcing. Designed various prototypes of dashboards using MicroStrategy, which would give ability to the users to drill down to claim (lowest) level. Created new users, roles, privileges, shared folders, access controls Lists using Security Roles in MicroStrategy. Created various subscriptions and schedules. Worked extensively on Performance tuning to reduce the run time of MicroStrategy, reports drastically by changing the VLDB properties, reducing the number of SQL passes, additional index creation etc. Improved the performance of the report by configuring ODBC connection while using multisource. Created Dynamic Dashboards showing Company’s yearly performance using various graphs and widgets. Created several Custom tables and Views for developing reports used in MicroStrategy environment. Extensively worked in both Ad-hoc and standard reporting environments and involved in creating Reports scalable to large volumes of data.  Environment: MicroStrategy 9.3.1 (Architect, Desktop, Narrowcast Server, Object Manager, Enterprise Manager, MDX Adapter) Oracle, PL SQL Perrigo Company, Allegan, MI                                                           Feb’13-Feb’14 MicroStrategy Developer Responsibilities: Participated in the end user meetings to get the business requirements from users to create reports.  Created Conceptual Approach and Detail Design Documents for the reports for the acceptance and including installing, configuring, and administration of MicroStrategy tools. Created Attributes, Facts, Advanced qualification Filters, Custom groups, Prompts, Hierarchies, compound metrics, filters, object prompts, custom expression filters according to the business needs. Communicated with the business, Data Modelling team and ETL team in various levels for the stabilization of the reports. Communicated with business for gathering information’s, designing, developing, administrating and maintaining MicroStrategy based reporting applications.  Involved in performance enhancement and tuning of MicroStrategy projects for better performance, accurate SQL and report. Extensively Created Metrics, Prompts, Transformations and Filters to generate reports for the Business Analysis. Created reports for Daily, Weekly, Monthly, Quarterly and yearly for various transactions of Business. Extensively worked in developing Report Services Documents, HTML Documents according to Business Requirements Development of Dashboards and scorecards for management reporting using Document Services. Conducted Unit/System/User Acceptance testing on the MicroStrategy objects Developed. Experienced in managing reporting teams, platforms, and cross team projects. Constructed reports with view filters and derived metrics on a report for further analysis of report which reduced Database load and improved response time to end users. Implemented drill functionality on the reports using Drill Maps. Environment:MicroStrategy 9.2.1/8.1.2 (Architect, Desktop, Web, Distribution services, Object Manager), Informatica, Oracle 11g, Teradata, HTML & DHTML, Windows XP. State Farm Insurance Bloomington IL                               \tOct’11 – Dec’13 Role: Microstrategy Developer Responsibilities: Extensively created filters, facts, Consolidations, Transformations and Custom Groups using MicroStrategy Desktop to generate reports for the Business analysis. Well experienced in creating the dashboards using Visual Insight Created various Monthly Dynamic Dashboard documents for the decision makers with multiple panel stacks, selectors and customized widgets. Communicate business user requirements and provide clarifications as needed. Used pass-through functions (apply simple and apply comp) in attributes and filters definitions. Provided the users the facility to create customized reports for Business Analysis by creating Hierarchical filter prompts Attribute filter prompts Attribute. Implemented SAVE and Export Links for dashboards. Managing schema objects and application objects across the project by using Object Manager.  Created ad-hoc reports by drilling up, down, within and across dimensions. Performed administrative activities like invalidating the report cache loading and unloading the projects merging & deleting projects and creating security roles Define/Create system hierarchy/user-defined hierarchy and controlling (lock, limit and filter out) the attribute elements in hierarchy. Created advanced grid reports, consisting of data analysis by combining a template with filters. The end-users were able to generate ad-hoc report by drilling up, down, within and across dimension or anywhere. Troubleshoot and tune MicroStrategy reports by analyzing the Microstrategy generated SQL to determine data issues such as double counting, hitting incorrect fact tables, incorrect joins and insufficient data. Created test cases to check the functionality of Application.  Provided support for QA and UAT. Worked along with Microstrategy Knowledge Base to troubleshoot some Report related issues. Worked in writing SQL Queries (Sub queries and Join conditions, correlated sub queries) Environment: MicroStrategy 9.2.1/9.0 (Architect, Desktop, Narrowcast Server, Object Manager, Enterprise Manager, MDX Adapter) Oracle, SQL Server, Informatica, IBM DB2, ASP, XSL, HTML. Big Lots.INC, Columbus, OH                           \t\t\tNov‘09 -Aug’11 MicroStrategy Consultant Responsibilities: High user interaction, understanding their requirement. Extensively worked in creating and integrating Microstrategy reports and objects (Attributes, Filters, Metrics, Facts, Prompts, Templates, Consolidation and Custom Groups) with the data warehouse. Huge amount of performance improvement done on existing documents by using main strength of MicroStrategy like report cache and intelligent cubes.    Highly interactive and complex report in MicroStrategy Desktop and web and provide production support. Extensive administrative experience creating user, setting up privileges. Security access to metrics and attribute level. Created of Intelligent Cubes and shared to reduce the database load and     decreasing the report execution time by using the cube services Actively participated in developing Report Delivery Schedules. Extensive use of dynamic dashboard and scorecard to predict the trend in market and very interactive presentation and use of data. MicroStrategy web (View, interactive, Editable and flash mode), Subscription feature to improve the performance and mobility of the group. High end experience with OLAP services. Understanding of MicroStrategy architect and its data flow. Experienced in troubleshooting in problems related to I-server, data warehouse, ETL process, metadata, project source and project.  Expertise in creating complex reports like Drill Down and Sub Reports and implementing Conditional Formatting, Interactive Sorting, Grouping and Filtering. Developed the reports against Star Schema and Snow-Flake Schema. Environment:MicroStrategy 9.0.2(Desktop, Administrator, Architect, IntelligenceServer, Web, Agent), Informatica, Object Manager, Teradata V2R5, SQL Server, Oracle10g, Erwin, Informatica 6.2, MS SQL Server, DTS, Teradata, Windows. General Motors, India                                                      \tMay‘08-Oct‘09 Role: ETL Consultant Responsibilities: Designed Mapping documents ETL architecture documents and specifications.  Analyzed the Source Data and designed the source system documentation. Participated in discussions with Project Manager, Business Analysts and Team Members on any technical and/or Business Requirement issues.  Designed Documents for performing unit testing and string testing of developed code. Used the Data stage Designer to develop processes for extracting, cleansing, transforming, integrating, and loading data into data warehouse database. Analyzed COBOL Copybooks for Source Dictionary. Developed PL/SQL scripts for ETL (Extraction, Transformation & Loading).  Used surrogate key assignment and change data capture.  Used Parallel Extender for Parallel Processing for improving performance when extracting the data from the sources and used various Parallel Extender partitioning and collecting methods.  Followed Star Schema to develop data marts.  Worked with Metadata Definitions, Import and Export of DataStage jobs using Data stage Manager.  Implemented Quality Stage for data cleansing, data standardization and matching process.  Environment:DataStage 6.0, SQL, PL/SQL, SAPR/3, UNIX, SQL Server, Erwin 4.0, Stored Procedures, DB2 UDB, IBM AIX 4.2. SAPR/3 ECC6.0."}