{"text": "Name: helen helen E-Mail: helen.helen@gmail.com Address: Heze, China Github: https://github.com/helen LinkedIn: https://linkedin.com/helen Phone No. 905284936656 Professional Summary: Over 7+ Years of experience in IT industry with experience on Business Intelligence and Data Warehouse Applications. Experince as Microstrategy Developer, building projects and creating reports,Dashboards using Microstrategy 8.1/9x,10x Microstrategy Desktop,Microstrategy Intelligence Server and Microstrategy Developer.  Experience in Data Modeling, with experience in using BI tools like Microstrategy 8x and 9x, 10x Business Intelligence reporting using Microstrategy, Cognos and Tableau. Involved in all phases of SDLC from analysis, design, development, testing, implementation and maintenance. Complete BI project life-cycle development experience and expertise in Development levels in MicroStrategy products including Developer, Intelligence Server, Web, Architect and Command Manager, Integrity Manager, Object Manager. Strongly experienced in installation and configuration of Microstrategy. Extensively used filters, facts, consolidations, transformations and custom groups to generate reports for Business analysis and also have  knowledge in Schema Objects. Involved in the creation of Schema objects like Attributes, Facts, and Hierarchies & Tables. Expertise in developing Application objects like Filters, Advanced Metrics (with all components), custom Groups, consolidations, Drill Maps, Templates & Reports.  Created prompts in reports to add interactivity for users. Expertise in creating Free Form SQL reports. Experience in hierarchies, Custom Groups, Consolidations, scheduling, clustering. Optimizing the Report Performance using VLDB Setting, Caches and Indexes. Expert in developing Application Objects (filters, prompts, metrics, Custom Groups, Consolidations, DrillMaps, Templates, Searches) developed Reports, Documents and Dashboards. Worked on OLAP features like derived metrics, pivoting, page-by, subtotals and sorting. Had knowledge in OLAP services like derived elements, view filter, intelligent cubes and dynamic aggregation.  Experience in MicroStrategy Report development, Report testing, Report tuning, Ad-hoc, scheduling report delivery and Alerts and also experienced in maintain and modify existing projects, applications and reports as required.  Expertise in migration of Projects/Objects between different environments. Expertise in using Pass - Through functions like Apply Simple and Apply Comparison to develop complex Filters and Transformations. Worked extensively on VLDB Properties for performance tuning. Expertise in migration of Projects/Objects between different environments.  Expertise in using Pass - Through functions like Apply Simple and Apply Comparison to develop complex Filters and Transformations. Worked extensively on VLDB Properties for performance tuning. Worked on creating interactive dashboards for MicroStrategy mobile. In-depth understanding of fundamental data warehousing concepts such as Dimensional Modeling, ER Modeling, Star and Snowflake Schemas, Datamarts, Security and deployment, FACT and Dimensional tables, Logical and Physical data modeling. Strong knowledge of Agile methodology including Sprint Review, Daily Standup, Sprint Plan, User Story Points and Code Review meetings.  Worked on Agile methodology including Sprint Review, Daily Standup, Sprint Plan, User Story Points and Code Review meetings. Good at POC (Proof of Concept) presentations and building sample Mock Ups to get initial approval from application users. Can work with minimal supervision. Very good team player with excellent communication skills, self-motivated, dedicated, and very interested in learning new technologies. Technical skills: Professional Experience Client: Mayo Clinic, Rochester, MN                                                                                                                 Jan 2018 – Till Date Role: Sr. MicroStrategy Developer Analyzing and understanding BI requirement by coordinating with various business teams. Created new users and providing privileges. Created schedules and subscriptions for various reports. Created freeform sql reports as per client requirement. Hands on experience on to created different types of schema objects. Developed transformations to generate reports of type sales this period to sales this period last year and so on using transformations. Hands on experience to Creating application objects. Developing different kind of reports (Grid/Graph) using schema and public objects based on requirement. Worked on various other tools like control m, SVN, SCM, repository browsers, win scp and Automate server. Checked and changed VLDB properties to improve performance. Worked with Microstrategy team and fixed schema issue. Worked and changed database connections in odbc.ini file. Designing the reports and documents as per technical design documents and performing unit testing. Created advanced reports using various public objects (Filters, Prompt, Metric, I-cubes, Consolidation, Dashboards). Hands on experience working with schema objects (Attribute, Fact, Transformation). Performance Tuning of various reports. Designed the MicroStrategy Project Schema/Architecture and involved in suggesting changes to the Logical Data Model as per the Business Requests and implementing the same in the MicroStrategy Project Schema. Created and modified attributes, facts, hierarchies and transformation objects as part of the development work for a project. Worked extensively on automation of the sales reports using Freeform SQL reports.  Built several public objects Filters, Metrics, Prompts to serve the reporting needs. Created compound Metrics forcing dimensionality and conditionality Built Complex level metrics to achieve the required results intended by business. Created automated events used to deliver reports in email in several formats HTML (email body), PDF and excel spreadsheets.  Created Documents for several business s subject areas such as Email health, Goods, Getaways, Financial, Refunds using various grids and graphs. Implemented best practices like choosing right visualizations, planning outline and creating right datasets to enhance Dashboard performance.  Designed and Developed Dynamic Dashboards using various panels, selectors and widgets. Worked on Performance tuning of reports that are running longer. Played a key role in User Acceptance Testing of the reports. Tested all the reports by running queries against the warehouse-using SQL Assistant. Working experience in creating interactive dashboards for MicroStrategy mobile. Extensively used Distribution Services to deliver reports directly to business users through Static and Dynamic subscription delivery methods. Extensively used Report Services to generate Documents for exporting to Excel & PDF. Environment: MicroStrategy 10.10, Oracle, UNIX, Crystal Reports, Cognos          Client: Norwegian Cruise Line, Miami, FL                                                                                                       Sep 2015 – Dec 2017 Role: MicroStrategy Developer Developed Reports and Dashboards. Worked with In-memory Intelligent cube technology. Created dashboards with multiple functionality for mobile users. Implemented MicroStrategy web for web users with different modes and functionality. Created schema objects such as Attributes, Facts, Hierarchies, and Transformations. Created various types of filters and prompts based on requirements. Creating Ad-hoc reports using Prompts and Drill maps. To create the different types of public objects like filters, metrics, Custom Groups, Consolidations etc. Worked on MicroStrategy OLAP Services Features i.e. creating View Filter, Dynamic Aggregation, and derived metrics. Created various Dynamic and Interactive Dashboards with multiple panel stacks, selectors for WEB. Prepared the documents for Object Migration process, Object standards, Package Creation. Working with object manager to migrate all types of objects across multiple environments. Working with databases for writing queries against MicroStrategy reports. Preparing and implementing test cases in the newly developed reports and Dashboards. Verifying the data and SQL across the environment using Integrity Manager tool. Resolving production support issues. Working on enhancement requirements. Working on new change requests based on the UAT feedback. Tuning the performance of reports using VLDB properties. Created Dynamic Web, Mobile & Visual Insights Dashboards using features like Panel Stacks, Selectors, Information Windows and Widgets like Time Series Slider, Interactive Bubble Chart, Thermometer, ESRI Map, Data Cloud, Heat Map etc. Created Dynamic Dashboards showing Daily/Weekly/Monthly/Yearly performance metrics using various graphs and widgets.  Created and modified MicroStrategy Schema objects (such as Attributes, Facts, Hierarchies, Transformations etc.), Application Objects (such as Reports, Documents, Metrics, Filters, Prompts, Templates, Consolidations, Custom groups etc.) and Configuration Objects (such as project, database instances, users, user groups,  security role etc.) using Micro strategy Developer and/or Web. Created complex metrics involving MTD/YTD Transformations and Level Dimensionality. Troubleshooting MicroStrategy objects like Attributes, Facts, Transformations, Metrics, Prompts, Filters, Templates, Consolidations, and Custom Group. Created Intelligent Cubs to improve performance. Used Distribution Services for timely distribution of reports to users. Worked in Microstrategy Administration creating new users, roles, privileges, shared folders, access controls list. Used the VLDB properties for performance tuning and SQL optimization. Created Free-Form SQL reports for short-term reports, ad-hoc requests that are not supported by existing schema model. Responsible for providing on time deliverable solutions to clients. Installed and configured all Microstrategy products including Intelligence Server, Microstrategy Desktop, Object Manager, Command Manager, Web and Microstrategy Narrowcast on Servers and mapping to Client machines. Configured Enterprise Manager. Environment: MicroStrategy v10.4 and PL/SQL, SQL server 2008 Client: Axiometrics Inc, Dallas TX\t                     Feb 2014 – Aug 2015 Role: MicroStrategy Developer Worked on creating schema objects like attributes, facts, Hierarchies, transformations. Created public objects filters, metrics, prompts, custom groups. Created reports and dashboards as per the mockups. Created interactive and flash mode dashboards on the reports. Developed widgets in dashboards like heat map, bubble graph. Created of multiple panels and panel stack within the same dashboard, and using of different functionalities in dashboard like time slider, linking multiple dashboards, navigating to different dashboards and reports within the same dashboard. Experience on Visual Insight dashboards/Dossiers. Knowledge on Microstrategy Security Administration and object/user creation by using security filters. Installed and configured MSTR environment. Utilized in-depth knowledge of functional and Technical experience in data warehousing and other leading-edge products and technology in conjunction with industry and business skills to deliver solutions to customer. Testing the reports with requirement and compare the data with database, Issues fixing while in UAT. Unit tested the Reports by running SQL queries on source and target. Gathered functional and non-functional client requirements in order to optimize the design of BI deliverables (reports, dashboards, alerts, visualizations). Responsible for gathering requirements and designing the semantic layer for MicroStrategy Reporting.  Worked on Designing Dashboards for Adjustments, General Financial reports like General Ledger, Balance Sheet , reconciliation trend report, Price verification of different financial products received from Product Processors. Extensively worked with MicroStrategy desktop in creating attributes, facts, metrics, hierarchies, transformations, hierarchies, custom groups, prompts to be used in generating reports according to the needs of business.  Involved in Migrations of Microstrategy Objects. Designed Critical Dashboards for MicroStrategy Mobile. Created several Custom tables, Views, and Aggregations for developing reports used in MicroStrategy environment. Built and analyzed data sets using R and Python  Developed Perl Scripts for Reconciling data from different Product Processors and generated Reconciliation reports. Involved in Creating PL/SQL procedures for data preparation for reports. Mentoring and managing team of developers on site and Offshore. Client: Sonata Software, Hyderabad, India \tMay 2012 – Dec 2013 Role: Systems Engineer  Involved in creating entity relational and dimensional relational data models using Data modeling tool Erwin. Creating databases from the physical model and creating indexes on the tables in the data warehouse. Designed and generated database objects and Oracle Forms, Reports. Including Forms based on stored procedures. Generated SQL and PL/SQL scripts to install, create and drop Trading Exchange Connection database objects including tables, views, primary keys, indexes, constraints, packages, sequences, grants and synonyms. Extensively used SQL Loader and PL/SQL for extracting source data, transforming and loading into Data marts and Operational Data Stores. Created PL/SQL procedure, functions and packages to fulfill the transformation part of the ETL. Responsible for capturing data changes. Created Export/Import scripts to Export Files using Oracle’s Export utility and importing the data into a different oracle database. Used Transportable table spaces for moving large volumes of data between two Oracle databases. Designed and Developed Customized Attributes, Hierarchies, Facts, Metrics, Filters, Prompts, Custom Groups, Consolidations and Reports. Create connection maps to map users to different homogeneous databases or table spaces in a single project to direct end users against production and power users against development database. Designed, Developed and altered html document objects by placing multiple reports on it in Grid as well as Graph View applying XSL formatting for each in the process of automating IT Dashboard reports. Project duplication within and in between different project sources of Prod, Dev and UAT environments. Installed and configured complete MicroStrategy product suite on Prod, Dev and RE&I Lab environments.  Personalize the end user experience at report runtime by providing flexibility with reusable prompts/report parameters. Validate, Detect and Repair logical/physical inconsistencies and corruptions of MicroStrategy metadata by running Scan MD/MD Doctor utilities. Environment: MicroStrategy 9.4, Oracle 9i, PL/SQL, SQL Server 2008/2012, TOAD, Windows 2000/2003 server. Erwin, MS Office (Word, Excel, PowerPoint Education Bachelor of Technology in Engineering from Vignan Institute Technology."}