{"text": "Name: ruth ruth E-Mail: ruth.ruth@gmail.com Address: Changsha, China Github: https://github.com/ruth LinkedIn: https://linkedin.com/ruth Phone No. 533846555654 PROFESSIONAL SUMMARY: Over 7.9 years of IT experience in the use and development, design, support and migration of Microsoft SQL Server database. Development using MS SQL Server and products SSIS, SSRS, and SSAS. Transformed data from one server to other servers using tools like Bulk Copy Program (BCP), Bulk Insert, Data Replication, Data Transformation Services (DTS) and SQL Server Integration Services (SSIS). Creating VBA programs to automatically update Excel work books used Macros and Formula to speed up processes and maximize accuracy. Created multiple dashboards and various reports in Power BI like Tabular Reports Good Knowledge of RDBMS and Data Warehouse Concepts, OLTP, OLAP.  Proficient in SQL Server and T-SQL (DDL and DML) in constructing Tables, Normalization techniques on database Tables.  Expertise in creating, modifying, using and debugging Stored Procedures, Views, User Defined Functions. Good understanding of Inmon top-down approach and Kimball bottom-up approach Strong Knowledge of Normalization/De-Normalization and Data Modeling. Highly proficient in the use of T-SQL for developing Triggers, Views, Functions, Data Cleansing, Relational Database models and Data integrity, and SQL joins.  Expertise in Performance Tuning, Optimization, Data integrity, and Statistics by using SQL Profiler  Very Proficient in SQL Tuning and Optimization of Queries. Experience in Creating and managing Event Handlers, power Package Configurations, Logging, System and User-defined Variables for SSIS packages. Creating SSIS solutions for ETL and Business Intelligence process for Data Integration and Migration Services. Expert in designing (development) and deployment of SSIS package from various sources like MS Access, Oracle, Excel, Microsoft SQL Server, flat file, and XML. Excellent in High-Level Design of ETL DTS Packages& SSIS Packages for integrating data using OLE DB connection from various sources like Look-ups, Fuzzy Look-ups, Aggregate Functions, Merge Join, Conditional Split, Data Conversion, Derived Column, Event Handlers, and Error Handlers etc.  Also Supported team in resolving SQL Reporting services and T-SQL related issues and Proficiency in creating S types of reports such as Cross-Tab, Conditional, Drill-down, Top N, Summary, Form, OLAP and Sub-reports, and formatting them. Expert in writing Parameterized Queries for generating Tabular reports and Sub reports using Global variables, Expressions, and Functions, Sorting the data, Defining Data sources and Subtotals for the reports using SSRS. Experience in Troubleshooting Report Processing, Subscription, Delivery, and Configuration Problems. Proficient in building Cubes, defining Referenced Relationships and creating Hierarchies in SSAS. Expertise in creating Cell Level Security in cubes using SSAS. Expertise in creating Perspectives, Partitions and Design Aggregations in cubes using SSAS. Expertise in creating Dashboard Reports to support end users using SSAS Expertise in implementing efficient Disaster Recovery Strategies and High availability like Replication, Log shipping, clustering (Active/Passive) and Database Mirroring. Worked on administration tasks such as data loading, batch jobs, data unloading, backup & Recovery, user and application table management, upgrades, creating databases/File groups/files/Transaction logs. Developed ETL process using SSIS with various Control flow, Data flow tasks and Stored Procedures for the work order validation process. Expert in calculating measures and dimension members using the Multidimensional Expression (MDX), mathematical formulas, and user-defined. Familiar with work environment Agile methodology and Scrum meeting. Extensive knowledge in Tuning T-SQL queries to improve the database performance Wrote VB.Net code for various SSIS Packages also valuable experience in developing Power BI dashboard using Share point. Involved in Data Warehousing Concepts and Data Modeling Techniques like Dimensional Data Modeling, Star Schema Modeling, and Snow-Flake Modeling Experience in report writing using SQL Server Reporting Services (SSRS) and creating several types of reports like Dynamic, Linked, Parameterized, Cascading, Conditional, Table, Matrix, Chart, Document Map and Sub-Reports. Experience in building, deploying and managing applications on Microsoft Azure Cloud computing platform. Very Good Communication skills, Good interpersonal skills & desire to excel, fast learner, efficient in handling multiple projects, hardworking and a versatile team player. Technical Skills:  Work Experience Client: Stewart Title, Houston, TX\t\t\t\t\t                  Apr 2017 - Present   Role: SQL/SSIS/SSRS/SSAS/POWER BI Developer Key Responsibilities:  Responsible for gathering and defining user report requirements and developing appropriate Interfaces for the Reporting Infrastructure Environment to meet customer business needs, based on business processes and data entities between various systems. Supported front-end team in Designing and Developing custom web and console applications as per client requirements and specifications. Developing complex SSIS packages using different data transformations like Aggregate Conditional Splits, Lookup, Sort, Merge Join, Data Conversions, Derived Columns, Multicasting, Slowly Changing Dimensions, Scripting, OLEDB Command with SQL etc. Actively involved in writing SQL Stored Procedures, functions, and triggers for updating customer usage information in the database Developing SSIS packages that upload multiple flat files using For each Loop Container and uses other control flow tasks like File System task, FTP task, Send Mail Task, Script Task etc. Improving the database performance by creating and using both Clustered and non-Clustered Indexes and by optimizing T-SQL statements. Using Azure portal to audit and analyze the events during a particular time horizon and stored in the script. Created ETL process using SSIS to transfer data from heterogeneous data sources by extensively using PIVOT to normalize the data also combining data from different sources using UNION ALL.    Worked with Marketing department to improve the external and internal website and posting latest updates. Developing SSIS packages that upload multiple flat files using For Each Loop Container and uses other control flow tasks like File System task, FTP task, Send Mail Task. Utilized Power BI for Office 365 to amplify data visualizations with collaboration and data management. Generated ad-hoc reports in Excel Power Pivot and sheared them using Power BI to the decision makers for strategic planning. Created effective reports using visualizations such as Bar chart, Clustered Column Chart, Waterfall Chart, Gauge, Pie Chart, Tree map etc. in Power BI.   Actively involved in developing Complex SSRS Reports involving Sub Reports, Matrix/Tabular Reports, Charts, and Graphs. Used Execution Plan, SQL Profiler and Database Engine Tuning Advisor to optimize queries also trimming lengthy queries by replacing sub queries with JOINS to enhance the performance of Databases. Created and managed Database(s) on SQL AZURE. Setting up Connection Strings and connecting SQL Server Azure Databases from locally Installed SQL Server Management Studio. Generated reports using SSRS, Power Pivot, and Power BI that could be used to send information to a diverse group of users, clients, and managers Implemented Event Handlers and Error Handling in SSIS packages and notified process results to various user communities. Scheduling Daily, Weekly and Monthly SSIS package execution process using SQL Server Agent jobs. Environment: SQL Server 2016/2014/2012,Visual Studio2017, 2015,2013, Framework 4.5, C#.Net, XML, Entity Framework, Microsoft Office, Excel, Word, Windows server 2010,Business intelligence development studio, Tableau 10.4,SQL profiler, MS Visio-SQL, DTS, Data Analyzer. Client: Home site Insurance, Boston, MA\t\t\t\t\t              Dec 2015 - Mar 2017 Role: MS SQL/MSBI Developer (SSIS, SSAS, SSRS) Key Responsibilities:  Understanding the business requirement and functional specification of the client module also supporting Front-End team to improving the Application. Developed DTS packages from SQL Legendary tasks on SQL Server Management Studio to load the data from flat files and Source tables into SQL databases. Created and managed Schema objects such as Tables, Views, Indexes, Procedures, and Triggers in the database.  Used SSIS and T-SQL stored procedures to transfer data from OLTP databases to the staging area and finally transfer into data marts and performed an action in XML. Extensively worked on three stages of enterprise reporting like Authoring, management, and delivery using SSRS. Strong experience in database installation, capacity planning, implementing backup and recovery strategy for application and database. Raising the change management request and following up with the customer approval, for making any changes in the production server Developed a methodology for the ongoing assessment of database performance and the identification of problem areas. Responsible to tune ETL procedures and schemas to optimize load and Query Performance. Worked on Agile Methodology throughout the project, performed a decisive role in developing and planning as well as coordinating with assigned sprints.  Actively involved in developing Complex SSRS Reports involving Sub Reports, Matrix/Tabular Reports, Charts Developed scorecards/reports for the system using Power BI Explored data in a variety of ways and across multiple visualizations using Power BI Used Tableau to develop dashboards for more intuitiveness as per the user requirements also created the documentation for the team on project technical details.  Involved in 24X7 On-call production support and fixing production issues. Experience working with live site production issues. Environment: MS SQL Server 2014,.Net 3.0, SQL BI Suite (SSIS), XML, MS Excel, MS Access 2014& Windows Server 2010, SQL Profiler, DTS, Data Analyzer, SQL Server Data Tools/BI (SSDT), Red Gate SQL Source Control, TFS, Remote Desktop Connection (RDC), Windows Server 2010 R2, SharePoint and Windows 10,Tableau., SQL Profiler. Client: TargetX, Conshohocken, PA\t\t\t\t\t\t  Mar 2014 - Nov 2015 Role: MS SQL Developer/ (SSIS/SSRS) Developer Key Responsibilities:  Requirement gathering and analyzing data sources. Assisted in design and implementation of Database.  Experienced in Data Extraction, Transforming and Loading (ETL) using various tools such as Data Transformation Service (DTS), SSIS, SSRS, Bulk Insert. Scheduling Daily, Weekly, and Monthly SSIS package execution process using SQL Server Agent jobs Working closely with the Actuarial department on loading and analysis of Claims data on daily basis.  Designing claims reconciliation, validation and analysis reports for accounting and actuarial departments.  Taking Database Full Backup, Transaction log backup & differential backup in daily routine. Traced long running queries and deadlocks using SQL Profiler. Automated Stored Procedures to load data into staging and production environments in a timely manner using SQL Server Agent. Worked on Power BI and prepared dashboards to make it more attractive and explored data in a variety of ways and across multiple visualizations using Power BI. Involved in Installation, Configuration, and Deployment of Reports using SSRS. Scheduled the reports to run on daily, weekly basis in the report manager. Environment: SQL Server 2012/2008 R2 Enterprise Edition, SQL Server Business, Intelligence Development Studio (Visual studio)2010/2012 (SSIS, SSRS), DTS, Data Analyzer, TSQL,SQL profiler, Tableau, MS Share Point Server, Azure, MS Word, MS Excel. Client: Staples Inc Corporate HQ CA, \t\t                                               Dec 2012 - Feb 2014 Role: MS SQL Server Developer (SSIS, SSRS)\t\t\t\t Key Responsibilities:  Worked closely with Business analyst to analyze and understand the requirements. Creating flowcharts, data flow diagrams and support documents with a detailed description of each new module. Created Data model as per User requirements and studied the source system using Star Schema and Erwin.  Designed various kinds of reports like Linked, cascaded and parameterized reports and Worked on Drill Down and Drill-through Reports using SSRS.  Deploying these reports to share point site and adding filters, web parts  As part of a Development team worked mostly on Integration Services, database migration planning, performance evaluation, migration process from development to production.  Created views and indexed views as required by front-end developer for easier implementation.  Created stored procedures and functions to support data storage and manipulation.  Used linked/replicated servers and high-volume data storage.  Converted the DTS Packages into SSIS using Migration Wizards.  Interacting with the client directly to get the requirements and explain the project status.  Publishing the reports in the share point site  Environment: SQL Server 2008R2, MS Visual Studio, Microsoft office 2007, Microsoft Excel 2007, MS Access, SQL Server Query Analyzer, Windows 2007 server, java 1.5 platform., Tableau, Excel, Word, SQL Profiler, MS Share Point Server, Azure, DTS, SQL Server Enterprise Manager IDEA Cellular, India\t\t\t\t\t\t\t\t     Oct 2010 –Nov 2012 SQL Developer (India) \t\t Responsibilities: Worked as a developer on databases like MS SQL Server 2005, MS Access.  Installed and maintained MS SQL Server 2005. Created Database Objects – Tables, Indexes, Views, User-defined functions, Cursors, Triggers, Stored Procedure, Constraints, and Roles.  Analyzed and prepared Statement of Work and Requirement Definition Document. Extensively developed SQL Procedures, Functions, Triggers and Packages. Tuned and Optimized SQL Queries using Execution Plan and SQL Profiler. Troubleshooting performance issues and fine-tuning queries and stored procedures.  Develop SQL Server Agent jobs and packages to populate data. The packages created included a variety of transformations, for example Slowly Changing Dimensions, Look up, Aggregate, Derived Column, Conditional Split, Fuzzy Lookup, Multicast and Data Conversion. Involved in performing database Backup and Recovery. Created and manipulated many small and Complex packages to perform ETL operations. Developed and optimized database structures, stored procedures, Dynamic Management views, DDL triggers and user-defined functions. Environment: SQL Server 2008/2008R2, T-SQL, DTS, MS-Excel, Windows 2000/2003, Visual Studio 2008/2010, SQL Server Enterprise Manager, SQL Server Query Analyzer, SQL Profiler, MS Visio, Data Analyzer, MS Excel, Word. Education: Bachelor’s in Technology from NIT- Durgapur, India."}