{"text": "Name: annie annie E-Mail: annie.annie@gmail.com Address: Hengyang, China Github: https://github.com/annie LinkedIn: https://linkedin.com/annie Phone No. 760207046788 SUMMARY OF EXPERIENCE Sr Developer and Sr Support Analyst with eight years of experience as IT professional in Financial, Insurance, HealthCare, and Warehouse. Including full stack software development with analysis, design, development, deployment, testing, documentation, maintenance and Supportof N-tier web applications, client / server applications. Work Experience of Azure, ASP.NetWeb API 2/1, ASP.Net MVC 4.5/4.0/3.5, ASP.Net Webforms 4.5/4.0/3.5, VB.NET,C#, WCF, Angular 2.0,AngularJS, jQuery, JSON, HTML5,CSS3, JavaScript, SQL Server 2012/2008, Visual Studio 2015/2012/2010. Have good enough knowledge of AzureMaas,IaaS and PaaSofferings with deployment experience. Expertise on developing SPA usingAngularJS controllers, directives, components, factory and service resources, routings and events and using Angular 2.0components, service, routing modules, module. Extensive experience in developing N-Tier Architecture of Repository Logic Layer(RLL), Business Logic Layer(BLL), Service Logic Layer(SLL) using ASP. NET Web API. Experience in SQL Server in writing scripts for Database Creating, Database Objects, Stored Procedures and Functions using T-SQL. Expertise in providing client side designing and validations using Angular JS, JavaScript, and HTML5. Experience in developing UI components using UI Bootstrap.  Extensive Experience in accessing and managing data using C#, ADO.NET, Entity Framework. Have used LINQ while implementing the query logic in repository layer to implement grouping, filtering, selection etc., Used Karma/Jasmin Testing framework to do Unit testing for client side application. Experience in using NUnit and FakeItEasy for testing C# functionality of backend. Proven ability in creating Views, PartialViews, ViewModels and ActionFilters in ASP .NETMVC. Experience in developing N-Tier Architecture using Data Access Layer (DAL), Business Logic Layer (BLL) and User interface (UI), Model View Controller (MVC) and Service Oriented Architecture (SOA). Worked on Team Foundation Server (TFS) and Subversion (SVN) for source code management and project management. Adopted Agile Methodology and involved in Scrum Meetings for Sprint Planning, Sprint Review, Daily Standup. Used Data Annotations to do required, pattern validation of Sever side application. Expertise in converting the requirement into the Technical Specifications and developed them using C# and ASP.NET.  Worked extensively on creating and consuming WCF, Web API. Experience in designing and developing object-oriented software applications. Excellent analytical, problem solving, multitasking, communication and team skills. Habituated to JIRA/ Confluence board for issue tracking, picking the task, BRD’s based on the given sprint requirement and documenting the overflow of application. Used Jenkins to check whether our source code is deployed successfully or not, file missing and any unit test case fails. TECHNICAL COMPETENCIES Company: - Goldman Sachs Company, NY.\t\t Roles: - Application Developer(Consultant) Project Title: - Service Delivery of ISG Revenue Applications                               Oct 2016 - Current Description: -  The main purpose of this GS project is to create a Graphical User Interface(GUI) to allow the employee provisioning team to provision GS ISG Revenue Applications without SQL Server Management Studio. Displayed a view in GS Admin that displays the user’s name, user’s Company Id, and the user’s access to the ISG Application.  Using ISG the provisioning team will have the ability to review access and utilize user lookup to see what the employee is provisioned for. Responsibilities: -  Technologies used for building this application are Azure, ASP .NetWeb-API ,Nunit, JavaScript, HTML, UI-Bootstrap, AngularJS, Jasmine, Karma. Applications connected with SQLdatabases using Data-Base First Approach of entity framework.  Created N-Tier Architecture of Context Logic Layer(CLL), Repository Logic Layer (RLL), Business Logic Layer (BLL), Service Logic Layer (SLL) using ASP. NET Web API layer hosted on Windows Azure. This layer is the middle tier between SQL Azure and client application.  Created Angular 2.0 components and registered in main module to control and provide their dependencies to other components where ever is needed. Used Angular 2.0 Service as resource to build HTTP services that reach client application using ASP.NET Web API Framework and pass as provider in depended component. Created different UI components like alerts, collapse, typeahead, modal, popup etc., using UI Bootstrap. Provided security in terms of authorization and authentication by creating Entitlement Service using AngularJS. Created Angular 2.0 Routing to connect different components, paths to the view which allows the single-page application. Involved in the creation of Unit Test Cases for both client and backend Application. Used third party JavaScript library like Bootbox.js, agGrid.js etc., for better design and view.  Used to access Data from different schemas of Database Server. To establish connection for all the databases, written logics using LINQ queries (C#) and followed Lambda concepts to do query operations. Worked directly with the Azure Product team in tracking and resolving defects in the beta Azure IaaS offering. Controlled version control, source control and for better communication usingSubversion (SVN). Environment: - Visual Studio 2015, Angular 2.0, Microsoft, Azure, Microsoft SQL Server 2012, ASP.NET MVC 4.5, ASP.NET Web API 2.1, Entity Framework, Subversion (SVN), HTML5, JavaScript, CSS3, Bootstrap. Project Title: - The GS Desktop Jan 2016 – Sep 2016 Description: -  The group is responsible for the systems that provide financial counselling and help end clients plan for their financial future. The systems also provide the Administrative support for the Account Managers and Corporate representatives to configure to their specific needs. \tDesktop is a web based application that acts as a source of truth for institution, client, prospect, and contact data with the ability to facilitate the client onboarding process. The platform also provides ability to view and manage client data such as Events and Appointments, Asset Details, contact data, Insurance Information, tax Data along with additional features such as Document and Entitlements management. GS desktop is the primary tool used by teams such as Investment Advisor, Financial Planners, Coaches and Tax Planners to serve their clients.                                                                        Responsibilities: - Designed and developed a responsive single-page web application using AngularJS,ASP.NET Web API, HTML5, JavaScript, CSS3 and UI Bootstrap. Created AngularJS Controllers for each module to control and transfer the data of applications. Used inbuilt AngularJS Services and created custom service, factories as resource to build HTTP services that reach client application using ASP.NET Web API Framework. Used inbuilt directives and created custom directives to create different layouts of view in different landing pages. Used inbuilt filters and created custom Filters to format the result to the requirement. Created different UI components like alerts, collapse, typeahead, modal, popup etc., using UI Bootstrap. Provided security in terms of authorization and authentication by creating Entitlement Service using AngularJS. Created AngularJS Routing to connect different controller to the view which allows the single-page application. Implemented Client side validations using AngularJS Custom Form Validation, HTML5 validations and server side validations using Data Annotation. Created N-Tier Architecture of Common Logic Layer(CLL), Repository Logic Layer (RLL), Business Logic Layer (BLL), Service Logic Layer (SLL) using ASP. NET Web API. Build all HTTP Service calls, provided URL routing using Attribute Routing of ASP.NET Web API 2. Had used Code-First Approach, Data-Base First Approach of entity framework to access Data from Database Server. Written logics using LINQ queries (C#) and followed Lambda concepts to do query operations. Created Tables, Stored Procedures, User Defined Functions, and Views for different data operation on the database using SQL server. Used Karma, Jasmine testing frameworks to do client side unit testing and Nunit testing framework to do server side unit testing. Adapted Agile Mythology named Scrum for all the work performance. Used Subversion (SVN) for version control, source control and for better communication between the team members. Environment: - Visual Studio 2015, AngularJS Core, Microsoft SQL Server 2012, ASP.NET MVC 4.5,ASP.NET Web API 2.1, Entity Framework, Subversion (SVN), HTML5, JavaScript, CSS3, UI Bootstrap. Company: -Coyote Logistics, Inc., Jersey City, NJ\t\t\t\t                       May 2015-Dec 2015 Role: - AngularJS/ASP. NET MVC Developer Description: -Coyote Logistics is an air freight shipping company, provides international freight and global logistics services. They are exports in providing their services to wide range of customers systematically. This project is about Warehouse Management System(WMS) which is developed for Coyote Logistics with a central database for allowing multiple warehouses to operate independently with complete access. This system consists of the following main modules like Receiving, Put Away, Location Management, Inventory Management, Picking and Shipping, Reporting. One of the main functionality of the system is to develop the Inventory Management system which is used to provide the availability of any items within the warehouse. The information of inventories is updated automatically once the items are received and shipped. The system has many different features like view Current Inventory status, view Inventory Location within the warehouse, view Inventory Transaction History, Consolidate Inventory based upon the customer, Lock/unlock inventory, Accept Cycle Count orders, Print Cycle Count Reports and Update Cycle Count Status.  Responsibility: - Designed and developed a responsive single-page web application using AngularJS, ASP.NET MVC, Web API, HTML5, JavaScript, jQuery, CSS3 and Twitter Bootstrap. Implemented AngularJS Controller functions, service using Controller methods to set up initial state of the object.  Implemented AngularJS Services to bind the data and provide access to the data on the server. Used AngularJS as the development framework and done CRUD operations with $http service. Used AngularJSfilters for search, sorting, pagination and custom filters. Designed a Web application using Web API with AngularJS and populated data using ADO.NET entity framework and Used Entity Framework to model and manage data from SQL Server. Created AngularJS Routing to connect different controller to the view which allows the single-page application. For better design user experience used Bootstrapfor Modal pop-ups, Alerts, etc. Implemented Client side validations using AngularJS Custom Form Validationand server side validations using Data Annotation. Created Tables, Stored Procedures, User Defined Functions, Views and Triggers for different data operation on the database using SQL server. Adapted Agile Mythology named Scrum for all the work performance. Used Team Foundation Server (TFS) for version control, source control and for better communication between the team members. Environment: - Visual Studio 2015, AngularJS Core, Microsoft SQL Server 2012, ASP.NET MVC4.5, Web API, Entity Framework,Team Foundation Server(TFS), HTML5, JavaScript, jQuery, CSS3, Twitter Bootstrap. Company: -Shaw Contract Group, NEW YORK, NY.\t\t\t\t        Sep 2014-April 2015 Role: - ASP.NET MVC Developer Description: - Shaw Contract Group manufactures residential and commercial resilient products which are engineered with state-of-the-art manufacturing equipment and holds numerous patents for novel creations over the years. This project is about Parent Roll Processing (PRP) which is developed for Shaw Contract Group. The system consists of two applications; the first application is on pc based system which is used to communicate with the MU over a serial port, the Second application is on Web based portal which is used run on a Windows based server and SQL database Server for doing actions with mapping. This System includes several models like Admin, Parent Roll, Scheduling, Move Ticket, Reports. The most important functionality in this Applications is Parent Roll File Maintenance. The features of this functionality are; Administrator can create, edit and search for a parent roll. Using the WIP number or Pattern, the user can directly search for a specific PDS. A new roll is being scheduled, if the information doesn’t populate.  Responsibility: - Designed and Implemented Web Application by using ASP.NETMVC 4.0, Razor, C#, jQuery, Ajax, Html5, CSS3, JSON,LINQ, Lambda Expression, Repository, Custom Action Filter, Bootstrap. Using ASP.NET MVC 4.0implemented Controllers for processing incoming requests, handling input, saving data, and sending a response to send back to the client. Designed User Interface with Razor Views, Partial Views and Twitter Bootstrap for Layout View. Created Model classes for the different tables of the database on the MVC application. Used ViewModel in the view, to populate data from different tables on the same view. Used WebGrid, GridViewwith jQuery/JSON to provide more flexible, editable and sortable grid view to increase user interaction. Created multiple partial viewsand reused them across the application. Used AJAX Helpersfor making asynchronous AJAX calls in Views. Used ActionFilters for implementing user authentications, authorizations and role based security. Used Exception Filters for handling errors raised by the controller action results. Used LINQ to SQL and Lambda Expressions to query data from SQL Server. Used Bootstrap to make web applicationresponsive and user friendly. Deployed the project through Internet Information Services (IIS). Implemented Unit testingwith NUnitfor detecting and solving problems. Maintaining Version Control of the project in TFS by merging the developed code with the latest version in the TFS. Environment: - ASP.NET MVC 4.0, C#, jQuery, Entity Framework, HTML5, CSS3, Razor, Microsoft SQL Server 2012, NUnit, Visual Studio 2012, TFS, JSON, LINQ, IIS. Company: - Dixon Group Inc, Washington, DC\t\t\t\t      May 2012-AUG 2014 Role: -ASP.Net Developer Description: - The Dixon Group provides management consulting services for federal agencies, government offices, and nonprofit organizations. It offers marketing and materials development services; and meeting and publication support services. This project is about Functional Event Management Tool for Dixon group and the aim is to create an efficient web application replacing the existing system. This application consists of three main phases; Event, Event Management, and Administration. The functionalities of Event Management Are Event Setup, Call for Presentations, Abstract Review, Speaker Management and Session Management. Event Setup is the first logical step of the workflow which has the features like Event Metadata, Venue info, Client into & contact, Event Manager, Sponsored Participants, and Event Services.  Responsibilities:  Designed the Web Application using ASP.NET Web Forms. Designed the N-tier architecture for the application development with Presentation Layer (UI), Data Access Layer (DAL) and Business Logic Layer (BLL). Graphical User Interface (GUI) was designed using ASP.NET4.0, CSS, and JavaScript. The business logic was coded in C#. Extensively involved in T-SQL Queries like creating Tables, Stored Procedures, Functions, Triggers. Created ADO.NET objects like Dataset, Data Reader and Data Adapter to connect to the database in DAL. Manipulated data using data Bound controls like GridView, Repeater and WebGrid. Used Dynamic SQL for better filtering operations.  Enforced Validations using ASP. NET validation controls and Custom Validation controls. Created Modal Popups with Bootstrap and jQuery. Created and consumed WCF Service to use in the application for important operations. Environment: - C#, ASP.NET 4.0, ADO.NET, JavaScript, HTML, CSS, WebForms, Microsoft SQL Server 2008 R2, Visual Studio 2010, WCF. Company: -Bajaj Allianz Life Insurance Co Ltd, Pune, India.\t\t                      Dec 2011-Apirl 2012 Role: -ASP.Net Developer Description: - Bajaj Allianz Life Insurance Co. Ltd. is a joint venture between Allianz AG and Bajaj Auto Limited.The company Ensuring world class solutions by offering customized products with transparent benefits supported by the best technology is our business philosophy. The Project consists of two main modules, the module I was part of the development is Allianz AG and it is in the business of Life & Health Insurance, General (Property & Casualty) Insurance and Asset Management. We have developed a block for their Life insurance plans and Auto Generation quote for the plan of what the customer chooses.  Responsibilities:  Designed the Web Application using ASP.NET Web Forms. Designed the N-tier architecture for the application development with Presentation Layer (UI), Data Access Layer (DAL) and Business Logic Layer (BLL). Graphical User Interface (GUI) was designed using ASP.NET4.0, CSS, and JavaScript. The business logic was coded in C#. Extensively involved inT-SQL Queries like creating Tables, Stored Procedures, Functions, Triggers. Created ADO.NET objects like Dataset, Data Reader and Data Adapter to connect to the database in DAL. Manipulated data using data Bound controls like GridView, Repeater and WebGrid. Used Dynamic SQL for better filtering operations.  Enforced Validations using ASP. NET validation controls and Custom Validation controls. Created Modal Popups with Bootstrap and jQuery. Created and consumed Web-Services to use in the application for important operations. Environment: - C#, ASP.NET 3.5, ADO.NET, JavaScript, HTML, CSS, WebForms, Microsoft SQL Server 2008, Visual Studio 2008, Web-Services. Company: - Elico Healthcare Services, Hyderabad, India.\t\t\t        May 2009-Nov 2011. Role: - ASP.NET Developer    Description: - Elico Healthcare Services is one of the greatest healthcare division which offers IT services, Revenue Cycle Management and Transcription Service to Hospitals and Physician practices for clients. It is an expertise in medical care field of Operative Reports, Discharge Summaries, H&P’s, SOAP notes, Consultations, Emergency Room Care and Radiology etc.,   Responsibility: - Developed a server-side web application with ASP.NET 3.5, HTML, CSS, jQuery, JavaScript and AJAX in Visual Studio 2008.  Developed Master Pages, User Controls, and Custom Controls. Developed code for operations between the application and the database using ADO.NET in C#. Developed Stored Procedures, Views, User Defined Functionsusing T-SQL. Used Visual StudioBusiness Intelligence Tools to create SSRS reports. Used SSIS in Visual Studio Business Intelligence Tools to handle different data formats for incoming invoices and automated tasks. Deployed the application into Internet Information Services (IIS). Environment: - C#, T-SQL, ASP.NET 3.5, JavaScript, jQuery, HTML, CSS, IIS, Microsoft SQL Server 2008, Visual Studio 2008."}