{"text": "Name: frances frances E-Mail: frances.frances@gmail.com Address: Zhangzhou, China Github: https://github.com/frances LinkedIn: https://linkedin.com/frances Phone No. 288374008284 BACKGROUND SUMMARY: 7 + years of experience in Client/Server and Web Applications using Microsoft Technologies and .Net framework. Strong in the complete Software Development Life Cycle (SDLC) including requirements definition, design,programming / testing and implementation of major systems. Working experience in agile methodology using Rally dev tool and scrum methodology using scrum works pro tool.  Experienced in developing web applications using .NET Framework 2.0/3.0/ 3.5 and 4.0, ASP.Net, C#, VB, ADO.Net, XML, XSLT, Java Script, HTML, VB Script, AJAX,  and IIS.  Experience in gathering customer requirements and functional requirements and converting them to technical requirements, applying OOAD concepts and Design Patterns.  Involved in the design and development of 3 Tier, N-tier distributed architectures and MVC architecture. Possess a proven track record of successfully developing application systems based on user requirements. Well versed in Unified Modeling Language (UML) and OOA/OOD methodologies. Good experience in Web services, Windows Communication Foundation (WCF), Windows Presentation Foundation (WPF), Windows Workflow Foundation (WWF) and Silverlight webapplications. Experience in creating use case diagrams, class diagrams, activity diagrams, sequence \ndiagrams, page flow diagrams using UML technologies and Microsoft Office Visio. Proficient in using XML related technologies including AJAX, XSLT, XPATH and XQUERY. Extensively worked on the C# and ADO.net for developing the windows applications. Worked on DCOM (distributes Component Object Model) components also help in two-tier client server application. Knowledge on developing the web application using framework like Language Integrated Query (LINQ) and Entity framework 3.5.  Experience in working with TCP/IP socket programming and supporting Performance QA team. Experience in Database Analysis/Design/Normalization/Manipulation processes using SQL Server 2000/2005/2008, Oracle9i and MS- Access. Extensively worked on stored procedures, Triggers, Indexes and DTS packages. Familiar with the bug tracking tools like BUG track and Bug Sentry.  Worked experience on the source control software packages like Microsoft Visual Source Safe (VSS), Team foundation Server (TFS) and AccuRev. Designed and implemented reports using Active Reports, SSRS for .NET Expert in using the tools like httpWatch 7 for web application. For the performance tuning, trouble shooting, verifying that a site is secure and does not expose sensitive information. Experience performing Unit and Integration Testing in the Development, System Integration Testing (SIT), User Acceptance Testing (UAT) including Bug Reporting and Fixing. Ability to work on strenuous team/single projects and meet deadlines. Excellent communication skills, strong organization and interpersonal skills and a very good team player, capable of working independently with minimal supervision, and perform as part of a team. TECHNICAL SKILLS: Languages\t:\tC#, Visual Basic, C, C++, SQL, PL/SQL, Java Script, VB Script .NET Technologies\t: \t.NET, C#.NET, ADO.NET, ASP.NET 2.0/3.0/3.5,WCF,WPF,WWF,MVC  Web Technologies\t:\tXML, HTML, XHTML, CSS, XSL, XSLT, AJAX, Silver light Servers\t\t:\tIIS, Apache Tomcat Databases\t:\tServer 2000/2005/2008, MS Access, Oracle 9i/10G Reports\t\t:\tCrystal Reports 10.0, SQL Server Reporting Services, Active Reports Platforms\t:\tWindows 9x, 2000/2003, Windows XP, Windows NT, Vista Source Control\t:   Team Foundation Server (TFS), Visual Source Safe (VSS) Network Protocols\t:\tTCP/IP, HTTP, FTP, SMTP, SOAP,UDDI. Development Tools\t:    Visual Studio 2003/2005/2008/2010, XML Spy, SQL Plus PROFESSIONAL EXPERIENCE: Client: BCBS, IL                                                 \t\t\t\tMay 2012 - Till Date Role: .NET Developer Description: BCBS Insurance is one of the largest insurers in the nation and since several years it has been developing applications for processing financial business. The project is mainly used by the customers and the financial staff for maintaining the details of various personal information and different insurance policies, payment history, and billing cycle. It also allows searching policies depending upon various search criteria. With this the end users and customer care staff can make online payments and has an administration module which is used for creating users, groups and career. It also provides reports for down payment, online payment and new business. Responsibilities: Developed application using ASP.Net 4.0, C#, AJAX, ADO.Net using Visual Studio 2010. Involved in AGILE Methodology for the software development process. All server program components of Tracker are written in ASP.Net and C# is used to develop all .NET components and Code-Behind pages Developed Model component for database access, View component for UI design and Controller component responsible for handling end user interaction, manipulating the model, and ultimately choosing a view to render to display. Performed input validations on Web Forms using various .NET Validation Controls. Designed and implemented reusable class libraries that formed the basic binding blocks for the application, minimizing the executable size, providing central locations for common functionalities. Created parts of the application using ASP.NET Microsoft AJAX Toolkit controls like Script Manager, Update Panel within some web pages, thus reducing the number of round trips to the server per page and improved user experience. Developed web forms using Master Pages, AJAX controls and CSS Style sheets for the unique look for the page. The project is being carried on TIBCO CRM environment. Worked with third party controls like easy query, Dev Express controls, and Ajax extender for developing rich user interface.  Accessing the Data from database and XML’s using LINQ. Designed reports using Active Reports in Microsoft .NET environment with C#, ASP .NET Developed Microsoft Active Data Object (ADO) to communicate with the database Wrote stored procedures, Triggers, Functions, and Indexes to improve the throughput of application using optimized queries in SQL server. Managed the code versions using Visual Source Safe (VSS). Used ClearQuest for bug tracking. Environment: .Net Framework 4, ASP.Net, C# .Net, Visual Studio 2010, Ajax, LINQ, Dev express controls, easy Query, SQL server 2008, VSS, TIBCO ClearQuest, MS-Visio and Active Reports. Client: Esurance, San Francisco, CA                                                                    \tMarch 2010 - May2012 Role: ASP.NET Developer Description: Esurance is the first online-only insurance company and is also the fastest growing new insurance company to be created within the last 50 years. This is Esurance.com (web and desktop) application from which auto insurance buyers can get quotes and purchase policies. Current application supports 28 states in US. Customer Flow Standard Flow is Esurance.com application from which auto insurance buyers can get quotes and purchase policies. It uses web services for utilities like for verifying customer's address, credit history, credit card payments. Used factory design pattern to implement state specific business, also used MVC pattern.  Responsibilities: Experienced in all phases of SDLC which Involves Project Planning, Analysis, Design, Documentation, Development, implementation and support of software applications. Involved in Use Case analysis and Developed use-case diagrams using MS Visio 2007. Developed application using .Net 3.5, Windows Communication Foundation (WCF) Services, Windows Workflow Foundation (WWF), MSMQ and Enterprise Blocks using Visual Studio 2008. Involved in Data Model, Work Flow and Web frame designing Using Microsoft Visio. Designed and developed Windows Communication Foundation Services (WCF) using data contracts, service contracts and operation contracts. Performed input validations on Web Forms using various .NET Validation Controls. Involved in creating web service calls to various tools like TIBCO. Used Asynchronous JavaScript and XML (AJAX) techniques to improve performance. Developed Reports Using Crystal Reports. Used Team Foundation Server (TFS) extensively for version control of the source code along with the maintenance of the builds and the relevant documents of the same. Developed Reports Using Crystal Reports. Created the Universe for generating Active Reports Involved in Maintenance / Enhancements of the application which includes developing the new reports Extensively used both Dataset and Data Reader to gather data from database and used Grid View, Data List, Detail View and Repeater controls to the display the data in a desired format. Used Enterprise library Data Access block in DAL to connect to database. Used Enterprise Library Logging application block building data Access layer & tracking the Event Logs in the Application. Designed and developed Stored Procedures, Views and Triggers. Designed, modeled and architected multi-threaded, enterprise n-tier software agent using Windows Communication Foundation (WCF) web service hosted in a Windows service. Worked with WCF Service Contracts, Data Contracts, Operation Contracts, Instance Modes and Security of the services. Involved in UI build release, defect and bug fixing. Performed Code review and Unit testing for better performance Performed Unit Testing Using NUnit. Environment: .Net Framework 3.5, ASP.Net, C#.Net, Visual Studio 2008, Ajax, WCF, WWF, LINQ, Oracle 11g,  Team foundation server(TFS), Crystal Reports, Involved in creating web service calls to various tools like TIBCO,MS-Visio and Active Reports Client: Bank of America, NY                                                                                 Aug 2009 - Feb 2010 Role: .NET Developer Description:This system is involved in fixing bugs with the existing EBPM (Enterprise Business Process Management) application. Capital One uses EBPM as an internal application which helps higher authorities to accept and process credit card application from customers. Responsibilities: Involved in gathering requirements by interacting with the clients and developing GUI /Business tier design for the web application. Extensively used UML in the design process - Use cases, Process diagrams, Sequence diagrams, Class diagrams. Involved in AGILE Methodology for the software development process. Designed and developed application using MVC architecture, ASP.NET and C#. Designed and developed Model component for database access, View component for UI design and Controller component responsible for handling end user interaction, manipulating the model, and ultimately choosing a view to render to display. Designed and implemented reusable class libraries that formed the basic binding blocks for the application, minimizing the executable size, providing central locations for common functionalities. Created parts of the application using ASP.NET Microsoft AJAX Toolkit controls like Script Manager, Update Panel within some web pages, thus reducing the number of round trips to the server per page and improved user experience. Involved in discussions with business line to enhance the existing web services. Accessing the Data from database and XML’s using LINQ. Worked with WCF for building service-oriented applications that communicates across the web and the enterprise. Worked with the web services using WCF.  Used Telerik controls for ASP.NET MVC extend the ASP.NET MVC platform by delivering reusable UI controls built specifically for MVC. Developed application using Entity Framework for Model to access database. Developed server-based framework integrates with client-side modules built on the popular JavaScript library, jQuery, to deliver productivity enhancing controls for MVC Wrote stored procedures, Triggers, Functions, Indexes to improve the throughput of application using optimized queries in SQL server. Implemented SQL Server Reporting Service to generate various reports for customers with different rates. Worked with bug tracking tool for tracking the bugs in the application and implemented Exception Handling mechanism using .NET Framework Classes to debug the errors.   Involved in writing Unit testing, NUnit testing and MS test testing for the application. Conducted designing test automation strategies, created test scenarios, test plans and performed inspection of test scripts. Used Team foundation Server (TFS) for version control of the source code along with the maintenance of the builds and the relevant documents of the same. Environment: .Net Framework 3.5, ASP.Net, C#.Net, Visual Studio 2008, MVC, Ajax, XAML, Silver Light, WCF, SOAP, LINQ, SQL server 2008, SSRS,  Team foundation server(TFS). Client: Concentra, Addison, TX\t\t\t\t\t\t\t\tSep2008 - July 2009 Role: .NET Developer Description: Concentra Provides HealthCare Services in US which has tie-up with Health Care Insurance providers and Employers, CRA is a Centre Revenue Analysis Data Warehouse for Concentra’s Labs and Billing systems distributed across the country. CRA proposes to consider the replicated servers for extracting data on incremental basis. Legacy systems distributed as 80 identical databases across the Enterprise, normalized data from source systems will be loaded to centralized operational Data Source (ODS). Responsibilities: Involved in whole project development life cycle from requirements gathering to implementation.  Used SCRUM methodology for the software development process. Designed and developed Data Access Layers, Business Rule layers, application using ASP.NET and C#. Created GUI in ASP.Net using .NET controls, C# and writing of common controls (*.ascx). Designed Data Access Layer (DAL), Business Logic layer (BLL) and other components in C#.Net and also in implementing Business Processes,Abstract factory as part of SIMPLE OBJECT ACCESS PROTOCOL (SOAP). Developed application using N-tier architecture. Implemented design patterns and the entire backend of the application in C#, using various object oriented features like classes, interfaces, inheritance, polymorphism etc and multi threading.  Designed, modeled and architected multi-threaded, enterprise n-tier software agent using Windows Communication Foundation (WCF, MSMQ) web service hosted in a Windows service. Extensively used Master Pages, Web Forms, multi-threading in Win Forms and Custom Controls in developing the front end application. Developed application using Entity Framework to create data access applications by programming against a conceptual application model and Exception Handling Mechanism using .Net Framework classes. Used Java Script and JQuery for Ajax Implementation and Client side Validation. Extensively worked with the Silverlight for the rich user interface to the web. Worked with WCF for building service-oriented applications that communicates across the web and the enterprise. Developed an application on WCF for communication with the database through the Silver light applications and used for hosting the web services. Worked with Microsoft Enterprise Library, which is a collection of reusable software components designed to assist software developers with common enterprise development cross-cutting concerns. Developed an Ecommerce application for sells products from different sellers. Customer puts in a delivery address and the delivery prices are updated automatically depending on where in the world the destination delivery is. Actively used objects to communicate With the PL/SQL database and the Data bound controls to display the data on the UI screens. Implementing set of core services that handle thread scheduling, persistence, transaction handling, queuing, and tracking by using Windows workflow foundation (WWF). Used AJAX Script Manager and Script Manager Proxy controls to register JavaScript and web service files.  Developed stored procedures, Data modeling and complex queries in Oracle 10G. Implemented client side validations using Java Script and server side validations by using .NET validation control. Designed and developed various reports using Crystal Reports and with an option to export to excel. Performed Unit Testing, Integration Testing and Load testing on the modules according to the requirements and development standards. Experienced in bug tracking tool like BUG track and used worked on Visual Source Safe (VSS) for version control of the source code. Good experience on troubleshooting and solved production Issues. Environment: .Net Framework 3.0, ASP.Net, C#.Net, WEBSERVICES, Ajax, XAML, Silverlight, WCF, MVC, SOAP, Ecommerce, Enterprise Library 3.0, Java Script, Oracle 10g, Crystal report, VSS. Client: LIC Life Insurance, India                                                                \t\t\tMay 2005 - July 2008 Role: .NET Developer Description: LIC Life Insurance is the leading provider of liability insurance to physicians, hospitals, and medical entities in India. The Project involved the development of a Data warehouse to consolidate policy and claims information from different states for operational and strategic reporting needs. Responsibilities:  Served as a support consultant to project team in selecting technologies and developing System architecture. Participated in the analysis and design of the GUI & Functional aspects of the   application using ASP.NET, C# and XML. Writing SQL queries, SQL procedures, to handle the business rules and data integrity. Analyzed the Change or Enhancement Request (ER) and interacted with client's Change Management Team for clarifications and convert them into low level design document for development. Extensively worked on WinForms using C# which involved Multithreading. Implemented Exception handling mechanism using .NET Framework classes with XML files. Implemented the Incremental-testing plan on the components developed using features of TRACE and DEBUG classes in .NET. Developed various reports using Crystal Reports. Environment: C#, ASP.Net, ADO.NET, Visual Studio.NET, XML, HTML, Win Forms, SQL Server 2000, UML."}