{"text": "Name: marie marie E-Mail: marie.marie@gmail.com Address: Tangshan, China Github: https://github.com/marie LinkedIn: https://linkedin.com/marie Phone No. 864161884870 PROFESSIONAL SUMMARY: Around 8 years of experience in Business Intelligence, Data Warehousing and Database Applications including Analysis, Design, Development, Testing and Support using ODI11.1.1.7 /12c, OBIEE10.x/11g and BI APPS. Extensive ODI Development experience in Health, Insurance, Financial industries with a strong understanding of data & analytics. Profound knowledge on all ODI components - Topology, Security Manager, Designer and Operator. Hands on experience on working with ODI Knowledge Modules like LKM, IKM and JKM, CKM. Extended the base ODI Knowledge Modules to create customized versions that are re-used across other data integration projects. Used ODI Designer to develop complex interfaces (mappings) to load the data from the various sources into dimensions and facts. Good working knowledge with ODI Operator for debugging and viewing the execution details of interfaces and packages. Extensively worked on Dimensional modelling, Data migration, Data cleansing and Data Staging of operational sources using ELT processes and providing datamining features for data warehouses. Implemented the Change Data Capture (CDC) feature of ODI to minimize the data load times. Expert in data warehousing techniques/concepts such as data cleansing,Surrogate key assignment, Slowly Changing Dimensions SCD TYPE 1, SCD TYPE 2, Change Data Capture (CDC). Experienced in creating Tables, Stored Procedures, Views, Indexes, Cursors, Triggers, User Profiles, Relational Database Models and Data Integrity in observing Business Rules. Familiar with Oracle EBS concepts of Financial Analytics, Spend Analytics and Supply Chain modules. Performed the changes to the physical layer, Business Model and Mapping Layer and Presentation Layer in an OBIEE Repository for all new objects that needed to be added. Experienced in analysing the needs of the user and creating new BI reports according to the user requirement in OBIEE. Experience in designing and developing end-to-end BI solutions according to standard OLAP methodologies using Siebel Analytics/Oracle Business Intelligence (OBIEE)  Experience on BI/BA/BSA role to work close with managers to create sales and inventory analytics reports.  Development of Business Reports, Business Alerts with help of Oracle/Siebel Answers, Oracle/Siebel Delivers and Oracle/Siebel i-Bots, Oracle BI Publisher to create reports from multiple data sources. Experienced Program management involving Oracle Applications(ERP) + DB and fusion technology using different methodologies Oracle Unified Method(OUM), AIM and agile  Experience in Setting up Dynamic, System and Non-System Variables. Good knowledge in working with FTP and development tools like SQL developer. Exposure to handling Data from various sources such as Oracle, MS SQL Server, DB2, Legacy systems, Flat Files and XML Files into ODS (Operational Data Store) and EDW (Enterprise Data Warehouse) systems. Also worked for Data loading using UNIX shell scripts, SQL*Loader. Extensive experience in writing SQL Queries and PL/SQL. A Self-starter with a positive attitude, willingness to learn new concepts and to accept challenges, as well a very good team player. TECHNICAL SKILLS PROFESSIONAL EXPERIENCE Responsibilities Involved in all the phases of the project from Planning, Discovery, Requirements Gathering, Design, Construction, Testing, Pilot and Deployment. UsedODI Topology Manager graphical tool to manage the data describing the information systems physical and logical architecture.  Created ODI Packages, Jobs of various complexities and automated process data flow.  Created EBS views, did the Noetix workbench set up. Published the RPD generated by Noetix - and created analysis, dashboards and dashboard prompts for all the AP Reports Worked Extensively on OBIEE/Siebel Analytics Administration Tool, Siebel Analytics Web/Presentation Services, Answers, & Interactive Dashboards and Security Implementation. Created EBS query to validate OBIA reports Supported development of an Enterprise Data Warehouse(DWH) using OBIEE, ODI, OBIA (BI Apps), Noetix, Informaticaand Oracle EBS  Created complex Interfaces and implemented Slowly Changing Dimensions (Type 1, Type 2 and Type 3) for data loads. Created Interfaces to implement one time as well as Incremental loads. Used Interface Variables, Interface Parameters and Session Parameters to increase the re-usability of the Interfaces. Implemented performance tuning logic on targets, sources, interfaces, sessions to provide maximum efficiency and performance. Used ODI knowledge modules to implement SCD logic and Update logic.  Developed load plans using Load Plan Generator and monitored the results using ODI Operator. Analysed business requirements of the project and wrote technical specs for the implementation. Used SSIS, SSAS, SSRS Reporting and Production Support for following systems: Production System: (Solar) Parts Ordering, Shipping and Inventory Systems.  Analysed the user requirements and created BI reports in different subject areas. Involved in the Installation of OBIEE 11g (BI Administration Tool, Oracle BI Enterprise Manager, WebLogic server and BI Publisher) in Linux environments. Created Logical Tables, Logical Columns and calculated measures and metrics as per the business need. Created complex requirements like Dimension hierarchies, time comparisons and share measures along with ranks.  Developed Month Ago, Year Ago Measures for Comparison of Facts and Used Time Series Functions and to Date Functions Extensively. Implemented Oracle BI security at the data and object levels and utilized variables and initialization blocks in the repository. Created operational reports with BI Publisher integrated with OBIEE. Created variables in OBIEE for use with reporting - Repository Variables, Session Variables, Presentation Variables and Initialization blocks. Managed and provided permissions for Reports and Dashboards in OBIEE Presentation Services Web CatLog. Environment:ODI 11.1.1.9.x (Repository Manager, Designer, Load Plan Generator,Noetix, and Operator), OBIEE 12.2.1.0/11.1.1.9.0, OBIA 11.1.1.10.1/11.1.1.8.1, Oracle 12c/11g, SQL Developer 4.x, Toad 10.x, PLSQL, SQL. Client: Spectrum Health, Grand Rapids,MI                                                                    Apr 16 – May 17 Role: OBIEE/ODI Developer Responsibilities Developed RPD creation by including all the functional requirements and Working extensively in Answers and Dashboards. Created hierarchies in business model and Designed different viewsinview Selector, Legend, and MAP viewer Developed different brand level reports, filters, and prompts by using web. Develop and implement strategies, policies and standards for OBIEE administration solutions in the enterprise Perform testing sessions for reports and dashboards and resolve process issues (if any) Evaluate and set strategies to implement infrastructure and application changes in OBIEE system and processes. Creating and scheduling BI Publisher reports, integrated with OBIEE 11g. Integrated BI Publisher with OBIEE. Created Templates such as Employee Account Attendance Detail, Reports such as Turn Over/Period/Department,Prompts such as Customer Name in BI Publisher. Prepare documentation and communicate the status of the project to the management Creating Users, Groups and assigning roles as per security requirements. ODI Designer is used for reverse engineering tables from database to develop projects, and release scenarios.  Created ODI (Sunopsis) interfaces for loading the data from Source System to DW and from DW to different Data mart. Deploying RPD and Web Catalog and Supports monthly schedule activities for moving the code from Dev to stage and Production. Inserting new Users and modifying the existing Users access by using the LDAP authentication. Creating hierarchies in business model and Worked extensively in Answers and Dashboards. Created the requests and view the results in different views like table, compound layout, chart and pivot table. Environment\t:ODI 11.1.1.7.x(Topology manager, Repository Manager, Designer, Load Plan Generator, and Operator), Oracle 11g, OBIA (Inventory, Sales, Bill of Material, Order fulfilment, Shipping) OBIEE 10.x/ 11.1.1.7.x, Control-M Changes, SQL, PLSQL, EM, Web logic Console.           Wellington Management Company, Marlborough, MA                                          Jan 15 – Mar 16         Role: OBIEE Developer Responsibilities: Involved in meetings with Business analysts to update the functional requirement design documents in a systematic manner and to discuss the technical feasibility. Involved in Installing OBIEE 11G on various local systems following the OBIEE recommended Standards. Involved in repository (.rpd) building, based on different requirements, with the necessary logic that involved customizing the Physical, Business Model Mapping and the Presentation layer. Worked closely with System Analyst in order to simplify the various weighted average calculations for different measures (time series, level based etc) created in BMM to be further used for reporting purposes. Worked on configuring OBIEE Security parameters and assigned Dashboard privileges for controlled access to sensitive customer data. Created Folders/Sub-folders for different user groups and departments in Presentation Layer and managed catalog folders using catalog manager in Analytics as well. Extensively worked on developing and modifying existing Holdings and Transaction reports with various views like pivot table, graph etc Created Complex Dashboards for business users based on different business units like Investors, Brokerage etc and created various presentation variables, global and local prompts and implemented guided navigation. Involved in design, development and test documentation. Interacted with end users and developers to validate the data model, reports and dashboards. Documented project details and test cases for future reference. Extensively used Quality center in order to update the issues and fix them on time, thus maintained balance between designing and testing team. Found new issues pertaining to the tool and raised Service Requests and extensively worked with Oracle in solving them. Worked closely with Data warehousing team and maintained equilibrium between ETL data loadings and BI. Used catalog manager to migrate Web catalog across the diff environments. Environment: OBIEE 11.1.1.3, Oracle 10g, PL/SQL Developer, Sql server 2008, HP Quality Center10x, Windows XP. Responsibilities: Involved in data analysis, designingand development of data warehouse environment. Developed and implemented a strategy for the install and configure of Oracle Data Integrator11g.  Interacted with Business Users and Business Analysts for gathering new business requirements and also understood the current requirements and Data Analysis. Created Repositories, Agent, Contexts, Data Server, and both of Physical & Logical Schemas in Topology Manager.   Various kinds of transformations were used to implement simple and complex business logic. The mappings involved extensive use of transformations like Filter, Router, Expression, and Union for loading data into target tables.  Developed and maintained various Packages, Interfaces, Variables, and Models, which populated the Data into the Target Star Schema.  Create Oracle Workflow and schedule jobs. Used Lookup Transformation to access data from tables, which are not the source for mapping.  Implemented Slowly Changing Dimensions– Type I & II in different mappings as per the requirements.  Used SQL tools like SQL Navigator to run SQL queries and validate the data in warehouse.  Used workflow manager and work flow monitor to run and monitor jobs.  Analyzing the source data and deciding on appropriate extraction, transformation and load strategy. Designed and developed table structures, stored procedures and functions to implement business rules.  Monitored sessions for executions usingODI operator. Managed user privileges using ODI Security Manager.  Associated with Production support team in various performances related issues. Environment:ODI 10g/11g, PL/SQL, SQL Navigator, Teradata, SQL Assistant. Client: Equifax, Atlanta, GAOct 2011 – Mar 2013 Role: OBIEE Developer Responsibilities: Created Interactive Dashboards, Answers and Administering Oracle BI Apps Applications. Worked with Oracle BI Server,Presentation Server, Repository development and Oracle BI Administration. Analysis, Design, development and customization of Reports and Dashboards in OBIEE and daily client interaction. Preparation and execution of the test plans. Involved in developing the Incremental ETL process i.e., Mappings using various Transformations and Workflows.  Responsible for administration and migration of repositories between Development, Test (QA) and Production environments Responsible for all activities related to the development, implementation, administration and support of ETL processes and for scheduling using DAC and reporting using OBIEE Customized and developed approach to load data into GL Star, AP Star, AR Star, Budget star Data Models using ETL tool Informatica Worked on OOB and customized InformaticaSDE, SIL, PLP adaptors, DAC, OBIEE Worked with all three layers in the repository – Physical, Business, and Presentation Layer. Worked on security for users based on LDAP, External table Authentication and Database Authentication Types. Implemented the Cache Purging Strategy and usage tracking of Reports Added column/data level security at the repository level. The data was restricted with respect to the group user belongs too.  Created reports according to user requirements and also created corresponding dashboards for the reports. Actively involved in deployment and post release support. Environment: OBIEE 10.1.3.2, Informatica 7.9.1, Oracle E-Business Suite 9i, OBAW, Oracle10g, XML (BI) Publisher, SQL Developer, PL/SQL. Responsibilities: Performed the Creation, manipulation and supporting the SQL Server databases. Involved in Creation of tables, indexes, sequences, constraints, triggers and procedures. Created stored procedures and triggers which were used to implement business rules. Helped in integration of the front end with the SQL Server backend. Written triggers, stored procedures and manipulated the data using DDL and DML functions. Migrated the data (Import & Export of data) from one server to other servers using tools like Data Transformation Services (DTS)  According to the business requirements made the documentation of the performed tasks. Extensively Used SQL Profiler for troubleshooting, monitoringand optimization of SQL Server and non-production database code as well as T-SQL code from developers and QA. Backing up, restoring system & other databases as per requirements, and also scheduled those backups. Managing the security of the servers, creating the new logins and users, changing the roles of the users Environment: SQL, PL/SQL, SQL server, TOAD, windows. Education: Bachelor’s in Electronics and Communication- From Aurora, 2011."}