{"text": "Name: annie annie E-Mail: annie.annie@gmail.com Address: Shijiazhuang, China Github: https://github.com/annie LinkedIn: https://linkedin.com/annie Phone No. 725305060771 EXPERIENCE SUMMARY: Have over 8 years of focused experience in IT industry in various fields like banking, insurance, financial, retail and manufacturing. Extensive experience in relational database design, analysis, modeling, development, administration, implementation, trouble shooting and quality management. Comprehensive experience as Oracle DBA; proficient in Oracle 9i/10g/11g/12c Software Installations, Migrations, Database Capacity Planning, Automated Backup Implementation, Tuning Oracle 12c/11g/10g/9i on Unix and Windows NT platform. Involved with architect group in designing the logical and physical model of the databases. Thorough understanding of the Oracle data dictionary. Have good experience in UNIX administration, Shell scripting. Have impeccable communication and interpersonal skills and an exceptional team player. Managing the team of Oracle DBAs and actively coordinated with the end user community.  Real Application Cluster  Involved with installation and maintenance of ORACLE 10g/11g RAC 2 node and adding a node to this cluster database for high availability. Hands on experience in Oracle 10g/11g/12c RAC implementation & administration (Oracle Clusterware setup and configuration, RAC installation using ASM, Grid Installation) Good experience RAC Clusterware administration, Configuration and Patching, RAC Backup and Recovery. Managed RAC Cluster using SRVCTL and CRSCTL and applied patches in rolling Fashion  Oracle Enterprise Manager  Setup Oracle Enterprise Manager (OEM) 11g & Grid Control (12c) for database monitoring/performance/diagnostics. Hands on experience in managing databases from Grid control   Developed database monitoring/health check alert scripts for database uptime/downtime status, and sizing issues using grid control (OEM) ASM Extensive experience in configuring and implementing ASM and proficiency in using ASMCMD and ASMLIB, Flash-Back Technology, Log Miner. Done migration from non ASM database to ASM database. Responsible for maintaining every day backups and also to maintain ASM and disk space. Experience in implementation of enterprise databases on enterprise Storage Solutions using Storage Area Networks (SAN) / Network Attached Storage (NAS) GoldenGate Configured and replicated databases using oracle Golden gate. Experienced with cross site (active-active) data replication using Golden gate. Hands on experience working with Golden gate director and configured ODI to use oracle Golden gate for change data capture. Implemented zero downtime migration and upgrade of 10g to 11g database using oracle Golden gate. Replicated certain columns from a table and also certain values from columns by using oracle Golden Gate.  Migrated databases using Golden Gate and RMAN for 2node RAC. Implemented Broadcasting and Bi-directional Replication. Implemented and configured Golden gate  RMAN Experience in database cloning with RMAN, Capacity Planning, Database Refresh and patch management. Extensive knowledge in Database Backup and Recovery concepts using RMAN utilities (scheduling full/incremental/cumulative backups, hot/cold backups writing/editing UNIX Shell Scripts for RMAN). Dataguard Extensive experience in Dataguard configuration, implementing and maintaining standby databases. Hands on Experience in using Active Dataguard and Snapshot standby databases  Good knowledge on Logical Standby databases  Upgraded databases from 11gr2 to 12C using Data Guard. Extensive knowledge and experience on Data Warehouse using ETL. Patching and Upgradation Good experience in PATCHING AND UPGRADATION.  Expertise in upgrading Oracle Development and Production databases from 9i to 10g & 11g  Upgrading of database from lower version to higher version using opatch. Upgrading of databases from 10.2.0.x TO 11.2.0.x. and 11.2.0.x to 12.1.0.2  Installed security patches, performed patching on oracle Database server 10g and 11g using O-patch utility. Extensive experience in oracle upgrades, Critical Patch updates (CPU), Patch set updates (PSU)  and other oracle patches. Datapump Experienced in maintaining databases on large Production, Testing and DEV environments. Proficient in raising TAR with Oracle Support and using Metalink to resolve the bottlenecks in the database environments Experience in LOGICAL BACKUPS and Database migration tools with DATA PUMP, Export/Import and Transportable Tablespaces. Performance Tuning and Miscellaneous Tuned various large critical OLAP and OLTP databases of Tera bytes size using various tools like STATSPACK, AWR, SQLTrace, Tkprof, Analyze, ADDM and Explain Plan Methods. Provides platform-specific performance tuning, installation and configuration  Extensive knowledge on database administration for Oracle 9i, 10g and 11g, with experience in very largescale database environment and mission critical large OLTP and OLAP systems Experience in a variety of hardware and software platforms including; MS-Windows, NT Server, UNIX/Linux, Sun Solaris, HP-UX & AIX and RHEL Proficient in SQL, PL/SQL, Stored Procedures, Functions, Cursors and Triggers and extensively used TOAD for querying databases etc. Exposed to Data Warehouse assignments in various domains like Medical services, Sales, Insurance, Financial & Bank, Inventory Distribution, and Production Data warehouses Excellent Communication skills, co-ordination and communication with system administrators, business data analysts and development teams Experience as On-Call 24x7 production DBA support, application/development DBA. TECHINICAL SKILLS: WORK EXPERIENCE Fedex Custom Critical Inc, Uniontown,Ohio                                         \t\t\tAug 2016 - present Role: Sr. Oracle DBA Responsibilities:  Utilizing the Oracle replication products Golden gate, and Data Guard and developing High Availability Oracle databases. Worked on database requirements for new and existing Oracle database schemas to meet application needs. Used knowledge to Develop, execute, and track project schedules and work with application development teams being supported to manage the database tasks. Performed database tasks following FedEx DES Standards & Guidelines; includes: Developed Oracle Schema. Setting up, configuration and management of standby databases using Data Guard and performed Failover tests for High availability. Configured Data Guard environment for setting up a physical standby in maximum performance mode Write scripts to perform database tasks like database creation, backup and recovery, Data Guard monitoring, data migration, monitor space etc.  Experience in configuring, maintaining Data Guard Broker and performing switchover and switchback from Production to DR  Maintaining Oracle Data Guard and ensuring that the physical standby is always in sync with primary database.  Experience in configuring, maintaining Data Guard Broker and performing switchover and switchback from Production to COB.  Installation, Up gradation, Configuration and Troubleshooting GOLDEN GATE 12c software.  Configured GOLDEN GATE Downstream Mining and replication components for replication.  Performed Zero Downtime Database Data Center Migration using GOLDEN GATE and Data Guard.  Configured GOLDEN GATE Downstream Mining and Integrated components for Active-Passive and Active-Active replication.  Installed and configured GOLDEN GATE to work with OEM GOLDEN GATE Plugin.  Configured GOLDEN GATE High Availability using Oracle DBFS and Active Data Guard.  Monitoring and Performance tuning of GOLDEN GATE sessions at OS level, Database level and GGSCI level and investigate replication failures using ggserr.log, report files and Log Dump utility.  Worked with Informatica team for performing GOLDEN GATE Initial loads.  Experience in Oracle RAC DBA configuration management Performed Capacity Planning for RAC database. Worked on maintenance scripting and scheduling (including Korn Shell). Managed Oracle RAC Database environment on Linux/RH. Performing Database Change deployment through development, test, and production systems. Performed troubleshooting and Post-deployment performance tuning of Oracle database and SQL in production. Performed database changes and document them in accordance with FedEx GDP and Change Management standards and guidelines. Reviewing work product for all changes. Developed schemas and schema changes for VLDB (Very Large Data Base) Oracle systems that are 5+ TB in database size. Developed schemas and schema changes for high-OLTP (Online Transaction Processing) Oracle databases that exceed 5,000 executions per second, and 10,000 I/O per second. Understanding United States regulations regarding SOX, HIPPA, PCI, FTC, and FDA where applicable and developed schemas and schema changes accordingly. Managed to develop and executing Oracle Backup and Recovery Plans in test and production systems. Performing restoration and Recovery where needed in development and test databases. Performance Tuning for the SQL queries which are running slow. Heavily utilized OEM for monitoring, job scheduling, Performance Tuning, and other routine DBA activities  Environment:\tOracle 11g/12c, HP-UX UNIX RHEL 4.x/5.x, ASM 11.1.0.6 , OEM (Grid Control), RMAN and Data Guard, STREAMS, Explain Plan, SQL Developer, PL/SQL Developer, Data Pump, Business Objects, Toad, Informatica. Golden Gate. Anthem, Norfolk, Virginia                                                                                       Nov 2014 – July 2016 Role: Sr. Oracle DBA  Responsibilities: Experience in Design, Creating and maintaining the Oracle Database on 11g and 12c Created User accounts, Roles and granting required access permissions and privileges to the database based on the applications they are accessing. Manage the corporate SOX test plan.  Remediated 91% (20) of IT related deficiencies from prior SOX years  Managed and administered quarterly SOX attestation process for all enterprise control activities   Advised compliance committee on strategic and comprehensive approach to HIPAA compliance established by NIST (the National Institute of Standards and Technology). Performed and wrote a Gap Analysis Plan.  Wrote full set of over 50 USHHS HIPAA compliant documents including Information Security, Risk Assessment, Data Breach, Logical Access, Disaster Recovery Plan and Business Continuity Plans.  Used Database Configuration Assistant (DBCA), Database Upgrade Assistant (DBUA) for upgrading to Oracle 12c to the latest Oracle 12c and applied patches as required. Installed, Configured and Administered STREAMS and good knowledge on GOLDEN GATE. Performed Schema as well as Table Level Replication using Oracle Streams  Migrated databases using Golden Gate and RMAN for 2node RAC. Installed, configured Oracle 11gr2 RAC/non RAC databases on RHEL 6.4 VMs  Full support of DBA activities for MAP and Content RAC   databases on 10g and 11gr2 on OEL Linux 2.6.  Performed a database upgrade of 17Tb 2-node RAC database with ASM on 10.2.05 to 11.2.03 on OEL Linux 2.6 using the RMAN cloning of the database and performing an out-of-place upgrade to 11gr2 GRID.   Configured and deployed 11gr2 RAC (4-node) in Dev, QA and Prod to support PEGA Applications. Fine-tuned RAC   configurations and the databases as a daily activity. Implemented Broadcasting and Bi-directional Replication. Implemented and Configured Golden gate in 2 node RAC cluster for flow into EDW. Resolved replication issues in Golden gate. Automating tasks using Cron for GG restart. Hands-0n experience in converting integrated to classic extract and vice versa. Implemented 12c New Features in Golden gate Upgraded Golden gate from v10 to v11. Architect Golden gate (10.x/11.x/12.x) replication solutions to facilitate data flow between heterogeneous (SQL Server and Oracle) environments. Implemented and Monitored Data Guard on Oracle 11g and 12c in maximum performance  Implemented Dataguard and configured standby databases for critical databases using Dataguard and Export and import of database objects using EXPDP and IMPDP. Cloned schemas, objects and data on new server using Data pump. Involvement in space management, rectification of lock problems, managed quotas. Table partitioning to improve I/O access Data Refresh from Production to Test and Development environments using RMAN Duplicate Database or Data Pump Implemented 12c RAC Clusters and created POC for failures and performance in the environment and troubleshooting using clusterware Alert Log Monitoring every day in the production environment Perform health checks using crsctl and managing services using srvctl  Performance Tuning for the SQL queries which are running slow and taking more CPU cost Creation of database objects like Tables, Indexes, Views, Users, and DB Links etc. Query optimizing using CBO (Cost Based Optimization) and Scheduled Oracle Jobs and Backups using CRONTAB. Restoration and Recovery of databases at the times of occurrence of critical failures Experience in Online and Offline backups and recovery. Experience in backups and recovery using RMAN and Scripts. Experience in Administering Oracle Database 10g and 11g using Oracle Enterprise Manager (OEM), Toad, SQL Developer and PL/SQL Developer. Daily Health Check Up of the Database and SQL Queries using Statspack, AWR, ADDM and TKProf  Applied Security Patches from Metalink when needed and Responsible to provide 24 x 7 database administrative activities over different database servers Environment: Oracle 11g/10g, HP-UX UNIX RHEL 4.x/5.x, ASM 10.2.0.4, OEM (Grid Control), RMAN and Data Guard, STREAMS, Explain Plan, SQL Developer, PL/SQL Developer, Data Pump, Business Objects, Toad, Informatica. XEROX CORP, NY                                                                                                          March 2013 – Sep 2014 Xerox Corporation is an American global corporation that sells business services and document technology products. The company purchased Affiliated Computer Services for $6.4 billion in early 2010.[6] As a large developed company, it is consistently placed in the list of Fortune 500 companies. Role: Sr .Oracle DBA Responsibilities: Installed, configured and maintained Oracle 11g R2 on Linux also Upgraded from Oracle 10g to 11g Implemented Oracle Database 10g Two node Real Application Cluster (RAC) using Oracle Cluster-ware and responsible for high availability and load balancing. Installed, configured Oracle 10g and 11gR1 Streams between two geographical disparate sites for a 3-node RAC on Solaris 2.10  Day-to-day DBA activities such as tuning, RMAN based backup/restore and recovery of production databases. ASM+ configured on each RAC   node for OMF files. Generation of AWRs, PGA memory management, OEM for ONAMES and LDAP.  Develops, interprets, and implements operational requirements for flow process and tracking of requests from CMS Recovery (RAC) Program, CMS Medicaid Integrity Program, CMS Prepayment Reviews as well as all other coordination, monitoring, and direction of RAC activities.  Provides financial data and analysis for internal and external reporting. Ensures the system is prepared for RAC audits, coordinates response to audit requests, challenges questionable determination and assists in filing timely appeals.  Prepares and perform quality audits of Medical Records to be released. Have a working knowledge of rules and regulations as they pertain to CMS  RAC  program and other government regulatory and enforcement agency audits for documentation and billing compliance.  Installation, configuration and management of 2 –Node   using OCFS in Oracle 10.2.0.3 on Linux (Oracle Enterprise Linux 4.5) using NFS to provide the shared storage. Setting up of kernel  Very good Knowledge on 11g New Features. Configured Oracle Data guard for Oracle Disaster recovery. Achieved High Availability, Data protection and Maximum performance by maintaining both physical and logical standby databases. Restoration and Recovery of databases at the times of occurrence of critical failures. Responsible for installing, upgrading and configuring the Oracle environment by creating databases, storage structures and objects, database backup and recovery, monitoring and optimizing database performance. Installation, Configuration and Administration of Oracle 11g RAC. Optimization and tuning SQL queries using TRACE FILE, TKPROF, EXPLAIN PLAN. Implemented Oracle database backup & recovery solutions using RMAN. Extensive use of Oracle Data pump Exports/Imports utility for moving data among the servers. Performed large batch jobs, and tuning of SQL queries and database systems. Oracle streams AQ (Advance Queuing) in integrated application environments. Configured and implemented Oracle Streams (AQ and dequeuer) for high availability. Good skills in configuring and implementing down streams, Queues database. Very Good Knowledge on oracle streams Oracle streams AQ client/ server communication. Performed Schema as well as Table level Replication using Oracle Streams. Implemented downstream capture at the destination database using Oracle Streams. Responsible in configuring and backing up database using RMAN, Hot backups, Cold backups and Logical backups. Performed automated backups and scheduling using scripting. Experienced in dealing with Query execution plan, SQL trace, TKprof. Worked with Data pump to take the logical backups of databases. Experienced in performing Point in time recovery using RMAN. Used oracle configuration assistants like DBCA(Database Configuration Assistant) for Creating databases, DBUA(Database Upgrade Assistant) for Upgrading databases and NETCA(Network Configuration Assistant) for creating a Client-Server environment using Listener, TNS names etc., Working Experience with Latest TOAD having new features Health PLSQL & SQL Script Debugger, Database Checkup, ASM Manager, Diagnose Extents, Segment Advisor, SGA Trace, Query Builder. Created indexes to facilitate easy user interface implementation and tuning. Implemented advanced features of Oracle 10g such as Automatic Database Diagnostic Monitor (ADDM), Automatic Workload Repository (AWR) for monitoring database performance. Tested database performance issues (monitoring and tuning) to ensure database optimization. Performed administrative maintenance, monitoring on Oracle database systems in a global 24x7 operational environment. Involved in gathering requirements from end users. Clear documentation was prepared on all the processes like program specification, bugs fixing logs & change requests for future reference. Environment: Oracle 11g/10g, HP-UX UNIX RHEL 5.x, ASM 10.2.0.4, CRS 10.2.0.4, OEM (Grid Control), RMAN, RAC and Data Guard, Explain Plan, Oracle Support, SQL Developer, Data Pump, Business Objects, Toad, Informatica, VERITAS Net Backup Optum, Minneapolis, MN                                                                     \t               Nov 2012- Feb 2013 Optum is a new business brand of UnitedHealth Group and operating business through Business Process Outsourcing (BPO) services. UnitedHealth Group serves approximately 70 million individuals throughout the United States Role: Oracle DBA Responsibilities: Installed and Configured Oracle 11g databases on Linux and also Upgraded Oracle databases from 10g to11g version. Implemented Oracle Database 11g Two node Real Application Cluster (RAC) using Oracle Cluster-ware and responsible for high availability and load balancing. * Configured Oracle Data guard for Oracle Disaster recovery. Achieved High Availability, Data protection and Maximum performance by maintaining both physical and logical standby databases. Restoration and Recovery of databases at the times of occurrence of critical failures. Responsible for installing, upgrading and configuring the Oracle environment by creating databases, storage structures and objects, database backup and recovery, monitoring and optimizing database performance. Implemented Oracle database backup & recovery solutions using RMAN. Extensive use of Oracle Data pump Exports/Imports utility for moving data among the servers. Performed large batch jobs, and tuning of SQL queries and database systems. Created User accounts, Roles and granting required access permissions and privileges to the database based on the applications they are accessing. Renaming and Resizing the databases and Configured and implemented Oracle Streams (Advanced Replication) for high availability. Performed Schema as well as Table level Replication using Oracle Streams. Implemented downstream capture at the destination database using Oracle Streams. Responsible in configuring and backing up database using RMAN, Hot backups, Cold backups and Logical backups. Performed automated backups and scheduling using scripting. Responsible for migration of databases. Written Stored Procedures and Triggers for database maintenance and management using PL/SQL, UNIX Shell Scripts for backups. Worked with Data pump to take the logical backups of databases and Experienced in performing Point in time recovery using RMAN. Used oracle configuration assistants like DBCA(Database Configuration Assistant) for Creating databases, DBUA(Database Upgrade Assistant) for Upgrading databases and NETCA(Network Configuration Assistant) for creating Client-Server environment using Listener, TNS names etc.,   Involved in designing logical and physical data models using Erwin. Working Experience with Latest TOAD having new features PLSQL & SQL Script Debugger, Database Health Checkup, ASM Manager, Diagnose Extents, Segment Advisor, SGA Trace and Query Builder. Created indexes to facilitate easy user interface implementation and tuning. Implemented advanced features of Oracle 10g such as Automatic Database Diagnostic Monitor (ADDM), Automatic Workload Repository (AWR) for monitoring database performance. Tested database performance issues (monitoring and tuning) to ensure database optimization. Performed administrative maintenance, monitoring on Oracle database systems in a global 24x7 operational environment. Involved in gathering requirements from end users. Estimate growth of database size by detail analysis of the company's future policies and generating reports for the management to act in advance. Environment: Oracle 10g/11g, Sun Solaris, HP-Unix, UNIX, Linux 4.0, 5.x RMAN, DBCA, Data Guard, EXPLAIN PLAN, Cloning, OEM, STATSPACK, TKPROF, Informatica, PL/SQL and Toad. HSBC BANK Hyderabad, India                                                                         April 2009 to Sep 2012 Role: Oracle DBA/ PL/SQL Developer Responsibilities: Performed full and incremental Backup Using RMAN Utility for Production databases. Involved in Upgrading the databases using Database Upgrade Assistance (DBUA) Performed cloning and refresh of Database from production environment to test environment using RMAN Duplicate database and Data pump import export. Handling service requests within Service line agreement. Involved in configuration files like Listener.ora, Tnsnames.ora for Client-Server environment using network configuration assistant. Identified and fixed the logical block corruption using RMAN. Performed Data load on different databases from flat file using SQL*Loader. Performed Hot backup, cold backup and incremental backup for production database using RMAN. Monitored ALERT Log files to keep tracking the Oracle Errors and make necessary action to rectify them.    Environment: Oracle 9i/10g, Sun Solaris, HP-Unix, UNIX, Linux 4.0, 5.x RMAN, DBCA, Data Guard, EXPLAIN PLAN, Cloning, OEM, STATSPACK, TKPROF, Informatica, PL/SQL and Toad"}