{"text": "Name: elizabeth elizabeth E-Mail: elizabeth.elizabeth@gmail.com Address: Weinan, China Github: https://github.com/elizabeth LinkedIn: https://linkedin.com/elizabeth Phone No. 820804366582 Professional Summary:  5 years of experience in Analysis, Design, Development, Implementation, and Testing of various stand-alone and client-server architecture-based enterprise application software in python on various domain. Comprehensive knowledge of Machine Learning, Statistical modelling, data science, data mining, Natural Language Processing. Proficient in front end development experience using HTML, XML, CSS, JavaScript, Bootstrap, Node.js  Handy experience in developing web application implementing Model View Template Architecture using Django, Flask, and Spring web application framework. Worked on several python libraries such as NumPy, Pandas, Matplotlib, Seaborn, SciPy, NLTK, and have good knowledge in several Machine learning algorithms. Experience in working with several IDE’s such as PyCharm, Spyder, Eclipse, NetBeans, PyScripter, PyStudio, PyDev. Excellent working knowledge in UNIX and Linux Shell environments using command line utilities. Very good understanding of data structures, design patterns and object-oriented design concepts. Experience in programming languages like C++, Java,  R Experience in working with python under PyPi package and PyBluez for wi-fi and Bluetooth management tasks. Experience in working with Big Data using Apache Spark 2.3.1 with Hadoop package 2.7. Familiar with JSON based RESTful Web Services, and Amazon Web Services. Experienced in data analysis and modeling. Experience in writing complex queries, subqueries, and Triggers involving multiple tables using SQL for data integrity. Experience in designing and developing database system using RDBMS. Experience in successfully implementing algorithms such as Linear Regression, Apriori algorithm, K-means, Random Forest, and Dijkstra. Experience in designing flowcharts, Class diagrams, use case diagrams in-order to establish an effective communication with the team members. Strong understanding of statistical models. Excellent understanding of Software Development Lifecycle (SDLC) and its models like agile and waterfall. Experience in Unit Testing/ Test driven development. Experience in installing software using pip command for python libraries like BeautifulSoup, NumPy, SciPy, PySide, python-twitter, matplotlib, Pandas data-frame, uuid and used PEP8 coding convention. Very strong critical thinking, problem solving and analytical skills and ability to work with or without direct supervision. Self-motivated team player, with excellent communication and interpersonal skills. Technical Skills Education M.S. in Computer Science|  Franklin University|  CGPA 3.7|  2018 Bachelor’s in computer information system|  Pokhara University|  Background Client: Pfizer Pharmaceuticals\t\t\t\t\tFeb 18 –Oct 18 Responsibilities: Developed a fuzzy matching string application on python using fuzzywuzzy package on a set of csv files. Upgraded the program to Pyspark to accommodate big data. Utilized Python scripts to work on levenshtein package and jellyfish package in-order to calculate levenshtein distance and jaro-winkler on a dataset with billions of rows. Applied Natural Language Processing (NLP) techniques to process raw texts. Applied ojdbc7.jar file to submit the spark application in-order to read the database content and store the calculation result in Oracle database. Extensively applied SQL queries on big data for data manipulation.  Worked on AWS ec2 instance and Red Hat Linux Server 7.4 (Maipo) for big data operation. Wrote Bash Scripts to submit Spark application and assign memory to clusters. Applied standalone Hadoop clusters with to distribute the task. Successfully completed the task to meet the goal with the reduced time from 25 hours to 15 minutes to complete the entire task.  Involved in developing user profile module. Developed MVC with number of templates for login and user registration with end to end protocol to save in database. Responsible for debugging and troubleshooting web-application. Used JavaScript validations Controls for compare validations, Regular Expression Validations. Involved in creation of stored procedures in MS SQL Server 2005. Hands-on experience in developing front-end and back-end for user registration and authorization using Django models, views, forms, and MongoDB as the Database. Applied NLTK library for natural language processing in-order to find the type of resume uploaded in the website. Worked with JSON based REST web services and Amazon Web Services (AWS) Generated various graphs for business decision making using Python Matplotlib library. Used Python collections for manipulating and looping through various user defined objects. Maintained Oracle database.  Managed the wi-fi connections using python scripts. Responsible for debugging and troubleshooting the web-application. Designed and developed Use-Case Diagrams, Class Diagrams, and Object Diagrams using UML Rational Rose for OOA/OOD. Environments: Python 3, Spyder, anaconda 3, Apache Spark, PySpark, Oracle 11G, SQL, AWS, Linux, Big Data, SQL Server, HTML, CSS, JavaScript, Django, MongoDB, Python, GIT. Client: Vertical Ops, Orem, UT\t\t\t\t\t\tAug 16 – Jan 18 Role: Python Developer Worked on a Vertical Ops sales and operations planning dashboard that could keep track of client’s businesses. Responsibilities Developed entire frontend and backend modules using Python on Django Web Framework. Participated in requirement gathering and analysis phase of the project in documenting the business requirements by conducting workshops/meetings with various business users Used Pandas API to put the data as time series and tabular format for east timestamp data manipulation and retrieval. Managed, developed, and designed a dashboard control panel for customers and Administrators using Django, HTML, CSS, JavaScript, Bootstrap, jQuery and REST API calls. Created a Python/Django based web application using Python scripting for data processing, MySQL for the database, and HTML/CSS/jQuery and High Charts for data visualization of the served pages. Successfully migrated the Django database from SQLite to MySQL to PostgreSQL with complete data integrity Designed and developed the UI of the website using HTML, XHTML, AJAX, CSS and JavaScript. Performed troubleshooting, fixed and deployed many Python bug fixes of the two main applications that were a main source of data for both customers and internal customer service team Responsible for debugging the project monitored on JIRA (Agile) Involved in development of Web Services using SOAP for sending and getting data from the external interface in the XML format. Implemented Restful Web-Services for sending and receiving the data between multiple systems. Used Pandas library for statistical analysis. Maintaining SQL server database and updating PHP script. Migrated SQL reports in SSRS to Teradata. Created report queries utilizing Teradata SQL. Used pandas for data alignment and data manipulation. Worked on Jenkins continuous integration tool for deployment of project. Used GitHub for version control. Responsible for debugging and troubleshooting the web application. Environment:  Python, Django, MySQL, SQLite, PostgreSQL, HTML, Bootstrap, jQuery, CSS, JavaScript, SOAP, Restful API, Oracle DB, JIRA, Git, Linux Citrix Systems Inc, Fort Lauderdale, FL\t\t\t\tSep 15 – Jun 16  Role: Python Developer Citrix Systems, Inc. is an American multinational software company. Worked on software and web development to provide company’s clients with the most effective service to their business as per the company’s mission. Responsibilities: Involved in the project analysis, design, and implementation & debugging. Worked closely with different stakeholders of the system to understand their needs for this system integration. Implemented the Spring MVC architecture. Worked on Restful API development using Jersey API. Worked on different J2EE Design Patterns such as Factory Pattern and Singleton. Created User Interface screens using HTML, AJAX, CSS, Java script Developed Action classes, ActionForms, and Struts Configuration file to handle required UI actions, JSPs for Views. Wrote Python routines to log into websites and fetch data for selected options. Design and setting up environment for MongoDB using Shards replica sets (Dev/Test, and production). Developed approaches to improve NLP pipeline. Used Python modules such as requests, Urllib, and Urllib2 for web crawling. Developed build scripts to generate EAR and WAR files Tomcat Server. Developed server-side presentation layer using Spring MVC Framework using Maven. Used the light weight container of the Spring Frame work to provide architectural flexibility for inversion of controller (IOC). Performed Inheritance based Object Relational Mappings in tables to simplify the data using Hibernate ORM. Used Eclipse IDE and deployed the application on Web Logic application over Apache Tomcat server. Debugging and testing of the applications & fine-tuning performance. Provided maintenance support in production environment. Unit tested all the classes using JUNIT at various class level and methods level. Participated in complete SDLC process. Environment: Java, J2EE, Spring MVC Framework, JSP, JSTL, HTML, CSS, JavaScript, XML, Log4J, Ant, Oracle, Tomcat, REST, Servlets, Hibernate, POJO, Restful Services. Small Farmers Development Bank, KTM, Nepal\t\t\tAug 13– Dec 14 Role: Python Developer Worked on developing websites solely focused on promoting alternative energy for a project named ‘CleanStart’, that could also allow its member client to fill out their progress. Store that information in a database for analysis, manipulation and presentation.  Responsibilities: Designed frontend and backend of the admin application Python using Django Web. Developed consumer-based features and applications using Python, Behavior Driven Development (BDD) Worked on development of SQL and stored procedures for normalization and denormalization in MySQL. Wrote Python routines to log into the websites and fetch data for selected options. Launching Amazon EC2 Cloud Instances using Amazon Images (Linux/ Ubuntu) and configuring launched instances with respect to specific applications. Added support for Amazon AWS S3 and RDS to host static/media files and the database into Amazon Cloud. Successfully migrated the website’s main database from MySQL to PostgreSQL. Worked on angular JS framework to develop interactive websites based on client needs. Created custom filter in React JS in the application. Handled business logics by backend Python programming to achieve optimal results. Generated various graphs for business decision making using Python matplotlib library. Strong expertise in working with server-side technologies including databases, Restful API and MVC design patterns. Maintained program libraries, users’ manuals and technical documentation. Environment: Python 3.3, Django 1.6, HTML5, CSS, XML, MySQL, PostgreSQL, Linux, Angular JS, JavaScript, AWS, GitHub"}