{"text": "Name: margaret margaret E-Mail: margaret.margaret@gmail.com Address: Qingdao, China Github: https://github.com/margaret LinkedIn: https://linkedin.com/margaret Phone No. 80529352591 SUMMARY: 6 + years of experience as a Python and Java Developer, proficient coder in multiple languages and experience in Design, Development, Implementation of Python, Django, Flask, Pyramid and client-server technologies-based applications, RESTful services, AWS, C, C++, JAVA and SQL.  Experience in all phases of Software Development Life Cycle Process across various workflows (Requirement study, Analysis, Design, Coding, Testing, Deployment and Maintenance) in Web & Client/Server application development.  Extensive experience in developing web applications using Python, Django, Flask, Pyramid, Sanic frameworks. worked with several python libraries including Beautiful soup, Twisted, NumPy, panda, pyspark, matplotlib, SciPy, PyQt, Scapy, SQLAlchemy, Boto, logging, Nose, Blaze, Hug.  Good experience in developing web applications implementing MVT/MVC architecture using Django, Flask, Webapp2and spring web application frameworks, with good understanding of Django ORM and SQLAlchemy.  Hands on experience in working with various Version Control Systems, mostly GIT, subversion SVN, CVS and Mercurial. Experience working with Django, Jinja to handle the templating with python. Hands-on experience with industry-standard IDEs like PyCharm, Sublime, Emacs, Eclipse, NetBeans, Intellij, TOAD. Worked on the technologies like HTML, HTML5, CSS, CSS3, JavaScript, jQuery, XPath, RegEx. Extensive experience in developing applications by implementation of web based and client/server application using HTML, Bootstrap, PHP, CSS, JavaScript, Bootstrap, D3.js, and various Java/J2EE technologies. Strong knowledge of Data Structures and Algorithms, Object Oriented Analysis, machine learning and software design patterns.  \t\t\t\t\t\t\t\t\t\t\t\t\t TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE:\t Verizon, Richardson, TX                                                                                September 2018- Till Date Role: Python Developer    Description: Verizon Communications Inc., commonly known as Verizon, is an American multinational telecommunications conglomerate and a corporate component of the Dow Jones Industrial Average.  It offers smartphones powered by Apple's iOS, Google's Android, Microsoft's Windows Phone and BlackBerry OS. Its basic phones use Verizon's 3G network, while the smartphones use their 4G LTE network. The company offers different voice and data plans for its users.  The name of the project I worked on was VNF Automation (telecommunication project). It involved ROBOT Framework and Selenium using JAVA, writing scripts in Python and writing JAVA programs with Zephyr. Responsibilities:                                                                       \t                     Develop Python scripts for ROBOT software framework to automate test cases. Developed tools using Python, Shell scripting, XML to automate some of the menial tasks. Interfacing with supervisors, artists, systems administrators and production to ensure production deadlines are met.  Developed Business Logic using Python on Django Web Framework.  Developed views and templates with Python and Django's view controller and templating language to create a user-friendly website interface.  Manage source code in Bit Bucket and integrate it with Jenkins. Export and import Test Cases from Excel to Jira using Python scripts. Develop REST APIs and connect to Zephyr with Jira using JAVA. Executed SQL queries to fetch records from the DB and validate results obtained from the logs. Completed in-depth analyses for business-organization projects, reporting tools, back-end programs and payment processing app. Requirement analysis to define business processes and workflow for each of the Use cases Participation in Architectural discussions on Specifications, forming relationships and applying relevant design patterns wherever applicable Prepare Low Level design, High Level design document and creating the reusable components for across the application Implement) Model View Controller (MVC architecture Using Spring  Develop end-to-end application using Java 8, jQuery, Spring, brazil build tool Developed Web Application where MongoDB is used in the back-end part Participation in unit testing, code deployment, bug fixes, application support and downtime handling Participation in client interactions and daily standup meetings Mentor junior developers: assisted with code reviews, conducted technology discussion groups and presentations Prepare Daily Monitoring Report, Weekly Status Report and Monthly User’s Report Environment: Java, MongoDB,Jenkins, Unit Testing, Docker, Django, Python, JIRA, Zephyr, Selenium, Robot Framework, GIT, REST, AXURE. Data Science Knowledge Base Consulting Club, Bloomington, IN                       August 2015 - May 2018 Role: Python/JAVA Developer Description: IU Data Science Club is aims at making connections with different companies helping students to get job by letting them show case their projects. It undertakes opportunities letting students learn about tools and techniques for effective applied Data Science. Students build their skills by consulting with partners from academia and industry for short term Data Science projects.  They work together in teams to provide solutions to the clients and get feedback on their services, gaining useful knowledge along the way. I worked as a Research Assistant which resulted in my tuition waive. The projects I worked on were SPEA Affordable Care Act Research and Mindshift solutions.  SPEA Affordable Care Act Research project involved aggregation of large set of government data from the Agency for Healthcare Research and Quality (AHRQ), which is of interest to researchers, human resources, or other consulting companies. Mindshift Solutions goal of the project is to increase a call center’s ability to resolve a customer’s complaint, in the first interaction and in the shortest amount time while improving customer satisfaction and optimizing call center resources like knowledge base  Responsibilities: Designed programming course for GitHub, Tableau, R, MySQL and Python for non-programmers. Updated the website of Data Science Knowledge base which can provide students a forum to share projects, using Spring MVC. Requirement analysis to define business processes and workflow for each of the Use cases Participation in Architectural discussions on Specifications, forming relationships and applying relevant design patterns wherever applicable Prepare Low Level design, High Level design document and creating the reusable components for across the application Design and develop SQL scripts for creation of tables in DB2 for different modules Develop end-to-end application using Java, Maven, Spring, WebSphere Application Server, Data Source, JNDI lookup and Database creation Create Spring Rest Service Integration with Apache Subversion (SVN) and Jenkins Experience in design and developing Application leveraging MongoDB. Participation in unit testing, code deployment, bug fixes, application support and downtime handling Participation in client interactions and daily standup meetings Mentor junior developers: assisted with code reviews, conducted technology discussion groups and presentations Prepare Daily Monitoring Report, Weekly Status Report and Monthly User’s Report Environment: Core Java, MongoDB,RAD 7.5, WebSphere Application Server 7, Spring MVC, Spring Rest Web Services, JSON, AngularJS, Spring Security, Agile, Multi-Threading, Maven, DB2, JDBC, SVN, Jenkins, ClearQuest Cornerstone Information Systems, Bloomington, IN\t\t          August 2013 - August 2015 Role: Developer Description: Cornerstone Information Systems provide travel management software that reduces corporate/agency travel costs with real-time information. It provides technology to support the goal of increasing top-line revenue and improving operational efficiency and staff productivity to grow profitability.  Responsibilities: Single-handedly developed automation scripts using Selenium WebDriver (in Java) and integrated with Jenkins from scratch, thus starting a new trend in the company. Prepared and executed Unit-Smoke-Regression-Integration Test as per Systems requirement Scripted SQL/PLSQL queries extensively and developed SQL query scripts to export data from excel sheet using Java, which was greatly appreciated by the product management team. Worked in a dynamic AGILE environment and participated in scrum, sprint meetings with the development team. Oversee all stages of design, development, and deployment of new Java-based vendor application system for travel industry Worked on presentation layer, developed dynamic UI modules using JSP/JS pages along with jQuery and AJAX calls Implemented Maven Script to create JAR, WAR, EAR & dependency JARS and deploy the entire project onto the JBoss Application Server. Worked with Spring MVC, Spring Core, DAO, Spring Security, XML, JAXB. Designed Patterns to implement REST/SOAP based services. Integrating the front-end UI to back end using Spring MVC framework. Used the spring open source framework for building Servlet/JSP based web application on the MVC design paradigm. Configured Hibernate second level cache using Ehcache to reduce the number of hits to the configuration table data. Environment: Unit Testing, Jenkins, C#, Docker, Selenium, AGILE, LINQ, MySQL, Pl SQL."}