{"text": "Name: mary mary E-Mail: mary.mary@gmail.com Address: Liaocheng, China Github: https://github.com/mary LinkedIn: https://linkedin.com/mary Phone No. 834607252279 Summary Over 5+yearsof industrywide experience as a QA Automation Engineerin e-commerce, Banking,domain. Also have experience in development/programming part of the applications.Has diversified experience in IT, is seeking QA Tester position which will utilize and incorporate my current skills and experience, as well as expand them to assist the organization in being successful. Experienced with testing tools such as HP Quality Center, Quick Test Professional (QTP) SOAPUI and SQL Management Studio Tool 2008 Extensive hands on experience with all levels of testing including Smoke testing, Functional testing, Integration testing, System testing, Regression testing and Database testing Experience in Manual and Automation testing. Extensive experience in Quality Assurance using Java, Python, TestNG, Junit, SQL, Selenium RC, Selenium IDE, Web Driver, Manual Testing, Performance Testing, Automation, Quality Center, SoapUI, JMeter. Test Planning, Test cycle estimation and Test strategy document creation and defining SQA processes whenever required.  Expertise in Black box and White Box testing Strong experience in HP Quality Center and ALM-11 Extensively involved in Backend testing of SQL Queries using Oracle & SQL Server  Experience in creating Test Plan, Test Case, Test Procedures and Test Metrics Proficient in using Quality Center, Test Director, Bugzilla, JIRA to track defects and enhancements. Test Plan, Test Conditions, and Test Cases; ensuring adequate testing of software both before and after completion; conducting and documenting UAT. Responsible for SaaS provisioning and ORT testing on On-Demand servers Experienced in writing and executing SQL queries to verifying Source-to-Target mapping and transformation rules (ETL Processing) in Data warehouse manually.  Experience in analyzing the FSD (Functional Specification Documents), functional design documents, and use cases to formulate test strategy, test plans, and test cases for manual and automated testing for various applications to ensure proper business compliance. Manage UST and Merrill channel high net worth client investment in various alternative investment products. Extensive experience using manual testing to troubleshoot systems integration, GUI, Compatibility, User Acceptance Testing (UAT), SOA Testing using web services, functionality, Database and regression testing. Good Expert on Tools like HP ALM QTP, Quality Center  Experience in Web service testing using SOAP  Worked in SDLC Methodologies like RUP, Agile, Waterfall and Spiral. Hands on experience in Manual and Automated testing using Quick Test Pro(QTP), Load Runner, Quality Center  Performed Back-End testing on UNIX to check the log files and permission Strong analytical and problem solving skills with proven records of organized and timely project completion Extensively worked with Performance testing, Functional, Integration, System, Regression and Black Box testing. Extensively created and executed SQL queries in Oracle, SQL Server, and MySQL tables in order to validate data at the back end Experience in SOA Testing, Agile Testing, Manual testing, System Integration testing, Functional testing, Regression testing, Smoke testing, Black Box Testing and Web services Testing. Technical Skills Client: GMAC Mortgage, Fort Washington, PA   \t\tOct-2016-Aug-2018                                                                    QA Automation Engineer Mortgage group in GMAC implemented a new web-based application that allows customers to shop for mortgages, providing multiple choices based on specific situations like refinancing, first time home buyers, applying for new loans etc. The tools designed for calculation purposes were developed by finance center, which provides web based financial calculation services. Worked with business analysts and developers and user group managers to test the requirements and automate the test scripts. Responsibilities Worked closely with Development (UI), Product Management and Technical Operations during the development,  Wrote, Developed and Implemented Test Plan, Test Scenarios and Test Cases using HP Quality Center (QC) test, and launch stages of the software development and release cycle (Waterfall and Agile). Developed and executed manual test cases and automated test scripting using Selenium IDE, Selenium RC and JUnit. Involved in all stages of Test life cycle Test planning, Test case design, Execution, defect Tracking, Metrics and Status reporting. Involved as part of automation team using QTP, developed test scripts.   Logged the errors, reported defects, determined repair priorities and tracked the defects until resolution using ALM. Documented all stages of the project, generated documentation using Java API Documentation Generator (javadoc). Worked with Test Complete to  have access to methods and properties of Java application objects during tests Run automated ruby scripts on a Linux machine.  Installation of HP-QC V10.0 and creating new domains in HP-QC  Created AJAX based XML editor as a testing interface. Developed various test plans and involved in preparation and execution of test cases using SQA Automated Tool. Developed automated test systems using Quick Test Pro, Win Runner, Test Complete and Silk Test.  Developed and implemented current website usability documents that are used for the organizational website. Installing, configuring Application server and components of SOA suite(ESB) for reusability Experience in utilizing XML for SOAPUI web services testing Configured data sources, JDBC provider for the WebSphere Environment and ran applications with that configuration. Identified the bugs and kept track of the defect report using ALM Quality Center, and also analyzed the root cause for defects. Used SoapUI for testing SOA and Web Services (SOAP, Restful WSDL). Installation of IBM HTTP server and generating plug-in files and clear knowledge of HOGAN mainframe. Involved in performing different types of Testing Functional, Integration, System and Regression Used Silk Performer to check the source of performance delay: network or client delays, CPU performance, I/O delays, or issues with database server Shared application logs to development team by tailing logs from UNIX environment. Environment:HP Quick Test Load Runner ,C# .Net C++Oracle, Web Services Restful SQA Team Suite , ALM HP Quality Center , QTP, HTML, XML, MS project, SQL, Oracle 8i, and Windows XP Client: National City Bank, Columbus, OHJul-2014-Sep-2016\tQA Automation Engineer National City has many mortgage options to meet customer needs such as fixed rate mortgage, ARM, Jumbo, and so on. The bank also provides options for securities and for collateral management. The project was to develop a JAVA and HTML based web application that will allow users to maintain and set-up Account Information, payment information, Escrow Analysis and many other business Areas. Documents also had to adhere to the three pillars in Basel II. Responsibilities Worked on test automation framework and test cases in Selenium on the web-based applications.  Focused on creation and execution of TestNG tests with Java/TestNG and Selenium. Developed white-box tests in for the product.  Created Automation scenarios for regression testing using the manual test case flows. Worked on Automation Framework called TAF for Selenium Web Driver in Java. Developed External Library using Java for Selenium Automation Created test suites and test cases using Web Driver for various scenarios in the application. Created Java based scripts for Selenium Web Driver with TestNG as Test case frame work. Automated the Regression Testing using Selenium Web Driver and TestNG Worked in Agile SCRUM model. Performed the mobile testing in different platform like Android and IOS.  Gathered consolidated requirements for generating performance goals and test plans Utilized Load Runner for performance testing to analyze the response times of the business transactions under load Analyzed test results – traced and troubleshoot performance bottlenecks. Created the UAT Plan and test scripts and participated in UAT. Used Rally tool for Scrum and test case management, managed test results and for creating the defects in Dev environment in QA environment. Analyzed the Batch Process, Work-flow behavior and SOA/ Web Services testing using SoapUI. Used JIRA for bug filing and bug triage. Involved in testing multiple release for new features and regression. Verified backend data writing complex SQL queries.  Performed white box (API tests) on Stored Procedures, verified complex constraints/business rules implemented in triggers through the backend. Demonstrated skills using best practices in QA methodologies including automated testing techniques, White Box and Performance/Load testing strategies, Release Management and Customer Support. Used Rest services, Parsed the xml using Perl scripts in backend. Followed project milestones; design, implement, document, and execute tests. Evaluated and communicated results and reported module failures. Developed processes, test strategies and test plans on all build releases for the product. Cross platform testing done using different browsers and environments. Presentation of the QA Status report and the Defect Status reports using JIRA.  Environment:Java, Perl, TestNG, Selenium RC, Selenium Web driver, Eclipse IDE, Perforce, Firebug  Oracle 9i/Oracle 10g, PLSQL, XML, HTML, DHTML, Load Runner, Quality Center, JIRA, UNIX ,Windows XP. Symantec, Mountain View CA\t\t\t\t\t\t\tFeb-2013-June-2014\nE-Store – Renewal Center\nQA Analyst E-Store is a customer facing ecommerce portal, provide the capability for the various customer segment like Retail, online, partner and OEM to renew/upgrade their subscription and purchase various Norton product from Symantec store. It  provide the facility for the business user to set up the catalog, promotion, sales campaign and trade compliance rules and landing page rule for geo-located customer etc. This project follows service oriented architecture to reuse the various services like Norton account, Payment, Billing, Entitlement, Licensing, Trade Compliance etc across the organization. Responsibilities Involved in writing test plan and test cases. Conducted Back End Testing, GUI/Web Testing, Positive Testing and Negative Testing. Responsible for handling production issues reported by clients and for correspondence with clients related to these issues.  Responsible for preparing training data and training documents for clients. Prepared test data and user acceptance test cases for clients. Responsible for producing bug reports that contain detailed instructions on the bug environment, and how to reproduce the problem. Performed GUI Testing, Regression Testing and UAT  Performed product based GUI testing Modifying Object Repository to help QTP identify GUI objects and enhancing the scripts using VBScript in Expert View.  Provide AGILE project management controls, project plans, timeline schedules, facilitate RAD sessions, and review software defects Automated framework for the purpose of acceptance testing using selenium. Environment:Java, HTML, Struts,Oracle,Websphere, C#,Net Framework, Quality Center,"}