{"text": "Name: alice alice E-Mail: alice.alice@gmail.com Address: Dezhou, China Github: https://github.com/alice LinkedIn: https://linkedin.com/alice Phone No. 135052229892 CAREER SUMMARY 6+ years of consistent experience in Finance, Banking, IT and a seasoned QA Analyst with an added advantage of different methodologies. Extensive knowledge of SDLC (Software Development Life Cycle) including Waterfall, Agile -Scrum and RUP methodologies. Good Experience in testing of Mobile and Web Based Application.  Good understanding on Manual and Automation testing using testing tools such as HP Quality Center, UFT/QTP and Load Runner.  Performed Device testing to ensure the customer is provided with a high security to make any kind of transaction in order to prevent from fraud activity.  Good knowledge of testing mainframe system, Mainframe Tools, and testing Mainframe environment. Knowledge of Software testing, User Acceptance Testing, and Mainframe development. Skilled in reviewing various project related document like BRD, FRD, Use case, UML diagram. Knowledge of different RDBMS like Oracle, Microsoft SQL Server, and DB2. Performed Manual and Automated Testing on Windows and UNIX platform. Experience in writing Test Plans, defining Test Cases, developing and maintaining Test Scripts and documenting all phases of the QA process. Experience in using Automation Tools such as QTP (HP), and Quality Center (HP). Expertise in testing web services using SOAPUI. Implemented Sanity Testing, Smoke Testing, White Box testing, Black Box Testing, GUI Testing, Functionality Testing, Performance Testing, Positive and Negative Testing, Unit Testing, Security Testing, Stress Testing, Integration Testing, System Testing, Volume Testing, Load Testing, Adhoc testing, cross browser, cross platform compatibility testing, Mobile Testing, User Acceptance Testing (UAT) and Regression Testing of Web Based Applications and Client-Server Applications. Experienced to use cases and read existing use cases, and also executing the test as well  Experience in reporting bugs using Bug tracking tools such as HP ALM and JIRA. Reviewed Requirements in Requisite Pro and develop Test Cases/Test Scripts, execute tests and log results in Rational Test Manager. Extensive experience in Reporting, Data Warehousing, and Data analysis for creating Business Intelligence solutions for end customer. Execution of Manual/Functional testing, SIT, Regression testing and UAT Experienced in GUI, Regression, and Functionality Testing. Experience to execute test life cycle activities, which include but are not limited to stand test execution, cross system test execution, regression, end to end and defect fix tests.  Involved in maintaining Test Matrix and Traceability Matrix and perform Excellent communication, presentation, interpersonal and time management skills. Experience in interacting with business analysts, developers, and technical support groups. Hands-on experience across a range of logistics functions including: production planning, inventory management, customer service, forecasting, transportation and distribution with a diverse group of companies, products, and services.  Well-developed business and supply chain understanding attained through diverse assignments in logistics, sales, and business analysis at both staff and manufacturing locations. Strong knowledge of the Systems Development Life Cycle (SDLC) models such as Water Fall  Identifying and documenting critical requirements through analysis of the department’s workflow and information flow. Creative and aggressive self-starter with integrative thinking skills, capable of forming and maintaining positive and productive working relationships in internal, external, independent, and team environments  Highly motivated, organized and results and detail oriented with excellent interpersonal, communication and presentation skills. Proven capability of adapting to new and fast changing technologies TECHNICAL SKILLS Project Methodologies: \t\tAgile, Waterfall, Scrum Testing Tools:\t\t\t\tHPALM/QC, QTP, SOAP UI Bug Reporting Tools\t\t\tRational ClearQuest, HPALM/Quality Center, JIRA, Bugzilla, TFS Operating Systems:\t\t\tWindows 7/8/10, UNIX, iOS, Android Database:\t\t\t\tOracle, MS Access, SQL Server, DB2, MySQL Quality Assurance: \t\t\tSoftware Application Testing Life Cycle  Languages:\t\t\t\tSQL, VBScript, XML, HTML, CSS, Java Script, WSDL Business Applications:\t\tMS Project, MS Visio, Microsoft Office Suite, MS Outlook CAREER EXPERIENCE Fifth Third Bank, Cincinnati, OH\t\t\t\t\t\t\t\t        Aug 2016 – Nov 2017 QA Tester Fifth Third Bank is among one of the top regional bank in USA. The project at Fifth Third Bank concentrated on Fraud and Financial Crimes Prevention. This project helped finding fraud detection risk factors quicker than conventional approaches by analyzing and extracting various data that was stored in data warehouses. Then the project implemented new datasets into in-database analytics processing with Teradata RDBMS in MPP (massively parallel processing) architecture. In-database analytics facilitated and optimized path analysis, pattern analysis and faster iterations of fraud analysis. My role in this project was to create and to export data sets from array of sources, including email, branch, online, call center and more. Additional analyses from new data sets produced new variables, risk factors, models, rules or scenarios to run in real-time fraud engines, which then helped Fifth Third to identify and catch many fraudsters more efficiently.  Responsibilities: Maintained Data consistency and database integrity. Extracted and analyzed data from existing data stores and performed Ad hoc queries. Assisted in the design and implementation of new production and DB systems. Intensive use of SQL within the Teradata platform.  Tested Anti Money Laundering for Banking and Financial applications. Analyzed the Bank Secrecy Act/ Anti Money Laundering (AML) financial crime and fraud alerts, clearing cases or escalating for suspicious activity report filing as warranted. Part of team that coded monthly Datamart scripts which extracted data from Third-Normal form Teradata table. Involved in Production Support and troubleshooting data quality and integrity issues. Worked with the business users to understand & document the functionality requirements. Performed detailed data analysis and understood existing architecture and data flows. Ensure that all anti-money laundering (AML) compliance procedures are followed. Frequently used the Advanced Microsoft Excel (Pivots, Lookups, etc) for various data analysis activities and automating the business processes. Automated test scripts using QTP for Functional Testing of the application.  Performed Functional Tests using Standard and Text Checkpoints in QTP. Performed data analysis, data reconciliation and data retrieval from various systems along with identification of data gaps and data quality issues. Provided detailed business and data requirements including complex data mappings.  Interacted with end-users and business analysts to identify and develop business requirements and transform it into technical requirements and ultimately responsible for delivering the solution. Involved in gathering, analyzing, and documenting business requirements, functional requirements and data specifications for Business Objects reports. Performed System, Integration, Ad hoc & UAT testing of complex applications. Involved in creating Test cases, Test Data reviewing and maintaining and executing detailed Test scripts for User Acceptance Testing (UAT), analyzing bugs and follow up with team members in fixing errors and retesting. Maintained and improved the GUI interface of the Data Control Department Database in MS Access/SQL for all reports and super users within the company.  Used data analysis techniques to validate business rules and identify low quality missing data in the existing data warehouse. Performed SQL queries in the mainframe to extract data required for various different scenarios. Responsible for balancing reports with previous runs of the report and disbursed all company’s reports on a daily basis. Interfaced and resolved print report issues with department heads. CITI Financial Services, New York, NY  \t\t\t\t\t\t\t        Sept 2014– Jul 2016 Quality Assurance Analyst CitiFinancial is a member of CITI Group, world's largest financial services provider, incorporating more than 2000 offices in the United States and Canada. My project in CITI Financial Services, New York was to work as a QA Analyst for testing an application, developed for various mortgage products offered by CITI group. Current application was an enhancement of previous application that provides customers and employees to accept the mortgage applications and applying and processing for loans etc.  Responsibilities: Created Business Workflow based on the requirements gathered from the client. Created functional specification documents based on the business requirement documents. Assembled business requirement documents (BRD) and the functional specifications as per the user requirements. Worked with SMEs and business partners to gather business requirements for Retail Pricing Management. Exceeded Client expectations by gathering requirements, documenting them as per requirement and finally forwarding the same to the development team. Developed Test cases for multiple releases based on Test Plans and minimal business requirements. Participated in weekly status review meetings with all business groups. Tested user interface and navigation controls of the application using QTP. Worked with various Checkpoints in QTP. Automated test cases and some workflows of the system using QTP. Created function and object libraries using QTP. Performed E2E data validation involving multiple systems to ensure the data integrity. Developed SQL queries, functions, stored procedures and triggers to perform the backend testing of the data. Worked on Web Services (SOAP &Restful) using SOAP UI and validated the JSON Messages. Validating SQL query for credit card application.  Involved in testing using automated testing tools like Visa and MasterCard simulators and customized testing macros which would reduce the manual testing hours. Integrated Automation scripts (Selenium WebDriver API) in Continuous Integration tools (Jenkins) for nightly batch run of the Script.  Prepared Business & System Use Cases and supporting all the documents with UML Diagrams such as Use Case Diagrams, Class Diagrams, Activity Diagrams, Data Flow Diagrams, Sequence Diagrams, Collaboration Diagram and Process Flows (Business and System) using UML modeling tools such as UML. Conducted JAD/RAD Sessions & weekly meetings to monitor the project progress Validated transactions for different cards like VISA, MasterCard, Discovery and etc.  Develop test cases on various types of credit card applications.  Interacted with developers to report and track bugs using Quality Center. Performed End to End testing across the applications using SQL and UNIX. Fairly worked on Groovy script to customize test in SOAP UI. ALM Quality Center was used to create the test plan, store test cases and run the test sets. Conducted Manual Functionality and Regression testing for each build and version Validated the data across the system during UAT. Performed testing in different environments- QA, UAT and Production environment. Conditioned the data for testing different environment. Prepared and maintained documents like Defect Report, Test Report and Trace Matrix. Followed the Agile methodology for the entire SDLC with daily scrum and through Sprints.  Had very strong interaction with the development team throughout the project. Organized JAD Sessions to resolve issues and conflicts, and to arrive at quick agreements regarding the system architecture design. Designed and developed test structure for web services to validate API calls using SOAP UI. Created Process Work Flows with supply chain perspective, Functional Specifications, and responsible for preparing Software Requirement Specifications (SRS), Functional Specification Document (FSD). Created application functional document and use cases. Defined requirements through the Use Case and detailed supplementary specifications. Managed scope and deadlines. Participated in various meetings and discussed enhancement and modification request issues. Worked with the clients on the final signing process in the User Acceptance stages. Huntington Bank, Columbus, OH\t\t\t\t\t\t\t\t       Nov 2012– Aug 2014 Software Test Analyst Huntington Bank is a leading bank in the great lakes area. I worked on the Credit Care project. The project involved testing the credit card application which will provide up-to-the-minute account information, schedule on-line payments, review recent statements and fraud alerts. I also worked on the plastics module. It involved checking the functionality when a new card has been issued. There were various cards ranging from personal to merchant credit cards that had to be tested. Responsibilities: Participated in requirement walkthroughs and creation of test plan. Involved in developing Test Plans, Test Cases to test the Screens and workflows for Quality Assurance. Wrote Test Cases from the Test Plan and manually tested the application. Participated with users in understanding the business requirements. Involved in testing both outbound and inbound call in Cisco finesse. Executed test cases in Quality Center. Involved in testing the third party software like Aspect Quality Management (AQM), eGain, Noble OnQ, Cisco Finesse both in QA and Production environment. Involved in various projects related to Data Modeling, System/Data Analysis, Design and Development for both OLTP and Data warehousing environments. Performed the Back-end testing, in mainframe environment, by writing and executing SQL-Queries. Ensure that all anti-money laundering compliance procedures are followed. Making sure that the call is recorded and monitored in AQM. Manually performed Functional Testing of the application from the test cases. Manually performed Backend Testing using SQL Queries to test Oracle Database. Retrieved records from multiple tables from Oracle Database through SQL by using joins such as Inner Joins, Outer Joins using Oracle. Tested web, mobile applications and APIs in Agile process  Tracked, reviewed, analyzed defects in the application using JIRA a defect tracking tool throughout the bug life cycle.  Manually conducted Positive Testing / Negative Testing. Performed Regression Testing after bug fixes or system enhancement. Performed Integration testing and Configuration testing. Effectively used Plan View for Project document repository, updated risks and issues related to UAT, updated documents related to Testing / UAT, Test files, Test data in the shared folders. Took part in internal agile transformation and in presenting the company's agile transformation to customers. Modifications were tested using standard product database against approved Technical Specification prior to customer distribution. Testing within AML industry and managing UAT testing between multiple organizations.  Verified the application’s functionality on different Configurations. Performed User Acceptance Testing (UAT) manually. Worked on back end testing in mainframe as well as SQL, DB2.  Analyzed and plan data using reports and graphs generated in QC. Documented defects in Enterprise Quality Center and helped developers identify the modules and code sections to be fixed.  Used JIRA as well for story writing and defect tracking. Attended the Weekly meeting. HSBC Bank, New York, NY\t\t\t\t\t\t\t\t                     Feb 2011– Oct 2012 QA Analyst/Tester HSBC Bank is an American subsidiary of UK-based HSBC Holdings plc, with its operational head office in New York City and its nominal head office in McLean, Virginia. The project is based on implementation of Web-based application to enhance the payment processing module, where payments module provides facility for online transactions. It provides facility for incoming and outgoing payments, authorizations, and summary of payments.  Responsibilities: Created and Maintained Test Cases in Quality Center. Followed Waterfall methodology for the entire SDLC. Worked with users in understanding the business requirements and in definition, creation and execution of the test scenarios and approaches.  Defined and implemented the QA methodology, strategies and metrics.  Developed test plan and defined test strategy for performing system testing of the client application being developed.  Test Activities included Functional testing, GUI testing, Integration testing, System Testing. Regression Testing, Sanity testing, and Ad hoc testing, cross browser, cross platform compatibility testing. Conducted UAT, documented and reported user feedbacks to management team, and developed training materials for different end users and assisted in User Training for the new system. Performed UAT by formally documenting the results of each test and provided error reports and correction requests to the developers. Used Soap UI for integration testing of the Web Services. Involved in Backend Testing and executed SQL queries.  Backend testing of the DB by writing SQL queries to test the integrity of the application using TOAD.  Used SQL for Querying the SQL Server database for data validation and data conditioning.  Wrote and modified required UNIX scripts. Re-tested the application to check whether the defects are resolved or not (Regression Testing). Defects were tracked, reviewed, analyzed and compared using Quality Center. Tested the Script for different sets of data using parameterization and Data Driven testing. Maintained Traceability Matrix and conducted Gap Analysis. Interacted with the developers and other team member to discuss the issues and reported the details of the bugs using Quality Center reporting tools. Developed detailed test plans and test cases, Enter and Exit criteria for the application being tested and ensured that standards for documentation were followed. Created and maintained the Tractability Matrix and Test Matrix.  Troubleshoot new releases and production issues. Interacted on a regular basis with web developers and business analysts on any Change of Requirements. Performed Manual Testing on different modules of the application. Manually conducted Positive Testing by putting correct inputs to ensure that it functions as desired and Negative Testing by putting incorrect inputs to ensure that it fails gracefully. Wrote complex SQL queries in Rapid SQL to perform the backend testing against Oracle/Sybase database Used UNIX Shell Scripts to extract data from the database for Back End Testing Used QC for Tracking Defects and Reporting Bugs. Defined Test Steps for each test in the Tree. Also, created Manual Tests in QC Scheduled a test using Test Run Schedule in QC. Participated in the Project Meetings and Walkthroughs in pursuit of Information Sharing as well as resolving the intermittent issues of concern Drafted Test Strategies, Test Cases and Test Plan based on Functional Specification."}