{"text": "Name: helen helen E-Mail: helen.helen@gmail.com Address: Ōsaka, Japan Github: https://github.com/helen LinkedIn: https://linkedin.com/helen Phone No. 945279933839  \t\t OBJECTIVE: To achieve a challenging position in Software Development and QA Automation Testing in a result oriented company, where I can contribute towards growth and advancement of software developed using my skills and education SUMMARY: 4+ years of experience in Software Quality Assurance in Manual/ Automation Testing A competent ISTQB certified professional with rich experience in software testing as Test Analyst, QA and Support. Extensively used Selenium Webdriver to access Form Elements, Automating list boxes, Handling Alerts, Handling Frames and iFrames. Skills rating 7+/10. Planned, Designed, Developed and Maintained different complex Test Automation Frameworks(Datadriven,Keyword) Solid experience in QTP. Skills rating 7/10.Used QTP for parameterized testing. Currently updating my skills set by learning JMeter, TestNG, SOAP/UI  Extensive expertise on testing Client/Server and Web based applications on various platforms Strong knowledge on  every phase of SDLC and STLC  methodologies Experience in working on Agile methodologies (Scrum, Test driven) with timely delivery against aggressive deadlines Proven experience in testing Health/Clinical/Pharmaceutical applications related to health, clinical and pharmacy domains and sound knowledge on medical terminology and health/pharmacy standards Expertise in using  Test/defect management tools like HP Quality Center, JIRA , iASSIST (iSOFT-CSC) and Silk Central Sound written communication and reporting skills including proven experience in reviewing requirements, writing Test conditions, Test Cases and ensuring the coverage of requirements through Traceability matrix  Expert in System Integration testing(SIT), Unit testing, Functional testing ,E2E testing, Regression testing, UAT, Smoke and Sanity testing  Expertise testing CRM/ERP applications with multiple modules and complex workflows related to Finance, Health, Retail, Warehouse and Telecom domains Hands on experience in writing VBScripts, SQL queries and working on Crystal reports 9,XI reporting tools Experience in automating tests using UNIX scripting and SQL queries. Experience in testing Web, N-tier, Web Services and Client/Server software Expertise in GUI, Functional, Regression, Integration, System, Smoke, Sanity, User Acceptance, Black box Testing, Performance, Load Testing and Database Testing Experience in Test Data creation based on requirements, Test Case execution, generation and documentation of Test results Experience in writing SQL queries and other database operation for various RDBMS like ORACLE and SQL Server Excellent communication, analytical and problem solving, interpersonal, leader ship skills and can think out of box Proven experience working in complex work environment involving multiple vendors by communicating and coordinating with business stakeholders Having good judgment Skills while reporting and prioritizing software bugs in conjunction with the development and QA managers Ability to work independently and as an excellent team player, ability to meet tight deadlines, quick learner and proactive attitude TECHNICAL SKILLS: Testing Tools\t\t\t\t: QTP, Selenium Web Driver, Selenium IDE Development tools\t\t\t: Eclipse, NetBeans IDE, Dreamweaver Continuous Integration Tools \t\t: Jenkins Version Control\t\t\t\t: GIT,  Visual Source Safe Operating system\t\t\t: Windows, UNIX, LINUX, MS-DOS Languages\t\t\t\t: Java, SQL, PL/SQL, Visual Basic, HTML,XML Databases\t\t\t\t: Oracle, MySQL  Database tools\t\t\t\t: My SQL Workbench, Toad,phpMyAdmin Application servers\t\t\t: IIS, JBoss, WebSphere, Apache Tomcat Scripting Languages\t\t\t: JavaScript, VB Script Tracking Tools\t\t\t\t: Bugzilla, Atlassian Jira,CSC iSOFT/iASSIST EXPERIENCE: Health Support Services (HSS, NSW Health)\tAugust 2012- March 2014 Solution Testing Analyst Project: Pharmacy Improvement Program Pharmacy Improvement Program is project by HSS at NSW health to improve and enhance the provision of medication in NSW public hospitals making it safer for patients and more efficient for the NSW public health system. The program aims iPharmacy (iSOFT from CSC Health) upgrade-which ensures all NSW public hospital pharmacies are upgraded to use the same information management system and Pharmaceutical Benefit Scheme (PBS) Highly Specialized Drug (HSD) online-Dispensing, online claiming functionality and integration with Medicare Australia systems. Created and executed test cases iPharmacy v5.6 1003 (build 5) and reported the defects found to iSOFT by iASSIST. Extensively used the record and playback functionality of QTP. Implemented various checkpoints for data validation and synchronization. Developed reusable functions using QTP. Performed Data-driven testing -- Parameterized the fixed values in checkpoint statements, created data tables for the parameters and developed scripts for the parameters to read new data from the data table  Logging and tracking defects on a release basis using Quality Center Involved in daily/weekly meetings with BA’s, Test manager and other project team Achieved mile stone in upgrading the Participated and successfully completed User acceptance testing (UAT) at Local health district public hospital sites during their iPharmacy upgrade (build 8) Extensively performed System integration testing (SIT) with the portable PDE devices and their integration with iPharmacy system Liaison closely with the pharmacists and vendor to clearly understand the business processes and criticalities of dispensing process in public hospitals Worked as SME for PBS(HSD) and Non-PBS and developed sound understanding of  dispensing, claiming concepts  Monitored the data flow and work process by back end database testing using SQL Reviewed the functional requirements and prepared the user manuals for the end users Involved in creating test plan/strategy for the HSD online project Performed system integration, functional and regression testing with various modules (Dispensing, Inventory, Medication chart, Kits, Imprests list, Bin and manufacturing) Successfully validated the HSD online claiming and interactions/responses to/from with Medicare Australia system by performing System Integration Testing Tested the sate wide data replication process of Hospital Pharmacy Product List (HPPL) products/data from a SWMD (state wide master data) to the local database  Generated, created and edited various system and application reports using Crystal reporting tool Converted and verified the crystal reports and labels from CRVIII to CRXI Successfully tested iPharmacy  application on Win 7,Win XP,FAT client and Citrix  environments \t\t\t\t Environment: QTP, QC , VBA Power builder, SQL server 2005/2008,Citrix Xen App, iASSIST (iSOFT)  HotHouse \tApril 10-2012 – July 2012 Software Quality Analyst HotHouse is one of premier Australian digital marketing agency. HotHouse works with some of Australia's best known brands guiding them online, building their digital capabilities and transforming their business models. Prepared test plan based on requirements specification and wireframes. Executing Automated Test cases by running Selenium scripts. Testing of toyota.com.au websites in FireFox by using record and play feature of Selenium IDE. Used Firebug Tool to identify the HTML Elements using id, name, XPath etc. Added annotations to the test. (Selenium) Extensively used Selenium Webdriver to access form elements, automating list boxes, handling alerts, handling frames and iFrames. Prepared and executed Selenium scripts to test various Toyota.com.au websites.  Logging all bugs /issues/enhancements in HIMS – JIRA. Co-ordinate escalation, resolution, re-test and closure of all bugs. Testing of various forms of Toyota websites and verify the values in the backend database. Proof read and edits websites. Prepared regression test cases and executing them on staging and production servers. Environment: Selenium Webdriver , Selenium IDE, Alfresco, Drupal , MySql, HIMS JIRA, Accent Software \tAugust 2011-March 2012 Test Analyst Carnegie Morgan Hill is one of Sydney’s leading financial planning firms who provide advice on investments, super fund, home loans and property investment. CMH financial planner CRM helps CMH staff in Lead management, opportunity management, activity management and various day-to-day tasks. CMH planner systems are an end-to-end process management system with various business activities in financial industry. The system is integrated with RAT tool, VEDA CRA credit check, SMSF Fund calculator and many useful tools. System designed with multiple automated complex workflow steps so that the business process is made easier without manual intervention.  Preparing and updating test cases to comply with the use cases and client requirements Performed SIT, Functional testing, data migration and workflow testing Active participation in peer reviews for all test deliverables Monitoring the flow of transactions to check the effectiveness of the system Coordinating with developers in performing Unit Testing and defect analysis  Prepared user training manuals and process flow diagrams for end users of the system Defects were Tracked, Reviewed and Analyzed using Quality Center.Used HP Quality Center for creating and executing test cases, for defect tracking and for generating reports Liaise with clients in UAT at client site and achieved high customer retention.  Environment: C#.Net, SQL server 2005, Dev Express, HP QC, Windows server 2008, Insyte workflow server   MLC – Online Content Services \tAug 2010 – March 2011 Software Web Tester \t\t                              MLC is an Australian asset and wealth management company, which was acquired by the National Australia Bank (NAB). It provides investment, superannuation, insurance and private wealth services to corporate and institutional customers. Test, Review online content  of MLC & NAB Wealth websites including static web pages, online forms, DHTML, video and other rich media. Validate MLC websites whether they adherence to style guides, accessibility and usability standards. Ensure content has been though appropriate review and sign-off. Developed and executed selenium scripts to validate various forms, links, and tables of the MLC advisory sites. Automated the verification of MLC advisory tests using Selenium Webdriver. Manage CMS task escalations by raising tickets using IBM Lotus Notes. Work with Vignette and ILWWCM content management systems (CMS) and static HTML as required. Assist in the identification and development of more effective content publishing processes. Effectively manage workflow via the publishing request database, content services team inbox and Vignette CMS. Ensure content owners are taking responsibility for updating their content after it has been published. Restructuring of content sections within the existing websites. Modify and create banners and other images for the websites. Managing stakeholder access privileges to various online systems. Support the delivery of online components for campaigns and events. Assist the project managers in delivering enhancements to the websites. Environment: Selenium , Vignette,Lotus Notes, Domino,  Lotus Workplace Web Content Management (LWWCM) Multilateral Business Solutions \tFebruary 2009 –July 2010 Software Tester Project Description: Transcend Financial Solutions Transcend Business Solutions is an established global financial business solutions. Transcend solutions provides necessary infrastructure for the growing demands global financial business solutions and international funds transfer. Preparing the Test Specification to test the end-to-end workflow of Transcend Business system. Preparing the Test Specification to test the end-to-end workflow of Transcend Business system. Functional testing of various forms of the website. Verify the data is present in the backend database using phpMyAdmin Executing the test cases on Google Chrome, Mozilla Firefox and Internet Explorer. Preparing the Regression Test Specification. Executing various regression tests after migration new version of Joomla. Perform conformance testing after the defects are fixed. Logging all defects found in the Bugzilla. Installing and Deploying various staging servers and production server. Deployment support during installation of various production patches. Verify the content of the website Verify products and product description are accurate on the website Test content of the website after migrating to new version of Joomla. Verify login privileges of various users of the website. Environment: Joomla,  Bugzilla, phpMyAdmin,MySQL Project Description: Alepine Peripherals Ltd  Alepine Peripherals Pty Ltd is a firmly established Nationwide Distributor of computer hardware, software and peripheral components for wholesalers and retailers across Australia. Preparing test specification for Joomla migration project from Joomla1.5 to 2.5 Rebuilding the application server and running server updates to ensure a clean environment prior to the beginning of a test phase Involved in daily meetings to make priorities for testing Involved in Analyzing and creating Test Scenarios based on Specification document Design, Review and execute test cases.  Performed manual testing on various web browsers. Validating product images and product information of the shopping cart. Environment: Joomla, PHP,Dreamweaver, VirtueMart, MySql, Apache,Bugzilla Project Description: AQN OneCard Document Management Website AQN one card is a one stop document management website which manages qualifications, licenses and insurances which can be used universally across all businesses. This website allows the users to scan all the educational and other personal information into the system after checking the identity through Australian posts and that can be retrieved later when needed from anywhere. This website helps individuals and organizations to manage identifications, one stop to check all the documents, carry out gap analysis and minimize OH&S risk. Execute test cases and analyzing and verifying results to ensure that the application/system full fills the specified requirements. Perform test coverage/scope analysis prior to each test execution cycle. Use/update in-house test harnesses to test business and system functionality Regression testing to ensure other areas of the code is not broken due to new changes by using Selenium Webdriver Rigorously tested the forms using Selenium Webdriver. Used Firebug Tool to identify the object’s id, name, XPath. Defect tracking to ensure, raised defects are fixed, retested and closed. Tested website on various browsers to check the compatibility Performed GUI,SIT, stress, load and security testing  Writing SQL queries to insert and extract data to/from the test databases to check the uploaded documents to the system Testing the server connectivity by analyzing the apache logs Environment: Selenium Webdriver, ASP.Net, JIRA, JavaScript, XML, SQL server 2008, Filezilla, Apache server,  Calling Card website Index Solutions has launched a website, where customers can registers and buys calling cards online. Customer can register, login and buy calling cards, check payment history, previous card history and many more modules. Rebuilding the application server and running server updates to ensure a clean environment prior to the beginning of a test phase Involved in daily meetings to make priorities for testing Involved in Analyzing and creating Test Scenarios based on Specification document. Design, Review and execute test cases.  Performed manual testing on various web browsers. Performing Usability Testing, Server side Interface testing, Compatibility testing, UAT and analyzing Test Report. Used HP Quality Center for raising & tracking defects. Environment: PHP, CSS, MySQL, HP QC, Apache, Joomla CMS, Zen Cart EDUCATION: ISTQB Certified Tester (ASTQB). IT Internship at Profession Pathways Australia.  W3Schools Certified HTML and CSS developer   W3Schools Certified JavaScript developer with excellence degree W3Schools Certified PHP and MySQL developer  Certificate course in PHP from UTS, Sydney.                   Master in Life Sciences  (2001-2003)  - Nagarjuna University, India Bachelor in Life Sciences (1998 -2001) - Nagarjuna University, India"}