{"text": "Name: louise louise E-Mail: louise.louise@gmail.com Address: Shangrao, China Github: https://github.com/louise LinkedIn: https://linkedin.com/louise Phone No. 872368626280 PROFESSIONAL SUMMARY Having 8+ years of experience in Software Quality Assuranceusing both Manual and Automation Testing. Strong domain Knowledge in various domains: Financial, Banking, Marketing, Insurance&Health Care. Actively participated and contributed in all phases of Software Development Life Cycle (SDLC)and Software testing life cycle (STLC) using various methodologies like Waterfall, Agile methodologies Proficient in Coding and Debugging using Java Programming Language Experience in HTML, Java Script, CSS, XML, JSON, AJAX technologies Specialized in Manual and Automated Testing of Client/Server based Applications and Web based Applications using Selenium WebDriver , Test NG, JXL, Maven and Log4j Technologies  Good knowledge of AWS (Amazon Web Services) on cloud computing.  Expert in developing Java Selenium Web Driver/RC/IDE/GRID test scripts using Java, JavaScript and Test Frameworks using Testing/Junit, ANT/MAVEN build tools. Hands on experience in Test automation using different Automation tools/techniques, Unit testing by using Selenium Web Driver/IDE/GRID, TestNG, Maven, Fire Path, Running scripts, Debugging scripts in different environment, Extracting Test results, Cross browser testing, and data validation.  Hands-on experience in Soap UI for testing and validating the Web services (SOAP and RESTFUL) Experience in Automation testing tools such as Load Runner, Performance Center, ALM, Business Service Management (BSM),JMeter, Rational Visual Test Studio, IBM Rational Performance Tester and JIRA  Strong experience with TestNG,Log4j andJunit for unit testing Experience in configuring and updating the build scripts using Maven. Experience in continuous integration (CI) and deployment frameworks such as Jenkins and Hudson. Good knowledge in version control system tools like SVN, GIT. Proficient in writing SQL queries to retrieve data from Databases like Oracle, SQL server, MySQL and DB2. Extensive experience in preparing Test Strategy, Test plan, Test scenarios, Test cases, and Test Scripts based on User requirements. Experience in writing and execution of positive and negative, boundary value analysis, equivalent classes portioning, functional, integration, regression, ad-hoc, test cases of various applications Expertise in Requirement Analysis, Test Plan formulation, Test Design, and Test Automation.  Strong Exposure on Functional and Non – Functional Testing Methodologies: Black Box Testing, Integration Testing, Regression Testing, Smoke System Testing, Data Validation/Backend Testing, Automation Testing. Proficient to learn things, Good communication skills, Hardworking and adaptable, quick learning, Self-motivated, precise and dedicated. Excellent verbal/written communication skills and strong analytical abilities and can perform well both independently and as a team player. Diligent worker, self-starter, consistent performer, adaptable to work as a team member as well as independently. TECHNICAL SKILL SET PROFESSINAL EXPERIENCE Client: Blue Cross Blue Shield, SFO, CA                                          \t\tJan 2016 – Till Now Role: QA Analyst Description:Blue Cross Blue Shield  is a US Healthcare domain related software which interacts  between provider (Physicians) and payer (Insurance Companies) Consisting of the Modules such as Enterprise Practice Management , Electronic Health Records, File Maintenance , License manager , Background Business Processor and Internal Control System (ICS). This provides the Information about the Patient, Policy details, Service provided by the Physician and the Status of the Medical Claims. This Project mainly focuses on the creation of Patient information and Charge Entry as per the service provided by the Physician. The Medical Claim thus generated is forwarded to the Insurance Companies for the adjudication and payments. Responsibilities: Actively involved with SCRUM iteration planning and sprint meetings, managing product backlog, removing obstacles to progress, re-allocating resources where necessary, prioritizing and review milestones and accomplishments. Used Rally tool for managing tasks and stories Develop regression and functional test automation scripts in Java using Selenium WebDriver. Created automation framework using selenium and TestNG. Performed UI verification via Selenium WebDriver, TestNG and Maven dependency tool. Designed and executed the Automation Test Scripts using Selenium Web Driver and Junit.  Implemented Automated execution of tests (nightly and need based) using ANT and Jenkins.  Performed Continuous Integration testing byJenkins.  Created AutomationTest framework using Selenium WebDriver, Maven, Test NG, xPath, Log4j, JXL, Data Driven and Page Object Model principles Used Firebug to identify web elements using xPath and CSS selectors. Testing Web services using Soap UI Pro tool. Used XML files in Sending/receiving XML requests using SOAPUI. Worked on setting up pom.xml for setting up the artifacts for various projects Wrote SQL to update and create database tables. Used SVN and CVS as repositories Co-ordinate with the QA lead for development of test plan, test cases, test code and actual testing responsible for defects allocation and those defects are resolved. Develop, document and maintain functional test cases and other test artifacts like the test data, data validation. Front end (Black Box) testing of the application. Performed HP Quality center project administration and user and role configuration. Test Design, Test Development and Defect Tracking were done using Quality Center.  Documentation of common problems prior to go-live and while actively in a Production Support role. Environment: Selenium WebDriver, Java, Fire Bug,  JXL, Log4j, MAVEN, Eclipse, TestNG, Jenkins, HTML, Java Script, CSS,  XML, XPATH, Firebug, Web Services, SOAP UI, SOAP and Restful, SQL, Oracle, TOAD, Quality Center, Linux, WebSphere Application Server. Client: Guardian Insurance Company, Bethlehem, PA\t\t\t\tNov 2014– Oct 2015 Role: Sr. QA Analyst Description: Founded nearly 150 years ago, Guardian and its subsidiaries are committed to protecting individuals, business owners and their employees with life, long term care insurance, disability income, medical and dental insurance products. The project was to enhance the existing on-line system to store and maintain the customer's insurance information in a centralized location. The web portal allowed Guardian customers to track and review claims and other health account information as well as performs on-line transactions such as ordering medications. The system was designed to increase efficiency of the website. Responsibilities: Involved in design and requirements gathering for project for further improvements and enhancements as per business requirements. Used open source web test tool SeleniumWebDriver for cross browser and cross platform web testing. Used SOAP UI to test the web service request/response scenarios. Developed and implemented robust Keyword driven framework with Selenium which cut down the script development time in half. Created Test plans and performed manual testing of the application to test the system for both the functional and business requirements for positive and negative scenarios using Quality Center. Created manual test by using Quality Center and automated test by using Selenium Web Driver.  Used TestNGTest Suite to run group of Test classes and Test Cases. Used Rally managing the stories and creating defects for the iteration. Created, Maintained and executed build files using ANT for running automated test cases along with continuous integration tools like Jenkins. Performed load testing with HP Load Runner (Script Creation, Parameterization, Running and Reports)  Created JMeter Scenarios and automated Performance tests using Jmeter.  Executed test Cases and Procedures for functionality Testing, Black Box Testing, Regression Testing, Positive Testing, Negative Testing, User Acceptance Testing. Automate validation of data from Oracle/Informatica to AWS Prepared Test cases, procedures, Bug Tracking, Logging and reporting bugs using BugZilla. Created Test Plans which describes the features and functions to be tested. Executing of Manual Scripts, Defect logging and Bug tracking through an interface with Quality Center. Manually manipulate data directly from Oracle database using SQL. Responsible includes integration cycle and deploying application on Production server and providing Production support. Environment: Selenium Web Driver 2.0, Eclipse, Java, TestNG, JXL, xPath, Firebug, Fire path, Agile, Maven, Jenkins, Rally, XML, SOAP, SOAP UI, Web Services (SOAP and RESTFUL),  Oracle 10g, Quality Center, HTML, Java Script, CSS, UNIX, SQL, TOAD. Client: JP Morgan Chase, SFO, CA                                                                   \t\t\tApr 2012 – Oct 2014 Role: Test Engineer Description:This application OLB (Online Banking) is an enhancement to its existing online banking application to provide better online banking services to customers. Primary needs of this project are to provide additional online banking services like Online Money Transfers, Online Credit Card Payments and Online Investment Management. Responsibilities: Analyzed the user requirements, functional specifications and used Case documents for Functional testing. Used agile development practices and work in short iterations to deliver a continuous flow of the most important and valuable features.  Hands on experience writing Selenium tests through Selenium Web Driver. Tested Web Services using SOAP UI. Used SVN for code management. Used SOAP UI to test the web service request/response scenarios. Used different features of SOAP UI tool like data source, Property transfer steps, delay steps for performing the web services testing. Developing Test Plans, Test Cases & Test Scripts and executed test cases manually. Reviewed Specified Business Documents and prepared Test Cases using Quality Center based on the requirements. As part of compatibility testing, executed the workflow manager web application related test cases on different browsers different Operating Systems. Performed application level logging using log4j for debugging purpose. Thoroughly involved in testing phase and implemented test cases using TestNG Knowledge of writing unit tests using JUnit framework. Developed the build scripts using ANT. Used GIT repository as Version Control. Used SubVersion for creating the project structure and version controlling. Actively involved in writing SQL using SQL query builder. Extensively tested customer’s payments are sent directly to your commercial bank account using the latest security technology.  Environment: Agile, Selenium WebDriver, Selenium IDE, Java, HTML, SOAP UI, Quality Center, Log4j, JUnit, TestNG, Ant, SVN, SQL, Oracle, Linux, Windows. Client: Vonage Corporation, Holmdel NJ. \t\t\t\t\t\tJan 2011 – Mar 2012 Role: QA Engineer          Description: Vonage US Unlimited plan customers billing system is migrating to Amdocs billing system and these valued customers billing cycle, Usage, customers’ information, 911 legacy details will be migrated. Post conversion customers data will be retrieved through Amdocs database. Responsibilities: Wrote test cases based on the requirements document. Performed automated testing using Selenium WebDriver, Java, JUnit, on various applications like Enrollment, Billing and claim Management. Performed data driven tests in Selenium using java. Used Maven as build and configuration tool. Extensively used JUnitas Testing Framework for java applications. Responsible for regression testing by executing batch test cases using Test Batch Runner and via Quality Center. Wrote test cases for the application and discussed with the team to identify the P1, P2, P3 test cases. Participated in reviews of Test Scenarios to ensure the requirement coverage. Performed functional testing to identify various critical points in the application and automated it by using Selenium WebDriver on different module of corporate web site. Responsible for performing sanity testing of new builds. Design and develop functional and frameworks and develop automated test suites (Selenium with JUnit). Participated in automating the regressions test cases. Used JUnit for testing and integration of modules. Monitor the status of full life cycle testing of Java and oracle based applications. Environment: Selenium Web Driver,Java, WSDL, REST, JUnit, Log4j, TestNG, SQL, JMeter, Ant,SVN, Oracle, Linux, Windows.  Client: JAYAM SOLUTIONS, INDIA\t\t\t\t\t\t\tJul 2009 – Nov 2010 Project: FIMO (Financial Information and Monitoring Organizer)\t\t\t\t\t Role:  QA Analyst\t \t\t\t\t\t\t\t Description: This project mainly deals with how the Micro Finance Institutions update their daily activities. Micro Finance means providing loans to below poverty line people. The main features of this product are Savings, Loans, Accounts ,Life Insurance and HR, Payroll Setting up the Organization Policies, Collection of Repayments of Disbursed Loans, Joining members in the groups, maintaining organization Accounts and Reports with different Combinations. Responsibilities: Developed Test Plans using Quality Center and also modified the existing test cases as per the new builds.  Used Quality Center for maintaining the Test execution and Defect Management.  Extensively performed functional and user acceptance testing (UAT), Risk Based testing using manual testing. Responsible for entering, Tracking bugs and reporting the defects to the developers for Modification Request. Performed data driven test & regression testing for every modification in the application & new builds  Wrote SQL queries to verify the contents of the logs stored in database of the application are updated after making changes to user profile. Environment: Agile, Quality Center, Java, SQL,JUnit, SOAP, XML, SVN, Oracle, UNIX, Windows. EDUCATION QUALIFICATION Bachelor of Science Electronics and Communications from B.V.B. College, India."}