{"text": "Name: olga olga E-Mail: olga.olga@gmail.com Address: Zunyi, China Github: https://github.com/olga LinkedIn: https://linkedin.com/olga Phone No. 403436654972 SUMMARY: Over 6+ years of professional experience as a Quality Assurance Analyst in Healthcare and Travel & Tour Industry performing manual testing of web-based and client/server applications. Good working experience using Software Development Life Cycle (SDLC) models like Agile and Waterfall. Expertise in Analyzing Business Requirements and developing Test Scenarios, Test Plans, Test Cases, and Test Scripts. Strong hands on experience with all levels of testing including Smoke testing, Sanity testing, Integration testing, Regression testing and User Acceptance testing (UAT). Experience in performing Manual Testing and Defect tracking using HP Quality Center, Clear Quest. Strong experience in UNIX and Shell scripting. Experience in using SQL Queries for backend data validation. Interacting with Client, Business Users and Vendors related to business enhancement/understanding and Risk/Issues. Experience in creating and developing Test Plans, Test Strategy, Test Cases, Test Scripts, Traceability Matrix and Defect Reports. Worked on different modules of FACETS application like Membership, Claims and Providers.  Implemented EDI transactions 834, 835, 837, 270/271, 276/277. Integrated Quality Center with external sources such as MS Excel to export Test Report. Extensive use of defect tracking tools including Quality Center and Clear Quest. Good knowledge of RDBMS and SQL along with SQL Enterprise Manager, Data analysis and reporting. Worked under various databases including Oracle, RDBMS, SQL Server and MS-Access. Self-starter, Quick learner, energetic, highly motivated, team player with excellent communication/problem-solving skills. Ability to manage multiple responsibilities and meet individual deadlines, while effectively focusing on priority issues and UAT Coordination. TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE: Tauck, Wilton, CT\t\t\t\t\t\t\t\tJan 2018 – Present Quality Analyst Description: Tauck is an operator of guided tours and cruises on rivers. Tauck offers more than 100 guided land journeys, small- ship ocean cruises, European river cruises, safaris and family travel experiences in more than 70 countries. As a QA Tester, I was responsible for reviewing and approving changes to our client's digital ecosystem including their public facing website, customer accounts (\"guest connect and agent connect\"), and other customer facing systems(Payments, Request a Quote, Search Page, Product Pages). Responsibilites: Worked in an Agile Software development methodology. Interfaced well with Project Manager, Team Lead and Business Analyst to understand the business requirements and reviewed User stories. Involved in creating Test Scenario and Test case documents as per specifications Performed Functional, Integration and UAT testing of payment gateway service for different scenarios. Performed GUI testing & functionality testing for front end screens. Involved in positive testing, negative testing, smoke testing, load testing, sanity testing, cross platform testing and cross browser testing. Performed testing on QA environment as well as staging environment for different modules of pages. Executed End to End Test cases, captured results and reported results to management using share file and JIRA Logged the defects in JIRA for the issues encountered during execution. Interacted with developers to report and track bugs using Jira. Retested the open tickets and closed the tickets once the issues are resolved in Jira. Developed the test cases for the features added in the new sprints by reviewing the user stories and executed these test cases once the build is released. Retested the bug fixes in newsprints. Performed testing on LoadRunner in Virtual User Generator, Controller and Analyzer. Created  test scripts to meet load-testing requirements according to the SLA (Service Level Agreement) agreed upon. Performed  automated Functional and Performance Testing using BlazeMeter, JMeter, LoadRunner. Performed Regression testing on each and every sprint, verified new defects was caused by new functionality and production fixes. Designed and executed the automation test scripts using Selenium Web driver (Java) for Regression cases.  Involved in reviewing of Business Requirement Documents, and prepared the Test Plan & Test Strategies, Test Cases. Participated in Sprint planning meetings and discussed the progress made in the previous sprint, then planned for the next sprint with brainstorming for ideas with the team. As a member of the QA team, was involved in the Product backlog refinement meetings with the product owner and provided updates involving the QA testing for user stories. Executed SQL queries to verify the database for the relevant test cases. Participated in daily scrum meetings to discuss the daily testing activities. Participated in defect triage meetings and working sessions by providing information required to triage and resolve issues encountered during testing. Participated in test cases and Sprint reviews with stakeholders. Validated Integrations (requests and responses) between Order Capture System, Payment Gateway and Order Management System using Dev Mariposa System.  Interacted and tested with the business closely during User acceptance testing to get a sign-off on user stories from the business. Provided sign-off on user stories/functionalities after completing end-to-end testing before the product went live in production. Environment: Web Services, SQL Server 2012, JIRA, Selenium Web Driver, HP ALM/QC, Java, LoadRunner, Jmeter, Blazemeter, MS Office Suite, Windows 10, Mariposa Reservation System, Sitecore (QA & Staging), Agile TMG Health, Dunmore, PA                                                                                   Aug 2015  -  Dec 2017 Quality Analyst Description: TMG Health's National Operations and Data Center has been serving more than 1 million Medicare and Medicaid members and processing 10 million health claims annually. TMG Health is in the process of implementation of FACETS which is a managed care application from Trizetto. This system enables to manage Members, Providers, products and claims. Responsibilities: Experienced in writing Test Cases based on the Use Cases and FRD (Functional Requirements Document). Expertise in troubleshooting issues on Windows. Played a role of TDM (Test Data Management) and is responsible for identify test data based on business requirements (identify data requirements, identify data types, identify data source and identify data dependencies) Created and maintained SQL queries to perform back-end testing on the oracle database.  Reviewed extensive SQL Queries with complex multi-table joins and nested queries. Involved in Facets Implementation and end to end testing of Facets Claim Processing and Subscriber/Member module.  Work with TDM team to get the data as per requirements to proceed execution for the team. Responsible for checking member eligibility, provider enrollment, member enrollment for Medicaid and Medicare claims. Experienced in processing various EDI files and coordinated with Facets upgrade. Worked with Facets Medical/Hospital Claims Processing applications to process Medical and Hospital claims. Worked with the production support team and involved in the last phase of implementation process. Developed Unix  shell scripts to manage file handling process Participated in testing Inbound and Out bound interfaces of Facets. Worked with various applications in Facets like Medical plan and Providers application. Checked the validity of claims, eligibility, benefits, limits and deductible data scenarios in Facets. Experienced in testing various ETL data warehouse components.  Worked on the Member Portal application to validate Member Eligibility and Benefits. Involved in the validation of EDI transactions such as 835 and 837 following the HIPAA compliance    EDI X12 standard formats. Developed detailed Test Plans and Test Cases and executed them in Quality Center. Used Rational Clear Quest to track all project related issues. Performed rigorous manual testing such Functional Testing, Smoke testing, Integration testing, Regression Testing, End to End Testing and System Testing. Used QTP to perform Functional Testing and Regression Testing. Performed Positive and Negative Testing manually. Tested the operation of key Facets module involved in the processing of Claims including Benefits, Provider and members. Involved in the preparation of various EDI Claims and validated them in Facets System. Created several Test Cases and Test Conditions for testing various Claims, Membership, and Provider reports using Quality Center. Responsible for defect tracking and defect reporting using Quality Center. Environment: Quality Center, Unix, SQL Server, QTP, Clear Quest, Rational Suite, Facets 5.3, Windows 2000, Oracle 12c, MS Office (MS Excel, MS Access, MS Word, MS PowerPoint). Magellan Healthcare, Glen Allen, VA                                                                  Sep 2013-  Jul 2015 Quality Analyst Description: Magellan Healthcare provides solutions to both individual and groups by providing broadest selection of leading health insurance plans. The project I have worked on was creating the application where customers can compare individual health insurance plans by providing zip code, date of birth and gender.  I was involved in the application that was used for checking the eligibilities, claim processing and claim status. Responsibilities: Worked on modern Agile Methodology of Software Development Life Cycle (SDLC). Developed Test Cases to test the Screens and workflows for Quality Assurance. Worked with EDI transactions270/271, 276/277, 820, 834, 835, 837.  Analyzed and understood the claims adjudication and reimbursement systems based on HIPAA X12 4010 standards. Analyzed and worked with HIPAA specific EDI transactions for claims, membership enrollment. Responsible for performing Functional, Integration and Regression testing. Facilitated User Acceptance Testing (UAT) by providing the necessary support to the business users and was fully involved until implementation. Worked extensively in creating Test Cases and Test Conditions for testing Claims, Membership, and Provider reports. Performed Front End Testing, Regression Testing, Functional Testing using QPT. Extensively developed and executed SQL statements to query the database for Data Validation and Data Integrity. Developed UNIX Shell scripts to automate repetitive database processes and maintained shell scripts for data conversion. Experienced in data Extraction, Transformation and Load (ETL) process. Authorized test case scenarios in MS Excel spread sheet and export them into Quality Center. Involved in the process of claim adjudication of application. Involved in development of test plan, test schedules, test cases based on high-level and detailed designs. Used Quality center for Defect tracking and documentation of Daily Defect Status. Environment: Windows XP, QTP, Unix, Facets 4.8, Quality Center, SQL Server, Clear Quest, MS Office (MS Excel, MS Access, MS Word, MS PowerPoint). CNSI, Rockville, MD                                                                                               Feb 2012-Aug 2013 Quality Analyst  Description: Based in Rockville MD, CNSI partners with several health insurance companies, state Medicaid and implement the IT solutions. The project I was involved in was the platform migration of HIPAA 834 5010 version of the file. As a QA, my job was to design and test the solution to convert the X12 file into flat file, select the required data elements and load the files to ensure the correct fields are being populated on the front end. I have worked in testing both the translator and the front end and have been involved in end-to-end testing of the HIPAA 834 files. Responsibilities: Prepared Test Cases and Test Scripts in Quality center for testing the applications. Executed test cases, identified defects, retested defects using Defect Tracking and reporting software’s Quality Center during various phases of testing. Executed Test Scripts using QTP. Coordination with QA and other teams for TDM needs Transition plan and execution TDM strategy and implementation.  Performed Regression, Integration, Functional, Load and System Testing. Responsible for troubleshooting and resolving errors in EDI transactions834 and 820 for health insurance exchanges and performed root cause analysis. Performed UAT Testing Manually in coordination with UAT group to ensure correct business logic. Reviewed documented training material for accuracy and assisted in end user training and support. Involved in Facets Implementation, involved end-to end testing of FACETS Billing, Claim processing and Subscriber/Member module. Worked under HIPAA compliance standards. Worked with multiple teams and coordinated with them to do various releases. Tested user interface and navigation controls of the application using QTP. Worked with Development Lead, BA lead, QA Manager, Release Manager on daily basis, and provided weekly status reports of QA team to product manager. Extensive use of SQL queries and procedures for data validation in both source system and target system. Maintained Requirement Traceability Matrix (RTM) to make sure that test plans were written for all requirements. Used Quality Center for reporting and tracking bugs and generating reports. Environment: Oracle 11g, HIPPA, EDI 5010, Facets 4.8, XML, QTP, Quality Center, MS SQL, MS Office (MS Excel, MS Access, MS Word, MS PowerPoint). Education: Bachelor in Computer Science."}