{"text": "Name: helen helen E-Mail: helen.helen@gmail.com Address: Bozhou, China Github: https://github.com/helen LinkedIn: https://linkedin.com/helen Phone No. 742581144469 6+  years of Quality Assurance experience to obtain a responsible QA position in a progressive organization where I can effectively utilize my expertise and qualifications to develop and improve the Quality Assurance aspect of the company.  Experience in Sanity, GUI, Functional, System and Regression Testing.  Well versed with all stages of SDLC and STLC.  Experience in Agile Scrum methodology.  Good exposure in understanding and analyzing Requirements. Expertise in Testing of Client/Server and Web based applications. Skilled in bug reporting and tracking using Test Director, HP Quality Center.  Worked on HIPAA EDI 834, 835, 837, 271/272, 278 use cases and collaboration templates according business requirements in FACETS Claims Process.  Expertise in querying and testing using RDBMS tools like Oracle, MS SQL server, PL/SQL, DB2, and MS Access for Data integrity Proficient in Manual as well as Automation testing in Windows and UNIX based platforms with experience in shell scripting Strong in IT research, software analysis and design skills. Extensive experience in Backend Testing on distributed databases using SQL queries. Experience in Functional Testing, System Integration Testing, Back End Testing, GUI Testing, configuration Testing, User Acceptance Testing.  Solid understanding of Membership, Claims Processing, Billing, Benefit/Eligibility, Authorization/Referrals, COB, and have experience in HIPAA standards and corresponding EDI transactions. Knowledge of Medicaid and Medicare Services. Familiar with Test Strategy, Test Plan and Traceability Matrices Documents. Involvement in preparation of Test scenarios, Test cases and executing the same.   Test results analyzing, sending suggestions and defects.  Good exposure on Bug Life Cycle.  Experience in Quality Center/ HP ALM.  Commitment, result oriented and interested to learn new technologies. Experience in facilitating meetings with clients to discuss and sign-off on the document. Conducted User Acceptance Testing (UAT) Motivated self-starter with exceptional team building, leadership, and interpersonal skills. Good team player with the ability to work in time sensitive environments. Proficient in working with FACETS, claim-processing systems. Bilingual. Fluency in speaking and writing Arabic Language on native level. TECHNICAL SKILLS:  Methodologies:\t\t\tSDLC, RUP, Agile, Waterfall Platforms:\t\t\tWindows, Mainframe Testing tools:\t\t\tQuality Center, ALM Change Management Tools:\tHP Quality Center/ ALM Office Tools:\t\t\tMS Project, MS Office, MS Visio Database:\t\t\tMS SQL Server, MS Access, DB2, Oracle,  Work Experience  Cognosante, CMS, McLean, VA\t\t\t\t\t\t\t\t         Jan 2016- Present QA Analyst Cognosante provides premier information technology solutions for the many challenges facing today's health organizations. I was working on CMS 1095A reconciliation project of 834 enrollments. As an EDI Analyst, I have to validate and reconcile the data from three different CMS databases MIDAS, FFM and Issuer.  Responsibilities: Closely collaborated with the product owner and business analyst in order to plan testing strategy. Validated and verified the data against three CMS databases MIDAS, FFM (Federally Facilitated Marketplace) and Issuer Database. Validate the date from EDI transaction. Recommend ways and workarounds for HIPAA 5010 (EDI X12 837,834,278,270) upgrades Researched and designed test plan for the existing and new projects. Presented the plan to developers and Product Owners in order to have a coordinated effort. Involved in testing HIPAA EDI X12 transactions & Code Sets Standards like 820 Premium Payment for enrolled health plan members, 834-Enrollment /Dis-enrollment to a health plan, 837- Health Care Claims and 278 Authorizations.) Performed Back end Testing-using SQL queries, generating reports to ensure data integrity and validate the inserted and updated data Performed Back-end Testing using PL/SQL for Database Validation. Initiated test plans for ‘PCT – Plan Change Tool’, a tool that allows previous members to move into new health plans carrying over existing benefits. Experience working in ANSI x12 837-835 EDI Transaction. Web Security testing, Regression testing, Integration testing and User acceptance testing (UAT).  Conducted Back-End Testing Using SQL Commands. Coordinated with product owner in order to provider member the option to select PCP (Primary care provider) of his or her own choice.  Provide training in using the system, using reports, executing queries and writing in SQL. Tested the ANSI X12 Version 5010 EDI transactions (HIPAA) like (834, 837P, 837I, 835 remittances). Inserted Checkpoints to check for broken links and standard properties of an object using QTP. Wrote test case in accordance with business requirement and functional specification documents. Performed GUI, Functionality and Regression testing. Extensively used SQL statements to query the Oracle Database for Data Validation and Data Integrity. Created test scenarios for Functional Testing of Web Services. Fixing defects, maintained Defect Tracking trough Quality Center. Demonstrating sufficient oral and written communication skills for effective dialogue with colleagues on a project team and superiors. Created and managed data base trigger and subprogram using SQL. Worked in Agile Scrum Environment. Attended daily stand ups, biweekly sprint planning/grooming meetings, & actively participated in release planning meetings.  Demo completed and accepted user stories to stakeholders, product owners and managers at the end of the sprint. Mapped documents from/to various formats including but not limited to x12, EDIFACT, XML, SQL and text utilizing ODBC and other connectivity methods  Tested broken links and inter application links (page redirects to respective URL’s) in development, test and production environments. Tested the Browser compatibility in different browsers. ENVIRONMENT: Facets, Web Services, Ultra Edit, Agile, MS SQL, MS TFS, Quality Center, FileZilla, Agile. Humana Inc. Louisville, KY                                                                                                                 Jan 2015- Dec 2015 QA Tester   Description: Humana Inc., headquartered in Louisville, KY, is one of the nation's largest publicly traded health benefits companies, with approximately 9 million medical members.  They used Facets for managing and processing healthcare claims. As a QA Analyst, I was involved in various kinds of testing of the Facets application modules like Enrollment, Membership and Claims. Responsibilities: Analyzed system requirements and developed detailed Test Plan. Performed Manual Testing for the EDI transactions. Conducted GAP analysis and filling gap according to the format set by HIPAA. Involved in FACETS Implementation, involved end-to-end testing of FACETS Billing, Claim Processing and Subscriber/Member module.  Elicit requirement to be able to generate the tools and info needed to process the ICD-10. Tested the HIPPA EDI 834, 270/271, 837/835 transactions according to test scenarios and verify the data on different modules. Experiences working in ANSI x12 837-835 EDI Transaction. Work on coordination of benefits (COB) in a claim processing. Developed Test Script for Functionality, Security, and Regression testing. Ran the scripts on multiple environments (QA, UAT and Production) to ensure that requirements were still met. Wrote Test scenarios and test cases for testing the 5010 and the processing of member enrollment and benefits, (834) batch jobs corresponding to the claims (837). Performed Back-End Testing to check database integrity by writing SQL queries. Set claim processing data for different Facets Modules. Tested HIPAA regulations in Facets HIPAA privacy module. Wrote test cases in ALM derived from the Design documents and generated a Traceability Matrix for testing purposes. Created Traceability Matrix to ensure implementation of all functionalities, identify all test conditions and test data needs. Used ALM to record documenting information useful in debugging process, evaluating test data. Developed and deployed test Load scripts to do end to end performance testing.  Prepared and maintained the Test Matrix, Requirements Traceability Matrix. Participated in release meetings and also participate in Retrospective session. Extensively worked on any requirement upgrade and/or change request while doing UAT. Wrote comprehensive performance test results report. Worked closely with development team to ensure the application performance and stability and also ensure the application completes the whole end-to-end process. Participated in weekly status meeting with Development and Management Teams. Environment: ALM, HIPAA, EDI, Facets, Windows 2000, MS Office Suite, SQL Server. Wellcare Group, Tampa, FL \t\t\t\t\t\t                                             Sept 2013- Dec 2014 QA Analyst This project dealt with the development of a Medical claim capture system. The system helped to accelerate document input process and eliminate manual entry. Overall the system was meant for the administration team to have a faster and easier way to access to patient's electronic health records. The project also involved implementation of Claims processing module which involved Receipt and Verification of Claim Forms (837), Enrollment Implementation Format (834), and Claims Attachments (275), Claims Enquiry and Response (276/277C), Adjudication, Healthcare Claim Payment/Advice (835) as per HIPAA guidelines.   Responsibilities: Monitoring and conducting non-supervisory support role will include coordinating team schedules, monitoring event attendance and outcomes, reporting to manager, escalating issues and conduct process improvement. Ensured that the MMIS upgrades are able to handle the new HIPPA transaction. Validated the following Transaction Processing: 837 (Health Care Claims or Encounters), 835 (Health Care Claims payment/ Remittance), 270/271 (Eligibility request/Response), 834 (Enrollment/Dis-enrollment to a health plan)  Experience using Agile Scrum Methodology. Worked on Enrollment and Billing Module through both 834 EDI transactions as well as Facets Online/enrolling members in Facets from Facets front end screens, web portal application and EDI 834 transactions.  Collaborated with business partners and developers to create EDI X12, NCPDP and proprietary encounter submission files. Also made appropriate changes to records by resolving enrollment system rejects. Reconciling our various EDI transactions sets such as 834 enrollment files, 820 payment remittance files, ID card files, and Group XML files.  Involved in the testing of web portal of New MMIS system. Created transaction sets requirements, usually with Microsoft Excel, for transactions such as: HIPAA 270/271, 276/277, 278/278, 820, 834, 271U, 835, 837-(I, P, &D), 835 Remittances and others.  Ran SQL queries to obtain various data including deductible, copayment and accumulators. Implemented and provide support for HIPAA ANSI X12 standard transactions 270, 271, 276, 277 and 278. Maintain and support 834, 835 and 837 HIPAA EDI transactions.  Created SQL scripts for different frames of testing. Developed/Modified Test Cases, Test Scenarios and Test Data using JIRA, Version1 and Quality Centre tools. Checked the data flow through the front end to backend and used SQL Queries to extract the data from database Coordinated with Business Owner, Application Vendor, Business Project Teams, Payers and Clearing houses to bring all processes to a level of execution to mitigate any impact to current revenue flow under the HIPAA 5010 compliance requirements. Involved in testing Encounter submission and error reconciliation. Performed analysis on various project types and solutions including but not limited to: EDI analysis supporting standard and non-standard transaction, Data analysis, trading partner analysis and mapping, etc. Specifications, Documentation and Construction of systems heavily relied on UML modeling. Performed the Gap analysis on the earlier systems, generated a detailed Requirements document describing new system architecture through Use Cases and Activity diagrams. Analyzed trading partner specifications and created EDI mapping guidelines. Designed the process flow diagrams for flow of information and report creation process.  Conducted JAD sessions for the report users, requestors, and the developers.  Developed PL/SQL stored procedures for the end-user report requirements.  Gathered and analyzed business requirements and developed a Test Plan for UAT testing of claims.  Developed and executed Test Cases and Test Plan Documents in Quality Center based on the requirement and design. Environment: Agile/Waterfall, MS Office Tools, Windows XP, Quality Center/ALM, Facets, MS SQL, UNIX. Health Now, Buffalo, NY                                                                                                                                    Jan 2012– Aug 2013 Quality Analyst\t Health Now New York Inc. is a premier and diversified health benefits and Information Company that provides innovative products, services, and technologies to improve the availability, quality, and cost of health care. They used Facets for managing and processing healthcare claims. As a, QA Analyst, I was involved in various kinds of testing of the Facets application modules like Enrollment, Membership and Claims. Responsibilities: Analyzed system requirements and developed detailed Test Plan. Performed Manual Testing for the EDI transactions. Conducted GAP analysis and filling gap according to the format set by HIPAA. Involved in FACETS Implementation, involved end-to-end testing of FACETS Billing, Claim Processing and Subscriber/Member module.  Tested the HIPPA EDI 834, 270/271, 837/835 transactions according to test scenarios and verify the data on different modules.  Experiences working in ANSI x12 837-835 EDI Transaction. Work on coordination of benefits (COB) in a claim processing. Developed Test Script for Functionality, Security, and Regression testing. Ran the scripts on multiple environments (QA, UAT and Production) to ensure that requirements were still met. Performed Back-End Testing to check database integrity by writing SQL queries. Set claim processing data for different Facets Modules.  Tested HIPAA regulations in Facets HIPAA privacy module. Wrote test cases in Quality Center derived from the Design documents and generated a Traceability Matrix for testing purposes. Created Traceability Matrix to ensure implementation of all functionalities, identify all test conditions and test data needs. Used Quality Center to record documenting information useful in debugging process, evaluating test data. Prepared and maintained the Test Matrix, Requirements Traceability Matrix. Participated in release meetings and also participate in Retrospective session. Extensively worked on any requirement upgrade and/or change request while doing UAT. Worked closely with development team to ensure the application performance and stability and also ensure the application completes the whole end-to-end process.  Participated in weekly status meeting with Development and Management Teams. Environment: Agile/Waterfall, MS Office Tools, Windows XP, Quality Center, Facets, MS SQL, UNIX. CareFirst BCBS, Owings Mills, MD                                                                                                               July 2010- Dec 2011 QA Analyst The project was based on the transition from a mainframe based legacy system to a new Enterprise open systems-based solution. Adhered to strict compliance, policies and regulations and configured Facets modules such as claims, membership, benefit and plan. I was involved in migrating application functionality and converting data.  I have also worked on the implementation of the new processing system for Benefit Enrollment files (834) and Payer and Claims (837) along with review design and reconfigure of the following FACETS functional areas: Enrollment Claim Billing Provider Member Information. Responsibilities: Analyzed system requirements and developed detailed Test Plan. Performed Manual Testing for the EDI transactions. Worked closely with development team to ensure the application performance and stability and also ensure the application completes the whole end-to-end process.  Participated in weekly status meeting with Development and Management Teams. Involved in testing methodologies throughout the Software Development Life Cycle. Assisted in writing Test Plan, Test Strategy, System Testing and End-to-End Test. Processed claims in Facets and verified 835 X12's are generated and sent to Provider. Involved in testing the EDI transactions 834, 837, 835. 270/271 & 276/277 conversion to Facets. Wrote Test scenarios and test cases for testing EDI 4010 and the processing of member enrollment and benefits, (834) batch jobs corresponding to the claims (837). Performed functional testing using HP QC. Developed SOL Queries for backend testing. Experience with developing HIPAA Companion Guides for 834 Enrollments, 270/271 Eligibility Inquiry/Response & 820 - Health Plan premium payments for MMIS. Evaluated and implemented QA process improvements for ongoing testing. Worked on UNIX platform and experience in backend testing by executing SQL Queries. Involved in maintaining the test matrix and RTM. Participated in QA meetings and defect tracking meetings. Conducted GAP analysis and filling gap according to the format set by HIPAA. Involved in FACETS Implementation, involved end-to-end testing of FACETS Billing, Claim Processing and Subscriber/Member module.  Tested the HIPPA EDI 834, 270/271, 837/835 transactions according to test scenarios and verify the data on different modules.  While working on requirements of the 835 HIPAA project, jumped half way in the 820 report project, continued working on 835, 276 / 277 and HIPAA EDI Transactions across enterprise. Experiences working in ANSI x12 837-835 EDI Transaction. Developed Test Script for Functionality, Security, and Regression testing. Ran the scripts on multiple environments (QA, UAT and Production) to ensure that requirements were still met. Wrote Test scenarios and test cases for testing EDI 4010 and the processing of member enrollment and benefits, (834) batch jobs corresponding to the claims (837). Performed Back-End Testing to check database integrity by writing SQL queries. Involved in FACETS Implementation Testing, involved end to end testing of  FACETS Billing, Claim Processing and Subscriber/Member module. Set claim processing data for different Facets Modules.  Wrote test cases in Quality Center derived from the Design documents and generated a Traceability Matrix for testing purposes. Used Quality Center to record documenting information useful in debugging process, evaluating test data. Participated in release meetings and also participate in Retrospective session. Extensively worked on any requirement upgrade and/or change request while doing UAT. Environment: SQL Server 2000, Oracle, MS Project, HP Quality Center, UML, MS Office, DB2, Toad, SOAP UI, UNIX. EDUCATION: Masters of Business Administration, Saint Leo University, Saint Leo, FL"}