{"text": "Name: mary mary E-Mail: mary.mary@gmail.com Address: Hefei, China Github: https://github.com/mary LinkedIn: https://linkedin.com/mary Phone No. 217929044095 Professional Statement Excellent communication skills, comfortable with highly technical subject matters, and a good sense of humor. Strong thought leader with ability to take in ambiguous goals, drive clarity, and deliver results under pressure. Expert on user experience design topics, tireless advocate of the customer, and influence on project vision and implementation with advisory role for multidisciplinary and cross-functional teams. Strong ability to work with designers, developers and customers from concept to executive with strong responding to customer and team feedback.  Commitment to collaborative problem solving, sophisticated design, and a quality product by implementing interactive functionality translating design ideas, concepts, and requirements into a functional experience. Areas of Expertise Photoshop Illustrator InDesign Premier Pro Sketch Axure InVision Principle After Effect Unity Cinema 4D Maya VR Design Interface              3D Modeling VR Shell ZBrush C# Unity  HTML CSS SourceTree Jira Flash Education MFA in Interactive Design, University of Texas at Arlington                BFA in Graphic Design, Shariati University Certifications & Awards Advanced Unity, University of Texas at Arlington  Virtual Reality, University of Texas at Arlington                                                                     Creative 2D & 3D, University of Texas at Arlington                                                              Animation, Universitat De Politécnica Valencia  Certified ScrumMaster, Agile Strategic Solutions Project Management ,Project Management Institute  College of Liberal Arts Scholars: COLA Scholars  Grand Prize and Medal Winner in International Illustration and Design Competition Society of Korea Illustrate, Seoul, South Korea, 2014 Adobe Design Achievement Award, Semifinalist Session 2, 2014 Professional Experience Senior Developer - Visual & Product Designer, Intel Corporation\t\t                Nov 2017 - Present Project: TrueVR Experience Olympic, PGA, Basketball Virtual Reality Apps End-to-End production pipeline in an agile environment from writing compelling user stories and sketching storyboards and UI design to communicate new concepts to specifications & interactive prototyping, wireframes, UX flows, UX design, motion graphic and mockups for AR/VR apps.  Work in an agile environment as a part of the TrueVR Experience Development Team to design, develop and deploy features and modules for consumer facing AR/VR apps. Work with 2D and 3D models and environments including experience with textures, shading, lighting, rigging, animation, GUI styles, and user session management.  Develop game physics and mobile and console game development with deep understanding of iOS and Android UI conventions, including the HIG and material design. Create and refine 3D models, visual effects and assets for the conceptualization and final products. Strong ability to create and visualized functional ideas for VR/AR game and marketing. Optimize the Unity 3D environment and game logic for performance benefits.   Art Director of Interactive Design, WIFD, Dallas, Texas\t                                         May 2015 - Oct 2017       Project: VMware Internal Pattern Library and Apps Conveyed design ideas via sketches, storyboards, user flows, wireframes and prototypes. Developed the strategy and conducted the execution of UX/UI patterns library and principles. Maryan Heller, MFA\nSanta Clara, CA | maryan.heller@gmail.com | (817) 884-6599 | Portfolio: https://maryannheller.myportfolio.com Project: Mary Kay UX Design, UI Web Design, and Virtual Apps Managed and collaborated with a creative team for translating ideas and concepts into useful and engaging solutions such as websites, apps, intranets, mobile, responsive frameworks, and visual storyboards. Made informed design decisions with market research and collaborated with UX researchers to generate concept sketches and scripts for user testing. Project: Virtual Reality Advertising Apps for Films, Games and Beauty Products  Lead creative UI/UX projects and content from complex concept to completion for different platforms (film, VR/AR, apps, game products). Owned strategy for VR/AR prototyping and prepared graphic elements and assets to the VR/AR unity environment.  Adept in UX design and research for app design, VR and AR for game, film and advertisements. Created and refined 3D models and assets for the conceptualization, visual design, and production for numerous clients. Project: LifeTree UI Web Design and Apps Created, visualized and presented ideas effectively and compellingly for internal leaders, business partners and customers. Conveyed design ideas via sketches, storyboards, mockups and prototypes. Adept in creating digital interface design solutions for the web, desktop applications and/or mobile and  hand-held devices. Assistant Professor, University of Texas at Arlington\t\t    \t\t                  Aug 2012 - May 2015 Owned and maintained UX documentation through wireframes, flows, storyboards, personas and mockups with strong understanding of composition, balance, symmetry, and white space to sell a vision. Adept in UI/UX interface design for interactive design VR/AR. Expert in 3D modeling, texturing, shading, and rigging, and digital 2D illustration techniques.   Developed creative app design, motion graphic and animation. Product Designer, Game Publisher\t\t\t\t\t\t                 April 2007 - July 2012 Functioned in a leadership capacity and managed all aspects of web design, advertising, UI/UX design, pattern library, and motion graphics for the company’s productions.  Conceptualized and translated complex science into engaging animated stories and games by using 2D and 3D software.  Conveyed design ideas via sketches, storyboards, mockups, prototypes, data architect,  and animations. Applied 2D and 3D visual effect for short films, animation and games. Interactive Designer, Game Publisher\t\t\t\t\t\t                  Jan  2005 - April 2007 Full stack design from wireframes to high fidelity prototyping, brand integration, user research, usability testing, and worked closely with developers to consistently ship new products adding and refining design across suite of products.  Worked cross-functionally with design, product management, content strategy, engineering and marketing. Communicated results and illustrated suggestions in compelling and creative ways such as storyboarding and visual information architecture.\n"}