{"text": "Name: lucy lucy E-Mail: lucy.lucy@gmail.com Address: Mumbai, India Github: https://github.com/lucy LinkedIn: https://linkedin.com/lucy Phone No. 6562426359 PROFESSIONAL SUMMARY 6 years of experience in Software design, development in.Net framework usingSQL Server 2008/2012, 3 Tier applicationusing ASP.NET MVC, HTML,CSS, JavaScript/JQuery, Angular JS, ADO.ENT, Entity Framework,LINQ, T-SQL, C#, VB.NET, Web Services, AJAX, XML and WCF, Service Oriented Architecture (SOA) with RESTful services. Extensive experience with source control systems such as Subversion,TFS andVisual Source. Extensive Object Oriented Design and Development skills. Knowledge on SQL Reporting Service SSRS, SSIS and SSAS. Experience inSoftware life cycle development and NUnittesting. Strong Skills in developing 3-Tier and N-Tier Architecture systems deployed on windows platform. Strong analyticalskills with Proficiency in debugging and Problem Solvingskills coupled with excellent written, verbal and interpersonal communication skills. Strong experience in Object Oriented Programming Concepts (OOP) and Object Oriented Design (OOD), Iterative Agile Programming Methodologies and Test-Driven Development and maintenance. Versatile team player as well as independent contributor. Ability to conceptualize, document, and communicate project ideas and plans. Enthusiastic and quick to learn new applications and tools and willing to take individual responsibilities. Good team player with strong ability to learn and adapt new skills and makes efforts to do the work at hand and manage time effectively Experience in working with version control systems like TFS, SVN and Visual Source Safe. TECHNICAL SKILLS EDUCATION MSC, Politecnico di Milano, Italy MSC, Adama University, Ethiopia Bachelor of Science, Adama University, Ethiopia       \t\t\t\t\t Certification MCTS: Microsoft SharePoint 2010, Application Development \t Children’s National Medical Center, Fairfax VA\t\t\t      Jul 2014 – Present .NET Developer Integrated Medical Care Children’s National Medical Center is the premier provider of pediatric care and pediatric subspecialists in greater Washington area. I worked on the Medical Center application to keep the record of the information of patient visit to the hospital. The system involves entering the information of patient, assign appointment to doctor, also keep record of patient previous medical history, diagnosis history, generate the prescription and send the copy of it to medical store.   Responsibilities: Selected and implemented agile development practices according to the application requirements for the project.  Followed Agile Methodologies and Test Driven Development. Actively involved in Database design and developed optimized stored procedures. Customized various controls for Application by developing User Controls. Used ASP.NET MVC, AJAX and updated web pages to implement the AJAX functionality to enhance the application. Developed Master Page and used the same template throughout the application to maintain consistent layout. Searching for Insurance policies depending on various search criteria is implemented as Windows. Communication Foundation (WCF) service. Created Data Access Layer for retrieving the data from the database. Used several Cache management techniques to improve the overall performance of the application. Actively involved in designing, documentation of application flows and developing functional diagrams using MS Visio. Involved in customizing the Web Forms Data grid for GUI. Developed custom controls for Web Forms and generating reports. UsedBootstrap, CSS, AJAX, Angular JS, HTML, and jQuery to improve the look and feel of the ASP.NET web application page.  Involved in creating and consuming services using WCF. Created Service Contract, Data Contract for services using WCF. Created and used Web User Controls for reusability. Used Entity Framework (EF) to establish connection with SQL server and LINQ for database transactions. Extensively worked on stored procedures, triggers, functions, views, temporary tables and table variables. Designed and developed the components for implementing business logic in middle tier of the development architecture interacting with SQLServer database using Entity Frame work/ADO.Net Involved in the Code Review Process and testing the application using NUnit. Generated reports using SSRS, SSAS and SSIS. Used Team Foundation Server for Version Control Environment. Client-side scripting using JavaScript, JQuery and Angular JS and Ajax. Environment: ASP.NET MVC, C#, Bootstrap, ADO.NET, WCF, MS VS 2012, SQL Server 2008/2012, TFS 2012,   XML,  JQuery, IIS 7.5, Windows 2008, Angular JS Ministry of Urban Development /MUD             Addis Ababa, EthiopiaFeb 2011 - July 2013\t .Net Developer\t\t\t MUD is a large federal government office in the country. The project was an intranet application to develop and manage the inventory management system. The basic aim was to maintain the inventory in an effective manner for thousands of different items for their construction projects. The system allows keeping track and processing their entire range of operations from Purchase Order Generation, Vendor Supply, Storage and control. Responsibilities: Developed Web forms and application logic in ASP. Net, C# utilizing the power of Microsoft .Net Framework. Used ADO.Net in connecting to Data Access management with SQL Server.  Designed and developed the C# components for implementing business logic which is used to do the transactions on database in middle tier using ADO. Net. Designed and developed the required SQL stored procedures. Handled Configuration (Session, authentication and authorization) and creating user login and privileges. Deployment of web services using C# and exposed them through SOAP and HTTP. Involved in designing UML and documentation of flows, class and functional diagrams. Conducting meetings to establish and enforce best practices and standards. Actively participated in Peer reviewing of the code for maintaining the quality of coding and application. Designed web pages using ASP.net server controls, HTML, AJAX, CSS, and JavaScript. Implemented client side validation using JavaScript and server side validation using built in ASP.net validation controls. Used Update Panel, Update Progress with Data Grids in AJAX and JavaScript Implemented Page Level Caching (i.e. Output Caching) for more static pages. Used Team Foundation Server for version control. Environment: Visual Studio 2010/2013, .Net Framework 3.5/4.0, ASP.NET, VB6.0, C#, WCF, HTML, CSS, Ajax, AngularJS, JavaScript, JQuery ADO.Net, Entity Framework (EF), Web Services, MVC,SQL SERVER 2008R2, TFS, XML, LINQ,T-SQL, SSRS, XML, NUnit, Agile Methodologies Maichew Technical College, Maichew, Ethiopia\t\t\tJune 2007 - Dec 2008 .Net Developer The aim of this project was to implement a web application, where students can register for  courses, borrow library books, view their grade, view announcements If the user is an administrator, he can add and remove courses and modify the student information.  Responsibilities: Involved in all phases of Software Development Life-Cycle (SDLC) for the application. Followed Agile Methodology – Extreme Programming. Used UML for object modeling. Actively involved in writing functional specifications and documentation of the project. Implemented the Object Oriented programming concepts in C# and ASP. Net. Involved in developing server-side code using ASP.Net and C#. Used HTML and Web Form Controls to create web pages. Took the leadership and participated in meetings and discussions regarding solving production issues. Developed MS SQL server Stored Procedures, Triggers, Views, and Cursors for accessing the database. Developed web and windows applications using multi-threading to run transactions successfully.  Design of ASP.NET pages including Master and Navigation pages. Design and Development of various Web Server Controls including Data List, Grid View, Validation Controls. Used Data Access Controls, XML, and XSL to display data from the database. Used Dataset, Data Table, Data Adapter controls for some web pages. Developed codes in Data access layer for retrieving and storing data to and from the database using ADO.NET connectivity controls. Developed partial post back validations to manipulate data on web pages using AJAX. Developed dynamic partial page updates using AJAX and added AJAX features to the existing web applications. Involved in unit testing and integration testing of the application. Used Visual Source safe extensively for version control of the source code along with the maintenance of the builds and the relevant documents of the same. Environment: C#. NET, ASP.NET, ASP, .NET Framework 3.5, VB 6.0, Web Forms, HTML, SQL server 2005, ADO.NET,AJAX, Visual Studio 2005,Visual Source safe."}