{"text": "Name: anna anna E-Mail: anna.anna@gmail.com Address: Delhi, India Github: https://github.com/anna LinkedIn: https://linkedin.com/anna Phone No. 299335089634 Professional Summary: 7+ years of System Analyst/ Business Analyst experience with strong healthcare industry experience in business data modeling, software requirement analysis, process modeling, process flow and quality assurance skills Exceptional knowledge in testing phases with state HIX projects. Thorough knowledge of ICD-9, ICD-10 codes and CPT codes for both Mental and Medical Health. Very good experience on EDI testing and ITS systems. Excellent knowledge of HIPAA standards, EDI (Electronic data interchange) Transaction syntax like ANSI X12, Implementation and Knowledge of HIPAA code sets and HL7. Familiar with HIPAA EDI transactions such as 835, 837 (P, D, I) 276, 277, 278 etc. Strong understanding of project life cycle and SDLC methodologies including RUP, RAD, Waterfall, Scrum and Agile. Experience in using test management and defect tracking tools Quality Center, Test Director, and JIRA for tracking the defects and reporting the defects. Familiar with ORACLE and SQL Experience in executing the test cases and test scripts in different phases of testing like GUI testing, functional, regression, integration testing, system and user acceptance testing. Experience in executed all test cases in all phases of testing like GUI testing, functional testing, regression testing, integration testing, system testing, end-to-end testing and user acceptance testing. Experience in QA verification and QA validations to ensure the quality assurance control. Proficient in writing the QTP scripts using VB script and executed through QTP.  Organized many joint application developments (JAD) sessions and joint requirement planning sessions (JRP), walkthrough, Interviews, workshops and rapid application development (RAD) sessions with end-user/clients/stake holders and the IT group. Extensive experience in reviewing and understanding of business and testing requirements and writing detailed test plans, test cases, and test scripts. Experience on web services like SOAP UI and WSDL elements and knowledge in SOA.  Involved in entire QA life cycle (SDLC), which includes design, development and implementation of the entire QA process for the relational database, web and client/server, IBM mainframe applications. Excellent working knowledge of designing and implementation of all QA test strategy plans and automated test solutions for client/server and web applications with Mercury Interactive Test Suite (LoadRunner, WinRunner, QuickTest Pro (QTP) and test Director). Performance testing expertise in developing performance test plans, test strategy, load modeling, performance metrics and performance analysis Technical skills: Business Tools:\tRational Suite, MS Visio, MS Project, MS Access, MS Office Suite, and Business Object (Crystal Reports). Business Skills: Business Definition Requirements, Business Process Analysis, Gap Analysis, Use Case Modelling and Analysis, Business Environment and Market Research Analysis. Methodologies: RUP, Agile, Waterfall, UML and Business/Data Modeling. Testing Tools: Win Runner, Soap UI, Load Runner, ALM, MDE, Compass, UFT, FACETS, Quality Center, Test Director, Quick Test Pro (QTP), QNXT, PR Tracker, PowerStepp Operating Systems: Windows 7/XP, Mac OS X and Linux. Databases: SQL Server 7.0, Access 2000, MS SQL Server  Languages: UML, C, C++, HTML, Java, and SQL Professional Experience: MVP HealthCare Schenectady, NY\t                                                                            June 2016– Mar 2018 Sr. Systems Analyst \t\t\t\t \t\t\t\t\t\t MVP HealthCare is a leading insurance organization that caters to the health insurance needs of the residents in NY. Worked on all HIPAA transactions . FACETS have been widely used across their network for the claim adjudication, claim processing and Provider Management. The National Provider Identifier Project’s objective is to comply with the mandate that effective with the federal compliance date, all Providers who conduct electronic business via HIPAA Transactions with Mercy Health will be required to obtain and use an NPI. I was also involved in integration of FACETS with legacy and thirty party vendor applications Responsibilities: Conducted user interviews at both in-house and client locations, gathering and analyzing requirements using Requisite Pro and Requisite Web Extensively used Agile Methodology in the process of the project management based on SDLC. Designed and developed Use Cases, Activity Diagrams, Sequence Diagrams, Object Oriented Design (OOD) using UML Gathered and documented Business Requirements, created Functional specifications and translated them into Software Requirement Specifications. Performed Gap analysis by identifying existing technologies, documenting the enhancements to meet the end state requirements Developed test cases and test scripts and assisted Quality Assurance activities, with system integration testing and user acceptance testing (UAT), developing and maintaining quality procedures and ensuring that appropriate documentation is in place. Involved in claim adjudication process of FACETS application. Interacted with Subject Matter Experts (SME), claimers, customers; Conducted detailed interviews with them, recorded the requirements, and reviewed the gathered requirement by both technical and business people.  Responsible for identifying and documenting business rules and creating detailed Use Cases Participated in the process of internal and external auditing activities and developed timelines for project delivery, and managed projects and resources to successful completion Involved in data dictionary management, extraction, transformation and loading (ETL) of data from various sources. Participated in ETL requirements process during data transition from source systems to target systems Involved in Data Analysis & Mapping to track all data elements used in the application from the user interface through different interfaces to the target databases in which they are stored. Developed tables, Views, Stored Procedures and Triggers using SQL Scripting Established Inner Join, Outer Join and created Indexes whenever necessary Writing Complex SQL queries and optimizing SQL Queries. Responsible for working with the State to review and modify process flows to increase productivity and effectively utilize FACETS features not provided by the legacy systems. Responsible to meet the information demands of our business users by delivering timely, accurate, meaningful and standardized data and reporting Participated in creating logical and physical data models, their enhancement. Based on the data models, worked with business architect, to create the software solution models. Helped in creating of Data-Mapping best practices document including visual processes and trained team members on Data Mapping process and tools. Environment: Windows, MS Project, MS Office MS Visio, SQL, Facets, Oracle, Informatica, Autosys, Quality Center.  Amerigroup, Virginia Beach, VA\t\t\t\t\t\t                    July 2014 -May 2016 System Analyst Worked as a Systems Analyst for the Nevada Medicaid, Medicare, and Child Healthcare project:  Amerigroup was migrating to a new MMIS application for Nevada from its previous system called AMISYS. As a business system analyst, I worked facilitated the integration of enrollment and eligibility modules of Medicaid, Medicare, and child healthcare with new MMIS system. The objective of this integration was to help the end users to simplify the tracking and management of the members and their claims. Responsibilities: Gathered Business Requirements from different business owners in areas such as claims, enrollment, cost containment, marketing, and customer service. Analyzed the state requirements and mapped the state requirements with business requirements. Analyzed and mapped different data sets from AMISYS system with the new MMIS system. Created business requirement documents as well as system requirement specifications after the JAD sessions. Created RWP (Requirement Work Plan) during the requirement planning sessions and set the time line to gather the requirements. Analyzed the different Nevada state rules and regulations regarding Medicare, Medicaid, and Child Healthcare (CHIP) Involved in claim adjudication process of FACETS application. Validated the different data sets in areas such as claim, enrollment, and member data from AMISYS system. Tested the changes for the front end screens in FACETS related to following modules, test the FACETS batches (membership, Billing, Provider, etc). Conducted requirement gathering sessions with business owners from claim, eligibility, and enrollment departments. Performed BA validation process for all the reports before dispatching to QA environment. Participated in weekly base team meetings to discuss team progress, problems. Analyzed and documented ICD 10 requirements related to data elements, data exchange, and data transmission. Transitioned to new FACETS Claims and Enrollment System, documented outcome FACETS platform. Documented business needs for ICD 10 resulting from the HIPAA 5010 gap analysis. Determined the requisite ICD 10 training for both internal staff and Medicaid provider groups, and assisted in the development of training materials. Extensively used team track for the documentation as well as the version tracking for the documents. Used TOAD to retrieve needed data from different databases such as FACETS, AMISYS and etc. Assisted QA team during the system testing of the application and coordinated the UAT testing of the application. Created Use Cases and leveraged them as a base for the UAT testing script at the end of the testing phase. Involved in creating weekly status reports regarding the progress of the project.  Worked with the Project Manager on various project management activities like keeping track of project status and major milestones. Analyzed the mainframe reports for member/eligibility/claims and mapped the fields with FACETS batch jobs and reports.. Environment: MMIS, AMISYS, UAT, Team Track, TOAD, MS office, MS Visio, Quality Center, Water Fall. Health Partners Inc., Philadelphia, PA\t\t\t\t\t                   Mar 2012- June 2014 Business System Analyst Health Partners Plans is an award-winning, not-for-profit health insurance organization serving more than 187,000 members in Philadelphia, Chester, Delaware, Bucks and Montgomery counties. They offer Medicaid, Medicare and Children’s Health Insurance Program (CHIP) plans that include special benefits to improve the health and wellness of their members. Responsibilities: Managed the team of consultants responsible for developing on-demand Medicaid Management System reports. Assisted JAD sessions to identify the business flows and determine whether any current or proposed systems are impacted by the EDI X12 transaction, code set and identifier aspects of HIPAA Designed and development of test cases based on functional requirements for Institutional and Professional claims for EDI and HIPAA transactions 837/835, 834, 276/277, 270/271 testing. Tested and implemented HIPAA 4010 and 5010 and ICD 10, version for all EDI transactions. Prepared master test plan covers both the HIPAA 5010 compliance system impact documentation based on 5010 changes and ICD-9 to ICD-10 migration.  Performed requirement analysis by gathering both functional and non-functional requirements based on interactions with the process owners and stake holders and document analysis, represented them in Requirements Traceability Matrix (RTM).. Prepared high level end to end use cases and individual use cases for each 5010 transaction. Facilitated four-hour long round table discussion with most HR directors, managers and analysts along with QA manager to get their input [ad-hoc UAT] in the project. Used SDLC (System Development Life Cycle) methodologies like the RUP and the waterfall. Prepared High Level Test Strategies for the both the 5010 Compliance and Facets 4.61.  Reviewed technical specs together with the team of two developers. Executed all test cases in all phases of testing like GUI testing, functional testing, regression testing, integration testing, system testing, end-to-end testing and user acceptance testing. Involed in the full HIPAA compliance lifecycle from GAP analysis, mapping, implementation, and testing for processing of Medicaid claims and NCPDP claims. Participating in processing of requests for medical services and pharmacy services submitted via DDE or HIPAA 837 EDI and NCPDP submissions testing, integration testing, system testing, end-to-end testing and user acceptance testing.  Wrote test cases in MS Excel for user registration, access to training material, and activity log-in, reviewed the test cases and finalized. Environment: Windows, Oracle, PL/SQL, MS-Project, MS-Office Suite, MS Visio, Rational Requisite Pro, Clear Case, Clear Quest, MS Visual Source Safe, Test Director and Quick Test Pro (QTP). Aetna Health Insurance, Philadelphia, PA \t\t\t\t\t      Jan 2011 – Feb 2012 Systems Analyst Aetna Health Insurance Services Inc. is the leading online source of health insurance for individuals, families and small businesses. It provided complex health insurance information in an objective, user-friendly format, enabling the research, analysis, comparison and purchase of health insurance products that best meet consumers' needs. The project involved the up-gradation of the existing health insurance system whereby web-based application and a direct portal was setup to register Insurance Policies for prospective clients. I was also involved in the analysis of EDI transactions including 837 and 835 based on HIPAA 4010 and mapping them in order to comply with HIPAA 5010 standards. Responsibilities: Performed pivotal role as a Systems Analyst in multiple projects and handled three releases at the same time.  Release one and two were web-based service application developed for streamlining office workflow processes involved in Electronic Data Interchange (EDI) transactions and benefits in claims management cycle based on HIPAA Guidelines.  Release three was based on reporting the policy premium. There were seven reports, which were generated in Brio portal.  Maintained good understanding on ICD-9 and ICD-10 upgrade as well as 4010A and 5010 State Companion guides, 4010A to 5010 side by side changes document , business requirement document (BRD) ,functional requirement document (FRD) and also good understanding on each transaction implementation guides.  Generated test cases in Claims Analyzer Editor Professional to ensure unification with CPT-4 and ICD-9 codes. Tested and Validated SOAP request and SOAP response messages. Identified each 5010 transaction files change and prepared the severity levels like, high level, medium level and low level and prepared the line of estimation by using the estimate tool.  Tested the claims system, Facets 4.41 and 4.51, through the 837 HIPAA X12 Formats (837D, 837P, 837I).  Involved in creating test cases for IDC-9 codes and 837,270,271,835,820 transactions and validating the EDI files.  Performed manual testing as well as automation testing with SOA test tools such as SOAP UI. Worked on agile methodology using Scrum. Tested the universe functionality by writing complex SQL queries in Oracle and verifying the results against the Universe.  Used Facets ITS sub system to easily send, receive and manage data regarding claims, provider, membership, and fee-for-service/capitation billing. Clarified QA team issues and reviewed test plans and test scripts developed by QA team to make sure that all requirements will be covered in scripts and tested properly. Worked with the EDI team to validate the input and the translated files based on the mapping guide.  Identified effect of new changes on existing applications like Edifecs (X-engine, Spec Builder).  Developed budget planning report and timelines of the project by conducting walk-through sessions and meetings involving various leads from development, QA and technical support teams. Environment: Rational Suite (Rose, Requisite Pro), Windows XP/2000, SQL, XML, HTTP, MS-Project, MS-Office Suite, MS Visio, Agile/Scrum, Win Runner, Load Runner, Test Director (Mercury Interactive), Java and Oracle."}