{"text": "Name: pauline pauline E-Mail: pauline.pauline@gmail.com Address: Dar es Salaam, Tanzania Github: https://github.com/pauline LinkedIn: https://linkedin.com/pauline Phone No. 193680948490 SUMMARY Over 6 years of experience as a Front End Developer in building Web User Interface (UI) using all the latest and greatest web technologies like HTML4/5, CSS2/CSS3, Java, JavaScript, AngularJS, jQuery, Node.js, Grunt, Bootstrap, LESS, Bower, Jasmine, Karma, Protractor and JSON that follows W3C Web Standards, Section 508 accessibility standards and are browser compatible.  Worked on the MVC architecture of Angular JS in developing the apps, controllers and directives which are totally customized to meet the needs of the application.  Expert in designing web applications and web contents utilizing various Search Engine Optimization (SEO) techniques.  Expertise in Responsive Web Design (RWD) using Twitter Bootstrap and CSS3 media queries.  Involved in web development consulting focused on the MEAN stack (Angular JS, Node JS, ReactJS, and MongoDB). Experience in utilizing JavaScript libraries, frameworks, template systems and platforms including Node.js, Knockout and AngularJS, ReactJS, Backbones, Ember and jQuery. Good experience with Form Validation by Regular Expression, other JQuery plugins (auto complete ui).  Proficient with creating Logos, Banners, Buttons, Icons and Images using Adobe Flash and Adobe Illustrator.  Experienced both in working on Designing table-less layouts and table-based layouts.  Excellent experience in developing web pages complying with Web Content Accessibility Guidelines (WCAG), Section 508 accessibility standards and ability to apply W3C web standards.   Experience in debugging and troubleshooting code using Jasmine testing framework and mainstream browser tools like Firebug, Firebug Lite, Chrome or Safari Web inspectors and IE Developer Toolbar.  Expertise in analyzing the DOM Layout, Java Script functions, Cascading Styles across cross-browser using Fire Bug, Developer Tool Bar.   Experience using all popular text-Editors like Brackets, Sublime Text, and Notepad++.  Familiar with Grunt, Gulp task runner to manage project and Bower package manager to install \nlibraries such as jQuery and Bootstrap based on running in thenode.js environment.  Used GitHub to interact with GIT to make code visualize and manage your repositories through GitHub simple interface. Experience in documentation using Visual Studio and extensive experience working with Agile and Scrum Methodology of SDLC which includes Scrum meetings, and Iterations.  Experience in all phase of SDLC like Requirement Analysis, Implementation and Maintenance, and extensive experience with Agile and SCRUM.  Excellent analytical and communication skills with capability to handle new technologies. TECHNICAL SKILLS UI Web Technologies\t: HTML 4/5, CSS 2/3, XML, Java, JavaScript, AJAX, JQuery, JSON, LESS, Angular.js, Node.js,  Backbone.js, Bootstrap, MongoDB Tools \t: Brackets, Sublime, Notepad++, Spring Tool Suite, Microsoft Visual Studio, Browser Developer Tools, Protractor, Jasmine, Karma, Grunt, Gulp, Eclipse, FireBug, Git, CVS, JIRA, GitHub  Operating Systems\t: Windows XP, Windows7, 8, Mac OS, Linux PROFESSIONAL EXPERIENCE Tunstall, Pawtucket, RI\t\t\t\t\t\t\t\t        Mar 2016 - Present Full Stack Developer Responsibilities: Developing Web Application to replace the existing and legacy Website using AngularJS Framework. \nImplement the statement module by using AngularJS.  Writing code to fetch data from Web services using JQUERY AJAX via JSON response and updating the HTML pages. Requesting to GET data from backend using Ajax function in jQuery to exchange JSON data with back-end.  Using Twitter Bootstrap framework and CSS3 media queries to create responsive layout for both desktop and mobile browser users. Front-end development utilizing Java Script frameworks such as Angular.js, JQuery UI, Backbone.js and React.js, as well as front end technologies HTML5, CSS3, AJAX. Working on Collections in Backbone.js to fetch raw JSON data from API which will automatically populate data as array Using Models to create the views in backbone.js by fetching the data from Spring MVC  Using SASS to write logical, reusable code which is more efficient, and easier to maintain.  Creating angular directive and controller to handle logic, search features on statements module.  Integrating Mongo DB and spring communication, establishing data mappings and using Mongo DB repository and spring mongo template for persistence.  Working on resolving numerous cross browser compatibility such as IE, Mozilla Firebox, Google Chrome and Safari.  Developing Single Page Application (SPA) using AngularJS MVC Framework.  Creating cross-browser compatible and standards-compliant CSS-based page layouts.  Working on Cross-Browser compatibility design and fixed the bugs. Make sure the application can work expectantly on multiple web browsers.  Set and configuring test environment using Karma, wrote unit test using Jasmine and end-to-end test using Protractor.  Testing the application using GruntJS.  Collaborating on GitHub for source code versioning. Involving in Agile process, monthly Sprints, and daily Scrums to discuss the development of the application. Working on documentation and involved in maintenance and support. Experience includes working with Agile Scrum Methodology of Software Development Lifecycle which includes Scrum meetings, and Iterations.  Creating design documents when and as required.​ Performing coding, debugging and testing.  Environment: HTML5, CSS3, Java, JavaScript, JSON, JQuery, Angular.js, Backbone.js, Node.js, Bootstrap, Jasmine, Karma GIT, MS Office, JIRA, Brackets, Grunt, Protractor, GitHub, MongoDB. Bed Bath & beyond, Union, NJ\t\t\t             \t\t\t\t      Apr 2015 – Feb 2016 Full Stack Developer  Responsibilities: Developed User Interface using HTML/HTML5, CSS/CSS3, JAVA, JavaScript, and JQuery, Ember.js, AJAX, JS, JSON and AngularJS.  Created package JSON for Bower and NPM.  Extensively used Angular UI (Angular Bootstrap) for ng-grid, and UI components.  Beautify the application layout and make every feature clear, smooth, and easy to access by using CSS.  Produced content pages with CSS3 layout and style markup presentations and also used JavaScript methods and properties.   Designed and developed web pages components to improve user experience and features using HTML, CSS, JavaScript jQuery and Backbone.js. Used Backbone.js routers to change the URL Fragment in order to provide bookmark able and shareable URLs for an Ajax heavy application Created a demo website running on a Node.JS, using the Express framework. Worked on creating responsive website using Responsive design and media queries to fit different size devices.  Debug the application using Firebug to traverse the documents and manipulated the Nodes using DOM and DOM Functions.  Extensively used Debugging JavaScript using Chrome developer Toolbar, Firebug.  Developed the UI with extensive use of JavaScript, JSON and Ajax.   Developed different JQuery component in MVC micro architecture framework which internally use various design pattern such as singleton, command, delegate, etc.  Version control through CVS.   Tested every detail of the application, tracking defects and fixing bugs before publishing.  Participated in the team on agile development cycle.   Environment: HTML5, CSS/CSS3, Java, JavaScript, JQuery, JSON, AngularJS, Backbone.js, Bootstrap, Ember.js, Responsive design, Grunt, Bower, Node.js, NPM, CVS, Chrome developer Toolbar, Firebug. Atos, Mason, OH\t\t\t\t\t\t\t                    Sep 2014– Mar 2015 Full Stack Developer Responsibilities: Maintained consistent communication for updates, content and approval with client.  Worked on the website to give it a new look using HTML/CSS/JavaScript.  Developed CSS styles to maintain the uniformity of all the screens throughout the application and positioning of screen objects. Involved in the unit testing of the application and fixing the bugs.  Responsible for developing the UI pages using HTML5, CSS3, JavaScript, Bootstrap, JSON, jQuery and Ajax. Involved in developing web Page Applications using AngularJS, ReactJS.  Developed Page layouts, Navigations and presented designs and concepts to the clients and the management to review.  Used firebug, IE developer toolbar and chrome canary tool for debugging java script and fixing issues.  Implemented responsive web design using media queries and bootstrap.  Used jQuery plug-ins to implement features as a light box, galleria, sliders and other intuitive features.  Created design mock-ups and wireframes using MS PowerPoint, Adobe Photoshop and Dreamweaver.  Used jQuery to make the application highly interactive and used JSON objects effectively for efficient client side coding.  Created pages in Mockups and validated the HTML code. Involved in fixing Front-End issues with the layouts. Responsible for checking cross browser compatibility and hence worked on different browsers like safari, Internet explorer, Firefox and Google chrome.  Worked on creating responsive website for smart devices using Responsive design and media queries.  Wrote an acceptance test suite utilizing Jasmine and Grunt. Developed test cases using Jasmine for functionality and unit testing and Protractor for end-to-end testing. Worked in scrum process attending daily stand up and completing tasks in sprints.  Used Source Tree, Git for version control for defect tracking.  Environment: HTML5, CSS3, Java Script, Java, AngularJS, Bootstrap, AJAX, jQuery, JSON, XML, Jasmine, Protractor, Grunt, Eclipse, Notepad++. Smart minds InfoTech Pvt. Ltd., TS, India\t\t\t\t \t       Jan 2012– July 2014 Jr. Front End Developer Responsibilities: Involved in the Analysis, System study and designing of the project. Developed front-end screens with HTML, DHTML, CSS, JavaScript and JSP's. Extensively did client side validations using JavaScript and developed the required Servlets. As a developer, coordinated with onsite team and client in understanding the business process and requirement understanding. Developed stores procedures, triggers, functions and database tables in Oracle database.  Worked on developing a suitable GUI for ATM locator. Participated in daily meeting for enhancing the features for the portal. Participated in Code review and Quality Assurance. Used JDBC, application server provided transaction API for accessing data from the Oracle the using standard statements. Involved in write application level code to interact with APIs, Web Services using AJAX, JSON and XML.  Developed an AngularJS workflow manager leveraging Angular-UI's state router for flexible configuration and management of multi-step user input flows  Designed dynamic and browser compatible pages using HTML5, CSS3, Bootstrap and JavaScript Developed Unit Test Cases using Karma, & Involved in Unit & Integration testing of the application.  Ability to rapidly prototype interface designs in hand-coded validating, standards-compliant, and semantically rich code and be aware of cross-browser compatibility and bugs.  Thorough understanding of the differences and bugs in various browsers and browser versions.  Understanding of application development lifecycle methodologies.  Adopted AGILE SCRUM methodology to manage full life-cycle development and worked closely with PO's (product owners) to implement customer requirements accurately.  Environment: HTML, CSS, JavaScript, JSP, AJAX, JSON, XML, Agile, Scrum, jQuery, AngularJS, Bootstrap, DOM, DHTML, Oracle database, Eclipse, SQL, Windows XP/07 and MS Office. EDUCATION Master’s of Sciences in CS – December 2015, Rivier University, NH, USA. Bachelor’s of Technology in CSE – May 2014, JNTU, Hyderabad, TS, IND."}