{"text": "Name: margaret margaret E-Mail: margaret.margaret@gmail.com Address: Toronto, Canada Github: https://github.com/margaret LinkedIn: https://linkedin.com/margaret Phone No. 471973968885 \t Business and Information Technology                        SUMMARY SAP Certified Business Associate with SAP ERP 6.0. Knowledge of how the fundamental integrative business processes interact within SAP including: Order to Cash, Procurement, FICO, Customer Service. SAP SD OTC Functional Consultant with 9 years of experience in Sales & Distribution, OTC Implementation, Enhancement, Order Management and Pricing. Hands on experience of working in 7 SAP projects, 3 of them as Full Life cycle implementations from Business Blueprint to Go Live and 4 projects with Production Support. Functional Order to Cash expertise from pre-sales business process like inquiry, quotation to actual business scenarios like sales order, delivery, post goods issue, and billing. Pricing expertise involved configuration of pricing procedure, maintaining various condition types, access sequence for these condition types, maintaining condition records, maintaining routines. Involved in implementation of Order-To-Cash that involves configuration of Availability check, Transfer of Requirement, Contracts, Schedule line Agreement, Delivery, Intercompany Sales transaction, Third party Orders, Invoice Generation. Functional expertise includes Price Control, Order management, Billing and Revenue Account Determination, Rebate agreement, Credit Management, Item category determination, Output Determinations, Copy Control, Periodic billing, Automatic Batch Determinations and Delivery Splits. Experience in the configuration of basic functions that included partner determination, output determination, Incompletion log, Copy Control, Material Determination, Text determination, Tax Determination, free goods determination, Credit Management, Payment processing. Billing expertise which included configuring order-related and delivery-related invoices, credit memos, debit memos, Intercompany billing process, Billing plans (Periodic, Milestone), and Rebate Agreements in OTC scenario. Data Migration: Expertise in migrating and converting data from legacy system to SAP using LSMW. Worked with interfaces EDI/IDOC’s. Proficient in Delivery processing configuration and customization picking, packing, PGI, PGR, route determination, shipping point determination, delivery due list. Expertise in Implementing, Customizing, IMG Configuration, Analysis, Application Design, Testing, User Training, Support in SD module  and expertise in integration of MM, FI, and PP modules. Testing experience includes Unit testing, Integration testing, User acceptance testing, Performance testing and Regression testing with tools like HPQC. End-user Training, user manual documentation, Data analysis, Tables, Debugging in ABAP for performance tuning. Excellent Technical, Analytical, Presentation, Communication and Leadership skills. Strong team player and ability to perform in both team and individual settings. TECHNCIAL SKILLS ERP Systems \t\tECC 6.0 & 5.0, 4.6B, 4.6C, 4.7 OS  \t\t\tWindows 95/98/NT, 2000 / XP, windows 7 Project Tools \t\tMS Word, MS Excel, MS Power Point, MS Access, C, C++, Tableau Languages \t\tC, C++, and VB   EDUCATION  Post-Graduation diploma in Business Administration from Academy of Management studies, Dehradun, 2005 Certification: SAP Order fulfillment (SALES and Distribution), 2008   PROFESSIONAL EXPERIENCE\t Client: Ashland, Dublin, OH                                                                                           Dec 2012 – Present Role: SAP -SD LE Lead in Production Support ECC7.0 Project: SAP SD OTC Functional Support Ashland Inc, USA - is a specialty chemical company that provides products, services and solutions to industries. Ashland is implementing a shipment tracking system which can provide track and trace of its chemicals using SAP SD module. Responsible for mapping new business requirements to SAP SD and to provide ongoing support for PGI, route, shipping point, shipment, shipment cost, output etc. Responsibilities: Order-to-Cash (OTC): Design and development of various sub modules of Sales and Distribution like Sales, Logistic Execution(Shipping and Transportation). Designed process for new shipment type creation, shipment cost. Creation of Activity Profile for PGI. Responsible for mapping the new business Scenario ( to give warning message when process during holidays) Mapped requirements which prevent manual entries in delivery without reference to a sales order. Mapped scenario  of over tolerance and under tolerance delivery  Responsible for resolving the ticket on SAP LE –OTC   module within the SLA Mapped scenario for partial delivery and complete delivery. General Master Data: Configurations including customer master, material master, combining sales area elements, condition records for both pricing and outputs. Sales: Development including order types, item categories, sales area assignment to document types, schedule lines, copy control routines. Shipping and Transportation: System configuration included routes, transportation zones, shipping point determination, delivery types, delivery split, copy controls for delivery, delivery due lists, output control. Configured Output Determination for Deliveries & Shipments, Shipping Points, Shipping Conditions and new Shipping Point Determination ,Delivery Splits, Transportation Planning and Scheduling, Route Determination – defining route, modes of transport, shipping types, routes and stages, transportation connection points, transportation groups and transportation zones Batch Job scheduling and assigning to distribution list. Client: Conva Tec Somerville, NJ \t\t\t\t\t\tJune 2012 – Nov 2012 Role: SAP SD OTC Functional Consultant, ECC6.0 Project: SAP Full Life Cycle Implementation Project ECC6.0 Description ConvaTec is a global medical products and technologies company, offering products and services in the areas of wound and skin care; ostomy care; continence and critical care; and infusion device Responsibilities:  Design and development of various sub modules of Sales and Distribution like Sales, Logistic    Execution(Shipping and Transportation). Product which are near to expiry or expired should not be picked for delivery. Restocking Business process. Maintenance support includes solving the service request raised by the end user by providing effective solutions for business within the time frame agreed upon in the SLA. Created and maintained the Organizational entities. Customizing Alternative Product selection, Material Determination, Material Listing/ Exclusion, Contracts, and Free Goods. \n Client: Jannsen Pharmaceutical, Belgium                                                                      Jul 2011 – May 2012 Role: SAP SD Lead in Production Support ECC7.0 Project: SAP SD OTC Functional Support Jannsen Pharmaceutical, Belgium - develop treatments for some of the most devastating disorders and complex medical challenges including diabetes, hepatitis, HIV, cancer, arthritis, dementia and mental disorder. Key member of the functional/Production support for global SAP SD implementation, including - Order to Cash cycle (Order, Billing, Pricing), LE (logistic execution) Responsibilities: Design and development of various sub modules of Sales and Distribution like Sales, Logistic    Execution(Shipping and Transportation). Invoice Date in Billing of the Third party process should be same as GR Date. Reverse pricing calculation of the new Discount and LIS report (info structure) of the new discount value on yearly basis. Limited number of item in an Invoice. Handled different types of issues faced in OTC (Order to Cash) process. Involved in configuration, Testing and production support for addressing company issues in Order Management, Delivery and Billing in (OTC cycle) of Sales and Distribution module. Maintained and tested Sales documents, Item categories, Incompletion procedures, Text determination and Billing. Involved in configuration and complete analysis of order management, Transfer of Requirements, shipping, billing, pricing and availability check. Configured pricing procedures, condition types, access sequence, pricing procedure determination. Configured various Tax Determination, Rebate Agreements, output types and output determination procedures. Defined and assigned Account Keys assigned G/L accounts. Documented Configurations, Functional Specifications, Test Scripts and Test Scenarios. Performed Unit Testing, Integration Testing, User Acceptance Testing, End User Training Manual. Lead training sessions for end users, ensuring the system met business needs.   Client: Alcatel Lucent, France                                                                                     May 2010 – Jul 2011               Role: SAP SD Lead  ECC 6.0  Project: SAP SD OTC Functional  They are a leading IP networking, ultra-broadband access, and cloud Technology Company. Responsibilities: End to end configuration from User requirements gathering, Business Blueprint phase and sign-off, realization, final preparation to Go-Live and production support. Involved in prototyping to test the system for GAP analysis and AS-IS and TO-BE processes. Set up sales area and Assigned plant to sales organization and Distribution channel Configured and Set up Divisions, Sales Groups, Customer Groups and Maintenance as required. Configured sales document types and copy controls as per the needs of the subsequent processes. Analyzed the pricing strategies and customized pricing procedures for product. Configured Item categories, schedule line categories, and Copy control. Configured Make to Order process and Material determination  Configured Pricing Procedure with condition tables, condition types, access sequence with Customer and Document Pricing procedure. Configured Pricing Involving base price, gross price and net price with taxes Configured Order to Cash Process (OTC) involving Sales order, Delivery, Billing and Third Party Orders. Managed credit control areas and credit limits and was responsible to release the customer orders from credit hold after review. Involved in Configuration activities in shipping documents for individual shipment, assigning transportation planning point. Configured Delivery types for delivery with order reference process based on business requirement and developed user exits to populate necessary data required for determining pricing and invoicing. Involved in creating Contracts like Master Contracts, Quantity Contracts, Value Contracts, and Service contracts. Worked on Complaints like Free-of-Charge Delivery, Sales Returns and Invoice Correction Request. Worked on Rebates including Rebate Agreement Type, Condition Type Group, Condition Types, Access Sequence, Condition Tables, Account Determination and Condition Records. Automated the Rebate settlement process by designing a function module providing the facility to the user for entering the amount and Rebate agreement number. Configured contracts, Scheduling agreements, Text determination techniques, Partner functions and shipping points. Defined Document types consignment fill-up, Issue, Return, Pick-up for Configuring Consignment Stock Process. Writing test cases, test scripts for various business conditions for most of the SD process and carrying out the Testing at all levels (Unit Test, Integration test) with different variant conditions and approach. Pre-implementation business process mapping, post go-live and end-user training. Closing interacting with ABAP programmers for developing reports as per the business requirements and Preparing Functional and Technical specification. Client: BHP BILLITON ,                                                                                           May 2010 – Jul 2011               Role: SAP SD Lead in Production Support IS-OIL Project: SAP SD OTC Functional Support BHP BILLITON  was my additional project which I was working remotely . Worked on the ticket related with account determination ,Pricing. Have configured formula pricing Customize Tab on sales order Client: Maersk Global Services, Dublin                      \t\t\t\t      July 2009 – Mar 2010 SAP SD Pricing Functional Consultant, ECC6.0 Project: SAP SD Full Life Cycle Implementation project ECC6 Description The Maersk Group is a global conglomerate operating in global trade, shipping and energy. Maersk operates in over 130 countries. Responsibilities: Setting up Enterprise structure: Sales area, Customer Master, Account groups, Plant, Shipping point, Route, Pricing procedure and worked in Rebate agreements, condition techniques and Creating ABAP queries. Worked on inbound and outbound EDI. This also includes extension of existing IDOCS, creation of partner profiles and mapping of EDI data. Business blueprinting that includes user requirements gathering, Gap Analysis and Mapping it with SAP and realization for RICEF Components. Output Determination configurations included setting up Exchange servers for emails, printing ports to print Smart Forms (Sales Order and Invoice), Fax Viewer to use Fax and IDOC’s for EDI. Configured Pricing Procedure: Maintaining and Assigning Condition tables, Condition types, Access Sequence, Pricing procedures and setting up Tax determination condition types based on Country, Plants and Rules. Configured Item categories, Item category groups, schedule line categories, Copy control and Credit management and risk category determination, contracts maintained. Configured Revenue Accounting Sales order management configuration included Intercompany sales Worked closely with ABAP Debugging generating records for essential fields and tables which ABAPer’s need to customize programs in user exits. Worked on OTC-Order to Cash, configured sales order documents, outbound delivery, Availability check, PGI, transfer of requirements, shipping point determination, billing document and Payment transactions. Creation of Test Plan: Unit level, Integration level, Scope requirements, testing process methodology development to suit the business scenario. Defined various Shipping Types, Transportation Connection points and maintenance of the Stages for the routes, configured the Transportation zones. Worked on training the end users on SAP functionality and prepared end user documentation for sales order processing, delivery and billing.   Client: NRCC, KSA                                                \t\t\t\t\tSep 2008 – Jun 2009     SAP SD OTC Consultant ECC 6, ECC5.0                                                  \t\t\t                Project: SAP SD Full Life Cycle Implementation project Description: Northern Region is major Cement Company based in Saudi Arabia Responsibilities: Involved in Configuration and AS-IS an activity. Proto typing and Demonstration of SD OTC and other modules functionalities to the business. Preparation of Business Process Master List, To-Be documents. Used data migration tools like LSMW to upload legacy master data like Customer master records and transactional data like invoices etc. Developed a User Exit to issue warning messages and put delivery block in sales order. Setting up of project, uploading documents in Solution Manager and maintaining on a regular basis. Arranging process validation workshop and getting sign-off of “To-be” document. Co-ordination with technical team for solution architecture. Created Variant and background Jobs. Responsible for the analysis of existing reports (including various customized reports) and help users with executing reports. Configured Intercompany Sales, Stock Transfers for Automatic Posting of Invoices through IDOCS and EDI. Configuration outbound delivery documents, picking, packing, and transportation. Proficient in configuring Shipping Point Determination, Route Determination, Transport and Delivery Scheduling, Backward Delivery Scheduling, Partial and Complete Delivery, Subsequent Outbound Delivery Split and Grouping of Deliveries. Integrated SD with other modules like MM, WM, and FICO modules. Involved in Core User and Super User Trainings.   Client: Crossroad, India                                                                                                  Oct 2006 – Aug 2008 Role: SAP SD Consultant  Responsibilities: Active participation in workshops and presentations Guided application to validated business processes and solutions with end User. Developed specifications for formulas, requirements, user exits and reports to enable business processes not supported by standard SAP functionality. Created Test cases and carried out unit testing and integration testing. Worked on creating test scenarios and test scripts.  Involved in testing the Configurations in Customer & Material Master Data, Account Groups for Customers, Partner Functions and Partner Determination Procedure for Customer Master. Material Listings and Exclusions for various customer groups, item categories, and copy control of sale document types to billing and delivery documents. Tested New Pricing Procedure with associated Condition types, Access Sequences and Condition tables as required by the business for service order types. Reviewing the Test cases and providing feedback to the QA team. Writing Test Cases for User Acceptance Testing (UAT). Performing User Accepting Test. Communicating and reviewing the defects from the UAT with the offshore QA team. Client: Tata Sky ,through Crossroad, India                                                    July06 to September06 Role:– SAP SD / CS Consultant Responsibility: Experience with Master Data – Vendor Master, Customer Master, Material Master, BOM and Pricing Created a new notification type and quote process for repair orders Made Configuration changes in Service notifications, Service Orders, Customer repair orders and resource related billing."}