{"text": "Name: vera vera E-Mail: vera.vera@gmail.com Address: Atlanta, United States Github: https://github.com/vera LinkedIn: https://linkedin.com/vera Phone No. 669687835465 SUMMARY Business Analyst with over 7 years of experience with focus on Salesforce.com, ERP, data analysis, requirement gathering, technical documentation, database development and software validation Proficiency in SFDC Administrative tasks like creating Profiles, Roles, Users, Page Layouts, Email Services, Approvals, Workflows, Validation rules, Reports, Dashboards, Tasks and Actions. Experience with Oracle Big Machines Express CPQ Cloud Service for Salesforce.com to configure, price, quote, and create proposals immediately, and streamline renewals. Experience in approval processes for automated alerts , field updates, custom objects and tabs, and security controls  Experience in maintaining, enhancing and creating workflows and validation rules. Strong experience in creating executive dashboard to display open, closed leads in SFDC Experience in managing reports, data migration, testing and support Documenting business requirements, technical requirements and Use Case diagrams to make the requirements easy to understand for Salesforce Developers  Skilled in using change control and bug tracking tools like TFS and Quality Center for identifying, analyzing, assigning and documenting defects including version and change control. Experience in Software Development Life Cycle (SDLC) methodologies and Object Oriented analysis Expertise in generating enterprise reports using Crystal Reports, SQL server Reporting Services (SSRS), Power BI, Tableau and Excel spreadsheet, scheduling and deploying reports on report server.  Experienced in implementing Sales/Service Cloud and Custom Application Development. Experience in Data Analysis including analysis of root cause for Incident and Problem Management Extensive experience in creating test plans, test cases and performed User Acceptance Testing (UAT) Knowledge of Agile Scrum development practices and assessment  Worked very closely with the offshore team across the SDLC Possess knowledge of CRM processes like Sales, Marketing, Customer Service and Customer Support, Business processes and recommended solutions to improve their processes using Salesforce.com. Oracle developer with in depth knowledge in writing SQL, PL/SQL programs, Packages, Stored procedures, Functions and Triggers to automate the interface processes for daily/incremental loads Created dynamic variables, Action filters, parameters and calculated sets for preparing dashboards and worksheets in Power BI, Tableau, Qlikview.  Extensive experience in working in TOAD tool Strong analytical and problem solving skills with ability to work within team environment and independently when needed Proficient in learning new technologies and quickly adapting to new environment TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE: Nike, Portland, OR              \t\t\t\t\t\t             Feb 2018-Dec 2019   Sr. Salesforce Business Analyst        The scope of this project is to deliver the core components for the consolidated ecommerce platform. The overarching requirement for the consolidated ecommerce platform solution is to provide flexibility driven by the business community, with the ability for the proposed solution to be maintained by the business users and not require significant IT intervention. As a BA, I worked on the Salesforce.com CRM platform which was implemented across all divisions and sub-divisions in order to manage ecommerce platform more efficiently. \t\t Responsibilities:  Interacted with various business team members to gather the requirements and documented the requirements.  Responsible for Salesforce implementations and training globally and looked after as Salesforce administrator and assistant developer.  Salesforce.com Configuration and Design of Service Cloud, Sales Cloud and Force.com solutions, with an emphasis on Service Cloud solutions.  Building and managing SSRS, Tableau, Power BI reports. Developed various Custom Objects, Tabs, Components and Visual Force Pages and Controllers.  Understood business goals and business context and translated them into technical specifications.  Experience with Salesforce data tools such as Data Loader and Eclipse Force.com IDE for data migration.  Experience integrating salesforce.com with other apps.  Techno-Functional experience with Salesforce Sales cloud and Marketing cloud as system administrator and guiding clients on CRM solution for sales, marketing and services teams.  Integrated the Web Services for extracting the data from external systems to display in the pages of Salesforce.com.  Support the UAT team during their testing.  Involved in Salesforce.com application Setup activities and customized the apps to match the functional needs of the organization. Used Data Loader for insert, update and bulk import or export of data from Salesforce.com S Objects. Used it to read, extract, and load data from comma separated values (CSV) files.  Created page layouts, search layouts to organize fields, custom links, related lists, and other components on detail pages.  Created Test Scripts by referring to Acceptance Criteria in User Stories in MS Team foundation Server (TFS). Built many complex reports for reporting team and integrating the reported data to TABLEAU using Integration platform INFORMATICA. Used Apex Data Loader to migrate data such as accounts, campaigns from different legacy systems.  Experience assessing testing processes, creating, implementing testing strategies and SQA strategies using Agile Scrum-testing methodology in UAT phase.  Worked with broad range of technologies including SAAS technologies, Custom Button workflow, and validation. Implemented Standard and Custom Apex Controllers to handle business logic and used debug logs to trace the execution.  Created Custom Email Templates as part of sending alerts to users based on the business requirement.  Created Campaigns to send thousands of emails at a time using just an email alert workflow and a trigger.  Developed complex formulas to calculate response times and show flags reminding customer service reps to respond to customer queries in due time.  Used Enterprise WSDL and developed Inbound Custom Web Services to expose native logic to external clients.  Created Users, Roles, Public Groups and implemented role hierarchies, sharing rules and record level permissions to manage sharing access among different users.  Designed and deployed dynamic workflows, validation rules, Approval Processes and Auto-Response Rules for automating business logic. Developed Configurations in Salesforce for DocuSign E-Signature, a Digital Transaction Management System used to securely sign, send and manage the documents in the Service cloud.  Implemented Test Classes to cover positive and negative use cases for Classes and Triggers and achieved close to 100% coverage.  Performed IDE and Deployments across sandboxes and to Production Instance AXA Equitable, Farmington, CT\t\t\t\t\t\t\t      Mar 2016-Jan 2018 Salesforce Business Analyst                    I have worked very closely with the Wholesale Life Distribution sales team of almost 100+ users to enhance and maintain our SFDC instance to meet the changing needs of the team.  Also, simultaneously serving as a Salesforce BA in most of the projects. I wrote the Functional Business Requirements, User Stories, Use Cases, and Business Requirement Documents. I wrote and executed the User Acceptance Test Plans and tracked the results through defect resolution. Responsibilities:  Actively Assisted Project Manager in developing Scope/Vision Documentation and Project Plan, tracking project progress. The Projects were implemented based on Agile Scrum methodology. Developed the Scope/Vision Documentation and Project Plan, tracking project progress. Created BRD, FRD and converted into System Requirement Specifications Document. Presented the project data in views as Gantt charts, pivots, calendars, network diagrams and task sheets in MS Project. Analyze existing interfacing systems and understand various technologies involved. Performed extensive System Analysis the various business specifications. Responsible for Bug free delivery of Sales and Service Oriented applications developed on (Salesforce.com) Force.com Platform. Implemented Salesforce Service cloud and Opportunity Management (Case management, Entitlement management, Product & price book, High volume customer portal, Partner portal, Visual force sites) for business support and technical support for its channel customers.  Created test scripts and test cases for approved business use case and requirements for System and UAT testing. Installed and Implemented Package tools like Box, Anaplan, DocuSign and Tableau. Develop Reports/Scheduled Reports, Dashboards, and processes to continuously monitor data quality and integrity Assist users with report design and management. Experienced in using Apex Data loader, for exporting and importing/exporting the data into/from SFDC. Transformed the customer experience and build great customer connections with Salesforce Service Cloud.  Managed the requirements and prioritized user stories them with the help of management tools like TFS, HP ALM and used JIRA for defect management.  Created Test Scripts and Writing the test cases and performing Regression tests on them. Experience in Creating and editing Users, Accounts in Salesforce. Responsible for managing Users in Production and supporting users in UAT. Performing UAT Testing for the complete instance of Salesforce for one of the major project. Created  Profiles,  Roles  based  on  Organization  role  hierarchy  and Implemented Record-Level and Field-Level security  and  configured  their sharing settings. Extensive business knowledge and customization experience on various salesforce.com standard objects like Accounts, Contacts, Opportunities, Products and Price books, Cases, Leads, Campaigns, Forecasting, Reports and Dashboards. Designed / developed several Reports in SSRS, Power BI and tableau using SQL Server tables and SSAS Cube.  Created/Customized Workflow Rules, Page  Layouts,  Approval  Process,  Tasks,  Email Alerts, Field Updates and Outbound Messages  to  manage  the  Workflow  &Approvals. Worked/Designed various salesforce.com standard objects like Accounts, Contacts, Leads, Campaigns, Opportunities, Quotes, Activities, Dashboards and Reports. Worked on various salesforce.com Custom objects like Account Addresses, Account Goals, Account Policies, Activity Calculator, Activity Points, Agent Policies, Policy Premiums, Premium Transactions, Retail Branch Performance, and Sales Profiles. Worked on the daily policy error reports coming in from a different system into Salesforce. Have been an active part in the Risk Assessment for one of the major Projects. Created Mockups for the New Objects to be created in Salesforce Instance. Fidelity Investments, Jacksonville, FL                                                                                  May 2014-Feb 2016 Salesforce Business Analyst    Fidelity Investments is an international financial institution. Their broad and integrated range of investment banking services spans the entire investment spectrum, Front-Office including research, investment management, sales and trading services and investment servicing. Perform various tasks as a member of the business team including, but not limited to: task lead, requirements gathering and implementation, writing functional specifications, knowledge transfer and process improvement, internal team building, client communication and relationship, and quality assurance.       \nResponsibilities:  Performed GAP ANALYSIS, created new process flows from AS-IS to TO-BE system. Involved in gathering and synthesizing business requirements and translated them into functional and non-functional requirements to be used as input to the functional design specifications. Conducted JAD sessions to allow different stakeholders to communicate their perspectives with each other, resolve any issues, and come to agreement terms. Conducted different elicitation techniques to gather requirements for Data Warehouse and also performed tests to validate the data. Interacted with technical architects to identify and analyze the given information, procedures, decision flows, and also evaluated existing procedures. Maintained On-going documentation of standard operating procedures and process improvements for VCS customer account management and call center IVR process, troubleshooting, and escalations.  Contributed with Project manager in handled scheduling, resource planning and allocation matters conducted status meetings and compiled reports. Extensively worked on creating User Requirement Specifications, Functional Requirement Specifications, and Business Process Documents and also assisted in developing System Requirements. Designed use case diagrams to present a better view of the system and enable the technical team to identify the key processes. Utilized Informatica to Extract, Transform and Load (ETL) data for the project during Data Migration. Prepared diagrams and elaborated them using UML diagrams, Data Flow Diagrams, Business Process and Data Process Model using MS Visio. Conducted sprints, created the sprint backlog, product backlog, burn down charts during Salesforce CRM implementation. Contributed in customizations, enhancements, updates, and changing functionalities of Salesforce CRM web application. Created and executed Test Cases. Assisted in functional testing for both manual testing and automated testing. Oversee VCS portion of VIN reporting project and be subject matter expert, conduct UAT and analysis of program and also participated in creating User Manual. Suntrust Banks, Atlanta GA                                                                                                  Nov 2012-Apr 2014 Business Analyst  The objective of the project was to establish a Common Operating Environment for Traders and Analysts working on the Fixed Income Trading desk and also working in the Migration process involving data gathering stage to the deployment and testing stage (UAT). The Project encompassed coordinating with the traders, data gathering, and platform engineering, and testing. Data conversion and trade floor support on a wide range of issues including business rules, core business applications, policy groups, and configuration settings were additional responsibilities. Responsibilities:  Presented new business solutions to stakeholders before initiating the project. Successfully implemented the Was responsible for implementing a trading application using Calypso for the Fixed Income derivative products: Interest Rate swaps, Currency swaps, Equity Total Return Swaps, Credit swaps, Futures, Forwards and Options.  Conducted GAP Analysis and system analysis to determine if solutions to the business requirements are feasible and can be implemented using the product Calypso.  Analyzed impact of proposed solution across the business. Developed proposed statement of work. Facilitated JAD sessions with the business group (traders and portfolio managers) to gather, analyze and document business requirements and business rules. Created UML Models such as Use Case Diagrams, Activity Diagrams and Flow Diagrams using MS Visio. Documented the Business Requirement Document (BRD) and the Requirement traceability matrix. Detailed and documented the key features of the application being envisioned.  Conducted JAD sessions with the end-users to design essential core features of the system.  Prepared logical Process Models by analyzing the process flows of the various system components.  Decomposed Business Requirements into Functional, Non-Functional and Reporting requirements.  Coordinated research, analysis, development, and implementation of workflow-processes and technology solutions.  Created traceability matrices between the various requirement types  As cross-functional project coordinator was involved in project planning, project management methodology implementation, and issue/risk tracking, scope and resource management through Agile Scrum Software Development Lifecycle.  Also involved in defining a PMO framework for identifying, prioritizing and achieving business objectives.  Managed the Change Control process for the entire project as a whole by facilitating group meetings and one-on-one interview sessions with different work stream owners to discuss the impact of Change Request on the project. Worked with the offshore Testing team to ensure complete test coverage through test cases and scripts, managed test execution during Integration, System, Regression and Performance testing and UAT. Participated in defect review meetings."}