{"text": "Name: gladys gladys E-Mail: gladys.gladys@gmail.com Address: Yuncheng, China Github: https://github.com/gladys LinkedIn: https://linkedin.com/gladys Phone No. 644789045322 Over 8 years of experience in Software Development Life Cycle (SDLC) and Agile methodology including Analysis, Design, Development, Testing, Implementation, Migration, Enhancement and Support of BI applications which includes experience in Data Warehousing (ETL & OLTP/OLAP) environment as a Data Warehouse Consultant 5+ Years of experience in MS SQL SERVER 2014/2012, 2008R2/2008/2005 Database Administration in Production, Test and Development environment.  Experience in Installing, Upgrading and Migrating databases in and from SQL Server 2014/2012/2008R2\\2008\\2005. Experience in Design and develop database objects, tables, stored procedures, views, triggers and SSIS packages Experience on Installing, configuring and supporting solutions on Microsoft Business Intelligence tools Hands on Exp  on  database query optimizations and large datasets Experience in designing and developing mappings and applying various transformations such as lookup, source qualifier, update strategy, router, sequence generator, aggregator, rank, stored procedure, filter, joiner and sorter. Good working knowledge of T-SQL with using DDL/DML, Subqueries, Inner queries, Nested joins, Clustered/Non clustered Index, Common table expression (CTE) etc.  Proficiency in Complete ETL Lifecycle from end to end and Data validation.  End to end experience in designing and deploying data visualizations using Tableau. Build and manage the experience design process, workflow, and integration with agile with SDLC  Generation of Dashboards with Quick filters, Parameters and sets to handle views more efficiently in Tableau. Knowledge of System Development Life Cycle (SDLC) and Software Testing Life Cycle (STLC). Extensive Tableau Experience in Enterprise Environment and Tableau Administrator Experience including technical support, troubleshooting, report design and monitoring of system usage.  Experience in Analysis, Design, Development, Testing and Maintenance, Capacity Planning, Performance support of application systems of OLTP and OLAP databases in the client-server, internet\\internet environments. Expertise in installing Slipstreams, rolling patches, rolling upgrades in Clustered Environment. Good knowledge on new features Data Compression, Transparent Data Encryption (TDE), Resource Governor, Policy Based Management, Backup Compression and Change data capture in SQL SERVER 2008.  Hands on experience Design, develop, and implement interactive visualizations by processing and analyzing large datasets  Designed AutoSys based solutions for communication of issues to technical teams. Participated in complete process of functionality testing of all versions of AutoSys applications. Communicated with team members for regular updating of software product development packages for Solaris and Linux systems. Designed/Implement solutions from Requirements Documentation using best practices, latest methodologies and technologies.  Turn data into clear visualizations and provided end-users an ability to view related data in new and innovative ways  Technical skills Footlocker, Camphill, PA     \t\t\t\t                                                                                   Jan 2016- Present Sql Database Developer Responsibilities: Installation, Configuration, Upgrade, patching of Oracle RDBMS and applications Work on IBM z/OS with OEM Grid control to maintain the database effectively.\\ Setup and configured Oracle Physical Standby database (Data Guard) for disaster recovery as well as to offload the running of huge reports. Tuning T-SQL queries to improve performance Assisted in configuration, development and testing of AutoSys JIL and other scripts. Responsible for developing various data connections to Oracle, Hadoop, Hawq and Pivot. Also have experience in connecting with denies.  Responsible for creating views based on user and/or reporting requirements, wrote Teradata  Performed Cloning/Refresh to setup Test and Development database Installing, configuring, deploying, administering, maintaining, tuning, and upgrading databases on an Amazon Web Services platform. Databases currently reside in Redshift and Oracle  Installing, configuring, deploying, and maintaining Informatica PowerCenter and PowerExchange with CDC.  Installed and configured SQL Server 2014/2012 Enterprise and standard edition in the production/ Development and test environment and applied latest service packs and security fix servers. Configured SQL Server Mirroring for High Availability across all production servers in SQL Server 2008 R2.  Involved in migration of databases from SQL Server 2008 R2 to SQL Server 2012.  Configured mirroring on SQL Server 2012 Data Bases. Involved in migration of databases from SQL Server 2008 R2 to 2012 and SQL Server 2012 to 2014  Implemented High Availability in SQL 2012 by configuring Always On Availability groups across Windows Server Failover Clustering using Failover Clustering Instances  Worked on pre-live BCP exercise to make sure mirroring will work after live migration. Implemented Log Shipping for warm backup solution for MS SQL Server databases. Understanding and converting business requirements into functional requirements doc, review and sign off with the customer.  Perform Impact analysis and provide optimal solutions to the Client, Business users.  Developed and Optimized Stored Procedures, Views and User-Defined Functions for the Application.  Extensively worked on Profiler, Perfmon Counters, DMVs, DMFs and DTA to tune the databases, servers and query tuning.  Used DMV's to diagnose problems and monitor health of server instance.  Rebuilding indexes with different fill factors and update statistics manually.  Detected and Resolved Locks and Deadlocks using the Trace Flags Tand Native tools like Profile and the Activity Monitor.  Installing/administrating SQL Server Reporting Services (SSRS), creating schedule reports and delivering via email. Scheduled weekly jobs and Maintenance tasks for better performance, created the alerts with Database Mail SMTP.  Used Quest Foglight and Quest Spotlight tools to monitor SQL Server Performance and to generate Performance reports.  Configured Transitional Replication (Creating Distribution Databases, updating Publishers, creating & managing Publications, managing Replication monitors) and troubleshoot replication issues. Used SQL server Profile to identify and analyze deadlocks.  Recovering the databases from backup in disasters. Implementing Point-In-Time Recovery solutions.  Perform Impact analysis and provide optimal solutions to the Client, Business users.  Design/Build Extract Transform Load procedures in SQL Server Integration Services  Created reports using SSRS from OLTP and OLAP data sources and deployed on report server. Migrated database from SQL Server 2008 R2 to SQL Server 2012.  Worked extensively in performance tuning of databases including query tuning, server tuning.  Created and scheduled maintenance plans for Database backups, log backups and cleanup.  T .Mobile Seattle WA\t\t\t\t\t\t\t                                                   Aug 2014-Dec 2015 SQL Server DBA/ Application DBA Responsibilities: Created new procedures, functions, triggers, packages, and SQL*Loader scripts, and modified existing codes, tables, views, and SQL*Loader scripts Incorporated business rules and constraints and created new tables for all modules. Worked on claims processing reports on investigation and payment. Generated claims report weekly, monthly and yearly. Strong Experience in implementing Data warehouse solutions in Amazon Redshift, Oracle and SQL Server. Worked on reports to give parallel comparison of different-2 fiscal year of claims. Fine-tuned long running claims reports. Developed expense reports to provide claims from accessing different-2 tables. Wrote heavy stored procedures using dynamic SQL to populate data into temp tables from fact and dimensional tables for reporting purpose. Tuned SQL queries to improve response time. Wrote UNIX shell scripts to run SQL scripts daily. Fine-tuned SQL queries using hints for maximum efficiency and performance. Developed Claims reports that would produce Excel outputs for users. Developed a customer data warehouse to understand customer behavior to various Claims related programs and identify critical customers in support of improved decision-making across the organization Extensively worked in performance tuning of programs and processes. Worked closely with Administrator for proper backup and recovery plans. Monitored performance and changed performance requirements through application of Database tuning and performance optimization techniques. Worked under tight schedules for successful development and implementation. Client: Virtusa Consulting, Hyderabad, INDIA\t\t\t\t                                                Sep 2010-  May 2014 Oracle PL/SQL Developer                       Responsibilities: Installing and configuring Windows and SQL clusters including 3 node clusters, 4 node clusters, and adding a node to an existing cluster.  Involved in the migration of databases from SQL server 2005 to SQL server 2008 R2. Implemented and configured Central Management Servers to centralize and manage about 30 instances of SQL Server 2008 R2 and SQL 2005. Implemented Data Collector and Data Management Warehouse to collect performance data of all the SQL instances. Enabled Transparent Data Encryption on critical databases. Configured Transactional Replication and Log Shipping with SQL Server Management Studio as well as basic account management and troubleshooting with connectivity, security and firewall issues. Configured SSRS using configuration manager, created and maintained security roles and created new reports. Deployed SSAS cubes to the server and created security roles. Created and scheduled maintenance plans (database and log backups and cleanups). Used server scoped DMV’s and database scoped DMV’s to trouble shoot issues. Identified and analyzed deadlocks in databases using SQL Server Profiler. Responsible for creating the Entity-Relationship diagrams, Class diagrams, Sequence diagrams and Flow diagrams using Visio 2002 and documenting the project architecture. Trouble shooting and fine-tuning of databases for its performance and concurrency. Backing up the databases and restoring them in different environments. Recovering the databases from backup in disasters. Implementing Point-In-Time Recovery solutions. Created stored procedures, views, triggers, user defined functions to apply business rules to the data. Worked on replication and Change Data Capture. Responsible for creating the reports based on the requirements using SSRS. Responsible for maintaining versions of source code using Team Foundation Server. Involved and communicated test results for application level testing, and Integration Testing. Involved in writing System Documentation and Code Documentation.  Environment: Oracle 9i, PL/SQL, Forms/Reports 9i, HTML, PowerBuilder, SQL*Plus, Oracle Designer and Toad, UNIX (HP-UX 11.11) Education Qualifications:\nBachelors from Kakatiya University in 2009 with 3.5 GPA\nMasters from Virginia International university 2015 with 3.9 GPA \n"}