{"text": "Name: louise louise E-Mail: louise.louise@gmail.com Address: Xianyang, China Github: https://github.com/louise LinkedIn: https://linkedin.com/louise Phone No. 701117020446 Summary  Over 7 + years of extensive experience in the field of Sr Business Analyst working with the technical staff to implement management and staff's business requirements into the software application in Healthcare Pharmacy domain. Extensive working experience with TriZetto’s Facets Expertise in documenting the Business Requirements Document (BRD), Technical Requirement Document (TRD), generating the UAT Plan, maintaining the Traceability Matrix and assisting in Post Implementation activities.  Good experience in the EDI transactions and knowledge on EDI transaction process flows. Strong experience and understanding of health care industry, claims management process, Knowledge of Medicaid and Medicare Services. Knowledge and Implementation experience in Eligibility System, Facets Data model, Configuration Implementation of FACETS module. Involved in using FACETS for various health insurance areas such as products, enrollment, members and other modules related to FACETS. Expertise in understanding and supporting the client with Project Planning, Project Definition, Requirements Definition, Analysis, Design, Testing, System documentation and user training. Used Rational Clear Case for Version Control of requirement documents. Experience with TriZettos Facets Application Groups/ Claims Processing, Guided Benefit Configuration, Medical Plan, Provider, Subscriber/Member, Utilization Management. Good knowledge of Workflows and Content Management Tools. For Executing Scripts manually, Involved in preparing data in FACETS. Expert in creating Use Cases, Use Case Diagrams, Class Diagrams, Sequence Flows using MS Visio and UML concepts.  Experienced in EDI and HIPAA Testing Privacy with multiple transactions exposure such as Inbound 834Membership Enrollment, 837Institutional, 837Professional, 837 Dental, 835 Claim Payment/Remittance Advise, 270/271 Eligibility Benefit Inquiry/Response, 276/277 Claim Status Inquiry/Response Transactions and testing in Client Server systems and Mainframe Applications. Worked with different Business Areas like Claims and Enrollment to document proposed ICD 9 – 10 Code changes.   Knowledge and expertise in working with Claims, Provider, Enrollment, Finance, Benefits, and Vendor Management Business Areas.  Maintained the Traceability Matrix table to track the Business Requirements to the design to the testing keeping track of all requirements in the BRD/Experience in conducting User Acceptance Testing (UAT) and documentation of Test Cases TECHNICAL SKILLS Project Methodologies:\tSDLC, RUP, UML, Agile, Waterfall,  Business Modeling Tools:\tMicrosoft Visio, Rational Rose Healthcare Tools                                                            EDI X12, HIPAA, 4010, 5010, Trizetto, FACETS, ICD 10,To ICD9 Testing tools:\tMercury Quality Center,  Change Management Tools:\tRational Clear Quest,RUP, SME,UAT. Office Tools:\tMS Project, MS Office, MS Visio Database:\tMS SQL Server, SSRS,SSIS,MS Access, and Oracle, Data Mapping PROFESSIONAL EXPERIENCE Affinity Health Plan, Bronx, NY  \tSr Business Analyst\t\t Jul-2013-Till Now  Project Description: I worked for the Affinity Health Plan as a Business Analyst. I have participated in full software development life cycle implementations (SDLC) from project initiation to final deployment. I have worked with various Business Areas like Enrollment, Claims, Finance, Providers, and Benefits Admin. The project involved gathering Business Requirements for the Claims Business Area and updating EDI Transactions like EDI 837, 835, 276 and 277 with the HIPAA 5010 Changes. Affinity Health Plan implemented Facets Enterprise administrative system, a new core system built by TriZetto, with updated technology to allow for more efficient claims processing, membership enrollment and provider data maintenance & getting access to customer records. X12 EDI and HIPAA standards were followed thorough the project. Responsibilities: Gathered Business Requirements from the Subject Matter Experts (SMEs) and documented the requirements in the BRD.  Expert in ICD 9 – 10Conversion Analysis.  Documented complex Business requirements and made process flow diagram for the 837, 270/271, 276/277 & 835Remittance transactions as per the 4010 to 5010 implementation for the Medicaid claim processing system enhancement. Full knowledge of the Diagnosis and Procedural Code changes for Healthcare Entities like Payers, Employer Groups, and Providers. Worked on ICD 9 codes and gathered future requirements based on ICD 10 codes. Managed creation of sample mappings for the conversion of EDI X12 transactions code sets version 4010 to 5010 and translation of ICD 9 codes into ICD 10 codes. Used TriZetto HIPAA Gateway to comply with HIPAA standards (270/271, 276/277 & 837) for EDI transactions Analyzed the impacts of HIPPA 5010 project on inbound 837 claims Gathered requirements from the users and analyzed the requirements for RQ System, Facets etc. Extensively worked with FACETS Implementation, FACETS Billing, Claim Processing and Subscriber/Member module.  Gathered and documented functional requirements for testing and verification of HIPAA. Web Portal Development – Worked as a Business Analyst gathering requirements to develop a referral portal.  Worked on As-Is To-Be analysis of ICD9 to ICD 10 conversion for the new qualifiers used in the 837 claims for the diagnosis and procedure/HCPCS codes. Performed manual testing by building 837 claims, converting them into EDI file, uploading them into mainframe region and doing error resolution & testing for 5010 requirements& NPI crosswalk. EDI file testing for checking the HIPAA 5010 (X12) compliance of the inbound 837 claims. Assisted in creation of the Functional Design Document from the Business Requirements Document which was used as the reference by the development team while preparing the design and held the responsibility of the required data setup for unit testing. Maintained the Traceability Matrix Table to uniquely trace the identified business requirements to general design to testing as proof that requirements requested have been developed into a solution and that it has been tested and tracked. Experience with Trizetto Facets System implementation, Claims and Benefits configuration set-up testing, Inbound/Outbound Interfaces and Extensions, Load and extraction programs involving HIPPA 837 and proprietary format files and Reports development. Involved in daily scrum meeting to discuss any roadblocks or impediments in the project path. Identified various points of integration among the new and existing applications and required integration with other IT components. Environment: MS Visio, Word, Excel, UML, Facets, PowerPoint, Rational Requisite. MVP HealthCare, Schenectady NY\tBusiness Analyst\t\t\tAug-2011-Jun-2013\t Description: MVP HealthCare is a leading insurance organization that caters to the health insurance needs of the residents in NY. Facets have been widely used across the network for the claim adjudication, claim processing and Provider Management. The National Provider Identifier Project’s objective is to comply with the mandate that effective with the federal compliance date, all Providers who conduct electronic business via HIPAA Transactions  Responsibilities: Coordinated the upgrade of Transaction Sets 837P, 835 and 834 to HIPAA compliance.  Responsibilities include the – Analysis of inbound and outbound interfaces and extensions to FACETS claims processing system Completed Data Mapping for Group and detail Product analysis and report writing Analysis and Design of the Facets data model to ensure optimal system performance and tuning Configured facets modules such as Claims, Membership, Billing, Benefit and plan Work closely with EDI to ensure accuracy in data transmissions and shared processes.  Worked on Mapping documentation using the Implementation Guide for EDI HIPAA 834,835,837(D,P,I), 277/278 and other Health Care Transactions. Utilized SDLC Methodology to configure and develop process, standards and procedures. Experience with Trizetto Facets System especially with the Managed Care Credit policies. Conducted JAD sessions with business users and Subject matter expert and stakeholders to define project scope, to identify the business workflows & task analysis and determine whether any current or proposed systems are impacted by the new development efforts. Coordinated with various IT teams related to various Facets backend database for Test Data Setup.  Designed Test Plans, Scripts after analyzing various scenarios/requirements & performed defect tracking using Test Director & Clear Quest. Provided Production support and documented System Release/deployment issues. Coordinated the upgrade of Transaction Sets 837P, 835 and 834 to HIPAA compliance. Responsibilities include the - Analysis of inbound and outbound interfaces and extensions to FACETS claims processing system Completed Data Mapping for Group and detail Product analysis and report writing Analysis and Design of the Facets data model to ensure optimal system performance and tuning Configured facets modules such as Claims, Membership, Billing, Benefit and plan Work closely with EDI to ensure accuracy in data transmissions and shared processes.  Involved in claim adjudication process of facets application Environment: Facets ,EDI,SQL, Mercury Quality Center, Go To Meeting, MS Office Suit Medco Health, Parsippany, NJ\t                        Business Analyst                Jan-2010-Jul-2011 Description:  Medco is a leading pharmacy benefits manager (PBM) with the nation’s largest mail order pharmacy operations. Through clinical management, Medco engages members, their physicians and pharmacists, in making better, most cost effective use of prescription drugs thus providing members safety and their care more effective and affordable Account Information System, clearinghouse and Claim processing group to evaluate and settle the insurance claim payments Responsibilities: Reviewed and analyzed the business requirements document to derive the functional specifications document and assisted in the preparation of System Requirement Specifications. Involved in Planning, Defining and Designing data based on business requirements and provided documentation. Occupied in Logical, Physical design and Development of the DSR (Data Staging Repository) for the Database and AMS (Asset Management Reporting System) using Erwin. Gathering all system requirements for Business Intelligence, Data Warehouse Interacting with Developers and SME (Subject Matter Experts) about HLD & LLD. Interacted with the business partners and database administrators to identify the business requirements and data realties.  Analyzing the code, data and preparing the spec’s for Developers Analyzing the system performance. Configured SQL mail agent for sending automatic emails when a SSIS package is failed or succeed. Created Drill-through, Drill-down, Cross Tab Reports and Sub-Report using RDL. Generated periodic reports based on the statistical analysis of the data using SQL Server Reporting Services (SSRS) & developed ad-hoc reports using SAS/SQL queries and MS Access and Excel. Full knowledge of the Diagnosis and Procedural Code changes for Healthcare Entities like Payers, Employer Groups, and Providers. Worked on ICD 9 codes and gathered future requirements based on ICD 10 codes. Managed creation of sample mappings for the conversion of EDI X12 transactions code sets version 4010 to 5010 and translation of ICD 9 codes into ICD 10 codes. Gathered requirements from the users and analyzed the requirements for RQ System, Facets etc. Gathered and documented functional requirements for testing and verification of HIPAA. Web Portal Development – Worked as a Business Analyst gathering requirements to develop a referral portal.  Worked on As-Is To-Be analysis of ICD9 to ICD 10 conversion for the new qualifiers used in the 837 claims for the diagnosis and procedure/HCPCS codes. Designed, developed and tested data mart prototype (SQL ), ETL process (SSIS) and OLAP cube (SSAS)  EDI file testing for checking the HIPAA 5010 (X12) compliance of the inbound 837 claims. Documented the UAT Plan for the project and worked with the UAT Team to ensure every acceptance criteria for the requirements has been included in the UAT task plan.  Environment: Facets MS Visio, Word, Excel, UML, Oracle SQL Server, PowerPoint, Rational Requisite. Catamaran, Rockville, MD     Business Analyst             Apr-2008-Dec-2009   Catamaran (formerly SXC/CatalystRx) is redefining pharmacy benefit management (PBM) by providing a broad range of pharmacy spend management solutions and information technology capabilities by providing software applications, application service provider (ASP) processing services, and professional services. Involved in multiple projects that was based on creating an applications by automating and processing the claims.\nResponsibilities: Involved in complete cycle of SDLC and lead the team when needed. Worked with PMO to establish scope, research new technologies, create and update processes. Facilitated JAR/JAD sessions to understand and gather requirements. Worked on new implementations and migration projects. Assisted in release plan and iteration plan for the project while working with the stakeholders. Worked on adjudication and on eligibility- Enrollment, Billing, Group/Member Insurances Analyzed adjudicated claims to ensure accuracy As a part of operational production support team, received work request tickets for resolving on daily basis. Used Teradata SQL Assistant to run SQL queries and validate the report's data Provided weekly project status report to project manager and project presentation to the high level management on monthly basis. Facilitated Joint Application Development (JAD) Sessions for communicating and managing expectations. Involved in analysis of requirements for Medicaid and Commercial line of businesses. Designed SSIS Packages to extract, transfer, load (ETL) existing data into SQL Server from different environments for the SSAS cubes. Assisted to create UI prototypes, Wireframes and Mockups. Represent Benefit Design on cross-departmental projects. Participate in workgroups, attend planning meetings and determine benefit plan set up requirements in Rx Claim, as appropriate. Wrote test cases and test scripts for the User Acceptance Testing (UAT Good knowledge in BI (Business Intelligence) tools like SSIS, SSAS and SSRS to perform ETL. Analyzed and Prioritized permission levels based on roles of user and created blueprint of system architecture for the web-based application created for internal users/Prepared graphical depictions of use case diagrams and process flow diagrams. Tracked daily issues and dependencies and coordinated with common team to work on the impediment list. Worked with change control board to initiate/manage change requests Played major role to create the Business Requirement Documentation (BRDs), using MS Word and MS Visio that provided appropriate scope of work for technical team to develop prototype and overall system. Environment:   Agile, SharePoint, MS Visio, MS project, XML, UML, Oracle, MS SQL Server MS SQL Server, MS Office"}