{"text": "Name: kathryn kathryn E-Mail: kathryn.kathryn@gmail.com Address: Xiaoganzhan, China Github: https://github.com/kathryn LinkedIn: https://linkedin.com/kathryn Phone No. 942690499681 PROFESSIONAL SUMMARY: \t IT Business Analyst with over 6 years of diverse experience in Business Modeling, Document Processing, EDI, Mapping, HIPAA regulatory changes and Application Integration,andANSI 4010/5010 in IT Healthcare domain. I am experienced in gathering Business & Functional Requirements, conducting JAD Sessions, identifying &executing Gap Analysis, producing UML Diagrams & defining Process Flows, Business Documentation for Claims Processing & Claims Adjudication for Medicare and Medicaid and Health Care Reforms. I also worked with different Development &Testing Teams as necessary to produce required deliverables that meet contract quality standards. I am a self-starter with motivation and capable to work independently. Specialized in Healthcare, Risk and Compliance Document Management.  Experienced in GAP analysis of HIPAA 4010 to 5010 with particular attention to qualifier, length and required field and situational rules.  Knowledge of the SDLC models such as Waterfall, Agile. Verified and documented HIPAA regulator changes found when moving from 4010 to 5010 X12. Transaction Mapping Full 4010 – 5010 conversion knowledge for 820, 834, 835, 837 PDI, 270 & 271 transactions.  Systematized Claims Processing and Claims Scrubbing in HMO, PPO, Medicaid and Medicare and gathered requirements in Enterprise Healthcare Management (ECHS). Produce design deliverables including workflow diagrams, sketches at various levels of fidelity, and wireframes to demonstrate and test the UI and user interactions. Document the results of design related meetings and design deliverables, involvement in user research activities. Conducted JAD sessions, Gap analysis, and prioritized requirements using interviews, document analysis, and requirements workshops. Experienced in documenting requirement using Unified Modeling Language (Use Case and Activity Diagrams) and building business Process Flow Charts. Experience with Facets backend data model tables and frontend application module like Subscriber/Member, Claims processing and providers. Experience in Data Quality and Data integrity. Gathered Business Requirements, interacted with the stakeholders, developers, Project Manager and SME's and facilitated JAD sessions to formulate Business Processes. Expert in organizing and managing all phases of the application testing process using Mercury Quality Center. Strong understanding of test plans, test cases, test scripts and defects tracking/reporting. Extensive knowledge of SQL queries and back end system integration testing. Conducted User Acceptance Testing (UAT) and verification of performance, reliability and fault tolerance issues for web based and client/server applications. Hands on experience working on health information in accordance to Federal Guidelines. Worked on inbound/outbound HIPAA EDI transaction in support of HIPAA 834, 835, 837 270/271 transactions. Revitalized requirement elicitation techniques - conducting user interviews and JAD sessions and managed the requirements using Use Case Modeling with all phases of SDLC.  Produced and utilized Use Cases, Functional Specifications, User Interface Specifications and Requirements Traceability Matrix to define the changes in client’s systems. Experienced in working on FFM/FFE and understanding of rules through Health Insurance Exchange (HIX), Conducted Impact Analysis, Risk Analysis and Risk Mitigation. Expertise in Claims, Subscriber/Member, Plan/Product, Claims, Enrollment, Provider, Commissions and Billing Modules of Facets. Designed Graphical User Interface using Adobe Photoshop, SQL Queries using MS Access and Oracle. On hand experience in implementing changes in HIPAA 4010 to 5010 conversions on SOA (Service Oriented Architecture). Synthesized 4010 and 5010 HIPAA implementation guides relate to Claim Testing and Medical Billing.  TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE:\t Health Now Inc. Buffalo, NY\t Business System Analyst\t\t\t\t\t\t\tJanuary 2014 – December 2015 Health Now New York Inc. is the leading healthcare company in Western New York. Since 1936, it has been a pioneer in providing quality healthcare services to companies and individuals in the region. Health Now New York provides the full spectrum of healthcare services and innovative funding arrangements. The assignment @ this company is all about installing new version of Facets, integrating with company’s landscape and making sure that claims get processed as per the business needs. Responsibilities:  Involved in HIPAA/EDI Medical Claims Analysis, Design, Implementation and Documentation. Involved in HIPPA Complaint X12N837 Transaction testing. Identified the scenarios based on business requirement and HIPAA compliance for each transaction such as 837(Claim) and 276/277 (Claim Status). Gathered business requirements through JAD sessions and one-on-one interviews with the Business Stakeholders  Created class diagrams, use case diagrams and sequence diagrams to view the system from different perspectives.  Gathered requirements for enrollment, eligibility and claims side in the NY HIX system. Checked if the Subscriber has active eligibility under NYCDFHP Plan.  Worked on EDI transactions: 270, 271, 834, 820, 835, and 837 (P.I.D) to identify key data set elements for designated record set. Interacted with Claims, Payments and Enrollment hence analyzing and documenting related business processes. Electronically submitted Enrollment (834) data. Understood the business process that included Sales processes, Rating methodology, different Products, Group Renewals. Eligibility and Enrollment process.  Responsible for interacting with client for requirements gathering, analyzing requirements, and creating detailed specifications. Used SDLC (System Development Life Cycle) methodologies using Agile and RUP. Conducted User Acceptance Testing (UAT) to verify whether the entire user requirements are met. Experienced in Facets and acted as SME point of contacts with other vendors Analyzed user and data issues related to Medicaid eligibility determination system. Involved in testing the Member Enrollment, Eligibility Enquiry, Eligibility Response, Claim Status Enquiry, Claim Status Response and conversion of Financial Claims. \n Very well known to the Subscriber/Member, Claim processing and Provider module in the front-end facets and data model back-end table. Responsible for creating the test plan and designing test cases for the EDI 834 members’ enrollment file loading process into FACETS through HIPAA Gateway. Mocked –up the EDI 834 states file for the system testing purpose and very well known to the loading process of the MMS file into Facets database Actively participated in designing test plans, test cases and test scripts.  Extensively worked on Managed Care Provider Enrollment. Responsible for creating business work flows and processes and creating management reports based on the analysis. Help conducting release backlog, Attended scrum meetings, conducted sprints and UAT in Agile methodology. Developed and executed SQL queries on claim records to validate reporting data.  Medical Claims experience in Process Documentation, Analysis and Implementation in 835/837/834/270/271/277(X12 Standards) processes of Medical Claims Industry from the Provider/Payer side. Responsible for reporting status ensuring accurate coverage of requirements and business rules. Environment: Windows 2000, MS Word, MS Excel, MS Project, UAT, Agile,MS Visio, HTML, XML,Java, Oracle. Coventry Healthcare Inc, Newark, DE                               Business Analyst\t\t\t\t\t\t\t\t\tOctober 2011 – December2013 Coventry Health Care, Inc. Operates as a managed healthcare company in the United States. The company’s Health Plan and Medical Services segment provides health plan commercial risk, Medicare advantage, and Medicaid products. It also offers commercial risk products, including health maintenance organization, preferred provider organization, and point of service products to individuals and employer groups. I was working with FACETS implementation projects. Responsibilities: Responsible for gathering, analyzing and digesting the requirements and the critical areas of the application to setup and execute baseline tests Participate in Agile SDLC using the Scrum process Analyzing the Facets Requirements and thus conducting gap analysis. Determined user requirements and goals by conducting meetings with client Drafted test strategies, test cases and test plan based on functional specifications Developed test cases for manual testing Establish test data for testing the application Analyzed and worked with HIPAA specific EDI transactions for Claims, member enrollment, billing transactions. Worked specifically with 837, 835, 834, 270/271 Designed, scheduled and executed test plans within the predefined timeframe Manual Testing for checking the flow of the application functionality Conduct the testing (system and regression) of all applications to ensure application integrity both AS/400 based systems and web-based applications. Entails: Managing/executing the testing effort, logging detailed accounts of errors/defects in the systems, and coordinating with the Application Development and Operations teams to diagnose and troubleshoot any errors/defects. Functional Specification Document Conducting business validations, covering the following deliverables: FACETS Providers, Facets Claims and Facets Membership and Operational reports. Performed Test Execution & wrote & Executed Test Scenarios/Test Scripts. Writing PL/SQL Procedures & Batch Processes Writing Test Plans/Test Scenarios/Test Cases/Test Matrix Executing System Test, Regression Test, User Acceptance Testing (UAT) Written and executed SQL Statements to retrieve data from backend.  Database testing by executing SQL statements. Created SQL queries in SQL Query Analyzer for data validation in SQL Server Database. Used Test Director for setting up and maintaining projects on Test Director. Execute test cases using WinRunner scripts through Test Director Performed manual back-end testing using SQL Plus to connect to an Oracle 9i database on a UNIX server. Generated of all reports for the test cases through Test Director’s document generator. Assign and track all defects of test cases through Test Director. Analyze, track, and report test results Developed design specification writing Test Reports & documenting test results. Oracle forms, Oracle database (Release name: Claims Validation Process). Environment: SQL Server, Agile, Windows, HL7, Crystal Reports, Oracle, Mantis Defect Tracking, UML, MS Office, MS Visio Emdeon Business Solutions, Nashville, TN\t\t\t\t\t\t\t Business Analyst\t\t\t\t\t\t\t\tFebruary 2009 – September 2011 The main objective of the project is to establish a claim editing path for 5010. This includes Converting 4010 Inbound claims from submitters to 5010 format for payers who are read to receive 5010. Converting 5010 Inbound claims from submitters to 4010 format for payers who are not ready to receive 5010. I was involved in migrating Payer specific claim editing from 4010 to 5010 format and migrating submitter specific claim editing from 4010-5010 format. Creating Automated test environment for submitter and payer for 5010 certification Responsibilities: Created monthly/weekly status reports to update the project schedules & deliverable plan. Provided training to QA resources, new EDI analyst, and other teams involved in EDI analysis. Identified risks and dependencies on various tasks to prioritize them properly. Gather Business Requirements from the Business users, Subject Matter Experts (SMEs) and document the requirements in the BRD.  Utilized data flow diagrams, use case diagrams and process flow diagrams to represent information provided by the Business Owners. HIPAA 4010 – 5010 Conversion Analysis – Involved in the documentation of HIPAA 5010 changes to EDI 837, 834, 835, and 820 Transactions. Conducted JAD sessions to help decide best solution for clients & maintained the Meeting Agendas and Minutes. Did gap analysis for HIPAA 4010 820 and 834transactions and HIPAA 5010 830 and 834 transactions. Creating Mapping documents for translating 837(I/P) to internal XML format and vice versa. Validated scenarios for Premium Payments, Payment Discrepancies, Enrollment Eligibility & Enrollment Updates. Completed Data Mapping for Group and Product analysis and report writing. Did data analysis, created data mapping and data interface documents and kept the documents updated with changes in requirements and functional specifications. Involved in UAT for Membership/Enrollments and Eligibility transactions. Prepared Test Data for the UAT as per the specifications of the FRD. Written multiple Use Cases for multiple transactions including 837I, 837P, 834, and 820 (both inbound and outbound) transactions as X12 standards. Maintained Requirement Traceability Matrix (RTM). Identified and fixed edit and mapping issues in the cross paths (4010-5010/5010-4010). Analyzed payer/submitter specific 4010 claim editing to migrate it to 5010 claim editing system Identify and document transition issues from 4010 to 5010 format.  Analyzed EDI ANSI X12 file mapping and reported in analysis spreadsheet. Performed validation of 837 (P, I, D) & 834 format files according to the EDIFECS engine. Management of Patient Profile Transfer (PPT) reports created by data team by verifying the associated data Helped testers to create Test scenarios and test cases for testing the migration of EDI 4010 to 5010 and the processing of member enrollment and benefits, batch jobs corresponding to the claims (837) and real time transactions like 820 and 834. Environment: SQL, Agile, Quality Center, Windows 2000, UAT, RTM, MSOffice Suite \t"}