{"text": "Name: jean jean E-Mail: jean.jean@gmail.com Address: Istanbul, Turkey Github: https://github.com/jean LinkedIn: https://linkedin.com/jean Phone No. 66716981103 Professional Summary: Highly motivated IT professional with 7+ years of experience as a Business Analyst, Data Analyst and Quality Analyst in the Finance and Insurance domains. Comprehensive knowledge of Software Development Life Cycle (SDLC) with thorough understanding of its various methodologies like Agile, RUP, Waterfall etc. Worked closely with project stakeholders, Subject Matter Experts (SMEs) and staff to understand business requirements and analyze specifications for new applications, and to modify existing applications. Excellent knowledge of various policy administration & industry standard tools such as Guidewire Policy Center, Guidewire Claim Center, Duck Creek and ACORD standards with insurance laws, regulations and company policies. Extensive experience in Requirements Gathering, Surveys/Questionnaire Development, Business Requirement Documents (BRD), Functional Requirement Specifications/Documents (FRS/FRD). Skilled at facilitating Joint Requirement Planning (JRP) sessions with Business User Groups, conducting Joint Application Development (JAD) sessions with IT Groups, and Conflict Management with Project team members. Approach with CRM to managing a company's interaction with current and future customers Involved using CRM technology to organize, automate, and synchronize sales.  Good understanding in Defect Life Cycle for tracking the defects with Severity & Priority. Used SOAP UI to validate the response from various WSDL file. Excellent knowledge in extraction, cleansing and modification of data from/to various data sources like flat files and databases processing in a corporate-wide-ETL solution using ETL Tools like Informatica ,Ab Initio & SSIS. Proficient in querying various RDMS Systems like Oracle, DB2, Teradata and SQL server.  Extensively used UNIX to run the Ab Initio graph from command line and Control-M error debugging.  Validated reports from various BI tools like SSRS, Cognos, Micro strategy for tabular, Pie Charts, Bar Graph, gage, map metrics etc. for alignment, header, and footer and other attributes. Tested Informatica mappings to validate the business conditions and extensively involved in analyzing the logs created by Informatica to validate the record counts and other validations. Loaded Flat file, fixed length, and delimited files through Informatica into Teradata tables using Unix Shell scripts  Experienced in performing data validation and preparation of test data in UNIX environment using various UNIX commands in VI editor. Extensively tested Scheduled jobs in Control M as per dependency matrix.   Technical Skills:   Professional Experience:  Progressive Corp. Mayfield Village, OH                                                Mar 2018 – Oct 2019 Sr. Business Analyst/Data Analyst/Quality Analyst The Progressive Corporation, through its subsidiaries, provides personal and commercial automobile insurance, and other specialty property-casualty insurance products and related services in the United States. Its property-casualty insurance products protect customers against losses due to collision and physical damage to their motor vehicles, uninsured and underinsured bodily injury, and liability to others for personal injury or property damage arising out of the use of those vehicles. Project includes caching of report in Enterprise Data Service, mapping schemas from External vendor into the building using different Web-Services, integrating Guidewire Claim Center to internal legacy application, business partners, and other multiple applications.  Responsibilities: Gathered, documented, and communicated business requirements into systems design documentation using Business-Modeling concepts. Conducted Interviews and Brainstorming Sessions with stakeholders (application users, subject matter experts etc.) to gather requirements and end user perspectives in order to identify deficiencies and areas for improvement & enhancement Created Ab Initio graphs that transfer data from various sources like Oracle, flat files and CSV files to the Teradata database and flat files. Identified As-is and To-be process maps while working on Collibra tool for data mapping and writing transformation rules for the data transfer between the source and the target systems successfully. Performed different validations in the source file using Excel, Notepad and UNIX commands as necessary.  Extract, synthesize and manipulate large data sets using Excel, Access, SQL, Visual Basic, and present them in Cognos.  Worked on Integration Mapping between Guidewire PolicyCenter/Guidewire ClaimCenter and Guidewire PolicyCenter/Guidewire BillingCenter Worked on fine tuning the existing Ab initio graphs in order to have optimum performance.  As process of testing report, Debugged the Cognos Dashboards /Reports with different analytics views (Pivot table, Chart, Tabular and View Selector), Alerts, Guided Navigation and Dynamic /Interactive Dashboards with drill down capabilities using global and local filters. Concentrated on implementing Guidewire batch integration in replacing the existing NextGen legacy functionalities like NY VIN Reconciliation screen Prepared data mapping document in excel based on requirement document for data migration from legacy Data Warehouse EDW to ICDW data warehouse. Validated each and every Business Logic incorporated in Target state Data Warehouse (Teradata) when the scheduled job is completed. Developed shell scripts to customize the ETL Ab Initio Graphs at runtime. Extensively tested all aspect of reports like UI, Functionality and Data validation which were generated using Cognos as reporting portal. Wrote complex SQL to validate the Data with legacy Reports in Oracle and Teradata environment. Created custom reports in Payables in Cognos according to user requirement Maintained the entire test cases in HP ALM and logged all the defects into the defects module. Prepared User Interface document (UID), Wireframes, and Prototypes to help design user interfaces. CRM systems helped to track and measure marketing campaigns over multiple networks, tracking customer analysis by customer clicks and sales Interacted extensively with customers.  And user interface (UI) designers to determine ways to improve the UI feel and user experience. Created Mock-up forms in Just in mind for better visualization and understanding of the Graphic User Interface (GUI). Modified User Stories in Guidewire PolicyCenter upgrade 8.0 Responsible for documenting Meeting Minutes of the Weekly meetings and distributing to PM and other team members. Created Burn-down Charts to monitor the completion of work within the time-boxes. Extensively used task board, Poker Planning for better teamwork and results. Gained expertise on Change Management by Performing Impact Analysis maintained Change Log for Change Requests. Escalated the results of the analysis to the Change Control Board (CCB). Walkthrough Session with development team and QA team to understand the business requirements clearly. Worked with QA team to help create Test Plans and Test Cases. Used Silk Central as defect tracking tool to validate test case’s results. Tracked open issues and documented progress reports on weekly basis. Conducted Smoke test after each build. Created the source SRS articulating the known issues and potential risks for feeding data into PDS repository that will be storing daily positions and reference data subscribed by LRM. Analyzed and documented gaps in Sophis’, the source trading system, trade and positions attributes based on the requirements defined in the Risk Management BRD. Create and review test plans and test case for UAT sessions in Collibra to see if the request was passing vendors correctly for Appraisal, title , flood Orders Generated runtime code using in Collibra and tested the Test Data against the code and provided the Java Transforms to developers for deploying in different Environments (DEV/SIT/UAT and PROD) Created step by step manual and user guide for quality assurance team keeping in mind user requirements and how it can be met. Performed Post Production Validation after the Application was released into production CUNA MUTUAL, Waverly, IA \t\t\t\t\t\t\tMay 2016 - Feb 2018​                                Business Analyst/ Data Analyst/ Quality Analyst\t\t CUNA Mutual Group is the leading provider of financial services and Insurance Products (Life, Property & Casualty) to credit unions and their members worldwide, offering lending, protection, financial, employee and member solutions through strategic partnerships, technological innovations and multiple service channels. I was actively involved in various projects playing the role of scoping the project, meeting business representatives to conduct and initial overview of the objective, costs and benefits and gathering, understanding and documenting the requirements spanning various systems which included Lifepro, other client/server based systems and also the Mainframe environment. Responsibilities: Conducted JAD Sessions with the SMEs and managers to understand the business processes and functional details. Identified gaps in the existing systems by performing GAP Analysis on the As-is business process maps. Created the To-be business process maps to communicate the solutions to the entire team as well as to gain the approval of the SMEs and the management team. Conducted meetings and brainstorming sessions with Company Ratings managers, sales advocates to gather user requirements and business process information. Documented the gathered business requirements into a detailed Business Requirements Document (BRD). Designed, developed, documented, tested and maintained various web-based project using PHP, MySQL, Javascript, XML, HTML and CSS. Define Input and Output Mapping requirements between Guidewire PolicyCenter and Duck Creek Rating Integration Reviewed the data model and reporting requirements for Cognos Reports with the Data warehouse/ETL and Reporting team. Identified high level requirements in Inception for Guidewire PolicyCenter Translated Business Requirements into functional and non-functional requirements using industry standard documentation processes like Data Flow Diagram (DFDs) and UML Diagrams (Use Case, Sequence and Activities Diagrams). Data visualization using Cognos. Supported in every day settlement operations of back office in a joint effort with day by day exchanges for center office operations. Gathered requirements for research data mappings for front office. Worked with architects to interpret business needs into service oriented, process driven business models using UML Used Cognos to perform regression analysis for managers to make prompt decisions with. Identified system requirement for integration with Guidewire System. Involved with the development team to ensure that business needs are fulfilled and deliverables are produced within specified budget, quality and time. Defined the context of the system by writing various use cases. Developed System Requirements Specifications (SRS) encompassing Functional and Non-Functional Requirements. Gathered data requirements of subject areas from stakeholders and developed strategies for data profiling and data validation. Prioritizing and managing the defects using the Defect Tracking system like JIRA,  Developed data maps to track transformation of data elements from source to destination across all phases of staging. Coordinated with Data modelers in giving requirements for ER diagrams including data type length and integrity constraints.  Developed the financing reporting requirements by analyzing the existing business objects reports Utilized Informatica toolset (Informatica Data Explorer, and Informatica Data Quality) to analyze legacy data for data profiling. Responsible in maintaining the Enterprise Metadata Library with any changes or updates Establish standards of procedures.  Worked heavily on SQL Server database to extract data and build Business reports. Generating a variety of reports based on the Universes, running free-hand SQL, and also personal data files. CNA INSURANCE, Chicago, IL \t\t\t\t\t\t\tMar 2014 - Apr 2016 Technical Business Analyst  CNA offers a complete line of standard casualty products from management and professional liability to commercial automobile protection.  I worked on the different modules like P&C (Property and Causality) Claims, and Quotes.  Worked on a Web-based application accessed by potential customers to file a claim through automated forms, request a quote, get extra liability protection, contact a shelter insurance agent and Report accidents via their website Responsibilities                           Worked with Business Users, Customers and Subject Matter Experts (SMEs) to understand the existing system and the current business process and methods to identify deficiencies and areas for improvement and enhancement. Accountable for creating, maintaining and ensuring User stories to have coverage on business values, story points and acceptance criteria.  Proficiently helped development teams to break down large user stories for execution. Advised product owners, scrum masters and teams to improve their ability to create good Product Backlogs to prioritize features and subsequently created Sprint Backlogs. Actively assisted in the acceptance and validation of the stories by testing the delivered stories.  Provided detailed User Interface Document to the development and testing team for clear understanding of the system. Conducted requirement walkthroughs with the development and test teams before the development and testing phases respectively, to ensure that the requirements are accurately understood. Created and maintained Requirements Traceability Matrix (RTM) to trace technical requirements to their business requirements and the test case to their functional requirements. Worked closely with the QA Team and played a key role bringing in best practices of test driven development in an agile environment. Actively participated in the Daily stand up and Weekly status meetings. Extensively used task board, poker planning for better teamwork and results. Conducted User Acceptance Testing (UAT) to ensure all the business requirements have been fulfilled by the application. Actively participated in Smoke Testing, Post Production Validation (PPV) and handled issues appropriately. Prepared detailed user manuals and conducted training sessions. Barclays Investment Bank, Bloomington, IL                                                                        July 2012 – Feb 2014 Technical Business Analyst ​Barclay Investment Bank provided a broad range of banking, asset management, wealth management and corporate and investment banking products and services. The aim of the Market Risk Systems (MRS) project was to perform valuation, simulation, aggregation and reporting of risk metrics and models on all simple (bonds) and complex (structured products, derivatives) security products. The MRS are comprised of intraday and overnight batch processes that handle staging for all trading position data and market data required for risk modeling as well as making this data available to the various risk valuation systems..   Responsibilities:  Participated in Joint Application Development (JAD) sessions by convening project sponsors, end-user representatives, development team members, subject-matter experts, technical personnel, and different stakeholders to communicate their perspectives with each other, resolve any issues and come to consensus. Worked with architectures to analyze the Project Definition Document (PDD) to make an initial estimation of the sizing of the project, as well as potential impacts on existing systems. Analyzed the business process as Business Process Automation Implemented RUP, designed visual models to draft business requirements by using Use Cases Gathered and documented the requirements that were critical to the business mission and used those requirements to design application software using a Use Case approach. Interacted with the Users by interviewing them, preparing questionnaires and getting feedback. Developed the required use case diagrams, business work-flow diagrams and activity diagrams so that all stake holders could better understand the business process. Developed the functional specifications document and assisted the project team in preparing Software Requirement Specifications (SRS), and the user interface design.  Created User Interface documents (UID) of prototypes and wireframes to help designing user interface.  Managed all the changes and change requests in the projects by using Rational Clearcase. Worked with SQL queries using MS Access for data manipulations Experience in walkthrough session with development team to ensure the business requirement are clear. Walkthrough session with QA team to ensure the test plan and a test case meets the business requirement. Conducted smoke test after each build. Create and review test plan and test case for UAT session. As well as conducting UAT session. Created step-by-step manual and user guide for quality assurance team keeping in mind user requirements and how it can be met. Performed Post Production Validation after the Application was released into production.  "}