{"text": "Name: elizabeth elizabeth E-Mail: elizabeth.elizabeth@gmail.com Address: Weinan, China Github: https://github.com/elizabeth LinkedIn: https://linkedin.com/elizabeth Phone No. 110237685353 OVERVIEW: Seeking a fast paced dynamic environment to align my professional skills on the IT and business fronts in the Insurance industry, and thereby apply my technical, business and interpersonal skills in the development of the company PROFESSIONAL SUMMARY: Over 6 years of experience as Business Analyst, with expertise in analysis, design, development and implementation of software applications. Expert knowledge and experience of SDLC processes like Waterfall, Agile (Scrum) for software enterprise initiatives. Experience in gathering business requirements, evaluating data sources, translating requirements into specifications, application design, technical and business writing and testing various methodologies. Knowledge of Rational Requisite Pro and DOORS for requirement management and created traceability metrices among requirements.  Gather requirements for rating process to design and address the Life insurance, Property and casualty commercial lines business. Acts as a liaison/coordinator between the business partner and other Systems Department areas. Core member of a planning team in preparing Business case document i.e. scoping of a project. Expertise in Project Planning, Project Design, creating functional specifications and data flow diagrams. Created Prototypes, High-Level and Detailed Business flow diagram using Tools like MS Visio. Extensive use of Rational Requisite Pro for reviewing and analyzing requirement.  Strong SQL skills, including the use of nested table expressions, unions, multi-table joins, scalar functions, outer joins and derived columns.  Conducted requirement analysis techniques such as Business Process Automation, Business Process improvement, and Business Process Re-engineering. Proficient in writing BRD, FRD and strong knowledge of writing Use Cases.  Coordinates the development training materials and instructs business users on strategies/processes/procedures related to line of business and agency applications  Coordinates the development, review, and update of procedures and training Facilitated JAD (Joint Application Design) sessions. Conducts research, analyzes and synthesizes information; anticipating business needs and its application to Systems processes and potential solutions  Possess excellent organizational, interpersonal, communication and documentation skills with good process management skills along with a remarkable ability to gather requirements to bring out quality product. Defining test cases, analyzing bugs, interaction with team members in fixing errors and User Acceptance Testing (UAT)  Strong leadership skills Experience working with offshore teams. Extensive experience in development of loan processing system and mortgage using Empower system TECHNICAL SKILLS: WORK EXPERIENCE: Guardian Life insurance, NYC, NY\t\t\t\t\t Aug 2015- Present Business Analyst  Guardian is the fourth largest mutual life insurance company in America, with 145 years of experience in providing diversified financial solutions, including life insurance, Property, and casualty (P&C) insurance, disability income insurance, retirement services, employee benefits, annuity, and investments. An application for the Defined Benefits Administration and printing the retirees' was developed to maintain the records of employee retirement benefits, provide retirement estimates and projections for the employees, as well as Calculating retirement checks and Payroll. As a Business Analyst my main responsibility was to provide valid policy information to the Claims application for a given date of loss. \nResponsibilities:   Analyzed System and Functional Specification documents.  Created a Test Strategy to be implemented across the web integrated system. Implemented a modified RUP for managing requirements. Involved in UML diagrams and design of Use Case Diagram, Class Diagram, Sequence Diagram, and State Diagram for project documentation using Select Enterprise.  Knowledge of claims systems and policy administration system.  Gathered business requirements through interviews, surveys, JAD sessions and observations and created the Business Requirements documentation for building UI for viewing data  Defined Acceptance Criteria and collaborated with the team to define staggered defect criticality levels. Recommended a reporting solution in the Data Warehouse that would minimize the impact on the system from evolving business needs. Documented technical requirements starting from project initiation to completion. Documented project details using Microsoft Project to develop and maintain a Work Breakdown Structure (WBS). Assisted in the documentation of requirements for the claims management system as a business analyst. Tested security privileges of the application for individual users as well as group access. Extensive interactions with the client and the management teams to understand the requirements and report the status of the testing efforts on their applications. Using SQL and TOAD analyzed the Business by performing data analysis and also monitored the databases during production support.  Conducted peer design and code reviews and extensive documentation of standards, best practices, and ETL procedures.  Collaborated with developers as needed to determine the root cause of defects, report software bugs and re-tested the fixed issues.  Checked validation of the application against the requirements, was involved in writing several test cases for UAT and Unit Testing.  Developed and documented Standard Testing Procedures for both Manual and Automated Testing. Involved in Database Driven Testing executed SQL Queries. Involved in developing Test Plan, Test Scripts, and Test Cases. Interacted with developers to get involved in meetings and walkthroughs and was responsible for weekly status reports.  Developed timelines for project delivery, and managed enterprise projects and resources to successful completion.  Designed and executed Test Plans and Test Cases and generated Test Scripts and Test scenarios. Coordinated User Acceptance Testing with the UAT group to ensure the correct business logic. Developing the test strategy based on the provided Test Planning and Test specification Documents. Analyzed and Executed Test Cases and Test Plans based on software requirement specifications and Functional specifications. Facilitated CR Review Meeting with product, marketing and involved in gathering estimates with impacted teams Used Defect Tracking System in Quality Center to report, update and analyze the defect. Participated in walkthrough and defect report meetings periodically. Participated in the test environment setup and in ensuring that the facilities, test tools and scripts are in place to successful perform the required testing effort. Involved in Data Analysis, Data Modeling and Logical Data Specification. ENVIRONMENT: MS Visio, UML, HTML, Oracle, Agile, MS Project. Liberty Mutual, Indianapolis, IN\t\t\t\t\t Jan 2014- July 2015 Business System Analyst \t Liberty Mutual is a leading insurance firm providing wide range of insurance products and services that include auto, home, commercial lines (Property and Casualty) and life insurance. Involved in claim management application to assist claim professionals to analyse and administer the claims in an efficient manner. The operational data came from multiple sources and was then loaded into claims application. Responsibilities: Involved in interactions with the Subject Matter Expert, Project Manager, Developers, and the End-Users.  Conducted JAD sessions as a lead facilitator in requirement phase. Gathered business requirements through interviews, surveys, JAD sessions and observations and created the Business Requirements documentation for building UI. Interacted with Business Users to conduct thorough Requirements Analysis.  Reviewed and analyzed the business environment and identified process improvements.  Involved in requirement gathering by conducting personal interviews, developing questionnaire, brainstorming, or role playing to get a better understanding of client business processes and creating requirements traceability matrix for tracking the requirements.  Conducted Design Walkthroughs with end users, developers, managers, and analysts to gather the modification requests and to upgrade or change the business specifications for the product. Participated with individual and JAD/RAD sessions (Work Sessions) with the stakeholders (Offer Management) and the technical units (Amdocs) for business requirement gathering followed by (Agile Scrum) approach Assisted the team members with documentations like Business Requirement Document and Use Case Specification Document by using DOORs Assisted in Data Analysis by Data Mapping among Enterprise Product Catalog , Web Product Catalog , SANSON (Billing System) and SAP (Inventory) then worked with the design team in the designing of the Databases with extensive use of ERDs for Data Validation, Reference Data Analysis, and Data Conversion  Applied T-SQL for cross checking Data Validation for Referential Data in SQL Server  Used Clarity to drive business transformation and operational excellence and to accelerate innovation  Developed UML Use Cases using Rational Rose and developed a detailed project plan with emphasis on deliverables. Assisted with Test Cases and development strategies with Quality Assurance Group (QA) to implement them. Developed Test Plans and Test Cases according to Business Requirements. Maintained status report of the testing had been conducted. Created Scenarios to conduct the load test using Load Runner. Used HP QC as the defect-tracking tool to enter defects regarding the issues found during testing. Inserted Requirements in HP QC, Mapped Requirements with Test Cases. Created Users, Setting Up The Auto-Email Configuration, Set Traceability notifications, set Up Workflow, Setting Up Permissions for Different Users Depending on their Group (IN Quality Center) Generate various reports and graphs in Quality center to analyze the AUT. Used Quality Center as a Bug Reporting Tool for entering the Bug. Involved in generation and execution of SQL queries. Acted as User Acceptance Testing coordinator and monitored business testing and interfaced with the development team regarding defect status and fixes on a daily basis. ENVIRONMENT: Rational Rose, Agile(Scrum), MS Project, MS Visio, MS Word, MS Excel, Test State Farm Insurance, Bloomington IL                                                    March 2012- Dec 2013 Business Analyst Under the scope of an Integrated Customer Platform(ICP), Development Center (DC 8) Billing project delivery scope consist of configuration and customization of the STG Billing product by Majesco Mastek(MM), and product integration though interfaces developed by IBM, for efficient use of MM’s STG billing Product by the client( State Farm). Responsibilities:  Participated in strategic and planning architecture as a Subject Matter Expert (SME), assisted in development of business decision documents and deliverables as needed by collaborating with  Development Centers (DCs), business partners, system partners and core teams. Provided subject matter expertise in BCD and HLSD Business Architecture reviews to help expedite knowledge transfer later.   Worked with Business Architecture and Application Architecture team to define the high level requirements to detail level, identified rules for each requirement. Consider business implications of the financial applications to future business environment. Validated requirements and design by reanalyzing the scenarios with business partners (P&C underwriters and agent representatives) and stake holders Team lead for Compatibility Analysis (CA) sessions for Generate Bill information, Refunds, Hold Suspense Release, write off, Time out of force Processing (TOOF), Earned Premium, Electronic Bill Presentment. Core member of the planning team for the Business Case document (BCD) for the efforts of STG Billing UI (R20335), and Bill and Remittance (R20403). Wrote Business Decision Document (BDD) and worked as a (BDD) Coordinator to keep track of all the BDD . Worked closely with Business Architecture team to revised Payment Center Process maps in MEGA and validate the business requirements. Very strong understanding of Billing and Payments process of state Farm and vendor Product i.e. (STG). Good understand the current Billing Process, Policy Admin System (PAS) and out of the box functionality of STG to avoid the gaps. Analysis of business requirements and system requirements of the client and also for new product development in Property and casualty modules. Attend integration sessions for PAS and STG. Facilitated Feedback Tracker meetings (set agenda, arrange for presenters, facilitate discussion, arrange environment, ensure action items are completed), helped Business Partners, Business Architecture and Application Architecture team to close the action items assigned to them by providing proposed and counter solutions. Central point of contact for our project dependencies with other DC’s, updated and maintained those dependencies in Lotus Notes. Facilitated sessions with other DC’s and core team to help identify and understand each dependency and provided solution and follow-ups.  Developed Architecture Approach Document (AAD), did gap and impact analysis between CAI and AAD.  Created and maintained Business Volume Metrics (BVM) for the project. Documented all the RCN’s (Requirement Change Notification), uploaded in Lotus Notes. Conducted work sessions with the core team and business partners helping them identifying each RCN. Conducted  Digital UI wireframes review sessions with the core team and Business Partners, documented all the proposed changes and feedback, assisted UI team to come up with better wireframes as per business needs. Environment: Windows, Agile, MS Visio, MS Excel, MS Word,  SharePoint. Met Life Insurance, NYC, NY\t\t\t\t\t             June 2010- Feb 2012 Business Analyst\t\t\t\t\t\t\t      MetLife Insurance is one of the multi-line insurance companies, which operates in eleven different states offering commercial (Property and Casualty), life insurance. In Met Life Insurance, the project was the intranet application. The project was to modify the application Claim process for the company employee so they can process the claim application for the various applicants. Responsibilities:  Performed Requirements Gathering and Analysis, interviewed the SME (Subject Matter Experts), and ensured that contributors and all key stakeholders were motivated to complete assigned tasks. Implemented daily scrums, collaborated user stories between resources and effectively solved issues in case of conflicts. Participated and played an analytical role from a process perspective to develop Requirements and Testing Methodology according to the Capability Maturity Model. Used Microsoft Project to plan projects timelines and resources. Writing and Review Use Cases. Conduct and lead walkthroughs and JAD sessions with business process owners, SME and software developers. Created data mapping documents for the movement of data from production databases to the warehouse and from the warehouse to the policy and claims marts. Documented test processes and results for an independent audit and internal audit procedures Conducted data-driven testing to verify reports generated from the project based on knowledge of valuation techniques and securities Analyzed the functional requirements, wrote test cases for each and every object Verified the correlation between the UML diagrams and developed detail diagrams Participated in weekly meetings and discussed modification request with management team Environment Environment: Windows 2000/NT, UNIX,  Java, JavaScript, MS Office, MS Visio, Project,  Rational Tools, PL/SQL, oracle, UML. EDUCATION: Bachelors of Business Studies (Tribhuwan University, Nepal)"}