{"text": "Name: margaret margaret E-Mail: margaret.margaret@gmail.com Address: Xingtai, China Github: https://github.com/margaret LinkedIn: https://linkedin.com/margaret Phone No. 756096691236 PROFESSIONAL SUMMARY Astute business analyst professional with 6+ years proven track record of implementing enterprise application software development projects with extensive experience and insight of technology, reengineering business processes, and continuous improvement. Proficient in gathering and converting user requirements into business requirements and functional requirement specifications (FRS) to enhance day-to-day processes by leveraging technology. Expertise in development methodologies like agile, scrum, waterfall, Rational Unified Process (RUP), and Software Development Life Cycle (SDLC). Extensive experience in handling requirements management, Business Requirements Document (BRD), Functional Requirements Specification (FRS), System Requirement Specifications (SRS), use case specifications and Requirements Traceability Matrix (RTM). Profound understanding of gap analysis, User Acceptance Testing (UAT), risk analysis and project plans.  Comprehensive knowledge of use cases, Software Development Life Cycle (SDLC) processes, Object Oriented Analysis and Design (OOAD). Skilled in designing business models using UML diagrams such as use case diagrams, class diagrams, activity diagrams, sequence diagrams and collaboration diagrams. Facilitator of project review meetings with design and development team, and release management team to track projects, acceptance, and to deliver across releases.  Expertise in business process modeling, business process re-design and in designing process architecture. Solid knowledge of business intelligence, data warehousing, and business architecture. Proficient in technical writing, documentation, oral presentation and delivery. Strong problem solving and analytical skills with a high learning acumen to adapt to new technologies.  Execute multiple tasks and manage small to large high-profile projects in cross functional and global environments.  Creative and aggressive self-starter with integrative thinking skills. BUSINESS SKILLS  Requirement Gathering, Analysis and Documentation Process and Performance Analysis  Requirement Management and Improvement Business Processing, Master Data Management  Workflow Design/Analysis, Strategic Planning Impact and Gap Analysis End Users Interviewing, Checkpoint Meetings Change Management, End User Design and Testing Strategies Negotiation and Persuasion TECHNICAL SKILLS  Operating Systems:\t Windows, Mac OS, Red Hat Linux, HP UNIX  Packages:\t    \t MS Office, MS Visio, MS Flow, MS Project, MS Access, SharePoint, Confluence Methodologies:             Waterfall, Agile, SDLC, Kanban, RUP, Six Sigma Languages: \t              C, C++ and SQL Databases: \t              MS SQL Server, Oracle Testing Tools: \t\t HP UFT, Selenium BI Tools: \t              Tableau, Power BI, Power Tool Suite, Cognos, Beyond Compare, Disco Data Tools:                     Erwin data modeler & governance, Collibra, Redshift, SAP Information Steward  ERP Tools:                     SAP HANA, Oracle ERP Cloud, Oracle EBS, NetSuite, Salesforce    PROFESSIONAL EXPERIENCE Business Systems Analyst                                                                                                          Dec 2016 to Present                                 Quicken Loans – Detroit, MI  Worked with the nation’s largest and #1 mortgage lender to redefine the mortgage process to help loans close faster by implementing cutting edge technology. Responsibilities: Identified and validated high potential business opportunities for stakeholders and developed business strategies that are aligned with corporate strategic objectives and resolve any discrepancies in master data. Proactively cleansed key master data to block inactive records, blocking duplicate information, enrich material characteristics, establish business partner relationships. Improved and redesigned the loan process to close loans in 15 days. Provided analysis, recommendations and business perspectives on many financial and operational issues based on data. Worked with stakeholders to develop effective processes and procedures to assure timely gathering, collection, analysis, review, formatting to specifications and delivery of program master data. Identified, developed, and provided periodic reports to the production; seek out action plans and recommended corrective action to improve operational performance. Analyzed master data and prepared financial scenarios, continually manage data quality dashboards and scorecards in for various master data domains leveraging data quality rules book. Evaluated business needs, analyze business processes, evaluate alternatives and/or modifications to existing processes, and facilitate dialogue between IT and business partners to arrive at a solution for a business need.  Involved in mentoring specific projects in the application of the new SDLC based on the Agile, Waterfall, Unified Process, especially from the project management, requirements, and architecture perspectives Participated in several requirements gathering sessions alongside stakeholders, SMEs, end users, and UAT group to characterize the intent and scope of the new changes and assemble the prerequisites as needs are. Identified and analyzed business problems, find opportunities and offer solutions by conducting gap analysis according to AS-IS and TO-BE model with the help of requirements and converting the requirements into technical specifications. Actively involved in validating the requirements and applying the RUP framework throughout the SDLC, propose process improvements to documentation and technical writing procedures. Tested the final application for usability testing to verify whether all the user requirements are catered to the application. Developed strategic partnerships with the business unit to prepare a solid knowledge based of the business line, including the business plan, products, and process. Provided clear and concise documentation regarding requirements management plans, functional requirements, supplemental requirements, test plans and test cases.  Assisted in the development of training materials for new technology and process improvements. Business Analyst                                                                                                                         Jan 2013 to Nov 2016 Tropisys Information Systems – Las Vegas, NV Worked with this dynamic software company which offers enterprise services and solutions, wore multiple hats as needed (Business intelligence, Product development & Data migration) Responsibilities:  Extracted the business requirements from the end users keeping in mind their need for the application, and documenting it for the developers.  Prepared Business Requirement Documents (BRD’s) after the collection of functional requirements from system users that provided appropriate scope of work for the technical team to develop prototype and overall system. Created artifacts including use case diagrams, activity diagrams, statechart diagrams, sequence and collaboration diagrams, mockups, prototypes, data flow diagrams and data dictionaries. Worked with the core team to design business requirement collection approach based on the project scope and SDLC Methodology. Actively involved in elicitation techniques like interviewing, questionnaires, brainstorming, focus groups, prototyping and facilitating JAD sessions. Ensured broad context of requested business changes are contemplated and process inputs, outputs, and potential impacts are considered.  Analyzed business requirements and segregated them into use cases and activity diagrams according to UML methodology thus defining the data process models. Created and maintained requirement/traceability documentation, provide guidance and prioritization on defect and change request submissions in accordance with project scope and business requirements. Actively lead large cross-functional discussions, probe for details in unfamiliar processes/systems, facilitate UAT sessions, and support project managers & developers with comprehending business needs project is solving for.  Prepared business workflow models that cover \"How\" business processes are accomplished. Worked with the quality assurance group throughout the company identifying the major changes with the greatest opportunity for cost reduction.  Prepared logical data models containing a set of diagrams and supporting documents containing the essential business elements, detailed definitions, and descriptions of the relationships between the data elements for the analysis and documentation of business data requirements. Assisted QA department to write and execute test plans and test Cases and worked on UAT. Prepared and maintained Business Rules Spreadsheets (BRS) identifying rules, triggers, and corresponding data fields. Conducted quality assessments, operational procedures, to ensure that change management procedures are met, coordinated with external third-party vendors, technical staff and users to ensure that functionality of automated system adheres to laws, regulations, and best practice standards. Managed the implementation of new systems projects including: Communicating data requirements to the client, executing internal operations processes to ensure high-quality analytics are delivered as required and communicating project status to appropriate internal and external constituents.                                                                  CERTIFICATIONS Six Sigma Green Belt Oracle Database 11g Administrator Certified Associate (OCA) CBAP "}