{"text": "Name: sally sally E-Mail: sally.sally@gmail.com Address: Quanzhou, China Github: https://github.com/sally LinkedIn: https://linkedin.com/sally Phone No. 654045387678 SUMMARY 7+ years of experience in business analysis, business requirements modeling and development of Web Based, and Client/Server applications extensively in business domain of Healthcare. Strong knowledge of managed care payer requirements and procedures. Proficient in gathering and converting User Requirements into Business Requirements and Functional Requirement Specifications (FRS) and use Modeling tools like Rational Rose and Microsoft Visio for requirements modeling.  Expertise in Business Process Modeling, Business Process Re-design and in designing Process Architecture. Strong knowledge of managed care payer requirements and procedures. Extensive experience in configuring data mapping between different Databases. Sound understanding of Gap Analysis, requirement management, risk analysis and project plans.  Solid understanding of Rational Unified Process (RUP) using Rational Rose, Requisite Pro, Unified Modeling Language (UML). Good understanding of trading partner management for 4010 and 5010 files. Extensive experience in configuring data mapping of files using Edifacs Specbuilder. Knowledge of various RDBMS like DB2, Oracle, MS-Access and MySQL Server. Thorough knowledge of HP Quality Center and Defect Lifecycle Process. Preparing graphical depictions of use cases including state diagrams, activity diagrams, sequence diagrams, use case diagrams, component-based diagrams, collateral diagrams, including the business workflow. Ability to communicate effectively with Business users and Senior Management. Worked as productive team member with excellent communication and presentation skills using MS OFFICE AND MS PROJECT Through knowledge of various phases of Edifacs Specbuilder- Analyzer and Mapper. Experience with various ETL, data warehousing tools and concepts. Excellent understanding of Data Models and Information Architecture and sound skills in SQL. Familiar with HIPAA EDI transactions such as 835, 837 (P, D, I) 276, 277, 278 etc Knowledge of the Back-End processes like Voucher Creation, EOB, Letter generation and 835 etc. Experience in development methodologies like RUP, SDLC, AGILE, SCRUM and Waterfall Experience in Risk Management process and technology reengineering, Sarbanes Oxley implementation, valuation review process and technology, strategic sourcing, metrics and benchmarking Design and review of various documents including the Software Requirement Specifications (SRS), Business requirements document (BRD), Use Case Specifications, Functional Specifications (FSD), Systems Design Specification (SDS), Requirement Traceability Matrix (RTM) and testing documents. Experience in HEDIS Reporting Software and VIPS as per NCQA standards. Strong experience in Business and Data Analysis, Data Profiling, Data Migration, Data Integration and Metadata Management Services. Excellent in designing business models using UML diagrams such as use case diagrams, class diagrams, activity diagrams, sequence diagrams and collaboration diagrams using Rational Rose and MS Visio. Experience in conducting Joint Application Development (JAD) sessions and White Board Sessions with end-users, Subject Matter Expert (SMEs) team, Architects and design group development and QA team for project meetings, walkthroughs and customer interviews commensurate with excellent communication skills. Creative and aggressive self-starter with integrative thinking skills, capable of communicating creative ideas through graphical analysis charts and statistical data display. Involved in training of end users and Documenting Training Manuals.  Focused troubleshooter and a team player with excellent interpersonal and communication skills. Ability to work cohesively with developers, other team members, and testers.  Analytical, methodical and resourceful approach to Problem Solving, Root-Cause Analysis, Conflict Resolution, Negotiation Strategies and providing corrective actions to meet business requirements.  Proven record of Leadership skills. Excellent Presentation skills in regards to communicating with both business and technical teams. Expert in developing BRD (Business Requirement Document), TRD (Technical Requirement Document), URS (User Requirement Document) and FRS (Functional requirement Specifications) following Agile methodology.  Hands on experience in Requirement gathering and analysis, Planning, scheduling and Tracking Projects. Technical skills PROFESSIONAL EXPERIENCE Lifetime Healthcare Group, Buffalo, NY                                              Jan 2018 – Present                                                                                                                                                                             \nBusiness Systems Analyst  Lifetime Health Medical Group provides primary and specialty care, urgent care, pharmacy, dental, optical, behavioral health and imaging services, serving the Buffalo and Rochester communities for more than 40 years. All Lifetime Health practices have been awarded recognition by the National Committee for Quality Assurance (NCQA) as Patient-Centered Medical Home Level 3, the national organization’s highest designation The project aims at building an Enterprise SOA (service-oriented architecture) based system that will be developed on the Microsoft .NET Platform. The new Claims Processing MMIS (Medicaid Management Information System) will replace the old legacy system and will automate all the business areas with minimum human intervention. As a Business Analyst, I was involved with drafting the migration plan for the Claims Processing data which needed to be migrated from the Mainframe to the Oracle environment. Responsibilities:   Created business and technical requirements, functional specs, gather and translate functional requirements into technical requirements and provide analytical support to the management team as needed.  Heavily involved in testing and reporting issues, as well as defining resolutions. Capture control points (automated and manual) in the process flows to know about the transactions happening between steps, processes etc. Analyzed requirements for developing a cross-walk for understanding major changes from ICD-9 to ICD-10 with the help of SME’s.  Facilitated JAD sessions for Requirement Validation with Dept. of Cleveland clinic to gather requirements for the new MMIS. Worked extensively on both inbound and outbound transactions, creating test cases for multiple transaction types including EDI 837, 835, 276, 277, 270 271 Managed defect tracking and helped in the verification of the developed test cases. Utilized the RUP Software Development Methodology for the creation of the new operations system. Worked on Vision 2020 projects on various trains including Financial Services. This was based on AGILE software development methodology.  Assist the HEDIS Supervisor in coordination of the Medical Record Review Project.  Created functional requirement specification documents such as UML diagram, use case diagram, scenarios, activity diagrams and mapping. Created Logical/physical Data Model in ERwin and have worked on loading the tables in the Data Warehouse Developed the User Interface (UI) prototypes to capture and validate requirements and spike solutions to the current problem. Worked on new Pharmacy Benefit Management System Medical Claim Data feed, Data Dictionary layout and definition, Eligibility files and various File Transfer Specifications Gap Analysis: Analyzed the client’s applications programs to determine the impact of the HIPAA final rule on EDI Transaction Set and Code List implementation and defined the changes to bring the affected systems into HIPAA compliance. Conducted JAD sessions for gathering requirements for the project. Identified, researched, investigated, analyzed, defined and documented business processes and Use Case Scenarios. Built relationships with the ACO Participants to help communicate the yearly changes in HEDIS Measures.  Participated in developing test plan, test scripts, and test scenarios and designed user documentation. Examine the system design deliverables & validating it against the SLA. Contact provider offices and members to retrieve Medical Records for both HEDIS and Risk Adjustment  Developed UAT test cases associated with the functional requirements. \nEnvironment: MS Office, Windows, .NET, Agile, MS Visio, MS SharePoint, TFS, MS Project, MS Visio, SQL, Oracle, SOA, HTML.  Dept. of Health & Hospitals (DHH), State of LA, Baton Rouge, LA         Feb 2014 – Dec 2017                                                                               Business Analyst                                                           The Louisiana Medicaid Program provides health services to low income individuals, has an annual budget of 7.2 billion dollars and provides services to more than 1 million recipients annually.  MMIS processes 51 million Medical claims annually for more than 30,000 Medicaid providers. The focus of the project was the replacement of 22 year old Medicaid Management information System (MMIS). It included technical and professional services related to analysis and assessment of the current MMIS and EDI claims, documentation of business and technical requirements, preparation of cost analysis and implementation of new MMIS automation system. & St. of Louisiana also provides health insurance to parents/caretakers and dependent children, pregnant women, and people who are aged, blind or disabled. These programs pay for hospital services, doctor visits, prescriptions, nursing home care and other healthcare needs, depending on what program a person is eligible for.  Responsibilities  Coordinated with the stakeholders and project key personnel to gather functional and non-functional requirements during JAD sessions. Studied the existing business process and created AS-IS workflow to illustrate the existing system. Responsible for the full HIPAA compliance lifecycle from gap analysis, mapping, implementation and testing for Medicaid Claims. Propose strategies to implement HIPAA 4010 in the new MMIS system & eventually move to HIPAA 5010. Responsible for gap analysis in changing old MMIS and Involved in testing new MMIS. Responsible for Medicaid Claims Resolution/Reimbursement for peach state health plan using MMIS. Recorded requirements in the Requirement Traceability Matrix (RTM) defining each technical requirement in detail from areas like: main hardware, application software, networks, servers, internet and desktop configuration. Assisting the project manager in creating the business case and project plan. Served as a liaison between the internal and external business community (Claims, Billing, Membership, Capitation, Customer service, membership management, provider management, advanced Healthcare management, provider agreement management) and the project team. Actively analyzed current business processes (Claims, Recipient eligibility and enrollment etc.) and worked with management to improve and implement enterprise solutions to ensure compliance. Work with business representatives to understand data marts requirements and priorities and ensure that IT works is appropriately aligned. Responsible for creating business work flows and processes and creating management reports based on the analysis. Followed the UML based methods using Rational rose to create use cases, activity diagram, sequence diagram, collaboration diagram that include functional and non-functional specifications to hand off to development teams. Actively involved in updating internal processes (submit claims, check eligibility), updating data collection and data reporting. Defects and bug testing by using Rational Clear-Quest, Configuration management and Version control with Clear-Case. Environment: Rational Unified Process (RUP), SQL, MS Visio, MS Project, MS Office, UML, Windows, HP Quality Center.  Hallmark Healthcare Services, Naperville IL                                             Jan 2012- Jan 2014                                                                                                                                                                                            Business Analyst Performed day-to-day EDI activities related to HIPAA compliant and NSF data submissions. Duties included technical and non-technical telephone or email communications with physicians, clearinghouses, billing services, and hospitals who submitted or received electronic claim data (NSF or ANSI X12 4010 version)  Responsibilities: Gathered business requirements by driving user-group meetings and working with various global, cross-functional and virtual teams Working within a growing knowledge of X12 4010 HIPAA 837 I, P, D, 835, 834, 820, 270, 271, 276, 277, 278, EDI, Privacy, Security, and Medicaid. Consulted with healthcare insurance company to develop conversion specifications for other insurance Coordination of Benefits (including Medicare). Performed Gap Analysis to check the compatibility of the existing system infrastructure with the new business requirements.  Teamed up with both internal and external software development groups to provide functional requirements specifications in form of use cases, process flows, and prototypes and management reporting requirements Performed Unit Testing and User Acceptance Testing and documented detailed defects. Developed Test Cases to validate the requirements and documented the Traceability Matrix for Test Cases and Requirements Conducted presentations of the Q/A test results with analysis to the stakeholders and users and documented modifications and requirements Developed Functional Specifications and Q/Testing Requirements. Worked on EDI transactions: 270, 271, 834, 835, and 837 (P.I.D) to identify key data set elements for designated record set. Interacted with Claims, Payments and Enrollment hence analyzing and documenting related business processes. Designed and developed Use Cases, Activity Diagrams, Sequence Diagrams, OOD using UML Involved in all phases of software development life cycle in RUP framework. Developed detailed  Developer specification to reflect technical details of the business requirements Was responsible for data mapping of HL7 messages into relational database. Assisted in monitoring ancillary data transactions and addressed problems with HL7 messages. Extensive experience in using collaborative tools like Mercury Quality Center to facilitate development across disparate teams Assigned tasks among development team monitored and tracked progress of project following agile methodology. Designed and developed Use Cases, Activity Diagrams, Sequence Diagrams, OOAD using UML and Business Process Modeling. Developed business process models in RUP to document existing and future business processes. Created Business Requirement Document (BRD), Functional Requirement Specification (FRS) document, User Requirement Specification (URS) and Change Request (CR) document for system application development. Provided management support to the off-shore End to End Integration / Regression Test Team Prepared UAT Materials UAT Test Cases to include various steps involved for UAT and to have proper coverage of requirements Involved in integration of various Customer Data Sources and provided Data Mapping from various sources into the target centralized customer data source with help of Erwin team. Acted as a Subject Matter Expert on Application knowledge for preparing training presentation, Quick Reference Guides and assisting with any issues/questions that arose from training Successfully conducted JAD sessions, which helped synchronize the different stakeholders on their objectives and helped the developers to have a clear-cut picture of the project. Environment: Agile/Scrum, UML, HP ALM, Rational Clear Quest, Windows, MS Office, HTML, Windows"}