{"text": "Name: margaret margaret E-Mail: margaret.margaret@gmail.com Address: Chengdu, China Github: https://github.com/margaret LinkedIn: https://linkedin.com/margaret Phone No. 24524112138 \n  SUMMARY Seven years of experience as a   Sr.System Analyst   in Health Care. Extensive working experience with TriZetto’s Facets tool. Data Migration. Worked on different EDI healthcare transactions like 837-Institutional, 837-Professional, 837-Dental, 835-Claim Payment/Remittance Advise, 270/271-Eligibility Benefit Inquiry/Response, 276/277-Claim Status Inquiry/Response Transactions. Detail understanding of ICD 9/ANSI/HL7 to ICD 10/ANSI/HL7 coding standards in Medicare and Medicaid domains of the healthcare industry. Experienced in working with Business Impact Analysis Template (BIAT) to analyze and document the effect of proposed changes on the project schedule and costs.  Proficient in business requirements gathering and writing including the EDI transactions from 4010 to 5010. Good Understanding of PPACA, HIX and HL7 Good understanding of MMIS, MECT and MITA. Possess excellent business writing skills required for documenting Business Requirements Document (BRD), Functional Requirements Document (FRD), and Non-Functional Requirements Document (NFRD). Expertise in Business Analysis and various Software Development Life Cycle (SDLC) methodologies like Waterfall, Agile/SCRUM, RAD, Rational Unified Process (RUP) methodology. Experienced in Data Warehouse concepts, ETL (Extract, Transform, Loading), DataMigration, Using Informatica Extensive experience in PL/SQL programming: Procedures, Functions, Packages and Triggers Developed detailed Requirements specifications through JAD sessions, interviews, on site meetings with business users & IT team. Proficient in creating and transforming business requirements into functional requirements by using Use cases diagrams, Activity diagram, Class diagrams, Sequence diagrams, Test Cases, Test Plans. Good knowledge of FACETS, and Transaction Manager for 4010-5010 migration. Knowledge and Implementation experience in Eligibility System, Facets Data model, Configuration Implementation of FACETS module. Involved in using FACETS for various health insurance areas such as products, enrollment, members and other modules related to FACETS. Documented Traceability to ensure all the features for the project has been captured and mapped back to the requirements in the BRD. Experience with claims process and adjudication in the Medicare, and Medicaid. Expertise in writing SQL Queries, Views and Stored Procedures in Oracle. Broad knowledge of testing concepts and hands on experience writing test cases, test plans and planning test strategy using testing tool Quality Center. Quick learner, reliable and confident working independently as well as in a team. Exceptional track record for meeting deadlines and submitting deliverables on time. Highly motivated team leader with excellent communication, presentation and inter-personal skills, always willing to work in challenging environments. Technical Skills: PROFESSIONAL EXPERIENCE Department of Health and Hospitals, St. of Louisiana. Baton Rouge, LA        Sr. System  Analyst                                                 May- 2013 – Jun-2015\nThe main scope of the project was that the Louisiana MMIS should be able to meet the minimum functionality necessary to electronically send, receive and process the transaction for Medicare part D. process design and requirements, Data Mapping and Data Migration\nResponsibilities: Gathered business and Functional requirements from Business Managers, Supervisors, stakeholders, Data Governance Team and the subject matter experts through meetings to understand needs of the system. Used the guidelines and artifacts of the Rational Unified Process (RUP) to strategize the Implementation of Rational Unified Process effort in different iterations and phases (Inception, Elaboration, Construction and Transition) of the Systems Life Cycle methodologies. Prepared various artifacts for all the phases of RUP.  Led JAD sessions with stakeholders to analyze system needs and integrate requirement to develop a consistent navigation structure. Created business workflows on the claims module for the client to get a better understanding of the software and prepared a detailed BRD including all functional and non functional requirements. Responsible for gap analysis in changing old MMIS and Involved in testing new MMIS. Used SSIS to read source data from complex flat file structures (e.g. EDI 837 PID, 835, 270/271).  Performed the Gap analyses of the earlier systems, generated a detailed Requirements document describing new system architecture through Use Cases and Activity diagrams. Worked on new implementations and Data migration projects. Worked with the QA (Quality Assurance) team for designing Test Plan and Test Cases, for the User Acceptance testing. Defined test cases, creating test scripts, analyzing bugs, interacting with QA / development teams in fixing errors and User Acceptance Testing (UAT). Created functional flow diagrams, context diagrams and other high level diagrams for documenting the functionality of separate modules using MS-Visio and UML. Analyzed HIPAA 5010 related to 837, 835, 270, and 271. Transactions and performed GAP analysis between the 4010 and 5010. Responsible for GAP analysis of ICD9 - ICD10.  Analyzed business requirements, performed source system analysis, prepared technical design document and source to target data mapping document. Used MS Project to maintain the project schedule and track its status. Involved in Data Migration testing of data from the existing system to the new system. Involved in the statistical analysis of data. Extensively involved in Querying the Database using SQL and PL/SQL as a part of Data Analysis. Environment: UML, RUP, MS-SharePoint, data migration ETL, SSIS, Oracle 10g, DB2, MS-Project 2000, MS-VISIO, TestDirector7.6, WinRunner7, PL/SQL, SQL Server 2000,EDI, Facets, HIPAA compliances. XL Health, Baltimore, MD                                Systems Analyst                                     Aug- 2011 – Apr- 2013\nThe project was regarding the Electronic Medical Claim Software System that facilitates providers to send electronic claims in short time, and thereby ultimately increase the revenue cycle efficiency. The primary feature of the software included Electronic verification of insurance eligibility, Electronic claims status inquiry, Financial Ledger, Essential system reports and automated reminders. The system’s goals were to maximize the value of online health information; expand utilization of programs, services and products by updating the Data Warehouse solution for reporting.\nResponsibilities: Writing the detailed user needs, Gathered business, functional requirements during inception phase, documented and delivered functional specification documents, and assisted architecture analysis and design using UML and Rational tools. Worked on Data migration, FACETS version upgrades Reports Implementation, letters, Inbound/outbound Interfaces and FACETS Extensions. Implemented EDI transactions 837, 835, 270/271, 276/277 and 834. Designed and developed Use Cases, Activity Diagrams, Sequence Diagrams, and OOD (Object Oriented Design) using UML and Visio. Extensively worked with FACETS Implementation, FACETS Billing, Claim Processing and Subscriber/Member module.  Identified, researched, investigated, analyzed, defined and documented business process and Use Case scenarios. Conduct workflow, process diagram and GAP analysis to derive requirements for existing systems enhancements. Led JAD sessions with stakeholders to analyze system needs and integrate requirement to develop a consistent navigation structure Worked on insurance data related to Medicare, Medicaid, and Insurance claims. Analysis of inbound and outbound interfaces and extensions to FACETS claims processing system Worked on HL7 to provide framework to carry out transfer of electronic healthcare information. Helped manage risk analysis and mitigation plans, status reports, and client presentations; prepared business process models, defined milestone deliverables, and established critical success factors. Experience with Trizetto Facets System especially with the Managed Care Credit policies. Prepared and maintained requirements traceability matrix (RTM) throughout the project lifecycle. Functioned as the primary liaison between the business line, operations, and the technical areas throughout the project cycle. Conducted GAP analysis assessment regarding ICD 9 to ICD 10 conversion and business work flows from legacy system to the detailed financial transaction interface The data architecture involved analyzing and addressing data migration and mapping for present and future systems. Configured facets modules such as Claims, Membership, Billing, Benefit and plan Used General equivalence Mappings (GEM) to convert ICD 9 to ICD 10. Formulating the systems of project to parallel the business strategies.  Conducted user training pertaining to old and new Affinity Provider ID appearing on documents providers receive from Affinity (mainly occur with EOPs, capitation rosters, PCP membership rosters, provider directory listings and some system generated letters) Wrote SQL queries in MS Access for data manipulations. Assist with user testing of systems, developing and maintaining quality procedures, and ensuring that appropriate documentation is in place. Develop the test plan, test conditions and test cases to be used in testing based on business requirements, technical specifications and/or product knowledge. Used Test Director with QA team for testing. Interfaced with SME’s to prepare BPR documents for ongoing projects. Environment: RUP, MS Project, ANSI X12 – EDI, Rational Rose, Data Mapping, MS Visio, MS Word, MS Excel, Medicare, Medicaid, Rational Requisite Pro, ETL, Oracle , MS Access. PL/SQL Active Health Management, NYC, NY\t   Systems Analyst /Data Analyst    Jan 2010 - Jul 2011                                                                                                                   This project aimed at developing software for auto-adjudication of claims process to improve the efficiency in processing claims. The system primarily aimed at handling Medicare / Medicaid insurance claims and process exceptions.  Responsibilities: Assisted in identifying project scope, to conform to the regulatory compliance related to X12 837 (I/P) and 835. Worked with Facets data models for Claims, Membership Eligibility etc. Prepared the Business requirement Document (BRD) and functional requirement document (FRD), working with Requirements Traceability Matrices (RTM), re-engineering business processes for the enhancement of the existing services. Created complex Mappings, Transformations, Tasks and Sessions to optimize the ETL performance in Microsoft SSIS for Data warehousing project. Coordinated the upgrade of Transaction Sets 837P, 835 and 834 to HIPAA compliance. Responsibilities include the - Analysis of inbound and outbound interfaces and extensions to FACETS claims processing system Used Oracle SQL* Loader feature for loading the data from Flat files and XML Created standard and Ad hoc reports using Cognos Impromptu designed catalogs and defined User Classes, Security and Privileges.  Used Rational Rose/MS Office Suite for creating use cases, workflows and sequence diagramsaccording to UML methodology thus defining the Data Process Models. Played a key role in project planning activities, User Acceptance Testing (UAT), and implementation of the system enhancements and conversions. Involved in Relational database design and mapping of Data Warehouse. Conducted Business Process (As Is/To Be) sessions with various department directors and staff to ensure the Testing Plan and Test Approach would meet the identified Business Requirements, and the Training Program covered all identified new and changed processes. Analysis and Design of the Facets data model to ensure optimal system performance and tuning Involved in Data Analysis for data mart system for the process of report generation. Environment: Facets ,EDI, Rational Requisite Pro, SharePoint, Rational Clear Case, RUP, Spec Builder, UML, HTML, SSIS, SSRS,SQL Server , Oracle  MS Visio, Data mapping, PL/SQL, T-SQL Baxter Healthcare, Deerfield, IL                                                        Business Analyst/ ETL                                       Jan 2008 – Dec 2009                                                                                                                             \nThe project was to understand the Medicare Claims Adjudication System, end to end, to fill the gaps in the system and incorporate the new CMS directives. Made test scenarios and helped with test cases to test the functionality of the system.  Responsibilities: Analyzed business requirements, functional requirements, tested high level and low level Use Cases and Activity Diagrams / State Chart Diagrams using Rational Rose, thus defining the Data Process Models. Designed the ETL processes using Informatica PowerCenter to load data from Teradata, MS SQL Server, Oracle   XML, Flat File and Excel spreadsheets into the target Oracle database. PreparedBusiness Requirement Document (BRD) and Functional Requirement Document (FRD) for the enhancement of the existing services. Held regular JAD sessions with the system architects, developers, database developers, quality testers during the entire project to assure that the critical as well as the minute details of the project were discussed and issues were resolved beforehand. Tracked stakeholder requested enhancements and changes using Requirement Traceability Matrix (RTM). Designed and implemented reports, score cards and dashboards using Cognos Experience in an outsourced healthcare insurance operations environment and understanding of MECT and MITA. Involved in working with Multi-Dimensional Model, Star & Snowflake schemas and other Data Modeling and Data Warehouse Applications. Analyzed Claims adjudication related transactions like 835, 837, 270, 271, 276 and 277 transactions (both inbound and outbound). Prepared UML diagrams (Activity diagrams, Sequence Diagrams, Use case diagrams) for Extensions. Implemented the entire Rational Unified Process (RUP) methodology of application development with its various workflows, artifacts and activities. Experience with data migration (ETL development), document data manipulation processes and scripts.  Data mapping, logical data modeling, created class diagrams and ER diagrams and used SQL queries to filter the data within the Oracle database. Worked with QA lead in validating Test Plan and Test Scenarios. Executed test scripts in different cycles to get the perfection and logged defects in defect tab of Quality center. Executed test cases manually. Compared and analyzed actual with expected results and reported all deviations to the appropriate individual(s) for resolution. Involved in the Statistical Analysis of Data. Extensively involved in Querying the Database using OracleSQL as part of Data Analysis Produced a variety of routine and ad-hoc reports, packages for senior management using advanced MS Excel Functions. Environment: MS Project, SQL, Rational Requisite Pro, Rational Rose, Microsoft Visio, Load Runner, Rational Clear Quest, Informatica, XML, Teradata, Oracle . "}