{"text": "Name: annie annie E-Mail: annie.annie@gmail.com Address: Pudong, China Github: https://github.com/annie LinkedIn: https://linkedin.com/annie Phone No. 364294403335 - Qualification Overview  Strong Knowledge of Software Development Life Cycle (SDLC) using Waterfall, Rational Unified Process (RUP), and Agile methodologies.  Result oriented Joint Application Development (JAD) facilitator and meetings coordinator with excellent communication and interpersonal skills. Extensive experience in creating and documenting Business Requirements and Functional Specifications including use cases. Successful in translating business requirements and user expectations into detailed specifications employing Unified Modeling Language (UML), drawing UML diagrams, Activity Diagrams, and State Diagrams using Enterprise Architect & MS Visio. Well-versed in creating Wireframes using Axure & Visio for Screen Mock Ups. Track and maintain Stakeholder requested enhancements and changes using SharePoint. Experience in designing Test Cases and Test Scripts and conducting User Acceptance Testing (UAT).  Strong presentation skills and ability to tailor presentations towards different functional areas of business. Developed training materials and trained end users on newly developed and existing applications. Experienced in software testing which involved development of test cases and test scripts, and User Acceptance Testing (UAT). Team player, energetic, result-oriented, fast learner, excellent communication skills with strong research capabilities.   Skills Inventory \tRequirements Elicitation\t      Creating User Story            Creating Wireframes           Off-shore Team Management \tCreating FRD\t\t      Documenting Use Case      Writing Test Cases               Writing Release Notes Tools /Methodology Methodologies:\t\t\t   Waterfall, Agile, Rational Unified Process (RUP)\t\t  Requirements Management Tools:    MS Word, Rally, Jira Modeling Tools\t\t\t   MS Visio, Enterprise Architect Wireframe Tools\t\t                   MS Visio, Axure Professional Experience  Florida Power And Light, \tPalm Beach, FL\t\t\t\t\t\t\tFebruary 2018- Present Business Analyst  Project Description: The project was to integrate and automate their Amex credit card transactions with their current system. They wanted to transform Amex GM1025 file to CCD format. Employees were filing their expenses outside the system as a cash expense without any records. The transformed system helped to file, manage and track  the employee expenses. Responsibilities: Created As-Is Business Process Models using MS Visio. Interacted extensively with various business groups, stakeholders and users to develop the Vision Document that is aligned with corporate strategic objectives. Documented the “AS-IS” Business Workflows adhering to UML standards. Worked on Agile Methodology with monthly release and weekly sprints. Managed the application support product backlog using Rally. Conducted Monthly Business Prioritization meetings with the stakeholders identify features to be scheduled for the upcoming release. Documented User Story using Rally to detail the business need. Conducted weekly sprint planning meeting with the developers and quality assurance analysts to review user story, assign story points and assign cards to a respective sprint. Documented meeting minutes from JAD sessions and obtained sign-offs from JAD participants. Followed a structured approach to organize requirements into logical groupings of essential business processes, business rules, functional and non-functional requirements. Designed User Interface-level wireframes detailing interaction models and user experience using Axure. Conducted requirement workshops to verify and validate business requirements. Documented test cases / test scripts. Performed functional and GUI testing to ensure that the user acceptance criteria are met. Co-coordinated the User Acceptance Testing (UAT) on a daily basis with the SME’s to make sure that all the business requirements are addressed in the application. Coordinated project scheduling and status reporting with the project manager. Inter-American Development Bank, Washington DC\t\t\t\t\t\tJune 2016- January 2018  Business Analyst  Project Description: Inter-American development bank is one of the largest source of development financing in Latin America and Caribbean. IADB was using homegrown application to manage HR, Finance, Travel and Expense. IADB wanted to integrate H.R and Finance In S.A.P and Travel and Expense in Concur.  The project aimed to enhance and make reporting advanced, increase visibility, manage authentication issues with travel and expense in Latin America. Responsibilities: Interacted extensively with various business groups, stakeholders and users to develop the Vision Document that is aligned with corporate strategic objectives. Documented the “AS-IS” Business Workflows adhering to UML standards Conducted JAD sessions to define requirements and finalize the Functional Requirement Document (FRD). Documented meeting minutes from JAD sessions and obtained sign-offs from JAD participants Followed a structured approach to organize requirements into logical groupings of essential business processes, business rules, functional and non-functional requirements. Identified use cases from the functional requirements, wrote use case specifications and created “TO-BE Business Process Workflow” diagrams (activity diagrams) in MS Visio. Designed User Interface-level wireframes using MS Visio. Assisted QA team in writing test cases. Conducted requirement workshops to verify and validate business requirements. Created use case diagrams using MS Visio to show interaction between the actors and the use cases as well as to demonstrate the relationship between the use cases. Maintained a Traceability Matrix to ensure that all functional requirements are addressed at the use case level as well as the test case level. Performed functional and GUI testing to ensure that the user acceptance criteria are met.  Amrit Enterprises, Pune\t\t\t\t\t\t\t\t\t\tAug 2015- May 2016 Business Analyst  Project Description: The project was to replace manual hand written inventory registers with electronic inventory management system. Aim of the project was to reduce the manpower and time required to manage the inventory manually. The enhanced system eased the management process effectively and efficiently. Responsibilities: Worked with different business users to develop Vision Document and Business Requirement Specifications and gathered Business and Functional Requirements.  Documented the AS-IS Business Workflow adhering to UML standards. Participated in JAD Sessions for gathering requirements from SME’s. Played the role of a Facilitator as well as Scribe in the JAD session Documented Meeting Minutes from the JAD Session as well as responsible for getting a sign-off on them from the JAD participants. Followed a structured approach to organize requirements into logical groupings of essential Business Processes, Business Rules, Functional and Non-Functional Requirements. Identified Use cases from the Functional Requirements and wrote Use Case Specifications and created “TO-BE Business Process Workflow” diagrams (Activity diagrams) in MS VISIO. Created Use Case Diagrams using MS VISIO in order to show the interaction between the Actors and Use Cases as well as showing the relationship between the Use Cases. Managed all the requirements and making requirements available to all team members. Wrote Test Cases and walked the QA team through the Test Cases to make sure they understood them properly. Maintained a Traceability Matrix to ensure that all Functional Requirements are addressed at the Use Case Level as well as the Test Case Level. Performed Functional and GUI Testing to ensure that the user acceptance criteria is met. Co-coordinated the UAT with the SME’s to make sure that all the Business Requirements are addressed in the application. Dexpert Systems Pvt Ltd, Pune\t\t\t\t\t\t\t\t\tMay 2014- June 2015 Jr. Business Analyst Project Description: The project was to develop a back end tool that could handle customer order management system. It provided the user the ability to create new orders, update orders, cancel orders . Responsibilities: Participated in interaction with clients to assess needs, identify key challenges, and define project scope. Supported in gathering Business Requirements from users and used Requisite Pro for documenting the requirements. Participated in Business Requirements, Functional and Technical meetings with Business groups. Involved in identifying Use Cases, Actors and writing Use Case Narratives. Created Use Case Diagrams and Activity Diagrams using MS Visio. Attended meetings with QA team members for SME in order to deliver quality documents.  "}