{"text": "Name: emma emma E-Mail: emma.emma@gmail.com Address: Houston, United States Github: https://github.com/emma LinkedIn: https://linkedin.com/emma Phone No. 358707993199 PROFESSIONAL SUMMARY: Five years of experience as a Business System Analyst in Healthcare domain. Experienced in defining business processes, identifying risks, base-lining acceptance criteria, and deliverables. Expertise in various SDLC methodologies like Agile, Waterfall and RUP Experienced in manual as well as automation testing of both web based and client based applications on Windows and UNIX environments. Excellent knowledge of EDI transaction files such as 270/271, 276/277, 470, 835, 820, 837, and 834. Extensive experience on working with ICD 9 and ICD 10 and adept understanding of professional, institutional PX/DX relationships. Good working knowledge of XML. In debt understanding and experience in data mapping and ETL process.  Thorough understanding of HIPPA standards, compliance issues, privacy policy, opts in/opts out policy. Rich experience with various modules of FACETS like membership management, premium billing, enrollment, claims processing & adjudication, coordination of benefits administration. Experienced in writing Test Plans and Test Cases. Experienced in testing the HIPPA EDI transactions X12, 834, 820, 837/835, 276/277, 273, 270/271 according to the requirement’s test scenarios. Considerable knowledge in the analysis, design, business processes, data modelling and application development. Applying Unified Modelling Language (UML), and implementation of performance measures. Experienced working with FACETS 4.71 & 5.0 claims processing. Adapt at transforming requirements into Business Requirement Document (BRD), Functional Requirement Document (FRD) and Software Requirement Specification (SRS). Experienced in designing business models using Business Intelligence, Use Case models, Workflow models, Analysis models, Activity diagrams, Sequence diagrams and Collaboration diagrams. Acted as liaison between management and development team for requirements. Experience with Quality Center (QC). Knowledge of healthcare Products and Guidelines. Worked in compliance with HIPPA guidelines. Experienced in working on Version 5010 – revised HIPPA transaction standards & prerequisite for ICD-9, ICD-10 and EMR/EHR. Extensive experience in reporting, data mapping using SQL across databases (Oracle and Teradata) and running ad-hoc queries.   Good knowledge of Web testing using SOAP UI Proficient in conducting Functional and User Acceptance Testing. Excellent analytical skills coupled with interpersonal, communication, presentation, and self- organizing skills, assertive and a committed team player. Experience in UNIX shell scripting and configuring cron-jobs for Informatica sessions scheduling.  Involved in gathering and testing requirements from BRD’s and specifications. Performed GAP analysis to determine the “As is” and “To be” situation. Coordinated and facilitated JAD session between the test team and application development team members to identify and resolve defects identified by the test team. Participated in Walkthroughs and meetings with development team. Very creative, spontaneous, self-starter with very good oral and written communication skills. I am very capable in forming and maintaining positive and productive working relationship with team members Experienced in preparing for elicitation. Conducted, documented and confirmed elicitation results Knowledgeable in conducting Impact analysis in other to determine the effect of a change due to changes in requirements or process of a system. Knowledgeable in Medicare and Medicaid healthcare plans. Capable of managing multiple projects simultaneously. Knowledgeable using SAS tool. SKILLS: Project Management: Microsoft Office Suite (Microsoft Word, Excel, PowerPoint)  Databases: MS SQL, MS Access, Oracle. Languages: SQL, Visual Basic.  Methodologies: SDLC, RUP, UML, CMM. Testing Tools: Quality Center, ALM, and Test Director.  Operating System: Windows 95/98/2000/XP/Vista/NT, Unix. Change Management: Rational ClearQuest.  Business Modeling Tool: MS Visio, Rational Rose. EXPERIENCE: Cognosante, McClean, Virginia                             \t\t\t\t\tOctober 2014 - Present Business System / EDI Analyst Cognosante is a healthcare subject matter expert and have provided consulting IT, and BPO services to healthcare organization for over 25 years. The project involved EDI 837 verification and validation of the claim transaction codes/information and the integration of subscriber information for timely EDI 835 payment advice or remittance. Responsibilities: Experienced analyzing and verifying subscriber information on 837 file. Revised HIPAA transaction standards & prerequisite for ICD-9, ICD-10.  Worked with Facets 4.71 & 5.0 claims processing. Identified and verified Institutional and Professional codes accordingly. Verified and validated Provider I.D, Subscriber/Member I.D and Payer I.D. Worked with other team members for proper time management and delivery accordingly. Worked according to HIPAA privacy policy. Ensured CMS rules and regulations are applied accordingly. Verified and validate premium payment accordingly. Knowledgeable working with different modules of the Facets. Verified PX and DX relationships. Mapped ICD-9 to ICD-10 codes (Forward mapping). Coordinated, facilitated and participated in walkthroughs and meetings. Data mapping, logical data modeling, used SQL queries to filter data.  Used UNIX scripts to check active directory before doing clean up in the own environment.  Thorough understanding and application of HIPAA standards to work within different modules.  Analyzed data architecture.  Environment: MS Office, Agile, Rational Rose, MS VISIO, UML, SQL, Oracle, Business objectives, SQL, UAT, XML, UNIX. Celtic Health Insurance, Chicago, IL\t\t\t\t\t\tJanuary 2013 – August 2014 Business System Analyst Re-engineering suite of Medicaid management products and creation of a core application called Enterprise. Worked for the team that is responsible for receiving, documenting, tracking and addressing the problems encountered by the customers of Flagship software product EPM (Enterprise Practice Management) while generating 837 Professional, Institutional, and Dental claims, Functional Acknowledgement 999, Claim Status Inquiry/Response 276/277 Unsolicited for their destination direct Payers or Clearinghouses. The product was also integrated with Trizetto's FACETS application for Claims processing. \n Responsibilities:  Facilitated Joint Application Design (JAD) sessions to collect requirements from system users and prepared business requirement that provided appropriate scope of work for technical team to develop prototype and overall system.  Involved in gathering, documenting and verifying business requirements.  Involved in requirement gathering phase (Provider, Claim components and HIPAA)  Met with report users and stakeholders to understand the problem domain, gathered customer requirements through surveys, interviews (group and one-on-one) along with JAD sessions.  Involved in understanding the current business process, defining scope of the project along with position statement.  Worked on the migration process from X12 4010 to 5010.  Wrote BRD, FRD, use cases, test scenarios, test cases for testing the functional requirement.  Implemented automated COB processing of Medicare claims into FACETS  Tested the existing ICD 9 and newly loaded ICD 10 codes for Medical Necessity,  Validated business rules and all artifacts with users, got approval and sign off.  Identify processes and systems to enable to trade files with non ICD 10 complaint trading partner.  Followed Unified Modeling Language (UML) methodology using and Rational Rose to create/maintain: Use Cases, Activity Diagrams, Sequence Diagrams, and Collaboration Diagrams.  Experience with Trizetto FACETS System implementation, Claims and Benefits configuration set-up testing, Inbound/Outbound Interfaces and Extensions, Load and extraction programs involving HIPPA 837 and proprietary format files and Reports development.  Set claim processing data for different FACETS Module  Assisted Design Team in preparing SRS, Software Design Document (SDD), User Interface Design, Application Architecture & Database Modeling.  Helped in project testing efforts for doing integration tests, regression tests and user acceptance tests.  Mapping of ICD 10 codes to procedure and diagnostic codes in IDX,  Worked on Data mapping, logical data modeling used SQL queries to filter data within the Oracle database tables.  Made sure that the systems complied with the rules of HIPAA and CFR Part 11.  Documented the dimensional models of ETL system.  Developing and executing SQL queries against data warehouses to support data mapping and ad-hoc analysis.  Led the testing efforts of the data marts in development, coordinated moving/setting up of processes in dev/qa/production. Worked with QA team and UAT team to go over the various test scenarios for different types of loads in the data marts.  Used SQL to test various reports and ETL load jobs in development, QA and production environment  Environment:  Java, MS Office Tools, Windows 7, MS Project, RequisitePro, Rational Rose, Clear Case, MS PowerPoint, MS-SharePoint, MS-Word, MS-Excel, IBM Process Modeler,UNIX, HIPAA 4010-5010, FACETS 4.21/4.31/4.6 Health Alliance Plan Corp, Detroit, MI\t\t\t\t\tDecember 2011 –December 2012 Business System Analyst As a BA on various applications that aimed at better integrating online account services which served in helping members with information and resources and to assist them in making better informed decisions about their Health care which also gives information about their billing. Also been involved in E-care a web-based technology uses databases to provide an extremely cost effective tool to validate patient demographics and verify insurance eligibility in real-time using EMR.  \nResponsibilities:  Identified and involved all key stakeholders, contributors, business, operations and technical resources that must participate in a project and ensured that contributors are motivated to complete assigned tasks within the parameters of the project plan.  Analyzing the Facets Requirements and thus conducting gap analysis.  Conducting business validations, covering the following deliverables: FACETS Providers, Facets Claims and Facets Membership and Operational reports.  Experience of Facets in Billing Entity, Premium Rates, Product Billing Component, Billing Group, Fees and Discounts, Adjustments, Claims, Provider, Member.  FACETS UI Extensions, Inbound batch interfaces and reports  Involved in FACETS Implementation, involved end to end analysis of FACETS Billing, Claim Processing and Subscriber/Member module.  Worked on EMR to cut down paper work and also get perfect information about customer's hospital and doctor surgery.  Design, analyze and performed Integration and wrote System requirements on different leading health care software's such as FACETS.  Played an active role in gathering, analyzing, and writing business requirements.  Translated the business needs into system requirements and communicated with the business on a non-technical level  Assisted in building a business analysis process model using Visio.  Documented the Functional Specifications Document using UML and Visio.  Created use cases using Visio and involved in managing the functional requirements life cycle  Involved in User Acceptance testing.  Responsible for creating business flow diagrams using MS-Visio.  Created product documentation, including online help, printed user manual, and training materials.  Used quality center for defect management and defect rectification. Environment: Oracle, UML, Requisite Pro, MS-Visio, Windows XP, Linux, MS Office. EDUCATION: Bachelor’s Degree."}