{"text": "Name: barbara barbara E-Mail: barbara.barbara@gmail.com Address: Belo Horizonte, Brazil Github: https://github.com/barbara LinkedIn: https://linkedin.com/barbara Phone No. 524598691787        Six plus years of diversified professional experience interacting with Business Stakeholders to gather and analyze the requirements. Expertise in defining the requirements with excellent communication and interpersonal skills with clear understanding of business and ability to work as part of a team. PROFESSIONAL SUMMARY Business analyst with more than 6 years of experience in Finance and Retail domain with excellent analytical skills. Extensive experience in Software Development Life Cycle (SDLC) phases including Requirement Gathering, Business Analysis, Design and Testing. Experience in Agile and Waterfall Models of SDLC. Lead JAD sessions with Business Stake holders and identify and create user stories, process flows. In-depth knowledge and experience creating Business Process Flows, Use Cases, functional requirement gathering and documentation. Experience in deploying Remote Deposit Capture Solution for Small Businesses. Hands on experience with Microsoft Dynamics AX 2012 R3 Enterprise Resource Planning system  Broad knowledge on source to target data mapping, data modeling and SQL query Experience with Microsoft TFS, JIRA requirement management tools Experience working on SharePoint and Confluence content management applications Hands on Experience with tools like Microsoft Visio, Lucid Chart and Axure RP. Ability to create use case, activity diagram, Entity Relation diagram and wireframes and Screen Mockups Excellent written and verbal skills for coordinating project tasks and activities with the team Ability to perform with minimal supervision, team player, mentor and problem-solving skills   TECHNICAL SKILLS PROFESSIONAL EXPERIENCE: BB&T, Winston-Salem, North Carolina \t\t\t\tMAY 2017 to Present Business Analyst Client: BB&T Bank is one of the largest banks in the United States head quartered in North Carolina offering Commercial Banking, Mortgages, asset Management, Securities brokerage and insurance products and services. Project: Implementation of Remote Deposit Capture (RDC) solutions functionality for small business which saves time, increases accuracy and enable small business customers to get their checks directly into their bank account using desktop and eliminating physical drive to the bank or ATM. Responsibilities: Perform analysis of business issues, provide recommendations for possible solutions, work with Business users and IT project teams to drive decision making and define requirements for application development, ensuring that business needs are being met. Conducted Scope Analysis, Stakeholder Analysis, GAP Analysis, and Traceability Matrix, and used MS Visio for Business Process Modeling adopting UML standards. Responsible for writing every possible scenario called Product Backlog Indexes/Items (PBI’s) in the company standard Gherkin language and then explaining and estimating the same with Developers and the QA team.  Produced and presented various Use Cases, Sequence Diagrams, Flow Charts, and Activity Diagrams.  Created Screen Mockups and wireframes using Axure RP tool. Responsible for organizing and conducting requirements elicitation meetings with various businesses and documenting them in JIRA. Collected functional requirements from clients for technology enhancement and initiatives. Performed Gap Analysis by doing an in-depth study of the current process, planned implementation actions and Change Control Process. Facilitated Agile Daily Standup Meetings and Product Backlog sprint meetings. Responsible to Verify Back End Data using SQL queries with distinct batch processes and front end .Net applications and logic validations. Responsible to advice Project Managers to glide through risk and Anticipate business needs and solutions in advance.  Tracked and triaged defects provided the severity to delivery leads and Release Management to have them fixed in a release. Worked with Product Owner to review the working demo of Potentially Shippable Product Increment (PSPI) in review meeting and helped deciding which features are done and satisfies the acceptance criteria Reviewed existing stored procedures, supported application developers by tuning SQL queries for better performance. Maintained project milestones, schedules, and project progress using MS Project. Collaborated with the Testers for designing the Scenario, writing and execution of test cases. Conducted User Acceptance Testing and verified performance, reliability and fault. Environment:  MS Visio, JIRA, Microsoft Word, Excel, Power Point, Axure RP, Microsoft Project. Citizens Bank, Glen Allen, VA\t\t\t\t\t\t          JAN 2016 to APR 2017 Business Analyst Client: Citizens Bank provides financial products and services for individuals and businesses with 181 branches in Florida, North Carolina, South Carolina, Tennessee and Virginia, offering a wide range of commercial and consumer loans and deposit products, as well as ancillary financial services. Project: Involved in providing business analysis and project management for Loan Origination System (LOS) implementation with the client to support the residential mortgage lending group including originations, processing, credit risk and compliance initiatives. Responsibilities: Gathered high level business requirements related with the Loan Origination System and broken them into functional and non-functional detail requirements. Implemented Agile Scrum methodology to transform the same into functional requirements; recorded the same in Business Requirement Document (BRD) for future reference. Conducted a GAP analysis of the user stories documented in MS TFS, and created Data Mapping document to reconcile the user stories in MS TFS to those in SharePoint. Collaborated with business users and software development team within AGILE framework to ensure rapid and successful implementation of the solution. Examined, analyzed Test plans, Use Case Model, Test procedures. Facilitated JAD sessions, capture meeting minutes, organize notes and distribute to meeting attendees included Business Representatives and various technical members. Assisted team lead in developing Requirements Traceability Matrix (RTM) to trace the relationship between business and functional requirements to test cases. Utilized Agile SCRUM methodology to develop User Stories, Product Backlog, and Sprint Backlog. Created use cases, project charter, BRD (Business Requirement Document) and FSD (Functional Specification document). Environment: Microsoft TFS, MS SharePoint, MS Visio, MS Project, Windows, SQL Server, Microsoft Excel, Microsoft Word, Microsoft Power Point. \n Wayne Fueling Systems, Austin, TX \t\t\t\t\tAUG 2014 to DEC 2015\t  Business Analyst Client: Wayne Fueling Systems is one of the leading global manufacturer and supplier of Fuel Dispenser systems, Payment terminals and Point of Sales Systems. \t\t\t\t       Project: Implementation of new Experlogix Configure Price Quote design center integration with Microsoft Dynamics AX 2012 R3. As a Business Analyst, I was responsible for the implementation of Experlogix CPQ Design Center and provide post implementation support.  Responsibilities:   As a Business analyst, I acted as the primary contact between the Business stake holders and IT Team. Follow Agile/Scrum methodology to execute the project Facilitated the User Story workshops with the Business Stakeholders and documenting the epic and user stories for different modules in JIRA Lead the Daily Scrum meeting (Standup meeting every morning). Participate in the sprint retrospective meeting and identified various process improvements. Work in tandem with the product owners to groom the product backlog each sprint and prioritize the user stories.  Participate in the design review for each of the sprint and provided the feedback to incorporate changes. Involved in the review of the existing old IBM Mac Pac and stimulating the product configuration in the new Experlogix software. Created the activity diagrams, use case diagrams, business flow diagrams for the required user stories using the tools like Lucid Chart, Microsoft Visio, and Mockup Screens/wireframes in Axure RP etc. Involved in entering the SQL query in Experlogix table/list module for returning value from the lookup table for a given condition. Ensure deliverables have been thoroughly tested and trace back to the requirements. Create and share RTM (Requirement Traceability Matrix) with the product owners at the end of every sprint. Identified issues/defects and logged them in JIRA. Facilitated training and support to new users for creating categories, options, properties, SQL queries and formulas in Experlogix Design Center  Involved in UAT acceptance testing and support throughout the defect triage life cycle. Involved in post operations and implementation process.  Environment: AGILE, MS Office Suite, Microsoft Dynamics, SQL, JIRA \n TD Bank, Mount Laurel, NJ\t\t\t\t\t\t\tJAN 2013 to JUL 2014\t Business Analyst Client: TD Bank is a US National Bank and a subsidiary of Canadian multinational Toronto-Dominion Bank, headquartered in Cherry Hill, New Jersey Offering Financial services to the customers.  Project: The project was about web application of Online Account Management to ensure that the registered customers had online access to their accounts. When the customer logged on to the website, they could view the account details, made transfers, e-bill payment and communicate with Customer Service. The website also had a Customer Service Message Center where the customer could report any problems. The web application used extensive security features to safeguard the privacy and interests of customers and to check and verify the information provided by the customers.  Responsibilities: As a Business Analyst, I acted as the primary contact between the Business users and the development team. Performed Document Analysis and came up with the AS IS process and the TO BE Process and arrived at the GAP Analysis of the system. Conducted user interactions and JAD sessions to get an understanding of client business process. Gathered primary input/output requirements and modeled the processes using Rational Rose. Responsible for creating the Business Requirements Document (BRD) and Functional Requirement Document (FRD). Managed all the requirements in Rational Requisite Pro, making requirements available for all team members. Interacted with the project team to define system objectives and scope, and identify constraints and the measures of success for the Corporate Banking system to be developed.  Designed and created Business Process Model (Activity diagrams, Sequence diagrams and Collaboration diagrams) using Rational Rose tool. Ensured application forms and reports (UI) followed client’s development standards and guidelines in terms of usage, naming conventions etc. Developed documentation of complex business logic for internal business users by analyzing SQL queries and reporting solutions. Responsible for writing Business Use Cases, Business Rules, logical analysis and change management of requirements. Prepared RTM (Requirement Traceability Matrix) and made sure that the no requirement is left untested. Designed the test plan and worked with the QA team to implement and monitor the entire QA process. Environment: Rational Rose, Rational Requisite Pro, Windows, SQL, MS Access. Microsoft Excel, Microsoft Word, Microsoft Power point."}