{"text": "Name: evelyn evelyn E-Mail: evelyn.evelyn@gmail.com Address: Riyadh, Saudi Arabia Github: https://github.com/evelyn LinkedIn: https://linkedin.com/evelyn Phone No. 312918276110 CAREER SUMMARY An IT professional with experience as a Business/Data Analyst/Data Modeler with the strong ability to gather and document Business Requirements, proficient in SDLC life cycle, understand the workflow concept, ability to gather and document the 'As-Is' and 'To-Be' processes. A Certified Scrum Master expertise in Waterfall, Agile (Scrum) and various Software Development Life Cycle (SDLC) processes and methodologies.  Expert at interacting with stakeholders, Subject Matter Experts (SMEs) and end-users to understand, analyze, communicate and validate requirements using Joint Application Design (JAD), Joint Application Review (JAR) sessions.  Introduced Tableau to Client to produce different views of data visualizations and presenting dashboards on web and desktop platforms to End-user and help them make effective business. Conducted Gap Analysis, created Use Cases, work flows, screen shots and Power Point presentations for the various applications. Extensive experience with EDI Transactions such as 837, 834, 276, 277, 835, 999, 4010 and 5010 HIPAA files. Experience in training Business users on Tableau through online and in-class sessions. Experienced in bug tracking, management and using HP ALM/Quality Center (QC) and JIRA for project reporting.  Experience in Business Intelligence (BI), Business Data warehousing tools and SaaS. Hands on experience with Trizetto FACETS, claim processing systems, Medicare and Medicaid Service. Experience in Data modeling for Data Warehouse/Data Mart development, Data Analysis for Online Transaction Processing (OLTP) and Data Warehousing (OLAP)/Business Intelligence (BI) applications. Well-versed in writing SQL Queries to perform end-to-end ETL validations and support Ad-hoc business requests.  Created, documented and maintained logical and physical database models in compliance with enterprise standards and maintained corporate metadata definitions for enterprise data stores within a metadata repository. Established and maintained comprehensive data model documentation including detailed descriptions of business entities, attributes, and data relationships. Expertise in writing Use Cases and producing Use Case Model, Analysis model, Behavior diagrams (Sequence diagrams, Collaboration diagrams) and Class diagrams & Business process flow diagrams using MS Visio. Hands on experience in creating Requirement Traceability Matrix to list all the requirements and \nensured all technical requirement documents like Use Cases, Test Cases are written and compiled  Proficient in creating various documents like Business Requirements Document (BRD), Functional Requirement Document (FRD) and Functional Specification Document (FSD). Interacted with client regarding project status and feedback on UAT and discussed the information with the development team.  Have in-depth knowledge of Software Development Life Cycle (SDLC) methodologies, vast experience working in Agile/Scrum, Waterfall, methodologies.  Performed in depth gap analysis to analyze/compare the As-Is and To-Be compatibility of existing system infrastructure with the new business requirements.  Organized weekly project status meetings and task review meetings, documented and disseminated meeting minutes effectively.  TECHNICAL SKILLS PROFESSIONAL EXPERIENCE TeamHealth, Knoxville, TN \t\t\t\t\t   \t\t         \t\tDec 2018 - Present Data Analyst/Modeler Worked on the Recruiting Excellence project. The goal of this project is to develop a data warehouse to support various reports for the board and Executives to replace the manual reports being currently produced.  Reports include:  1. Recruiter accountability (analyze recruiter performance over a period of time) 2. Premium labor (Track the premium labor cost being incurred and at what facilities) 3. Contract performance (Provider and Facility contract performances) Responsibilities: Translate the data requirements into specifications for development. Profile the data from various sources such as SQL Server, Oracle and Flat files to determine the suitability for the solutions. Conducted Stand-up meetings to gather capture goals, accomplishments and obstacles of the project team members.     Collaborated with business personnel, business Project Managers, IT Project Managers, third party vendors, Offshore team and IT solution delivery personnel. Created comprehensive business process models of current state and future state capturing pertinent process step details in design documents. Performed related duties as assigned including training, technical documentation, vendor management and administrative support. Performing detailed analysis, identifying trends and patterns in data. Worked with the ETL specialists to understand logic in transformation involved in Source to Mapping documents. Performed data mapping to map the ETL process for the creation of data marts. Perform detailed analysis to identify the trends and patterns in the data. Created DDL scripts for implementing Data Modeling changes. Created ERWIN crystal reports Perform root cause analysis on data anomalies and working data stewards to resolve issues. Provided regular and multiple demonstrations of Tableau functionalities and efficient data visualizations approaches using Tableau to the management as well as the client. Involved in Tableau dashboard performance optimization for better and more efficient reports. Installed, upgraded, and maintained Tableau Server when required. Wrote and executed SQL queries to verify that data has been moved from transactional system to DSS, Data warehouse, data mart reporting system in accordance with requirements. Developed logical and physical data models that capture current state/future state dataelements and data flows using Erwin. Tested, Cleaned, and Standardized Data to meet the business standards using Execute SQL task, Analyzed the data using statistical features in tableau to develop Trend Analysis reports. Created Workflow diagrams using Unified Modeling Language (UML), Wireframes and Mock-ups for Prototypes. Development of best practices, guidelines and standards for Data Integration COE Qualifications. Work on the Logical model for the DataMart using ER Studio. Write customized macros for ER studio to standardize and speed up the modeling process. Review the logical model with the End Business Users. Generate Physical model and DDL scripts to build the DataMart on SQL Server. Write source to target mapping documents for the offshore ETL Teams. Performance QA on the ETL loading packages for the DataMart. Prepare Documentation to incorporate the DataMart in the Microstrategy Dashboard. Perform final UAT with the End Business Users. Environment: JIRA, DQ Analyzer, Oracle, SQL Server, SSIS, SSRS, Toad, SSAS, ER Studio, Erwin , Microstrategy Horizon BCBS, Newark, NJ\t\t\t\t\t\t\t\t\tMar 2017 – Nov 2018 Data Modeler / Analyst I worked as a Data Analyst on the Health care application Dashboard. Also, involved in troubleshooting and resolving errors in 834 and 820 transactions for health insurance exchanges and performing root cause analysis. The second phase of the project involved retirement of legacy databases and redesigning of all reports from single data warehousing platform and develop new reports on a single business intelligence platform. Responsibilities: Designed and developed project document templates based on SDLC- Agile/Scrum methodology. Attended Scrum meetings, which included Sprint Planning, Daily Scrums or Stand-ups, Sprint Check-In, Sprint Review & Retrospective. Wrote User stories which included the business logic, expected behavior and user acceptance criteria.  Involved in defect tracking management and used JIRA for requirements documentation. Performed as-is analysis, to-be analysis, data Analysis, Gap analysis, competitive analysis, comparative analysis, process flows and business flows.  Identified and validated business rules and data elements.  Gathered Requirement from the Client to fulfill the Application need for FACETS Implementation.  Created 837(P, I, D) claims, and maintained data mapping documents about HIPAA transactions primarily 837(P, I, D), 834, 835, 270, and 271. Worked within project team to identify and interpret state Medicaid and Medicare policies as applicable to customer defined algorithm research as well as assist with internal development of new healthcare analytics. Worked with Trizetto based software called FACETS to obtain members information.  Worked closely with business power users to create reports/dashboards using tableau desktop. Created Rich dashboards using Tableau Dashboard and prepared user stories to create compelling dashboards to deliver actionable insights. Designed and developed various analytical reports from multiple data sources by blending data on a single worksheet in Tableau Desktop. Performed data analysis task using SQL queries on Enterprise Data Warehouse (EDW) and various source systems. Created data set reports for users by writing SQL queries which then were used for UAT and defined data dictionaries for identified sources by working with data stewards and subject matter experts.  Worked with developers to create requirements and ran SQL queries to extract data from specific tables from database. Utilized advance features of Tableau software like to link data from different connections together on one dashboard and to filter data in multiple views at once. Utilize SQL server to run basic queries and obtain necessary data for Medicaid and Medicare Encounters.  Worked with FACETS software for maintaining data about the enrollment, billing and health care claims management and to store, send, receive HIPAA transactions and facilitate the administration of HIPAA privacy rights.  Analyzed SSIS packages with which data resources such as Excel, Flat file, and SQL data were imported daily. Analyzed Impact analysis when there is any change in the requirements and updated the Business Requirements Document (BRD) and Systems Requirements Specification (SRS).  Redesigned the integration between Python and MySQL to reduce time consume. Develop ETL routines using Informatica and PL/SQL in an Oracle environment  Performed data analysis and data profiling using complex SQL on various sources systems including Oracle. Involved with data model and reporting requirements for Tableau Reports with the Data warehouse / ETL and Reporting teams. Performed Data Analysis and Data Profiling and worked on data transformations and data quality rules. Developing, Designing and supporting interactive Tableau Dashboard reports. Experience with the design and development of Tableau visualization solutions. Used SOAP UI tool to test SOA based architecture application to test SOAP services and REST API. Created SQL queries to pull out data from the database. Designed and developed various analytical reports from multiple data sources by blending data on a single worksheet in Tableau Desktop. Utilized advance features of Tableau software like to link data from different data sources together on one dashboard to filter data in multiple views. Involved in Cleaning of data for reporting software and custom application usage as well as calculations in R & Python. Facilitated meetings with the technical team and client team to analyze the current process and gather requirements for the proposed process.  Analyzed Change Files of 834, 835, 820, 837 PDI, 997, 999, 270, 271 & 277 HIPAA EDI Transactions using MS Word, MS Excel.  Streamlined Claims (837 EDI X12) Migration project by gathering functional specifications. Daily and weekly status reporting to senior management. Environment: Agile (Scrum), SQL, JIRA, EDI, FACETS, EDW, ETL, Tableau, SSIS, UAT, MS Office Suite, Python, Windows WellCare, Tampa, FL\t\t\t\t\t\t\t\t\tFeb 2015 – Feb 2017 Business Data Analyst The project aimed at adding some error prompts to adjudication system and automating reports. It involved gathering requirement from the business and conducting session with ETL team to work on extraction of data for reporting purposes by end business users. Responsibilities: Gathered requirements by coordinating with external vendor, and internal team.  Analyzed Gap Analysis of the HIPAA 5010 processes to identify and validate requirements.  Coordinated JAD sessions with all the stakeholders to understand the impact of HIPAA 5010 on the existing system.  Created several SQL Server objects like Tables, Views, Queries, Stored Procedures, Functions, triggers and Indexes.  Develop various reports using Tableau such as dashboards, charts/graphs, drill-downs, drill through, sub reports and dynamic reports to meet information needs.  Created Data Mapping Document and Metadata for the Enterprise Data Warehouse (EDW). Developing Custom Report and different types of Reports, Matrix Reports and distributed reports in multiple formats using Tableau Server.  Develop advanced Tableau dashboards using multiple data sources, creating calculations, parameters, and interactive filters. Implementing Backup and Recovery Strategies based on Business requirements. Gathered requirements for \"Front End\" and for \"Core Adjudication System\" by conducting meetings and brainstorming sessions with end users and Subject Matter Experts (SMEs) and documented them using Requirement Traceability Matrix and later exporting them to Quality Center.  Prepared Business Requirement Documents (BRDs) after the collection of Functional Requirements from System Users that provided appropriate scope of work for technical team to develop prototype and overall system.  Worked in Agile process of the project management based on SDLC. Gathered requirements for ICD 10.  Develop data models for capturing current /future state data elements and data flows using Erwin Performed Data Migration from OLTP to Data warehouse environment.\t Setting up Enterprise Data Warehouse (EDW) and associated ETL service to generate business reports. Designs and develops the logical and physical data models to support the Data Marts and the Data Warehouse. Tested Group set up data updates by comparing requirements, portal updates and concurrent database and Mainframe updates. Organized requirements into High Level Use Cases and Low-Level Use Case Specifications and modeled them into UC, Activity and Sequence Diagrams using MS Visio.  Assisted the QA personnel in the creation of Test Cases using Quality Center.  Defined and analyzed test cases, test scripts, bugs, interacted with QA/ development teams in fixing errors and conducted User Acceptance Test (UAT).  Coordinated and prioritized outstanding defects and enhancement/system requests based on business requirements, allowing sufficient time frame to ensure accuracy and consider deadlines  Streamlined Claims (837 EDI X12) Migration project by gathering functional specifications. Worked with Medicare and Medicaid Encounter Pro to obtain Encounter from the main server to be submitted to Medicare and Medicaid.  Review vendor files for any errors, missing segments, and for missing data on X12 file. Ensure file has complete data before encounter can be submitted to Medicare and Medicaid.  Tracked the change requests.  Maintained and tracked the project plan using MS Project.  Daily and weekly status reporting to senior management. Environment: Agile/Scrum, HP ALM/Quality Center, SQL, EDI, EDW, Erwin Toad ETL, Tableau, UAT, MS Office Suite, Windows Verisk Health, Richmond, VA                                        \t\t\t\t\t\tJan 2014 – Dec 2014 Business/Data Analyst I worked as a Business analyst to work closely with project team to identify user's business requirements, interpret complex business needs and translate them into system requirements, write business specifications and forward to technical staff for system integration and Enterprise Data Warehouse (EDW) migration. Responsibilities: Participated in Business Modeling by documenting the needs of the Business.  Designed a new matrix covering all the conceptual parameters of the new system.  Extensive knowledge on relevant cross-industry data and messaging standard organizations and HIPAA/EDI industry-specific organizations to maintain a point of view as to the current applicability and risks associated in implementing standards or new technologies to client environment. Created class diagrams, use case diagrams and sequence diagrams to view the system from different perspectives.  Conducted on-site/web conference presentations, data conversions, system implementations and end user training.  Leverage Risk experience and business judgment to plan initiatives and accomplish enterprise- wide goals. Utilization of BPM, as-Is and To-Be modeling processes.  Used Microsoft Visio to document Use Cases, ad-hoc reports Activity Diagrams/State Chart Diagrams, Sequence Diagrams, Collaboration Diagrams.  Prepared Business Process Models that includes modeling of all the activities of the business from the conceptual to procedural level.  Performed numerous data extraction requests using SQL scripts to prepare ad hoc reports Managed, created and altered Databases, Tables, Views, Indexes and Constraints with business rules using T-SQL. Involved in designing and developing Data Models and Data Marts that support the Business Intelligence Data Warehouse. Checked the data flow through the frontend to backend and used SQL Queries to extract the data from the database. Development Life Cycle (SDLC), to create the provider portal, which allows providers to access patient information to increase convenience  Analyzed the problem domain, specified features, established baseline architecture, developed the Project plan, and risk analysis.  Research and Implementation of Web Portal and Content Management Systems  Consulting with other departments on the management of content and design of pages.  Complying with the consistent development and maintenance of the healthcare industry databases, health care insurance and health care industry related aspects with adherence to HIPAA compliances. Provide reporting to management via excel reports of workload and work completion on a daily, weekly, and monthly basis. Liaison and Coordinated in resolving HIPAA/EDI mapping issues arising from the third-party systems.  After successful development and testing of the product, participated in product release and deployment to End-User.  Worked closely with the deployment team for roll out the project - external releases, packaging, distributing, installing, user assistance, beta testing, migration of software and data.  Conducted User Acceptance Testing (UAT).  Environment: Agile/Scrum, JIRA, SQL, EDI, ETL, UNIX, UAT, MS Office Suite, Windows TMG Health, PA\t\t\t\t\t\t\t\t\t\t\tFeb 2013 – Dec 2013 Business Analyst This project was based on Implementation of the new processing system for Benefit Enrollment files, Payer and Claims along with review, design and reconfigure of the following FACETS functional areas: Enrollment, Claim, Billing, and Member Information.  Responsibilities: Responsible for checking member eligibility, provider enrollment, member enrollment for Medicaid and Medicare claims. Developed test cases and test scripts and assisted Quality Assurance activities, with system integration testing and user acceptance testing (UAT), developing and maintaining quality procedures and ensuring that appropriate documentation is in place. Responsible for the full HIPAA compliance lifecycle from gap analysis, mapping, implementation and testing for processing of Medicaid Claims Involved in testing Facets for Group Information, Enrolling Subscribers, adding members, Related Entities, Class/Plan definition, Premium Rate Tables and all. Worked on HIPAA Transactions 270, 271, 276, 277. 999, 837I/P/D and 835R Involved in claim adjudication process of FACETS application Helped in project testing efforts for doing integration tests, regression tests and user acceptance tests. Used MS Visio, MS Word, MS Excel and MS PowerPoint to develop various project deliverables Environment: Agile – Waterfall, HP Quality Center, SQL, EDI, FACETS, HIPAA, UAT, MS Office Suite, Windows EDUCATION Masters in Information Systems, Iowa State University, IA"}