{"text": "Name: frances frances E-Mail: frances.frances@gmail.com Address: Lima, Peru Github: https://github.com/frances LinkedIn: https://linkedin.com/frances Phone No. 99509220952 PROFESSIONAL SUMMARY - 6 + years of experience in IT industry as Data Scientist with strong background in Databases. Analyzed Lending Club data and used various visualization libraries/regression techniques to  classify good and bad loans Used python to extract financial data from various sources and integrated them into one  single data set Hands-on-experience with pandas, SciPy and Numpy packages in Python for data analytics Large data sets manipulation, data cleaning, quality control, and data management  (Python, R, SQL) Worked with various datasets and analyzed data using python/R and used different regression models for datasets Experience with Statistical analysis. Stat packages mainly in R/python Hands-on-experience with pandas, SciPy and Numpy packages in Python for data analytics Large data sets manipulation, data cleaning, quality control, and data management (Python, R, SQL) Worked with various datasets and analyzed data using python/R and used different regression models for datasets Experience with Statistical analysis. Stat packages mainly in R/python Above 3+ years of experience as Data Scientist with experience in Data Mining,  Statistical Analysis, Exploratory Analysis and Machine Learning with different forms of data. Experience writing queries on large data sets and strong aptitude on learning new technologies Proficient in Tableau data visualization tool to analyze and obtain insights into large datasets,  create visually compelling and actionable interactive reports and dashboards Integrated python with tableau using TabPy for using python scripts in calculated fields of  Tableau, integrated R with Tableau using Rserv for writing R scripts in calculated fields of Tableau Deep experience with design and development of complex Tableau visualization solutions Experience in writing Sub Queries, Stored Procedures, Triggers, Cursors, and Functions on  MySQL and PostgreSQL database. Created a Python/Django based web application using Python scripting for data processing,  MySQL for the database, and HTML/CSS/JQuery and High Charts for data visualization of the served pages. Aware of SDLC, Waterfall, Test-driven development (TDD) and Agile/Scrum Methodologies. Well experienced on web development using Java and J2EE technology stack. Used Python libraries like NumPy and SciPy to filter unstructured data. Used combination of Python and R for predictive analytics. Excellent skills in System Analysis, Documentation and Designing the Technical Specifications for Business Processes Proficient in creating customized and interactive Tableau dashboards using multiple data sources - Oracle, SQL Server, Netezza, SAS datasets, CSV files & TDEs Excellent understanding of concepts like Star-schema, Snowflake schema using fact and dimension tables and relational databases (Oracle, SQL), Teradata, MS Access and client/server applications Used Alteryx to provide analysts the unique ability to easily prep, blend, and analyze all of their data using a repeatable workflow.  Combined multiple data sources using blending in Tableau to keep track of sensor data, operator inputs, and real-time systems, all in one dashboard. Identified Business Data and requirements and modified it to logical data models. Skilled in accessing and transforming massive datasets through filtering, grouping, aggregation, and statistical calculation.  Good experience in dashboard design using large data sets. Experienced in creating different visualizations using Bars, Lines, Pies, Maps, Scatter plots, Gantt charts, Bubbles, Histograms, Bullets, Heat maps and Highlight tables Expert in developing user objects (filters, prompts, metrics, Sets and Groups, Calculated Fields) to develop reports. Created ad-hoc reports based on business needs Worked on creating interactive, real-time dashboards using drill down and customization. Created incremental refreshes for data sources on Tableau server Scheduled reports to create an Instance and used instance manager to feed the current data, to optimize the performance of data feeding the reports. Designed the architecture of Tableau security by customizing the access levels and creating various user groups by assigning row and column level security at application level, folder level and user level. Experienced in Trouble Shooting, Performance tuning of reports and resolving issues within Tableau Server and Reports Established best practices for Enterprise Tableau Environment, Application Intake and Development processes Extensive experience in production support and issue resolution that includes debugging of Reports and related issues, dashboard design issues, archiving and performance issues. Good understanding of different programming languages such as Java and python Education:     Bachelor of Computer Science and Engineering, India  \t          Master’s in Information Management, MD, USA TECHNICAL SKILLS WORK EXPERIENCE MEDSTAR, Washington DC\t\t\t\t\t              Aug 2018 – Present Data Scientist Used PyCharm IDE and installed various libraries to connect with SQL and other tools through python Worked in MySQL database on simple queries and writing Stored Procedures for normalization and renormalization. Involved in reviewing business requirements and analyzing data sources from Excel/Oracle SQL Server for design, development, testing, and production rollover for reporting, analysis and predicting data in projects. Develop Machine Learning Algorithms to increase revenue recognition by predicting and  reducing supply chain related product readiness delays Utilized oversampling & under sampling techniques which led to a significant improvement in our testing results Deployed my project on AWS, connected RDS(SQL) to AWS using python Worked with Pandas/Numpy to analyze the data and infer from the Seaborn visualization Used PostgreSQL for the DB and various python libraries for data analysis and predictive modeling Formulated procedures for tableau with data sources and delivery systems integration of  Interacted extensively with end users on requirement gathering, analysis and documentation Used Python to create regression models, clustering algorithm and other data mining methods to explore the fast growth opportunities of the clients Classified customers by RFM analysis, clustering and regression model with R, selected customers with high value and improved their retention rate by sending ads and coupons Worked extensively with Advance analysis Actions, Calculations, Parameters, Background images, Maps.  Created Ad-hoc SQL queries to fetch needed data for data analysis and reporting purposes Worked Closely with different Product owners to get more business insights Designed and Optimized Data Connections, Data Extracts, Schedules for Background Tasks and Incremental Refreshes for the weekly and monthly dashboard reports on Tableau Server. Expert knowledge on Trend Lines, Statistics, and Log Axes. Used Groups, hierarchies and sets to create detail level summary reports and dashboards using KPI's. Experienced in SQL performance tuning and writing complex SQL queries. Proficient in creating New Schedule's and checking the task's daily on the server. Worked extensively with Advance Analysis Actions, LODs (FIXED, INCLUDE, EXCLUDE) Calculations, Parameters, Background images, Maps. Involved in Trouble Shooting, Performance tuning of reports and resolving issues within Tableau Desktop/Server Reports. Worked with AWS Redshift directly from Tableau to access cloud data warehouse and quickly perform visual analysis. Experienced in planning and implementation of overall analytics and business intelligence strategy Experience in integrating Alteryx and tableau, publishing data extracts from Alteryx to tableau server, Pulling data from Alteryx App on server though Web data connector into tableau Desktop. Developed complex T-SQL codes such as Stored Procedures, functions, triggers, Indexes and views for various applications. Excellent team player USDA, Beltsville, MD\t\t\t\t\t\tSept 2016 – July 2018 Data Scientist Responsibilities: Designed, developed and deployed Tableau reports on Tableau Desktop 10.3 and 10.4 Experience in implementing python alongside using various libraries such as matplotlib  for charts and graphs, MySQL db for database connectivity, PySide, Pandas data frame, Numpy Wrangled data, worked on large datasets (acquired data and cleaned the data), analyzed trends by making visualizations using matplotlib using Python Collaborated with data engineers, wrote and optimized SQL queries to perform data extraction from SQL tables Performed data integrity checks, data cleaning, exploratory analysis and feature engineer using R and python Gathered user requirements, analyzed and designed software solutions based on the business requirements. Experienced in creating Prototypes, Wireframes and Mock-Up Screens to visualize Graphical User Interface (GUI). Gained insights and verified the validity of multiple datasets by mining data and executing structured queries in pandas. Implemented sentiment analysis using Text Blob and Vader Sentiment to determine trends in USDA dietary guidelines. Completed ad-hoc projects relating to data investigations, follow-ups on analysis results, or other client requests. Built web scrapers using restful API’s to collect raw data. Created visualizations in Tableau to view temporal trend of agriculturally relevant occurrence data. Modeled User filters to enable the row level security in tableau within client's premises. Assembled Advanced Analysis actions and created Interactive Dashboards using Tableau 10.4 Involved in project status meetings, QA review meetings, and System Test meetings. Mastered the ability to design and deploy rich Graphic visualizations with Drill Down and Drop-down menu options and Parameters using Tableau. Experienced in creating Schedules for dashboards to refresh automatically. Worked on troubleshooting issues that are encountered during the testing cycles. Accessed and transformed massive datasets through filtering, grouping, aggregation, and statistical calculation. Strong understanding of advanced Tableau features including calculated fields, parameters, table calculations, row-level security, joins, data blending, and dashboard actions. Performed security implementation to Tableau server reports based on user community. Sapient, India\t\t\t\t\t\t   \t\t\tMar 2015 – July 2016 Data Scientist Responsibilities: Created Relationships, actions, data blending, filters, parameters, hierarchies, Level-of-Detail (LOD), calculated fields, sorting, groupings, live connections, and in-memory in tableau 8.2. Wrangled data, worked on large datasets (acquired data and cleaned the data), analyzed trends by making visualizations using matplotlib using Python Collaborated with data engineers, wrote and optimized SQL queries to perform data extraction from  SQL tables Performed data integrity checks, data cleaning, exploratory analysis and feature engineer using R and python Used R, Python and tableau to develop variety of models and algorithms for analytic purposes  Analyzed large sales data of Cisco devices and used R for predicting the future sales using regression models  Created effective visualizations using tableau and investigated a dataset to create data visualizations  to tell trends and patterns in data. Used Regression algorithms and made predictions to clean the outliers from the dataset Designed business intelligence dashboard using Tableau Desktop and published the same on Tableau server, allowing executive management to view current and past performance sales trends,  forecast sales and various KPI's like year over year percentage change in sales, Sell through Rate,  Gross Margin and Items per purchase. Worked closely with Tableau support team during tableau server upgrades to 9.2 Migrated all the reports from tableau 8.2 to tableau 9.0 and published them on the server.  Adopted Tableau 9.2 new features into my current work environment. Hands-on experience in assisting internal users to create and modify worksheets and data visualization dashboards. Created users, groups, projects, custom analysis and visually effective projects and dashboards to  present to Senior Level Executives.  Good SQL reporting skills with the ability to create SQL views and write SQL queries.  Identified opportunities to develop forecasts, statistical models, segmentation schemes, and  data-driven analyses to drive marketing and merchandising efforts around customer acquisition and conversion.  Involved as a technical expert providing input to application design regarding performance tuning and administration requirements.  DELLOITE, INDIA\t\t\t\t\t\t\t\tMay 2013 – Mar 2015 Data Analyst Responsibilities: Involved in reviewing business requirements and analyzing data sources form Excel/Oracle SQL Server for design, development, testing, and production rollover for reporting and analysis of projects within Tableau Desktop 7.3 and 8.0. Applied logistic regression and various classification techniques to predict credit scores and  validated the model. Researched various machine learning algorithms such as Decision trees, Naïve Bays, SVM, KNN and applied to predict loan acceptance to improve the previous model and increase the prediction accuracy. Validated the results using the cost matrix which is calculated based on cost incurred due to false positives and false negatives. Used Python and R Markdown to present the reports with the ROC plots, graphs and results of the models. Developed, recommended and assisted with the implementation of business strategies to manage credit risks, increase revenue and reduce exposure to credit losses. Built linear regression model to predict the interest rate for a loan application. Worked on a huge transactional data set of 40 million rows and performed exploratory data analysis. Converted continuous variables to dummy variables for performance improvement. Created report schedules, data connections, projects, groups in Tableau server. Created incremental refreshes for data sources on Tableau server. Created views in Tableau Desktop that were published to internal team for review and further data analysis and customization using filters and actions. Involved in creating interactive dashboard and applied actions (filter, highlight and URL) to dashboard Created and modified Interactive Dashboards and guided navigation links within  Interactive Dashboards. Created reports for users in Tableau by connecting to various data sources (MS SQL Server,  Oracle, MS Excel, Netezza, .CSV). Created Heat Map showing current service subscribers by color that were broken into regions allowing business user to understand where we have most users vs. least users. Converted charts into Crosstabs for further underlying data analysis in MS Excel. Created Bullet graphs to determine profit generation by using measures and dimensions data from Oracle SQL Server and MS Excel. Blended data from multiple databases into one report by selecting primary keys from each  database for data validation. Reviewed complex SQL queries and edited inner, left, and right joins in Tableau Desktop by connecting live/dynamic and static datasets. Well versed with the usage of variables to make the packages dynamic and scheduled the  package in SSIS (sequential scheduling). Migrated data using different SSIS packages and integrated data into the data warehouse. Developed story telling dashboards in Tableau Desktop and published them on to Tableau Server which allowed end users to understand the data on the fly, with the usage of quick filters for on demand information. Monitored VizQL server, Application Server and data server activity to track performance  and system stability. Scheduled data refresh on Tableau Server for weekly and monthly increments based on business change to ensure that the views and dashboards were displaying the changed data accurately. Tested dashboards to ensure data was matching as per the business requirements and if  there were any changes in underlying data. Participated in meetings, reviews, and user group discussions with stakeholders and business groups."}