{"text": "Name: dorothy dorothy E-Mail: dorothy.dorothy@gmail.com Address: Xinyang, China Github: https://github.com/dorothy LinkedIn: https://linkedin.com/dorothy Phone No. 876702310265 Summary of Qualifications: 7 years of extensive experience as EDI Analyst with solid understanding of Business Requirement Gathering, Business Process Flow and Business Process Modeling. Exposure to Healthcare, Insurance and Finance business domains. Worked on HIPAA compliance and experience in designing the healthcare transactions to be HIPAA 5010 compliant Expertise in EDI and HIPAA Testing Privacy with multiple transactions exposure such as 837 for submitting claims, 835 for payments, 834 for benefit enrolment, and 820 for premium payments to insurance products, 270, 271 for healthcare benefits and eligibility, 276, 277 for claims status and 278 for transmitting health care service information. Experience in working with QA team to develop the Test plans, Test scenarios, Test procedures, and Test cases to ensure adequate testing of software both before and after completion Worked on various EDI X12 transaction sets 837 I/P, 275/276, 270/271, 834 etc Extensive experience on HealthCare Industry including supporting efforts including response to RFP, Requirements Analysis Documentation, General System Design and Detailed System Design Documentation, conducting JAD and JAR sessions of project life cycle.  Extensive knowledge of Object Oriented Analysis and Design (OOAD) using Unified Modeling Language (UML), Rational Unified Process (RUP), Waterfall model, Rational Rose, Requisite Pro, Rational Clear Case and MS Visio. Worked on 837 (I, P, D), 834, 835, 820, 270, 271, 276, 277, 278 transactions and BRCs of the transactions. Good Experianced with HEDIS (Health effectiveness data and Information Set. Experienced in interacting with business users and executives to identify their needs, gathering requirements and authoring Business Requirement Documents (BRD), Use Case Diagrams, Activity Diagrams and Sequence Diagrams using UML modeling. Experienced in facilitating and conducting Joint Application Development (JAD), Rapid Application Development (RAD) and Joint Requirement Planning (JRP) sessions, interviews, workshops and requirement elicitation sessions with end-users, clients, stakeholders and development team. Experienced in Business Analysis, SWOT Analysis, Gap Analysis, Cost-Benefit Analysis, Risk Analysis, Disaster Recovery Planning, Return On Investment (ROI) Analysis, Testing and Project Planning. Extensive knowledge of testing large application, best practices and concepts of testing facets applications Excellent knowledge of HIPAA standards, EDI (Electronic data interchange) Transaction syntax like ANSI X12, Implementation and Knowledge of HIPAA code sets, ICD-9, ICD-10 coding and HL7. Good knowledge of Health Insurance Plans and experienced in determining the  Facets membership eligibility, billing experience within life and disability in health plans with thorough understanding of CPT coding, CMS-1500 claim forms and reimbursement forms. Experienced in working with various departmental teams, developing interactive relationships with business and IT colleagues, having a thorough understanding of the constraints, needs, and perspectives of both the business users and the technical team.   Experienced in training and mentoring team members with product knowledge and business processes. Strong work ethic, taking ownership of all duties and responsibilities and meeting management objectives. Strong business acumen, analytical, problem solving, interpersonal and presentation skills.   Excellent written and oral communication skills to keep executive staff and team members apprised of goals, project status, and resolving issues and conflicts. Technical Competencies: Business Skills:\tBusiness Process Analysis & Design, Requirement Gathering, Use Case Modeling, JAD/JRP Sessions, Gap Analysis and Impact Analysis. Methodology:\tRUP, Agile, OOAD and Waterfall. Standard and Codes:\tHIPAA 4010A1/5010, ICD-10, ICD-9, ANSI X12, HL7, CPT and CMS form. Languages:\tC, C++, SQL, PL/SQL, HTML and XML. Visual Modeling Tools:\tRational Rose, Requisite Pro, Clear Quest, Clear Case and MS Visio. Testing Tools:\tHP Quality Center, Win Runner, Load Runner and TOAD Web Servers:\tMicrosoft Internet Information Server (IIS) 4.0/3.0, SunOne Server 5.2. Operating Systems:\tUNIX, Windows 95/2000/NT/XP, and MS-DOS. Office tools:\tMS Office 2003 (Word, Excel, Power Point, Outlook), MS Visio, MS Project, and MS FrontPage. Professional Experience: Keystone Mercy Health Plan, Philadelphia, PA\tMay’ 13 – Present EDI Analyst I worked as an EDI Analyst at Keystone Mercy Health Plan (KMHP) on several different projects. KMHP was working with EDS for the State of Florida (AHCA) and Commonwealth of Kentucky besides several other state agencies. The project objective for LOB 1300 was to create a layout document for generating an Outbound 837I file from Facets that would then be sent to EDI so that EDI could convert the file into a standard HIPAA compliant format before the file was sent to EDS. I was also involved in the analysis of EDI transactions including 837 and 835 based on HIPAA 4010 and mapping them in order to comply with HIPAA 5010 standards. Responsibilities:  Involved in updating and/or reworking previous documentation on their Membership Enrollment System for Florida to get them in sync and up to date with their current new system in place. Involved in System Integration, Compliance and User Acceptance Testing and Validation of Medicaid claims processing and Electronic Data Interchange (EDI) translation in compliance with the 4010A and 5010A Health Insurance Portability and Accountability Act (HIPAA) transactions 837 I/P. Worked with ICD 9 and 10 Procedure and NDC codes used in HIPAAtransaction code sets. Conducted meetings with the project managers to review the project plans Recommend best practices for project plans to the project managers for their successful implementation. Extensively involved in data validation between 834 Membership file to Facets backend tables and from Facets Backend tables to different external EDI extracts based on MS CHIP plan requirement. Provided Facets related systems expertise (training) to system users, business partners, and other internal/external customers including trouble shooting issues, as well as, identifying and correcting inefficiencies. Performed activities to comply with annual HEDIS data collection and analysis, preparing recommendations to increase rates as appropriate. Responsible for verifying data integrity from several distributed systems to Facets system. Maintained project documentation in a central repository. Created a weekly report on the updated project plans and maintained them Gained understanding of Medicaid policy and billing requirements and documented needed changes to policies and billing manuals related to ICD10 through facilitation with internal KMHP program areas. Documented business needs for ICD10 resulting from the HIPAA 5010 gap analysis. Used requirement elicitation techniques such as JAD Sessions and Document Analysis to gather information regarding the application from the KMHP SME and EDS along with the State of Florida people. Involved in bi-monthly Technical and Operational Issues (T&O) Conference Calls with AHCA, EDS and various providers who worked with AHCA to answer and resolve issues pertaining to a smooth transition from AHCA’s previous fiscal agent ACS to EDS. Maintained open and clear communication with the team on change requests. Worked on the ICD9 to ICD10 crosswalk and coordinated the development of the crosswalk solution. Determined the requisite ICD10 training for both internal staff and Medicaid provider groups and assisted in the development of training materials.  Environment: HIPAA EDI X12, 834, 835, 837, ICD9/ICD10, MS SharePoint, Windows XP, SQL, SQL Server Reports, Rational Enterprise Suite (Rose, Requisite Pro, Clear Case, Clear Quest), Mercury Suite, Micro focus Optimal Trace, HP Quality Centre Centura Health, Denver, CO    Oct’11 – May’13 EDI Analyst The project was about making a business assessment to determine readiness of the Centura Health to comply with the new standards mandated by the Health Insurance Portability and Accountability Act (HIPAA) 1996. The assessment process was consisted of a business-impact assessment, compilation of results, gap analysis, and developing business case. The business-impact assessment involved a series of interviews. The results of the business-impact assessment were compared with the related HIPAA standards to determine the current level of compliance and used to develop an action plan for approval by the project steering committee to correct deficiencies. Responsibilities: Assisted JAD sessions to identify the business flows and determine whether any current or proposed systems are impacted by the EDI X12 Transaction, Code set and Identifier aspects of HIPAA.  Involved in the full HIPAA compliance lifecycle from GAP analysis, mapping, implementation, and testing for processing of Medicaid Claims. Worked on EDI transactions: 270, 271, 834, 835, and 837 (P.I.D) to identify key data set elements for designated record set. Interacted with Claims, Payments and Enrolment hence analysing and documenting related business processes. Facilitated interview sessions to identify business rules and requirements and then documented them in a format that can be reviewed and understood by both business people and technical people. Involved in Facets System implementation, Electronic Claims and Benefits configuration set-up testing, Inbound/Outbound Interfaces and Extensions, Load and extraction programs involving HIPPA 835 and proprietary format files and Reports development.  Created targeted Questionnaires for SMEs to gather requirements. Understood and articulated business requirements from user interviews and then converted requirements into functional specifications. Defined Functional Test Cases, documented , Executed test script in Facets system. Created Business Requirement Document and Functional Requirement document. Conducted analysis of HIPAA compliance and took part in discussions for designing the healthcare transactions to be HIPAA 5010 compliant. Developed UML Use Cases using Rational Rose and developed a detailed project plan with emphasis on deliverables. Used Healthcare Effectiveness Data and Information Set (HEDIS) to measure performance on important dimensions of care and service. Designed and developed Use Cases, Activity Diagrams, Sequence Diagrams, OOAD using UML and Business Process Modeling. Involved in interactions with Subject Matter Expert, Project Manager, Developers, and the end-users in more than one JAD sessions. MS Project proved useful in coordinating activities with project manager and various other team Established basic project lifecycles, milestones, and standardized processes for Plainview program management system. Involved in creating automated Test Scripts representing various Transactions, Documenting the Load Testing Process and Methodology. Created meaningful reports for analysis and integrated the Performance Testing in the SDLC. Worked on EDI transactions: 270, 271, 834, 835, and 837 (P.I.D) to identify key data set elements for designated record set. Interacted with Claims, Payments and Enrollment hence analyzing and documenting related business processes. Conducted user interviews, gathered requirements, analyzed the requirements using RUP methodology and documented the requirements using Rational Requisite Pro. Followed the adaptive RUP framework for the whole Project life cycle (PLC) Created Process Flow diagrams, Use Case Diagrams, Class Diagrams and Interaction Diagrams using Microsoft Visio and Rational Rose Used detailed knowledge of the application features and functionality to assess the scope and impact of business needs throughout the analysis and completion of the enhancement specifications Performed Gap Analysis to check the compatibility of the existing system infrastructure, features and functionality with the new business design using the “As Is” and “To Be” methodology. Conducted business-impact assessment and the results were compared with the new HIPAA 5010 standards to determine the current level of compliance and developed an action plan for approval by the project steering committee. Developed business case which included results of the business-impact assessment, gaps identified, alternative solutions, risk assessment, preliminary work plans, resource requirements, and a budget for completing the initiative. Identified gaps between Centura’s current policies and procedures and new HIPAA 5010 compliance. Analyzed the impact of new HIPAA standards on targeted systems, processes, and business-associate relationships. Performed GAP analysis for EDI transactions such as 837, 834 to support state specified X12 5010 file formats. Used SDLC (System Development Life Cycle) methodologies like the RUP and the waterfall. Identified solutions to close gaps in HIPAA compliance. Developed plan for data feeds and data mappings for integration between various systems, including XML, to follow ICD 10 Code set and ANSI X12 5010 formats. Developed Request for Information (RFI) and Request for Proposal (RFP) document. Designed eLearning Training for the IDS staff using Adobe Captivate. Developed and conducted statewide HIPAA 5010 and ICD-10 awareness program for all IDS staff in Centura. Environment: Oracle, HIPPA, EDI , XML, QTP, Mercury Quality Center, Facets 4.61, NetworX. Group Health Insurance, Chicago, IL\t\t\t                          Jul ‘10 – Sep’11 EDI Analyst GHI contracted with the Medicare Centers and Medicaid Services (CMS) to provide quick, easy, and affordable access to the health care service of their choice.Market Prominence™ is the only system that provides management with the ability to tailor each step of the regulatory process based on the health plan's interactions with each of its beneficiaries. Project involves integrating Market Prominence and the Claims processing System with the data warehouse to support the reporting requirements.The project also involved in updating their back-end system so as to facilitate the processing of Insurance application including: Underwriting, Mode change, Letter generation, Annual refunds and Claims processing. Responsibilities: Used Requisite Pro for the Requirement Documents Preparation and Prepared Business Process Models that includes modeling of all the activities of the business from the conceptual to procedural level. Followed top down, leveled technique for building Business Process Models.  Personally responsible for attaining HIPAA EDI validation from Medicare, Medicaid, and other payers or government carriers.  Developed HIPAA EDI Transmissions for both government carriers and commercial entities.  Work includes complete business cycle management and hands-on production as well. Create EDI Testing process, documentation, and performance matrices. Created Mapping Documents, Report Mockups and modified existing report mockups as to CMS requirements and finalized for development Involved in HIPAA EDI transactions such as 834, 835, 837 (P, D, I) 276, 277, 278. Produced Gap Analysis documents for HIPAA 5010 and ICD-10. Identified gaps and performed gap analysis with respect to CMS requirements Performed Data mapping, logical data modeling, created class diagrams and ER diagrams and used SQL queries to filter data. Performed extensive testing in Facets Subscriber/Member, tested Groups, Eligibility, and Enrollment and validated outbound 834 Extracts to different Vendors. Analyzed CMS comparison documentation highlighting changes of 5010 format and ICD10 diagnosis and procedure codes. Assisted with project planning, requirements development and completing ad hoc change management activities. Responsible for architecting integrated HIPAA, Medicare solutions, Facets. Played a substantial role in the process definitions and business and functional requirements gathering, in an effort to develop a practical technology solution for automating sales methodology.  Used Rational Rose to model the process using UML to create behavioral and structural diagrams. Created Use Cases / Activity Diagrams / State Chart Diagrams, Sequence Diagrams, and Collaboration Diagrams thus defining the Data Process Model and Business Process Model.  Responsibility included creation, member enrollment, billing, letter generation, contract administration and claim adjudication. Created workflow scenarios, designed new process flows diagrams and documented the Business Process and various Business Scenarios and activities of the Business from the conceptual to procedural level.   Met with various HMO, PPO, Medicaid/Medicare, and Tricare / Champus Representatives discussing benefits of contracts on behalf of facilities or appeals from denials and compliance issues Learned Business Process Management (BPM) & Business Process Reengineering (BPR) concepts. Collected business requirements to set rules for proper data transfer from Data Source to Data Target in Data Mapping. Developed business process models in RUP to document existing and future business processes. Prepared Demo on SharePoint for various Business to get new approvals like the Therapist and Nursing divisions. Used Rational Clear Quest to track required changes and Rational Clear Case to maintain different versions of the project documentation Configured Claims, Provider and Member Data via EAI tools for RAPS file and TRR files to CMS for Risk Management. Worked in mainframe environment and used SQL to query various reporting databases. Used SDLC (System Development Life Cycle) methodologies like the RUP and the waterfall. Developed Test Plans and Test Cases according to Business Requirements.   Acted as User Acceptance Testing coordinator and monitored business testing and interfaced with the development team regarding defect status and fixes on a daily basis. Involved in generation and execution of SQL queries. Environment: Rational Rose, Clear Quest, Microsoft Project, Crystal reports, SharePoint, Mercury, Lotus Notes, Erwin, Microsoft Visio, Microsoft Office suite, Business Objects, ETL, Oracle, Windows NT, Mainframes, COBOL. Aetna Health Services, Nashville, TN\t\t\t\t Feb’08 – Jun’10 Business Analyst Aetna Health Services has a history of developing innovative programs to facilitate a better, more positive health care experience for everyone. We combine our strength and stability with nearly three decades experience serving customers of all sizes. This system permits the registered members with Aetna Health Services, to get the details of the long term care insurance schemes and benefits.As a Business Analyst Worked on the Claims processing system within the company for scanning and capturing of data including working on UB-92 claims forms. Involved in using the technology to recognize, validate, and store claims and their attachments using HIPAA compliance interface. Responsibilities: Responsible for defining the scope and implementing business rules of the project, gathering business requirements and documentation. Responsible for writing Functional Requirement Specifications (FRS) and User Requirement Specification (URS). Analyzed Business Requirements and segregated them into high level and low level Use Cases, Activity Diagrams / State Chart Diagrams using Rational Rose according to UML methodology thus defining the Data Process Models. Understand the As Is system and develop the To Be system concept and also prepare the System Process Maps Assigned to the HIPAA 5010 project Developed the systems implementation project management plan with milestones and steps from procurement of vendors to project implementation and maintenance Gathered requirements for procurement of vendor applications for specific modules Successfully conducted JAD sessions, which helped synchronize the different stakeholders on their objectives and helped the developers to have a clear-cut picture of the project. Created Web-based reports using SSRS Conducted presentations of the Q/A test results with analysis to the stakeholders and users and documented modifications and requirements. Coordinating and Developing QA activities. Worked with SQL Server 2005 Analysis Services (SSAS) for reporting and online analytical processing analysis Performed Data Mapping around HIPAA EDI transactions Created Process Flow diagrams, Use Case Diagrams, Class Diagrams and Interaction Diagrams using Microsoft Visio and Rational Rose. Wrote Test Cases and performed User Acceptance Testing, documented the in detail defects using the Defect Tracking report. Used Test Case distribution and development reports to track the progress of test case planning, implementation and execution results. Wrote PL/SQL statement and stored procedures in Oracle for extracting as well as writing data. Created Use cases, activity report, logical components and deployment views to extract business process flows and workflows involved in the project. Carried out defect tracking using Clear Quest Worked extensively with the HIPAA EDI transaction sets- 270, 835 and 837 Maintained proper communication with the developers ensuring that the modifications and requirements were addressed and also monitored these revisions. Involved in compatibility testing with other software programs, hardware, Operating systems and network environments. Environment:Microsoft Office 2003 Professional (Outlook, Word, Excel, Visio, Access, etc.), Microsoft SharePoint 2003,UML, RUP, UAT, db2,Mercury Test Director, SQL, .NET, Clear Case "}