{"text": "Name: jean jean E-Mail: jean.jean@gmail.com Address: Suzhou, China Github: https://github.com/jean LinkedIn: https://linkedin.com/jean Phone No. 877878299361 Summary: 8 Plus years of experience consisting of Analysis, Design, Implementation, Business Intelligence, Decision Support systems in Financial & Business applications Experience in OLAP Application Development and Administration using Oracle EPM modules (Hyperion Essbase, Planning, Financial Reporting, Smart View, Excel Add-in, Essbase Studio, EPMA, CALC Manager and Essbase Integration services).  Experience in creating and maintaining the Hyperion Planning application, Data Forms, Business Rules, Menus, Task Lists & loading the data from flat files and interface tables. Experience in migrating the planning applications from one environment to another. Created Block Storage Application (BSO) and Aggregate Storage Application (ASO) cubes. Strong understanding of Dense and Sparse strategy dimension allocation, performed dynamic calculations. Experience in developing OLAP models and metadata outlines for loading dimensions and data into Essbase Cubes.  Developed Batch Scripts and Rules files for dynamically uploading dimensions and data to Essbase Cubes.  Responsible for security groups and access for the users in Hyperion Reports Planning and Essbase. Expert in user provisioning and setting up groups with Roles and Privileges. Development and setup of Version, Hierarchies, Nodes, Action scripts, Blend, exports, property categories in Hyperion DRM. Developed complex dashboards and reports using interactive reporting studio. Importing metadata from source file and exporting metadata to database tables, files in DRM. Creation of interface and packages in Oracle Data Integrator (ODI) and migration of ODI from one environment to another and scheduling of ODI automation. Supporting business users on installing client tools Smartview, FR studio, and EAS  Worked on multiple projects in Offshore and Onsite models; and worked extensively with coordinating offshore team and to follow up on timely deliverables  Ability to work collectively in a team, while simultaneously taking independent decisions, depending on the situation. Efficient in meeting deadlines and exceeding business expectations. Technical Skills: Hyperion Technologies: Oracle Enterprise Performance 11.1.1.3, 11.1.2.1, 11.1.2.2 and 11.1.2.3 (Hyperion Essbase, Hyperion Planning, Hyperion Financial Reporting, Hyperion Web Analysis, EPMA, CALC Manager, Hyperion Financial Management, and Hyperion Smart View), ODI11g (Oracle Data Integrator) Oracle Hyperion DRM 11.1.1.2, 11.1.2.2 and 11.1.2.3  RDBMS: SQL Server 2008 and Oracle 10g/11g Education: BBA, Symbiosis Law School, Pune, India Experience: Chrysler, Michigan              \t\t\t                                                November 2016 - Present Hyperion Essbase/ Planning Consultant  FCA US is an Italian controlled automobile manufacturer and one of the \"Big Three\" American automobile manufacturers. Responsible for developing and enhancing financial applications in Hyperion Planning, Hyperion Essbase and other Hyperion technologies. Developed several BSO cubes to incorporate different departments like sales, human resources, etc. in the company. Involved in extracting, transforming and loading data from multiple sources into Hyperion cubes using FDMEE and LCM. Responsibilities   Held meetings with the business users to collect requirements and documenting the requirement specifications. Designed and developed different cubes for creating reports about various business strategies to aid in decision-making and future planning.  Experienced in development, optimizations and performance tuning, for data/ dimensions’ load, database restructuring (BSO/ASO), calculations, overall Essbase performance. Key techniques used were resetting databases, grouping sparse member combinations, using parallel calculations, managing caches, using two-pass calculations and changing buffer size. Involved in developing design specifications of ESSBASE cube with customers.  Built new Calc scripts and developed MaxL scripts for automation process.  Created Planning applications with the plan types for revenue & expenses, sales and corporate.  Created data forms for business users for budget, forecasting and estimates. Worked on reports and data forms to give the flexibility to the users to review the detail/summary data and to allocate the Budget/Forecast amount. Maintaining project dashboard for updates from daily standup and various stakeholder meeting updates. Tested user connectivity for errors in instances such as developing databases and reports, moving from a development environment server to a production environment server, etc. Assisted in troubleshooting Production issues in support to Planning Applications and all databases. Migrated to new production server and supported end users and planners for budgeting. Maintained security for Planning Application, Business Rules and ESSBASE cubes. Developed and administered ad-hoc financial reports with Spreadsheet Add-in and Smart view. Developed Task lists and workflow process for all the Planning applications.  Involved in developing process management for workflow to promote the budget or forecast for different scenarios and versions.  Worked on Hyperion Shared Services to list user directories, users, groups, projects, and applications. Created and designed the existing reports using Financial Reporting Studio and Web Analysis. Prepared Profitability Reports, which detail cost, price/ volume trends, and expense variances over prior periods.  Very good knowledge of budgeting, forecasting, financial planning, balance sheet, income statement, P&L statements, cash flow statement and human resource management. Ensured that the current on-premises planning application is stable and without any cube refresh errors or invalid rules. Environment: Hyperion ESSBASE 11.1.2.3, Hyperion Planning 11.1.2.3, Hyperion Shared Services, Hyperion Interactive Reporting Studio, Web Analysis, Dashboards, SQR, Financial Reporting Studio, Hyperion Workspace system, Windows Scheduled tasks, Microsoft SQL Server 2005, MAXL, Excel Add-In, Smart View, ESSBASE Utilities, Windows NT/2003, FDM, Microsoft Windows Wal-Mart Stores, Inc., Arkansas                                                                        January 2016–October 2016 Hyperion Essbase/ Planning Consultant Walmart Inc. is a multinational retail corporation, headquartered in Bentonville, Arkansas, operating a chain of hypermarkets, discount department stores and grocery stores. The project required maintenance of multi-dimensional databases for its budgeting, sales forecasting, marketing analysis and reporting using their Hyperion Essbase and BI Tools suite. Reports were delivered via the Excel Add-in and Hyperion Web Analysis. Responsibilities: Responsible for the administration of Hyperion Planning applications. Worked on performance tuning and optimization of Hyperion Essbase Cubes and calculation scripts. Involved in automating data load using MaxL and batch scripting. Migrated updates between non-production and production environments through Life Cycle Management (LCM). Wrote several complex calculation scripts for ASO i.e. procedural calculations using MDX and minimized the use of member formulas. Currency conversion was done through procedural calculation. Created data forms as per business needs, created smart list, menus and assigned to data forms. Used planning utilities like FormDefUtil, Import Security, Export Security and Outline Load. Created users, groups and assigned privileges to them and migrated planning applications in Hyperion Shared Services. Supported Infrastructure team while applying patches and prepared documentation. Provided trainings and documents to Import/ Export Metadata, input data, build reports to the user on Smart View. Formulated knowledge modules and data models and data stores in Oracle Data Integrator. Involved in migration of ODI from one environment to another and prepared documentation in each phase of ODI. Created and modified interfaces and packages in Oracle Data Integrator as per the business change. Integrated Oracle Hyperion Data Relationship Management with planning application to enable dimension mastering, sharing and synchronization.  Created and modified Hierarchies, nodes and Properties in DRM per requirement. Identified root cause of issues and provided appropriate solutions. Involved in development and performance-tuning with Hyperion Analytic Services (Essbase) multidimensional databases including Outline, Rule Files, Calc Scripts, composite web forms, smart lists, task lists and menus, reports, database optimization. Created data sources from SQL servers, Oracle, SAP BW, etc.  for planning applications. Pulled up multiple Hyperion Ad-hoc Financial Reports and Web Analysis Dashboards, based on the requirements. Provided support and training for new and experienced Essbase users.  Optimized the applications to reduce the calculation time and database size considerably. Extracted the company payroll/employee, sales, CAPEX and OPEX data reports using Smart View. Restored database by taking regular backup in case of database corruption or server crash. Automated the daily general ledger load into Hyperion, and added extra error checking and automated notification processes, so the team is immediately aware of any data, server or process-related issues. The log files had to be manually checked daily prior to this change. Worked closely and pro-actively with project leadership to identify and resolve key risks with the Hyperion upgrade project. Environment: Hyperion Essbase System 11.1.2.2, Essbase Administration Services, Hyperion Planning, Outline load extractor, Hyperion Financial Reporting Studio, Data Relationship Management, Oracle data Integrator 11g, Smart view and MS Office. Bank of America, New Jersey              \t\t\t\t\t      July 2014 – December 2015 Hyperion Planning/Essbase Consultant Bank of America Corporation is a multinational banking and financial services corporation headquartered in Charlotte, North Carolina. It is ranked 2nd largest bank by assets and 26th largest company by revenue in the United States. Involved in requirement analysis and documentation leading to an effective Hyperion solution incorporating user needs of converting Excel based Budgeting and Forecasting Process to Hyperion Planning in-order to increase efficiency.  Responsibilities: Created dimensions in Essbase through rule files as well as loading and maintaining data through rule files. Developed formulas for each application’s outline for collecting data and creating calc scripts in Essbase.  Submitted budget and forecast reports through Smartview. Created Financial reports and report scripts in Essbase based on requirements. Understanding Of business requirements and fixing the issues. Modified Validations, imports and exports based on requirement. Validated DRM data against business rules or data source. Maintained DRM Batch scheduling and log files and Security setup in DRM for users. Used Life Cycle Management (LCM) for migrating cube and report objects between different environments. Created attribute members, formulas, substitution variables, to enable simple calculations. Involved in production support and maintenance of existing cubes. Tested the requirements & fixed issues. Environment: Oracle Essbase System 11.1.2.1, Essbase Administration Services, Hyperion Planning, Data Relationship Management, Hyperion Reports, Smart view, Essbase spreadsheet Add-In, MS-office. Gymboree Group, Inc., California                                                                      February 2013 - June 2014 Hyperion Essbase/Planning Consultant Gymboree Group, Inc. is a portfolio of children's brands operating specialty retail stores with high-quality clothes and accessories, currently operating hundreds of retail stores throughout the United States, Canada and Puerto Rico, along with franchises around the world. Primarily tasked with building and designing a metadata structure and planning application to manage various cost centers, profit centers, management of accounts receivable and accounts payable, credit/ collections and payroll functions.  Responsibilities: Built dynamic dimensions in Essbase through rule files. Loaded and maintained data through rule files. Developed simple to complex formulas in the outline for each application for aggregating data and creation of calc scripts, static variables in Essbase. Extensively involved in integrating metadata and data from various sources into Hyperion Planning, Essbase and HFM platform using Hyperion Financial Quality Management. Created Web Forms, Business rules and assigned business rules to forms. Developed and modified hierarchies, nodes and properties in DRM. Submitted plans and forecast data through Smart View. Generated ad-hoc financial reports for the end users to slice and dice the data using Smart View. Involved in the documentation of the various monies like accounts receivable and accounts payable, credit/ collections, payroll in the project. Ensured regular maintenance of the Essbase server like cube backup, security file backup and file system backup. Installed and configured Hyperion Products on windows environment. Created report scripts in Essbase based, identified business requirements and fixed the issues. Modified validations, imports and exports, as required. Environment: Oracle Essbase System 11.1.2.1, Essbase Administration Services, Hyperion Planning, Data Relationship Management, Hyperion Reports, Smart view, Essbase spreadsheet Add-In, MS-office. Amarchand & Mangaldad & Suresh A Shroff & Co, Mumbai                         May 2011 - December 2012 Hyperion Essbase/Planning Consultant Amarchand & Mangaldas & Suresh A Shroff & Co was the largest law firm in India with headquarters in Delhi and Mumbai. It had offices in 8 cities, comprising of nearly 600 lawyers including 85 partners. Assisted senior consultant in defining planning & budgeting metadata and designing the planning application to manage various aspects of the law firm’s business. Responsibilities: Designed and installed a multi-dimensional database application using Essbase and Planning to store and maintain law firm’s payroll, billable hours, expense data in addition to managing the security, manipulation and loading of data. Developed Aggregate Storage Cubes using Essbase 9.1.  Restructured as well as maintained existing Essbase cubes. Assisted other consultant teams by testing unit/data load processes in Essbase while creating upload sheets and reports using Essbase excel add-in’s/ Hyperion SmartView. Delegated testing of applications to designated team and worked with consulting team to identify and resolve any discrepancies found in the application testing results. Developed rules files for loading data and for building dimensions. Designed and created budget and forecast applications using Hyperion PBS. Integrated Hyperion planning with the Hyperion Financial Management to enable financial consolidation across its offices as well as allowing for reporting and analysis in an efficient manner. Formulated Hyperion data reports, user guides and system design documents for users at various access levels. Trained client personnel to perform the security and administrative tasks necessary to maintain a stable and secure environment for System9, Essbase, Hyperion Planning and Financial Reporting. Environment: Hyperion Essbase 9.x, Hyperion Planning 9.x, Hyperion Financial Reporting, Essbase Excel-Add-in, Oracle 9i/10g UnitedHealth Group, India \t            \t\t\t\t\t           August 2009- April 2011 Jr. Hyperion Essbase/Planning Developer UnitedHealth care is a healthcare provider for employers to help deliver quality healthcare to its employees, offering health care and wellness support, based on requirements. Developed a planning application for UnitedHealth to help govern its insurance business. Responsibilities: Involved in gathering specifications, design and development of outlines for cubes Involved in design and development of OLAP Models and Meta Outlines in Essbase Integration Server Designed and developed Data Load Rules using the Prep Editor in Essbase and created outlines for cubes Created report scripts to export the data out of Essbase cubes Exported and imported all documents to Microsoft office documents using Web Analysis Created reports graphically using Web Analysis for better visualization of data Involved in supporting the applications on daily maintenance, user creation and developing user interface Created planning applications using Planning Application Wizard Designed planning web forms Determined the user experience from an end user perspective for budgeting and reporting Maintained of Hyperion Planning cube, created web forms and refreshed data in Hyperion Planning Involved in refreshing security and filters in Planning production environment Optimized data load forms in Hyperion Planning Developed batch scripts for building dimensions dynamically and loaded data into cubes and scheduled the scripts to run periodically Provided security for various levels of users using Hyperion Shared Services Environment: Hyperion Essbase 9.x, Hyperion Planning 9.x, Hyperion Shared Services 9.x, Hyperion Financial Reporting, Hyperion Web Analysis, Hyperion Excel Add-In, Essbase Administration Services 9.x, Essbase Integration Services 9.x, Oracle 9i/10 g"}