{"text": "Name: katherine katherine E-Mail: katherine.katherine@gmail.com Address: Kunming, China Github: https://github.com/katherine LinkedIn: https://linkedin.com/katherine Phone No. 26952662069 Summary: Over 8+ years of programming experience including design, development, implementation and maintenance of Java/J2EE/Web based applications.  Excellent project life cycle experience (SDLC) in all aspects of requirements specifications, design, code, test, deploy, maintaining and implemented projects in Waterfall and Agile/Scrum methodologies.  Experience in using Core Java concepts like Multi-Threading, Collection, Interfaces, Synchronization, OOPs concepts and Exception Handling. Extensive experience in Internet, client/server technologies using Java, J2EE, JSP, Servlets, JDBC, Spring, Hibernate, Web Services, SOAP, EJB, JMS, XML, HTML, CSS, JavaScript, AJAX and Shell Scripting. Proficient in MVC architecture using Spring framework / JSP-Servlet and J2EE Design Patterns. Experience in hibernate O/R mapping tool.  Integrated the application with Spring-MVC using Spring Boot, Spring Dependency Injection (DI), and Spring Annotations. Knowledge of application development for Cloud platforms using technologies like Java/J2EE, Spring Boot, Spring Cloud, Microservices. Experience in Microservices and Spring Boot application development. Experience with versioning tools like Git, Clear case, Subversion and CVS. Experience in database connectivity (JDBC) for databases like Oracle, MS SQL Server. Driven by new challenges and adept at adapting to any cultural and business environments.  Experience in deployment and troubleshooting various application servers like JBoss, Apache Tomcat, IBM WebSphere and Oracle WebLogic. Good experience with Source code management collaboration tools GIT, SVN, Github, Bitbucket, Gitlab, AWS-Code commit. Expertise in developing, documenting, and executing test cases manually as well as generating automated scripts using Selenium.   Expertise in using issue tracking tools such as JIRA and Rally.  Strong analytical and dynamic trouble shooting skills coupled with excellent communication skills and able to work individually and as a team. Have the motivation to take independent responsibility as well as ability to contribute and be a productive team member.  Technical Skills: Professional Experience: Client: Genomic Health – Kansas City, MO                                                            March 2018 till date Role: Full Stack Java Developer Responsibilities: Involved in preparing System and business Requirements and Detailed Design document for the project.  Actively involving in Analysis, Design, Development, System Testing and User Acceptance Testing. Successfully followed agile methodology in the Scrum Cycle model. Implemented Design Patterns from Pure MVC Architecture to interact with backend J2EE and Web Services to pull out the data to JSF Components. Responsible for all client-side UI Validation and implementing Business logic based on user selection using JavaScript and Angular JS, Node JS.  Implemented Angular components for UI services to consume rest services using Component based architecture by providing Angular 2.0. Worked on Development and debugging the servlets and EJB with WebSphere Application server.  Worked on development of a web application using front end MVC framework using Angular 2, Node JS, HTML5, CSS3, JavaScript and AJAX.  Implemented Swagger Configuration in Java Spring boot for auto generating swagger json files for REST API calls. Developed the automated unit test cases for the Microservices using Junit, Mockito, and Sonar and deployed them in the Jenkins pipeline. Implemented the Responsive User interface screen using HTML5, CSS3 and Bootstrap.  Designed and developed the End Points (Controllers), Business Layer, DAO Layer using Hibernate/JDBC template, using Spring IOC (Dependency Injection).  Worked on AWS cloud watch for monitoring the application infrastructure and used AWS email services for notifying. Followed SOA Design and Architecture to Develop REST Web Service, generated and consume the services. Developed API for using AWS Lambda to manage the servers and run the code in the MongoDB. Developed Micro Service to provide RESTful API utilizing Spring Boot with Spring MVC.  Developed Hibernate mapping files using different mapping strategies such as table per class hierarchy. Involved in developing stored procedures and Triggers on Oracle 10g. Used Maven as repository to cache the information. Environment: Java/J2EE, Agile/ Scrum, Spring, JSF, AJAX, Angular JS, HTML, CSS, JavaScript, Node JS, Hibernate, JDBC, Micro Services, RESTful API, Spring MVC, Spring Boot, AWS, Mongo DB, SQL, Oracle, Log 4j, Junit, Maven, Windows. \nClient: Consolidated Communications, Mankato, MN                                 July 2017 to February 2018  Role: Java/J2EE Developer Responsibilities: Interacted with Business users during requirements gathering and designed the system using UML (Class Diagrams and Sequential Diagrams) with OOD features. Involved in writing Spring Configuration XML file that contains declarations and another dependent object declaration. Developed user interface using Bootstrap UI, Angular JS, and JavaScript to simplify the complexities of the application.  Used Angular JS to implement rich functionality in various pages: form validation, CRUD, grid, search, sort and pagination. Developed various web pages and components using React JS by implementing Redux components and libraries and predefined components from NPM (Node Package Manager).  Inserted Dependency Injection between components using Spring (IOC) concept.  Developed various Java beans for performance of business processes and effectively involved in Impact analysis.  Developed server side application to interact with database using Spring Boot and Hibernate. Experience in creating JavaScript for using DML operation with MongoDB. Responsible for Setting up Web Services project using WSDL in SOAPUI and provided setup help to other team members.  Extensively worked on SOA and web services to get the data and configured JMS queues on server.  Integrated Hibernate ORM with Spring-Hibernate framework to facilitate DML and DQL queries and represent object-database mapping.  Developed application service components and configured beans using Spring IOC, creation of Hibernate mapping files and generation of database schema. Created tables, triggers, stored procedures, SQL queries, joins and views for multiple databases, Oracle 10g.  Involved in JUnit Testing of various modules by generating the Test Cases.  Developed ANT Profiles for the build process and deployed in the server.  Implemented Log 4j for Logging Errors, debugging and tracking using loggers.  Used GitHub for version control.  Environment: Agile, Java/J2EE, Spring, Hibernate, XML, WSDL, REST, SOAP, SOAP UI, HTML, JavaScript, CSS, Angular JS, Bootstrap UI, SQL, PL/SQL, Junit, ANT, Log 4j, GitHub, JMS, Servlets, Eclipse, Windows. Client: Amex, Atlanta, GA\t\t\tNovember 2015 to June 2017\nRole: Java/J2EE developer Responsibilities: Interacted with Business users during requirements gathering and designed the system using UML (Class Diagrams and Sequential Diagrams) with OOD features. Implemented User Interface in Model-View-Controller Architecture, which accomplishes a tight and neat co-ordination of Spring MVC, JSP, and Servlet. Developed the User Interface validation framework using AJAX and Java Script.  Used AngularJS services, controllers and directives for front end UI, AngularJS MVC for cross-browser functionality and used Firebug for Firefox, Inspector tools for Chrome, IE developer toolbar for IE.   Implemented Dependency Injection (IOC) feature of Struts framework to inject dependency into objects and AOP is used for Logging.  Developed Server-side components with coordination of Hibernate and Spring using web established frame work designed under the guidelines of Business Delegate, session facade, Service locator.  Developed and utilized J2EE Services and JMS components for messaging communication in Web Logic Application Server for Credit Inquiries.  Developed Web service modules based on SOA architecture to consume services.  Developed services that are reusable and interoperable, based on Basic profile, SOAP, JAX-RPC Web services using AXIS.  Wrote complex SQL Queries, Stored Procedures, Triggers, Views, Cursors, Joins, Constraints, DDL, DML and User Defined Functions to implement the business logic.  Used JBoss and Tomcat servers to run and debug the application in local. Created build files using Maven.  Environment: JDK, CSS, AJAX, Spring, JPA, XML, XML Schemas, XSLT, SOAP-UI, WSDL, JMS, Tomcat, JUnit, Maven, Log4j, Web Services(JAX-WS), JAXB, Web Logic Application Server, GIT, IBM RAD, MS SQL. Client: Hanger, Austin, TX \t\t\t\t\t                    April 2013 to October 2015 Role: Java Developer Responsibilities: Involved in requirements gathering and analysis from the existing system. Captured requirements using Use Cases and Sequence Diagrams. Designed web portals using HTML and used Java script, AJAX. Used Spring IOC for dependency injection and Spring AOP for cross cutting concerns like logging, security, transaction management. Integrated Spring JDBC for the persistence layer. Developed DAO Classes and written SQL for accessing Data from the database. Used XML for the data exchange and developed Web Services. Deployment of the application into JBOSS Application Server. Implemented Ant and Maven build tools to build jar and war files and deployed war files to target servers. Implemented test cases with JUnit. Used RAD for developing and debugging the application. Utilized Rational Clear Case as a version control system and for code management Coordinated with the QA team and participated in testing. Involved in Bug Fixing of the application. Environment: J2EE, JBuilder, Oracle, HTML, DHTML, XSL, XSLT, Servlets, JavaScript, AJAX, JBOSS, RAD, JUnit, log4J, ClearCase. Client: First Citizens Bank – Raleigh, NC\t\t\t                   January 2011 to April 2013 Role: Jr. Java Developer Responsibilities: Developed Front End pages of the application using HTML, CSS, jQuery, and JavaScript.  Designed and developed the original prototype for a highly-complex, interactive, graphical, web user-interface using standards-compliant JavaScript. Implemented JavaScript and jQuery to develop UI components and their dynamic rendering based on the actions occurred and the corresponding stores, view components associated with them.  Developed RESTful web services using Spring Boot to provide domain data for the application.  Implemented SQL Database as the storage system for the Restful Web services.  Implemented Web Services to integrate between different applications using SOAP services using JAX-WS.  Developed Web services to SQL connection by using Hibernate ORM.  Used Message-driven batch application using Spring Batch to handle multiple requests accessed through Message Queue services between several micro services in the application.  Developed Authentication and Authorization to the Spring Boot web services using Spring Security.  Environment: Java, HTML, CSS, JavaScript, AJAX, Spring, Hibernate, REST, jQuery, Junit, SQL, Windows. Education: High School Degree from The Holy Trinity Cathedral School, Addis Ababa, Ethiopia."}