{"text": "Name: hazel hazel E-Mail: hazel.hazel@gmail.com Address: Nanjing, China Github: https://github.com/hazel LinkedIn: https://linkedin.com/hazel Phone No. 468276937626 8+ years of professional experience in designing, developing and testing internet/intranet web-based applications, client/server applications.  Good experience in Monolithic architectures, SOA (Services oriented Architecture) and Microservices Architecture. Working knowledge and experienced in multi-tiered distributed environment, OOPS and OOAD concepts, good understanding of Software Development Lifecycle (SDLC).  Strong working knowledge of Java 8 Hibernate, Struts, EJB, JDBC, Spring, JSF, REST.   Worked with the Java script frameworks like JqueryandAngularJS.  Good Experience in front ends technologies such HTML, HTML5, CSS, Java Script, Oracle and Ajax. Experience on Ext JS. Developed Restful web services interface to Java-based runtime engine and accounts. Customized Restful Web Service using Spring Restful API, sending JSON format data packets between front-end and middle-tier controller.   Expert-level knowledge of cross-browser, cross-platform compatibility and design constraints and Google analytics.  Brought the HTML and CSS of an existing web  site to the latest web  standards.  Experience in developing Web -centric applications using XML, Angular.js, JavaScript, JQuery, CSS, Photoshop, Dreamweaver and IIS. Experience in development and implementation of Application, mobile and web based Technology Solutions. Excellent Project implementation skills using Java SE,Java EE, Restful, Spring, Hibernate \nframework. I have experience in MXC Framework. Expertise in advanced JavaScript libraries and frameworks such as Prototype, Ext JS, Angular JS React JS, Node JS and Object Oriented Programming in JS. Strong Expertise in frontend technologies such HTML, CSS, Java script, AngularJS, Ajax and GWT. Basic understanding of ExtJS.  Customized Restful Web Service using Spring Restful API, sending JSON format data packets between front-end and middle-tier controller.  Experience in using Struts framework with features like Tiles, ValidatorFramework and Spring MVC framework. Possess strong working knowledge of Database Programming using SQL, PL/SQL, Triggers and Stored Procedures. Design, implement and test services in a Microservice-oriented architecture and has Implemented the REST based Microservices using the Spring Boot, Spring Data with JPA (Java Persistence API). Experience in using Struts framework with features like Tiles, ValidatorFramework and Spring MVC framework. Involved in multi-tiered J2EE design utilizing Spring Inversion of Control IOC architecture and Hibernate. Experience in using Struts framework with features like Tiles, ValidatorFramework and Spring MVC framework. Extensively worked with MVC Architecture using spring,Hibernate, Apache Struts.  Expertise in developing both Front End & Back End applications using Java, Servlets, JSP, HTML, JavaScript, Spring, Hibernate, JDBC, XML, Documentum, XMetal, Maven, MySQL, Oracle 9i. Implemented generating the verification hash code using crypto package on node.js and Added user validations and user permissions by using the node.js Experience in implementing Web Services based on Service Oriented Architecture (SOA) and Monolithic architecture using SOAP, Restful Web Services, JAX-WS, UDDI, WSDL, WADL. Expertise in web development using HTML, DHTML, CSS, Java Script, XSL, XSLT, and XML, JavaScript/jQuery, Angular JS, React JS, Node JS, AJAX. Expertise in Web Components technologies like JSP, Servlets, JDBC, AJAX. And designing enterprise applications using technologies like EJB, JNDI, JMS. Experience in working with application servers like IBM WebSphere, Glassfish, JBoss, WebLogic and Apache Tomcat.  Implemented account creation module as a Single Page Application using Angular JS 2 along with Angular JS 2 form validators.  Involved in creating Dynamic component using angular JS 2  . Experience in writing PL/SQL Stored procedures, Functions, Triggers and Complex SQL’s. Experience with various databases like Oracle, MySQL, DB2, MS SQL Server, MongoDB, Cassandra. Good Experience in process Improvement and Continuous Integration by using Jenkins and bamboo.  Excellent Experience in Code Refactoring and TDD (Test Driven Development). Good communication, interpersonal and quick learning skills with proven ability to adapt to different project environments.  TECHNICAL SKILLS:  Professional Experience: DupontPioneer, Des Moines,IAAug 2016 to Present Full Stack Java developer, Responsibilities: Participated in meetings with the end-clients to develop layout, color scheme for the web page and implemented them with the help of HTML5, CSS3 and JavaScript. Built Web pages that are more user-interactive using JQuery   plugins for Drag and Drop, Auto Complete, JSON, Angular JS, JavaScript, Bootstrap. Many JSP pages were developed and used Java script for client side validation.  Extensively used CSS, HTML5,Java script, JQuery and JSP to enhance functionality and user experience on web pages. Involved in writing application level code to interact with APIs, RESTFU web  Services using AJAX, JSON.  Involved in creating responsive web  pages with Bootstrap and CSS framework like SAAS.  Used the Node JS AngularJS, ReactJS Sencha Ext JS and Backbone JS MVC Frameworks in the development of the web applications.  Administered and supported Ext JS applications within scope.   Developing the business functionalities and exporting them as RESTFUL web services. Developed application using Angular.Js and NodeJS connecting to Oracle on the backend.  Used CI/CD tools Jenkins, Git/Gitlabs, Jira and Docker registry/daemon for configuration management and automation using Ansible. Used advanced level of JQUERY, AJAX, Java script, Backbone, Bootstrap, CSS and pure CSS layouts. Developed Test cases and test scripts using Jasmine test API and Karma for front-end code.  Performed use case analysis and design SOAP, REST APIs on social integration of web and native mobile applications implementing OAuth. Implemented generating the verification hash code using crypto package on Node.JS and Added user validations and user permissions by using the Node JS.  Used Angular.JS and Node JS framework for building web-apps and is highly efficient with the Laravel PHP framework as well as using Restful services.  Involved in implementing the complete Application in the in-build MVC Architecture with Angular JS,Used date-format and moment packages in Node.JS to save the timestamp in database converting into GMT.   Used XML Web Services usin SOAP to transfer the amount to transfer application that is remote and global to different financial institutions. Responsible for installation & configuration of Jenkins to support various Java builds and Jenkins plugins to automate continuous builds and publishing Docker images to the Nexus repository.  Created Spring Restful Web services consuming and producing JSON / XML, XSLT, and XSL  Implemented Spring configuration files for the beans defined and properties to be injected into them using spring's Dependency, Followed Agile process, created and maintained User stories in JIRA. Actively participated in Sprint grooming, retrospectives and daily stand up meetings.  Design and develop RESTful API capabilities on Java/node.js technologies and deploying in \nAWS and implement API proxies on Apigee Edge.  Developed Java/J2EE code, business logic using Spring Hibernate framework and OOP concepts, involved in Peer code reviews. Developed application in jQuery frameworks in AJAX-driven websites using proxy to get the data from the back-end in the form of JSON and XML to populate on the UI components. Implemented account creation module as a Single Page Application using Angular JS 2 along with Angular JS 2 form validators.  Was responsible for checking cross browser compatibility and hence worked on different browsers like Safari, IE, Firefox and Chrome. Involved in Creating and Consuming Restful Services using Node JS and Express Framework.  Involved in creating Dynamic component using angular JS 2    ENVIRONMENT: JavaScript,React JS,D3.js, HTML5, CSS3,OAuth, Open ID, jQuery, JSON, Spring, AJAX, DHTML, REST Web Services, XML,MXC, JSP,Jasmine, Servlets, Bootstrap, CVS, type script, MVC, Webpack, Node JS, Grunt, SQL, Express, No SQL, Angular JS 2,EXT JS, Angular JS. Molina Healthcare, Long Beach, CA\tOct 2015 –July 2016 Role: UI Developer, Responsibilities: Full stack development based on J2EE specifications with Microservices architecture. Written JUNIT(TDD) test cases for testing Spring Framework classes and wrote many Java Scripts to do client side validations Trained staff on effective use of Jenkins Docker ,GitLab and Kubernetes. Worked with Express.js for development of RESTful web services and middleware configurations. Implemented RWD using Twitter Bootstrap.  Developed dynamic responsive web  Application by integrating AngularJS with Bootstrap which is further integrated with web  Services.  Application is hosted on Amazon cloud and it supports all the major devices and browser types. RWD is implemented using Twitter Bootstrap to support multiple form factors  Good Experience in front ends technologies such HTML, HTML5, CSS, Java Script, Oracle and Ajax. Experience on Ext JS. Identified usability and develop functional and smooth, easy-to-operate and eye-catching web applications usingExt JS., Angular JS and React JS, Backbone. JS Node.JS and Bootstrap with MySQL database.  Java script is used for client side validations.  Worked with Passport and JSON web tokens for authentication and authorization security configurations using Node.js.   Developed crypto rest services using NodeJS and integrated services with HSM(Hardware Security Module).  Worked on React JS Virtual Dom and React  views, rendering using components which contains additional components called custom HTML tags.  Implemented various screens for the front end using React.JS and used various predefined components from NPM (Node Package Manager) and redux library. Worked in using React JS components, Forms, Events, Keys, Router, Animations, and Flux concept.  Developed and consumed RESTful web services using Spring REST architecture. Implemented Life Quote POC using Spring, core, Spring MVC, SOAP, AJAX, and JQuery.  Implemented and tested the enterprise application with jQuery, Angular.js and Spring, MVC. Developed the application implementing MVC Architecture, integrating JSF with Hibernate and spring frameworks.  Experienced in developing new extensions on Hybris platform to support different e-commerce functionalities, product creations, setting the catalog, content, script generator, impex import/export, cronjobs, validations and interceptors.  Worked on WCMS and accelerator services and Hybris type system to create a online travel website.  Created Spring Restful Web services consuming and producing JSON / XML, XSLT, and XSL.  Experience of working in Unix environment.    Build the code and distribute environments through Jenkins. Later performing the Hybris update in integration server nodes in different environments and also resolved several deployment issues during post deployment smoke test. Implemented Life Quote POC using Spring, core, Spring MVC, SOAP, AJAX, and JQuery.  Implemented and tested the enterprise application with jQuery, Angular.js and Spring, MVC. Developed the application implementing MVC Architecture, integrating JSF with Hibernate and spring frameworks.  Worked on JMS Connection Pool and the implementation of publish and subscribe using Spring JMS. Implemented transaction management for ORM project usin Spring Transaction Management API.   Involved in multi-tiered J2EE design utilizing Spring Inversion of Control (IOC) architecture and Hibernate.  Converted file uploading existing web service to Microservice for large Excel document uploads, validations, inserting records into Oracle DB tables.  Developed REST services to talk with adapter classes and exposed them to front-end. Also, enforced a stateless client-server and support JSON (few changes from SOAP to RESTFUL). Implemented a GUI using Google web toolkit (GWT) and integrate it with Java web services to facilitate users. Developed the responsive UI web pages using XHTML, jQuery, HTML5, CSS3, Angular JS 2, Java Script, JSF, and AJAX. And has worked with Angular JS filters in expressions and directives to filter data in the UI. Using Hibernate Query Language (HQL) for accessing data from the database and created Hibernate POJO Objects and mapped using Hibernate Annotations. Writing Stored Procedures to insert all the new services and elements to Oracle 12 Database, MySQL and mongo DB. Designed the real-time analytics and ingestion platform using Storm and Kafka. And Writting Storm topology to accept the events from Kafka producer and emit into Cassandra DB.   Developing automated Build files, reporting, and documentation using Maven. And Continuous integration and deployment with Jenkins. Testing components using , JUNIT & Mockito during development. Environment: JAVA 1.8, J2EE,React JS,d3.JS, HTML5, AJAX,Java 8, Angular JS 2, EXT JS, CSS3,  XML, REST, JAX-RS, JAX-WS, IBM WebSphere 8.1,Jasmine, JMS, Eclipse, Open ID,JUNIT, Mockito, GIT, Spring framework, MXC, Spring boot, Hibernate ORM, Maven, Mongo DB.  Bank of America, NY                                                                                       June 2014 to Sep 2015 Role: UI Developer, Responsibilities: Closely worked with business system analyst to understand the requirements to ensure that right set of UI modules been built. Implemented transaction management for ORM project usin Spring Transaction Management API.  Developed a web service using SOAP, WSDL, XMLandSOAP-UI. Defined and developed the application presentation layer using HTML5, CSS3, JavaScript and jQuery Scripting.  Developed Mean Stack from scratch including Mongo DB server setup and Express JS server development.  Designed and developed custom MongoDB applications specific to clients' needs.  Implement modules into Node JS to integrate with designs and requirements.  Developed Web API using Node JS and hosted on multiple load balanced API instances. Used AJAX and JSON to make asynchronous calls to the project server to fetch data on the fly. Redesigned pages to improve application design and UI to attract the customers by taking inputs from senior management. Developed all client-side logical implementation part of applications with Angular JS controllers under specific modules, manipulating nodes in DOM tree. Used JS tree that provides interactive trees by which we can implement drag & drop with search functionality. Worked with Data Tables, a table enhancing plug-in for jQuery, JavaScript library, adding sorting, paging, and filtering abilities to plain HTML tables. Developed Webservices (SOAP) to expose the business methods to external services. Understanding of application development lifecycle methodologies. Involved in write application level code to interact with APIs, Web Services using AJAX, JSON and XML. Implemented and designed user interface for web based customer application. Involved in writing the Properties, methods in the Class Modules and also consumed web services. Played a vital role in defining, implementing and enforcing quality practices in the team organization to ensure internal controls, quality and compliance policies and standards. Involved in writing SQL Queries, Stored Procedures. Involved in fixing Front-End issues with the layouts. ENVIRONMENT:  HTML, CSS3, JavaScript, jQuery, Bootstrap, backbone.js, Ajax, JSON, SOAP,Angular Js1.3. Client:HomeTelos - Dallas, TX\t\t Sep 2013 – May 2014 Role: Java/UI Developer Description:Worked on real estate asset management application in customizing and adding new functionality to family of HomeTelos Products Home Tracker and Bid Select to provide customizable and comprehensive solutions for managing and marketing real estate owned assets.  Responsibilities: Worked with BA team to understand the requirements and implement the new functionality and work. Developing scalable applications in a dynamic environment, primarily using Java, Spring,  web services and object/relationship mapping tools.   Hands on experience with data persistency using Hibernate and Spring, Framework. Developed the project in Java, different J2EE technologies like Struts, JSP, Servlet, JavaScript, HTML, and CSS.  Implementation of MVC architecture by separating the Business Logic from the presentation Logic using Struts framework.  Used JDBC in Data Access layer for data manipulation.  Developed DAO classes for the data interaction and service classes for the business logic Apache Tomcat, web server was used for deployment and administration of components.  Used Eclipse as software development platform for developing the whole application.  Created Action classes part of the Struts framework and mapped in the struts configuration file.  Developed XSD, WSDL for SOAP web services. Used SoapUI as web services testing tool  Created SQL queries and stored procedures.  Developed and deployed the applications using Tomcat. Used SVN for the version management.  Environment: JSP, Servlets, Spring, HTML, CSS, JavaScript, JDBC, JBOSS, Eclipse, SQL, Struts, Maven, Jenkins, Neon Technologies, Hyderabad, India                        Sept 2009 to July 2013 Role: Java Developer Responsibilities: Involved in analysis and design phases of Software Development Life Cycle (SDLC). Worked as a part of the Business Analysts team to understand the requirements. Written Technical Design Document for the application Development UI modules using HTML, JSP, JavaScript and CSS. Designed and developed application based on Spring MVC design pattern, used spring validation and wrote validation rules. Developed components using Spring Framework (Spring MVC, Spring DAO, Spring AOP) Primarily focused on the spring components such as Dispatcher Servlets, Controllers, Model and View Objects, View Resolver. Responsible in development of Web Services using SOAP based Web Services. Involved in the implementation of DAO using Spring-Hibernate ORM. Used Hibernate, object/relational-mapping (ORM) solution, technique of mapping data representation from MVC model to Oracle Relational data model with a SQL-based schema. Involved in the implementation of beans in Application Context.xml. Worked with the XML and developed Web Services using APACHE Axis. Extensively worked with Oracle to write store procedures and views Writing service methods and SQL queries to interact with the Oracle DBMS and writing test cases using JUnit Frames and also in Mango DB. Wrote different stored procedure and did fine tuning of slow performing SQL. Written Triggers, and Views as part of development of the Application. Developed the client side validation for the entire screen using Java Script Setup Data access layer with JDBC Template and Hibernate Template on Spring framework. Developed the project with good security features using hidden fields and encryption Prepared detailed design specifications and performed code reviews. Involved in Code Review Corrections & Bug fixing. Developed Test cases for Testing Environment:Java, J2EE, Spring MVC 2.5, JSP, JavaScript, Web Service, Hibernate 3.0, CSS, JAX-WS, J Boss 4.0.3 Oracle 11g, JUnit, AJAX,SQL, UNIX,HTML, SVN, Maven, SQL Developer. Encore Theme Technologies, Chennai, India                       Aug 2008to July 2009 Role: Junior Software Developer   \t\t\t\t Description:Shutterfly provides a range of products and services that make it easy, convenient and fun for consumers to upload, edit, enhance, organize, find, share, create, print and preserve their memories. Customers use our products and services to stay connected to their friends and family, to organize their photos and videos in a single location, to tell stories and to preserve their memories.  Responsibilities: Performed analysis for the client requirements based on the developed detailed design documents. Developed Use Cases, Class Diagrams, Sequence Diagrams and Data Models using Microsoft Visio. Developed Struts forms and actions for validation of user request data and application functionality.  Developed JSP's with Struts custom tags and implemented JavaScript validation of data. Developed programs for accessing the database using JDBC thin driver to execute queries, prepared statements, Stored Procedures and to manipulate the data in the database.  Involved in developing business tier using stateless session bean. Used JavaScript for the web page validation and Struts Validator for server side validation. Designing the database and coding of SQL, PL/SQL, and Triggers and Views using IBM DB2. Design patterns of Delegates, Data Transfer Objects and Data Access Objects. Developed Message Driven Beans for asynchronous processing of alerts. Used ClearCase for source code control and JUnit for unit testing.  Involved in peer code reviews and performed integration testing of the modules.  Environment: Java, J2EE, Struts 1.0, JSP, JDBC, Eclipse,  EJB, ANT, XML, IBM Web Sphere, JUnit, DB2, CVS. Educational Qualification: Bachelor's in computer science MAY 2008, JNTU INDIA"}