{"text": "Name: mary mary E-Mail: mary.mary@gmail.com Address: Paris, France Github: https://github.com/mary LinkedIn: https://linkedin.com/mary Phone No. 335046121911 Professional Summary Around 8+ years of IT experience in the Analysis, Design, Development, Testing and Implementation of business application systems for Health care, Pharmaceutical, Financial, Telecom and Manufacturing Sectors. Strong experience in the Analysis, design, development, testing and Implementation of Business Intelligence solutions using Data Warehouse/Data Mart Design, ETL, OLAP, BI, Client/Server applications. Strong Data Warehousing ETL experience of using Informatica 9.x/8.x/7.1 Power Center Client tools - Mapping Designer, Repository manager, Workflow Manager/Monitor and Server tools – Informatica Server, Repository Server manager. Expertise in Data Warehouse/Data mart, ODS, OLTP and OLAP implementations teamed with project scope, Analysis, requirements gathering, data modeling, Effort Estimation, ETL Design, development, System testing, Implementation and production support. Extensive testing ETL experience using Informatica 9.x/8.x/7.1 (Power Center/ Power Mart) (Designer, Workflow Manager, Workflow Monitor and Server Manager) Teradata and Business Objects. Strong experience in Dimensional Modeling using Star and Snow Flake Schema, Identifying Facts and Dimensions, Physical and logical data modeling using ERwin and ER-Studio. Expertise in working with relational databases such as Oracle 11g/10g/9i, SQL Server 2008/2005, DB2 8.0/7.0, UDB, MS Access and Netezza. Strong experience in Extraction, Transformation and Loading (ETL) data from various sources into Data Warehouses and Data Marts using Informatica Power Center (Repository Manager, Designer, Workflow Manager, Workflow Monitor, Metadata Manger), Power Exchange, Power Connect as ETL tool on Oracle, DB2 and SQL Server Databases. Experience using SAS ETL tool, Talend ETL tool and SAS Enterprise Data Integration Server highly preferred. Extensive experience in developing Stored Procedures, Functions, Views and Triggers, Complex SQL queries using SQL Server, TSQL and Oracle PL/SQL. Experience in resolving on-going maintenance issues and bug fixes; monitoring Informatica sessions as well as performance tuning of mappings and sessions. Experience in all phases of Data warehouse development from requirements gathering for the data warehouse to develop the code, Unit Testing and Documenting. Extensive experience in writing UNIX shell scripts and automation of the ETL processes using UNIX shell scripting. Proficient in the Integration of various data sources with multiple relational databases like Oracle11g /Oracle10g/9i, MS SQL Server, DB2, Teradata, VSAM files and Flat Files into the staging area, ODS, Data Warehouse and Data Mart. Experience in using Automation Scheduling tools like Autosys and Control-M. Worked extensively with slowly changing dimensions. Hands-on experience across all stages of Software Development Life Cycle (SDLC) including business requirement analysis, data mapping, build, unit testing, systems integration and user acceptance testing. Excellent interpersonal and communication skills, and is experienced in working with senior level managers, business people and developers across multiple disciplines. TECHNICAL SKILLS Catalina Marketing Corporation-St. Petersburg, FLJuly 2016-Till Date Sr. ETL/Informatica Developer Description:Catalina Marketing Corporation Inc. provides personalized digital media solutions for consumer packaged goods (CPG), agencies, and retail industry. It provides personalized and measurable campaigns that connect shoppers to CPG brands and retailers. The company also targets consumers via the digital channel, such as mobile, online, and in-store media networks. In addition, it provides promotions and messages based on the shopper’s purchase insights. The company was founded in 1983 and is based in St. Petersburg, Florida. It has operations in the United States, the United Kingdom, the Netherlands, Japan, Italy, Germany, France, and Belgium. Responsibilities: Responsible for Business Analysis and Requirements Collection. Worked on Informatica Power Center tools- Designer, Repository Manager, Workflow Manager, and Workflow Monitor. Designed and customized data models for Data warehouse supporting data from multiple sources on real time Involved in building the ETL architecture and Source to Target mapping to load data into Data warehouse. Created mapping documents to outline data flow from sources to targets. Involved in Dimensional modeling (Star Schema) of the Data warehouse and used Erwin to design the business process, dimensions and measured facts. Extracted the data from the flat files and other RDBMS databases into staging area and populated onto Data warehouse. Maintained stored definitions, transformation rules and targets definitions using Informatica repository Manager. Used various transformations like Filter, Expression, Sequence Generator, Update Strategy, Joiner, Stored Procedure, and Union to develop robust mappings in the Informatica Designer. Developed mapping parameters and variables to support SQL override. Created mapplets to use them in different mappings. Developed mappings to load into staging tables and then to Dimensions and Facts.Used existing ETL standards to develop these mappings. Worked on different tasks in Workflows like sessions, events raise, event wait, decision, e-mail, command, worklets, Assignment, Timer and scheduling of the workflow. Used Type 1 SCD and Type 2 SCD mappings to update slowly Changing Dimension Tables. Modified existing mappings for enhancements of new business requirements.Used Debugger to test the mappings and fixed the bugs. Wrote UNIX shell Scripts to FTP files from remote server to Informatica Server. Involved in Performance tuning at source, target, mappings, sessions, and system levels. Prepared migration document to move the mappings from development to testing and then to production repositories. Environment:Informatica Power Center 9.6.1, Workflow Manager, Workflow Monitor, PL/SQL, Oracle 11g, Autosys, SQL Server,Netezza, UNIX, Toad, Cognos, TFS Westfield Corporation-Madison,OHJune2014-June2015 Informatica Consultant Description:Westfield is in business for more than 158 years, Westfield Insurance, a member of Westfield Group, provides commercial and personal insurance solutions to the customers in the United States. It offers business insurance products and services such as property, liability, business auto, workers compensation, umbrella, surety bonds, loss control, and risk assessment for small, mid-size, and large businesses. The company also provides farm and agribusiness insurance products, as well as agribusiness and farm. Westfield markets its products through more than 1,200 leading independent insurance agencies and is one of the country's largest property and casualty insurers. Responsibilities: Created mappings and sessions to implement technical enhancements for data warehouse by extracting data from sources like Oracleand Delimited Flat files. Development of ETL using Informatica 8.6. Applied slowly changing dimensions like Type 1 and 2 effectively to handle the delta Loads. Prepared various mappings to load the data into different stages like Landing, Staging and Target tables. Used various transformations like Source Qualifier, Expression, Aggregator, Joiner, Filter, Lookup, Update Strategy Designing and optimizing the Mapping. Developed Workflows using task developer, worklet designer, and workflow designer in Workflow manager and monitored the results using workflow monitor. Created various tasks like Session, Command, Timer and Event wait. Modified several of the existing mappings based on the user requirements and maintained existing mappings, sessions and workflows. Tuned the performance of mappings by following Informatica best practices and also applied several methods to get best performance by decreasing the run time of workflows. Prepared SQL Queries to validate the data in both source and target databases. Worked on TOAD and Oracle SQL Developer to develop queries and create procedures and packages in Oracle. Worked extensively on PL/SQL as part of the process to develop several scripts to handle different scenarios. Created Test cases for the mappings developed and then created integration Testing Document. Prepared the error handling document to maintain the error handling process. Automated the Informatica jobs using UNIX shell scripting. Closely worked with the reporting team to ensure that correct data is presented in the reports. Interaction with the offshore team on a daily basis on the development activities. Environment:Informatica Power Center, Oracle 10g, MS-SQL Server, PL/SQL Developer, Bourne shell, Windows XP, TOAD, MS Office and Delimited Flat files, Control-M National Oilwell Varco-Houston, TX                                                       Oct 2012 – May 2014 Informatica Consultant Description: National Oilwell Varco (NOV) is an American multinational corporation based in Greater Sharpstown, Houston, Texas. It is a leading worldwide provider of equipment and components used in oil and gas drilling and production operations, oilfield services, and supply chain integration services to the upstream oil and gas industry. The company conducts operations in more than 1,200 locations across six continents.                                                Responsibilities: Designed and developed the data transformations for source system data extraction; data staging, movement and aggregation; information and analytics delivery; and data quality handling, system testing, performance tuning.  Member of warehouse design team assisted in creating fact and dimension tables based on specifications provided by managers. Created Informatica Mappings to build business rules to load data using transformations like Source Qualifier, Aggregator, Expression, Joiner, Connected and Unconnected lookups, Filters and Sequence, External Procedure, Router and Update strategy. Load operational data from Oracle, SQL Server, flat files, Excel Worksheets into various data marts like PMS and DEA. Designed and created complex source to target mappings using various transformations inclusive of but not limited to Aggregator, Look Up, Joiner, Source Qualifier, Expression, Sequence Generator, and Router Transformations. Extensively worked on Mapping Variables, Mapping Parameters and Session Parameters. Created post-session and pre-session shell scripts and mail-notifications Implemented effective date range mapping (Slowly Changing dimension type2) methodology for accessing the full history of accounts and transaction information. Design complex mappings involving constraint based loading, target load order. Use debugger in identifying bugs in existing mappings by analyzing data flow, evaluating transformations and Create mapplets that provides reusability in mappings. Involve in enhancements and maintenance activities of the data warehouse including performance tuning, rewriting of stored procedures for code enhancements. Designed workflows with many sessions with decision, assignment task, event wait, and event raise tasks, used Informatica scheduler to schedule jobs. Environment:Informatica Workflow Manager, Designer, Monitor, Oracle 10g, MS-SQL Server, PL/SQL Developer, Unix, SQL Developer US BANK-MILPITAS, CA                                                                                            Jan 2011 – Sep 2012 ETL Developer Description: US Bank, one of the largest commercial bank in US, provides a comprehensive line of banking, brokerage, insurance, investment, mortgage, and trust and payment services products to consumers, businesses and institutions. The project was aimed at the creation of a web-based payment environment for managing and processing payment transactions. It included features such as authorization, settlement, and refunding of credit card and electronic check payments for E-Commerce Customers, tracking of payment processing and other administrative functions. Responsibilities: Involved in requirements gathering, functional/technical specification, Designing and development of end-to-end ETL process for Sales Data Warehouse. Studied the existing OLTP system(s) and Created facts, dimensions and star schema representation for the data mart. Used Informatica power center for (ETL) extraction, transformation and loading data from heterogeneous source systems. Imported Source/Target Tables from the respective databases and created reusable transformations (Joiner, Routers, Lookups, Rank, Filter, Expression, and Aggregator) in a Mapplet and created new mappings using Designer module of Informatica. Modeled the data warehousing data marts in Star join schema. Created Stored Procedures for data transformation purpose. Created Tasks, Workflows, Sessions to move the data at specific intervals on demand using Workflow Manager and Workflow Monitor. Extensively worked on the performance tuning of the Mappings as well as the sessions. Involved in writing UNIX shell scripts for Informatics ETL tool to run the Sessions Working with database connections, SQL joins, cardinalities, loops, aliases, views, aggregate conditions, parsing of objects and hierarchies. Environment:Informatica Power Center, Oracle 9i, PL/SQL, Erwin 3.5, Sun Solaris, TOAD, SQL Navigator. Colruyt-Hyderabad, India\t\t\t\t\t\t\tFeb 2009 – Dec 2010 Informatica Developer Description: Colruyt Group is a Belgian based retailer of Food and non-Food products. Over the past decades, the group has grown to a giant retailer in food and non-food products with a unique sales formula. Colruyt is the number one retailer in Belgium who offers its products at the “lowest prices” with high quality. Sustainability is the DNA of the group and we sustain in a highly competitive retail domain with the help of over 200 shops. The group is spread across Belgium, France and Luxembourg and business activities are managed with the help of over 27000 Colruytians. The Colruyt Group has global sales of over 8.3 billion euros. Responsibilities: Interacted with business analysts and translate business requirements into technical specifications.  Using Informatica Designer, developed mappings, which populated the data into the target.  Used Source Analyzer and Warehouse Designer to import the source and target database schemas and the mapping designer to map the sources to the targets.  Responsibilities included designing and developing complex informatica mappings including Type-II slowly changing dimensions. Worked extensively on Workflow Manager, Workflow Monitor and Worklet Designer to create, edit and run workflows, tasks, shell scripts.  Developed complex mappings/sessions using Informatica Power Center for data loading.  Enhanced performance for Informatica session using large data files by using partitions, increasing block size, data cache size and target based commit interval.  Extensively used aggregators, lookup, update strategy, router and joiner transformations.  Developed the control files to load various sales data into the system via SQL*Loader.  Extensively used TOAD to analyze data and fix errors and develop.  Involved in the design, development and testing of the PL/SQL stored procedures, packages for the ETL processes. Developed UNIX Shell scripts to automate repetitive database processes and maintained shell scripts for data conversion Environment:Informatica Power Center, Oracle 9i, PL/SQL, TOAD, Unix, Control-M.  Education: Bachelors in Computer Science and Information Technology - JNTU, INDIA"}