{"text": "Name: lillian lillian E-Mail: lillian.lillian@gmail.com Address: Shenyang, China Github: https://github.com/lillian LinkedIn: https://linkedin.com/lillian Phone No. 555086158945 Summary: Over 6 years of experience on technical phases of Software Development Life Cycle (SDLC) - deployment, maintenance, analysis, design, architecture, development, testing of Web Based applications using Java/JEE. Proficient in developing front-end systems with HTML, CSS, JavaScript, Bootstrap, jQuery, Ajax, JSP, Servlets, Java Server Faces(JSF) and JavaScript frameworks such as AngularJS. Experience in publishing and consuming web services using SOAP and RESTful API. Experience in developing application using Spring Framework that uses features of IOC, AOP, and MVC, and Spring Boot. Involved in designing Spring MVC application and Hibernate to design module structure. Comfortable in configuration and deployment of multi-tier applications using servers like Web Logic, Tomcat, Web Sphere and JBOSS. Proficient in IDEs like Eclipse, Notepad++, Dream Wear and Adobe Photoshop. Involved in Requirements and Analysis Understanding the requirements of the client and the flow of the application as well as the application Framework. Good knowledge in developing Single Page Applications (SPA) using JavaScript MVC frameworks such as Angular JS. Responsive design approach using HTML5 and CSS3 to support device integration. Good experience in core java concepts like collections, multi-threading, exception handling and has experience with UNIX and LINUX commands. Involved in developing the multiple enterprise applications, which are developed using Spring MVC framework, Hibernate framework, RESTful web services. Implemented Hibernate in data access layer to access and update information in the database. Experience utilizing Spring Framework, Inversion of Control, Oriented Programming and MVC. Worked on Algorithms and Data Structures. Designed and built SOAP Web Services interfaces implemented in Java. Developed test scripts in JUnit and involved in testing. Responsible to create DAO CRUD methods using Hibernate&Spring framework. Involved in daily Scrum meetings to keep track of the ongoing project status and issues. Used GIT for version controlling and regularly pushed the code to GitHub. Used GIT to maintain current and historical versions of files such as source code, web pages, and documentation. Used agile methodology for the software development and used JIRA for task assignment, bug tracking and fixture. Education: Bachelors in Engineering, Hyderabad, INDIA Master’s in Computer Science, California, USA  Technical Skills: Java/J2EE Frameworks             : JDBC, Servlets, Struts, spring, Spring JMS, JDBC\nWeb Technologies                    :  HTML5, CSS, Ajax, XML, AngularJS\nApplication/Web Servers        :  Apache Tomcat, Web Logic, Web Sphere Application Server, JBoss\nDatabases                                  :  DB2, PL/SQL Oracle, NoSQL - MongoDB. Operating Systems                   : Windows XP/VISTA/7, UNIX, Linux\t Relational Mapping Tools       : Hibernate, Spring ORM, JPA\nScripting Languages                 : Java, C/C++, SQL, Java script\nSoftware Methodologies        : Object Oriented Analysis & Design, UML, SDLC (Agile) Development Tools\t         : IntelliJ, JavaBeans IDE                                               : Eclipse, Net Beans, My Eclipse\nSource Control                          : SVN, CVS, Git\nOperating Systems                   : UNIX, WINDOWS XP/7.0, MS DOS\nTools                                           : Maven, Log4J, JUnit, SoapUI, Jenkins Framework                                : jQuery, AngularJS, Node.js, Bootstrap Professional Experience: Sun Life Financial, Wellesley Hills, MA\t\t\t\t\t\t       July 2017 – Till Date Role: Java Developer Description: Sun Life Financial is a leading financial services organization dedicated to helping customers achieve lifetime financial security which provides a wide range of insurance and investment products and services in key markets around the world. Responsibilities: Involved in all the phases of SDLC including Requirements Collection, Design & Analysis of the Customer Specifications, Development and Customization of the Application. Actively participated in sprints and successfully implemented the project following scrum agile practice. Involved in the all phases of Software development life Cycle process, in short ours is 3 weeks sprint. Developed Object Model and UML design models for developing Use cases and created Sequence diagram, class diagram and active diagrams for application components and interfaces. Migrate out dated Java code to state of the art Java 8 code with advanced Maven builder and Spring Boot platform. Used Spring Transactions in the application and developed Session beans for the business logic at the middle tier level. Designed and developed Application based on Spring Framework, Spring MVC and spring templates. The Spring MVC architecture was employed in order to implement various aspects of cluster deployment tool such as for data-access, model view controller and also authentication and authorization. Implementing REST services for product data lookup using NoSQL database. Used Spring Framework for Dependency Injection and integrated with Hibernate DAOs. Used Hibernate framework in persistence layer for mapping an object-oriented domain model to a relational database. Intensively working on UNIX/LINUX commands to access the FTP Server through Putty. Involved in implementation of enterprise integration with Web Services and Legacy Systems using SOAP, and REST. Responsible for creating and maintaining architecture for Restful API using Spring Boot. Worked extensively on spring boot for building web service. Used spring core Annotations for Dependency Injection Spring DI and Spring MVC FOR Rest API’s, Spring Boot for micro services and Spring Batch for running batching jobs. Used Hibernate Beans tomap to tables and retrieve data from the database. Worked with Jenkins, CI/CD pipeline to integrate and deploy the code in to the Server. Involved in setting up Maven configuration and helping Continuous Integration (CI) Issues. Implemented Service Oriented Architecture (SOA) using JMS for sending and receiving messages while creating web services. Used MongoDB database to provide recommendations on Performance tuning for applications. Hands on experience with SOAP UI in performing the Integration and regression testing. Set up Jenkins Server and build jobs to provide continuous automated builds based on polling the Git source control system during the day and periodic scheduled builds overnight to support development needs using Jenkins, Git, JUnit and Maven.  Provided extensive pre-delivery support by fixing bugs and code reviews. Familiarity with Issue and Project-tracking tool, JIRA. Environment: Java 1.8, HTML5, CSS3, JavaScript, JQuery, XML, Spring Boot,  Angular.js, Agile, Hibernate, RESTful web service, SOAP, AJAX, MongoDB,Oracle, Jenkins, Windows, Eclipse IDE, Maven, Eclipse, Git, Agile. MyVest, San Francisco, CA\t\t\t\t\t\t            August 2016 – June 2017 Role: Java Developer Description:  MyVest builds enterprise wealth management technology for the digital age. Driven by a vision for client-centric advice, we empower firms to deliver personalized portfolios at scale. Responsibilities: Identify software requirement in monthly Agile Scrum Grooming meeting with project manager and business analyst, and create tasks based on the requirement. Develop Spring Batch applications to process encrypted batch files. Develop and setup Control-M scripts to manage batch jobs of Spring Batch Application Design and develop business components using Spring Boot. Experience in using various design patterns such as MVC in the development of Multi-Tier distributed Enterprise Applications. Experience in developing Web Applications using springand Hibernate. Integrated the application with Spring-MVC using Spring Boot, Spring Dependency Injection (DI), and Spring Annotations. Implement Routing part of application using Angular JS ng-route module, routing provider service with HTML5 views/CSS 3 styles. Implement AngularJS Service layer with utility functions to get data from back end using Rest based service calls and pass back to Angular Controllers. ExposeREST URL through internal Data Power to provide HTTP error handling. Implemented the Bootstrap framework to offer responsive webpage. Integrate Spring REST Request Mapping with Web SEAL URL gateway to provide URL level authorization. Integrate Web service URLs with internal/external API management (APIM) to achieve enhanced security by using Oauth2 Token based authentication framework. Use DB2 to store user data. Experience in developing testing and deploying applications using Web Sphere Application Server. Used Maven build scripts for the project build and deployment process. Used GitHub, Maven for version control, build dependencies. Provide database SQL scripts to Database Administrators (DBA) to analyze the software performance impact. Build Maven Scripts for the application. Internal/external dependencies with Scrum Master and provide up-front actions to reduce the negative impediment. Prioritize tasks and assign them to team members based on team capacity and individual capacity during bi-weekly Agile Scrum Planning meeting. Environment:  Java 1.5,  Spring MVC, DB2, HTML5, CSS3, JavaScript, Hibernate, Maven, Web Sphere, REST, Angular JS,   Bootstrap, Spring Batch, Spring Integration, JUnit, Jenkins, Git, Jenkins, LDAP, Control-M, BASH, JSON, XML, Agile methodology.\n Dr First, Rockville, MD\t\t\t\t\t                                        August 2015 – June 2016\nRole: Java Developer Description: DrFirst pioneers software solutions and services designed to optimize healthcare provider access to patient information, improve the doctor’s clinical view of the patient at the time of care, and enable more effective, efficient administration and collaboration across a patient’s circle of caregivers. Responsibilities: Involved in creating Use cases, Class diagrams and Interaction Diagrams and Involved in various phases of Software Development Life Cycle (SDLC). Developed user Interfaces using JSP's to provide unique personalized look-and-feel for administrators and other users of the system. Used spring framework for dependency injection, transaction management in different layers. Developed the Action classes, Action forms and Action servlet for Web tier. Providing server side and client-side validation using JavaScript and Struts Validator framework. Used Struts Internationalization for providing the labels on the User Interface. Used AJAX in user validation and suggestion list and to display dialog boxes. Developed the Business logic on the web tier using EJB Stateless Session beans. Designed and implementing Session Facade, Service Locator and DTO design patterns. Involved in designing the user interfaces using JSPs. Used Eclipse for writing code for JSP, Servlets. Involved in Design documentation and implementation. Developed business layer components using enterprise java beans (EJB). Developed JUnit test cases for all the developed modules. Used SVN for version control across common source code used by developers. Developed XML, Web Services using SOAP, WSDL. Used JDBC to invoke Stored Procedures and database connectivity to ORACLE. Environment: J2EE, JDK, JSP, JavaScript, spring, Eclipse, Struts, Hibernate, HTML, AJAX, XML, EJB, PL/SQL, JUnit, Web Services, UNIX, SVN, Apache Tomcat, Oracle, SOAP, WSDL. Hexaware Technologies, India\t\t\t\t\t\t            April 2011 – August 2013 Role: Java Developer Description: Common Securitization platform (CSP) is a federal government sponsored back office system to monitor secondary mortgage industries like Freddie Mac to Produce, Issue and Service securities. It performs five essential functions like Data Acceptance, Issuance Support, Disclosures, Master Service Operations and Bond Administration. Responsibilities: Design, develop and implement Customer Requirements using J2EE, Java, Java Server Pages (JSPs) and XML. Involved in development of presentation layer using JSPs and Servlets with Development tool Eclipse IDE. Worked with MVC Architecture integrating Hibernate and spring frameworks. Mailing system using java mailAPI to notify the staff when a customer submitted a policy. Worked on development of Hibernate, including mapping files, configuration file and classes to interact with the database. Implemented Object-relation mapping (ORM) in the persistence layer using hibernate frame work in conjunction with spring functionality. Involved in injecting dependencies into code using spring core module. Used Spring Core Annotations for Dependency Injection (DI). Involved in developing code for obtaining bean references in spring framework using Dependency Injection (DI) or Inversion of Control (IOC). Used Web Services - WSDL and SOAP for getting required information from third party. Designed and Developed Stored Procedures, Triggers in Oracle to cater the needs for the entire application. Developed complex SQL queries for extracting data from the database. Environment: Java, JDK 1.5, Servlets, Hibernate 3.2, JPA 2.0, Spring 2.5, Ajax, Oracle 10g, Eclipse 3.4, Apache Ant, Web Services (SOAP, RESTful), Apache Axis 2.0, Web Sphere 6.1, JavaScript, HTML, CSS, XML."}