{"text": "Name: helen helen E-Mail: helen.helen@gmail.com Address: Heze, China Github: https://github.com/helen LinkedIn: https://linkedin.com/helen Phone No. 669792540365 Summary: - 7+ years of versatile experience in analysis design development and implementation of software applications and in developing n-tier architecture based solutions with distributed components and internet/intranet applications.  Well versed in all aspects of software development life cycle (SDLC) including system design, development, and delivery of enterprise software and experience in developing applications using Agile Software Methodology.  Thorough working knowledge in application development using Java SE, with strong experience in Spring, Hibernate, Struts, Rest/SOAP web services, JDBC, Servlet, EJB, JMS, Java Server Pages, JQuery, JavaScript, JSF, Angular JS, AJAX, XML, HTML, XSLT, JAXB. Extensive experience developing application in various domains like Financials, E-commerce, workflow and web based arena.  Expertise in conceptualizing, designing and coding technical solutions using Java/J2EE technology stacks.  In depth exposure to Web 2.0 solutions, developing web services, OOAD architecture and modeling and designing artifacts experience in Java/J2EE applications.  Experience in Java design patterns such as Session Façade, Singleton, Data Access Objects (DAO), Model View Controller, Front controller, factory, abstract factory, singleton and Business Delegate.  Experience in developing Web Services using - SOAP, WSDL, REST and developing DTDs, XSD schemas for XML.  Hands-on experience in different modules (Spring Core, Spring MVC, Spring ORM, Spring JDBC, Spring AOP, Spring Security) of Spring Application Framework.  Experience in writing DAO using Hibernate and Hibernate mapping files.  Have Strong knowledge on C++ and C programming languages.  Experience in development of data access objects, data transfer objects as part of the persistence layer and EJB components to perform the business logic.  Experienced in working with message oriented middleware using different technologies like JMS,Web sphere MQ and Message driven beans(MDB). Experienced in design/development of UI screens using HTML, CSS, Java Script, JQuery, AngularJS, AJAX.  Experience in developing and deploying applications on Web Logic, JBOSS, Apache Tomcat Application servers.  Experienced in developing LDAP Authentication & Authorization Services using Java, LDAP.  Good Knowledge in building and deploying Apache ANT/ MAVEN scripts for deployment and customizing WAR/ JAR file management for web applications.  Experience in implementing software best practices, including Design patterns, Use Cases, Object Oriented analysis and design, Agile methodologies, and Software/System Modeling(UML). Good experience in designing and coding stored procedures and functions using PL/SQL and also fine tuning SQL queries.  Exposure to various Relational Database Managementsystems such as Oracle, MySQL. Experience in software testing, Junit testing, regression testing, defect tracking and management using JIRA.  Used version controller tool like GIT, Subversion and CVS.  Extensively worked on debugging usingEclipse, Net Beans debugger.  Integrated logging frameworks such as Log4J and commons for logging and debugging the application.  Strong knowledge developing dynamic web applications and deploying in various environments such as Windows and Linux.  Involved in Understanding functional specifications and developing creative solutions to meet business requirements.  Hold excellent analytical skills in order to work with mid-size teams, technical and business leadership.  Strong communication & relationship management skills, enthusiastic & self-driven, with a high degree of commitment. Professional Summary Citibank  New York, NY\t\t\t\t\t\t\t\t\tSep 2015 – Current  Java Developer Responsibilities:  Involved in the analysis, design, and development and testing phases of Software Development Lifecycle (SDLC).  Designed and implemented the J2EE with MySQL in Eclipse IDE.  Developed the UI using JavaScript, JSP, HTML, CSS, Json, AngularJS for interactive cross browser functionality and complex user interface.  Implemented the web based application following the MVC architecture using Spring 4 Framework.  Developed and Consumed RESTful Web Service.  Providing a framework for mapping object-oriented domain model to a traditional relational database using Hibernate 4.0 ORM framework.  Used Hibernate to store the persistent data as an Object-Relational Mapping (ORM) tool for communicating with database.  Expertise in MVC Architecture using JSF and Struts framework and implementing custom tag libraries. Development using the Use Cases and business logic & Unit Testing.  Utilize programming methodologies and languages and adhere to coding standards, procedures and techniques while contributing to the technical code documentation.  Participate in design reviews and provide input to the design recommendations; incorporate security requirements into design; and provide input to information/data flow, and understand and comply with Project Life Cycle Methodology.  Day to day communication with remote developers, through mail, phone, conference calls, for resolving issues, understanding business requirements.  Environment: Java/J2EE (JSP, Servlet), JAXB, Web Services, HTML, CSS, JavaScript, JSF, AngularJS, JQuery, JUnit, JavaBeans, Spring 4, Hibernate 4.0, MySQL, JBoss, log4J. Deerwalk Kathmandu, Nepal                                                                                            \tMay 2013 – Aug 2015 Java Developer Responsibilities:  Interacted with the stakeholders and gather requirements and business artifacts based on Agile SCRUM methodology. Used IntelliJ as an IDE. Extracting, manipulating, transforming (Excel, EDI to CSV, CSV etc. to XML, CSV to JSON etc.) and loading US healthcare data using distributed data processing Cascading on Hadoop. Transformed client data to standard defined layout to feed into different products like Plan Analytics, Health Portal and Care Manager. Involved in writing JSP and JSF components.  Used JSTL Tag library (Core, Logic, Nested, Beans and Html taglib's) to create standard dynamic web pages. Writing code on Big Data technology; Cascading Framework on upper layer of Hadoop Map Reduce Integrating jobs for manipulating and transforming the data Outputs the data on HDFS and MySQL Uses of AWS S3 (Simple Storage Service) file storage for storing data EMR (Elastic MapReduce) cluster for processing big data Focusing on optimization and integrating new features  \nEnvironments: Java, JUnit, Cascading, Big Data, S3, MySQL, EMR Cluster, JSF, Maven, XML, CSV, Excel, EDI, Git, SVN, Linux, Shell Script Unity Finance LTD\t\t\t\t\t\t\t\tJan 2010 – Apr 2013 New Road, Kathmandu Java Developer Designed and developed Application based on Spring Framework, Spring MVC, Spring Templates, Hibernate, Web Services using Axis and Jersey Frame works. Used Spring Core for concept Inversion of control (IOC) implemented using dependency injection. Developed Spring Controllers, Service Components, DAOs, Web Services and UI Integration for developing presentation layer of the application Hands on experience with data persistency using Hibernate and Spring Framework Involved in setting up Maven configuration and helping Continuous Integration (CI) Issues\n Environment: Java, J2EE, Servlets, JSP, JDBC, Spring, Spring Boot, Hibernate, Web Services, RESTFUL, HTML, CSS, XML, AJAX, jQuery, Mockito, MAVEN, Oracle, Design Patterns, UNIX, Tomcat, MySQL, Oracle, GIT, Windows, Linux"}