{"text": "Name: elizabeth elizabeth E-Mail: elizabeth.elizabeth@gmail.com Address: Nairobi, Kenya Github: https://github.com/elizabeth LinkedIn: https://linkedin.com/elizabeth Phone No. 94886896748 PROFESSIONAL SUMMARY Extensive experience in object-oriented programming, design and development of Multi-Tier distributed, Enterprise applications using Java and J2EE technologies with Software Development Life Cycle (SDLC). Experienced in developing applications using Java, Spring MVC, Hibernate, SpringBoot, JSP, Servlets, Apache Struts, JDBC, JNDI, JUnit, Mockito, Oracle, MSSQL, DB2. Experienced in the design, development and implementation of Model View Controller (MVC) using Spring MVC and DAO using Hibernate, Software Engineering, UML, Sequence Diagram, API Documentation in Swagger & WSO2 Manager. Proficient in developing Restful SpringBoot Microservices.  Experienced in configuring and installing Spring Config Server for externalizing application specific configuration. Client-side design and validations using HTML5, CSS, JavaScript, JSP, jQuery, AngularJS. Experienced in setup and configuration of Jenkins in the Linux server. Experienced in writing Groovy pipeline scripts in Jenkins for Continuous Integration and Deployment (CICD). Experience in deploying and configuring on Application & Web Servers such as JBOSS, BEA WebLogic, and Apache Tomcat Web Server. Experienced in setup, configuration and implementation of monitoring tool such as Prometheus, Elastic Stack and visualization tool such as Kibana and Grafana. Hands on experience in JMS over messaging to exchange the information in more reliable and asynchronous way in enterprise Applications. Used Apache ActiveMQ as JMS provider. Experienced in configuring Elastic Search, Kibana, Logstash. Used Elastic Stack as logging and monitoring framework in a distributed architecture. Good exposure on using various tools like IntelliJ, Spring Tool Suite, Eclipse, DataGrip, SQL Developer. Excellent analytical, communication and interpersonal skills.  Experienced software development in Agile/Sprint and Waterfall model. TECHNICAL SKILLS Languages:\t\tJava, C, C#, SQL, Bash, Python, Shell Scripting, Groovy Web: \tHTML5, CSS3, JavaScript, jQuery, AngularJS2+, React, JSON, XML, DOM, JAX-B, XSD, XSLT, Spring MVC, SpringBoot, Struts 2 Enterprise:\tJava core, I/O, Swing, Java Beans, JDBC, JSP, Servlets, Spring, Hibernate, Java Security   Frameworks:\tJavaFX, JUnit, Mockito, Log4j, Maven, Swagger 2, Spring Config Server, Spring Admin  Web Services:\t\tREST, SOAP, JAX-RS  Web/App Servers:\tJBoss, Tomcat, WebLogic Tools:\tJenkins, Consul, Docker, ElasticStack—ElasticSearch, Kibana, Logstash, Beats, Splunk, PUTTY, JIRA, Oracle VM, XLR, eCP Cloud Console, WSO2 Manager, Prometheus, Grafana, Soap UI, Postman, SonarQube IDES: \tEclipse, IntelliJ, Spring Tool Suite (STS), Microsoft Visual Studio, Sublime Text 3, Visual Studio Code, JetBrains DataGrip, SQL Developer Version Control:\tGit, GitLab, GitHub, Bitbucket, SVN Databases:\t\tOracle, MS-SQL Server, MySQL, DB2  Platform:\t\tWindows, Linux, UNIX SDLC:\t\t\tAgile/Scrum, Waterfall Design Patterns:\tMVC, Front Controller, Singleton, DAO EXPERIENCES American Express, Phoenix, AZ | July 2018 - Present Role: Java Full Stack Description Legacy application in Java that has customer travel and agents’ demographics information. There are various components that support different aspects of the business and are also interdependent with each other’s databases. Most services written in monolithic SOAP based services along with legacy Stored Procedures. As part of Software Modernization, our task was to migrate these legacy services to Restful web services according to Rest Standards and Microservice Architecture.  Responsibilities Worked in various stages of Software Development Life Cycles such as design, development, deployment and testing. Worked in latest open source Framework such as SpringBoot, Spring MVC, Java, Hibernate. Migrated existing legacy applications to SpringBoot Rest APIs.  Worked in Agile development methodology and used Agile concepts such Continuous Integration and Deployment with XLR for deployment, Jenkins for Integration, etc. Wrote wrapper service to call database stored procedure and exposed it to consumers as Rest API. Wrote custom utility jars that is used by multiple applications. Created API documentation using Swagger 2.0. Used JBOSS server to deploy WARs. Replaced existing legacy front-end framework with Spring MVC and called backend services to make the application modern and efficient. Used Rally to add and update daily tasks and progress. Used Bitbucket as repository. Front end development using Spring MVC, Apache Tiles, HTML, JavaScript, CSS. Converted existing SOAP-based services to SpringBoot Rest services. Wrote unit tests in Junit/Mockito. Used XSDs file to convert to POJOs using JAX-B. Involved in troubleshooting and debugging of existing legacy codes using debugger in IntelliJ. Deployed application using XLR and Jenkins to OpenShift ePAAS. Maintained code analysis and quality using SonarQube. Used Splunk for Server-side logging along with eCP Cloud Console. Used Elastic Search as document database. Used Docker to create images of the application and run it locally.  Environment: Java 8, Hibernate, Spring MVC, SpringBoot, Jenkins, CI CD, XLR, eCP, OpenShift, JUnit, Mockito, Docker, Maven, JBOSS, MicroService, Swagger, JAX-RS, RESTful, JSON, IntelliJ, DataGrip, Postman, Log4J, Oracle 11g, SonarQube, Linux/Unix, Rally CVS Health, Northbrook, IL | Jan 2016 – June 2018 Role: Java Developer Description This application is a Prescription Routing and Dispensing system in the health care domain. It involves various stages such as receiving the orders, validating customers, validating the medicine, preparation, routing and dispensing. The legacy application had maintenance costs, difficulty in scaling and performance issue. With a team of developers and architects, our team engineered a newer distributed architecture where applications would be highly available, highly performing, maintenance-friendly, scalable, and loosely coupled. Our role was to develop components after series of Proof of Concepts on various products, tools and technologies that would fit together in this architecture. This platform has a backbone of RESTful APIs along with responsive and highly performing front end platform developed in Angular. Our team configured huge set of tools such as Jenkins, SpringBoot, Angular, GitLab, Spring Admin, WSO2, Consul, Spring Config Server, Elastic Search, Prometheus, etc. Responsibilities Involved in various phases of Software Development Life Cycle (SDLC) such as requirements gathering, modeling, development estimates and analysis, design, development, testing and production. Prepared technical design document for Java Restful API. Generated Use Case diagrams, UML Sequence diagram and Class diagrams using Visual Studio. Developed Restful Java API to retrieve data from MS SQL database as JSON. Implemented Spring MVC Framework and Hibernate for persistence. Developed SpringBoot Microservices in a distributed architecture and prepared Application Design Document to incorporate technical designs.  Used WSO2 API Manager and Swagger to design API and document the Service Contract of Microservices. Performed unit testing of Java Classes using JUnit and Mockito Framework. Implemented SLF4J and Log4J for Server-side/Client-side logging. Worked with tables, views, types, triggers, complex join queries, stored procedures and functions on Oracle and MS SQL database along with configuration of data source using JNDI. Used Consul as Service Registry and Discovery tool. Used Spring Cloud Config Server to externalize properties in the Microservice Architecture.  Analyzed, reviewed and compared several tools and software as Proof of Concept (POC) to support and establish Distributed Microservice Architecture.  Installed and configured several tools such as Jenkins, Spring Config Server, Elastic Search, Kibana Dashboard, Beats agent in the servers.  Performed POC on Elastic Suite-Elastic Search, Kibana Dashboard, X-Pack, Beats. Analyzed Elastic search and compared its monitoring capabilities with other tools. Installed Elastic Stack in server. Enabled SSL, Alerting and Reporting using X-Pack. Monitored API servers, using Metricbeats. Wrote Java classes to post JMS Message to queues in RabbitMQ. Maintained code quality using SonarQube server. Used GitLab as source code repository for Java codes and externalized configuration repository for Spring Cloud Config Server. Developed branching strategies that fit the Microservice Architecture and to facilitate Continuous Integration and Deployment with Jenkins. Took the responsibility to do the code merges from feature branch to release and regression branch. Wrote Groovy pipeline scripts in Jenkins to automate application Continuous Integration and Deployment. Wrote Linux shell script for deployment.   Environment: Java 8, Hibernate, Spring, SpringBoot, Jenkins, CI CD, Consul, Service Discovery/Registry, Elastic Stack 6+, Kibana Dashboard, Prometheus, Spring Config Server, GitLab, JUnit, Maven, UML, SOA, Microservice, JAX-RS, RESTful, JSON, Spring Tool Suite, Postman, Log4J, Oracle 11g, HP Quality Center, SonarQube, Linux/Unix, Bash Scripting, RabbitMQ Alliance Bernstein, Piscataway Township, NJ | Sep 2013 – Dec 2015 Role: Java Full Stack Developer Description This product is developed to capture customer information—personal details, assets, verification, family details, income and expenditure details. Here, the client uses this information for banking purposes. The product also talks and interacts with multiple other business modules such as loans, insurance and mutual funds.  \nResponsibilities Involved in various phases of Software Development Life Cycle (SDLC) such as requirements gathering, modeling, analysis, design, development and testing. Generated the use case diagrams, Activity diagrams, Class diagrams and Sequence Diagrams in the design phase. Developed the User Interface using JSP, Spring MVC frameworks, jQuery, HTML and CSS.  Experience for building an internal, responsive AngularJS single page application. Hands on experience with AngularJS to execute expressions directly within HTML page. Used Spring framework AOP features and JDBC module features to persist the data to the database for few applications. Also used the Spring IOC feature to get hibernate session factory and resolve other bean dependencies. Developed Hibernate entities and wrote POJO classes for storing data and DAO's to retrieve the data and did other database configurations using EJB. Deployment and Configuration of application server JBoss deploying Java and Web Application. Worked with teams responsible for development, user acceptance, and performance testing, production & disaster recovery server. Used Tortoise SVN to maintain the version of the files and took the responsibility to do the code merges from branch to trunk and creating new branch when new feature implementation starts. Wrote Unit Test Cases using JUnit framework and Server-side Logging & Client-side logging using Log4J (Apache open Source API) and Maven scripts for the building the applications. Environment: Java, Hibernate, Spring, Servlets, XML, Tortoise SVN, JSP, MVC, JUnit, Maven, UML, RESTful, SOAP UI, Log4J, Oracle 11g, Jenkins, Rally, Linux/Unix, JavaScript, AngularJS, JIRA Blue Cross Blue Shield, Chicago, IL | Jan 2010 – Aug 2013 Role: Java Developer Responsibilities Involved in all phases of the Software development life cycle (SDLC) using Agile Methodology. Developed Use Case Diagrams, Object Diagrams and Class Diagrams in UML. Developed enterprise application using J2EE. Utilizing XML descriptors to describe screens, their actions, and their security roles'/levels. Involved in writing Spring Configuration XML file that contains declarations and other dependent objects declaration. Developed front end using Struts framework and user interface using JSP and JavaScript to simplify the complexities of the application. Developed Java Beans, Action Classes, and Action Mapping and hibernate classes to retrieve and submit using the Struts. Developed various Java beans for performance of business processes and effectively involved in Impact analysis. Created REST services to receive membership and service data for users. Designed and developed Hibernate DAO's using spring framework's Hibernate Dao Support and Hibernate Template. Created tables, SQL queries in Oracle 10g using SQL Developer. Involved in Unit Testing of various modules by generating the Test Cases. Involved in Bug fixing of various modules that were raised by the testing teams in the application during the Integration testing phase. Implemented Log4J for Logging Errors, debugging and tracking using loggers. Environment: Java, JNDI, JSP, Servlets, JSTL, Spring (Services, DAO, MVC etc.), Struts, JavaScript, jQuery, Log4j, XML, Maven, Ant, SVN. request"}