{"text": "Name: margaret margaret E-Mail: margaret.margaret@gmail.com Address: Alexandria, Egypt Github: https://github.com/margaret LinkedIn: https://linkedin.com/margaret Phone No. 516147374610 SUMMARY OF EXPERIENCE: Over 6+ years of professional IT experience in all phases of Software Development Life Cycle (SDLC) - Analysis, Design, Implementation, Integration, Testing and Maintenance of applications using Java/J2EE and object oriented Client/Server and Web-based inter and intranet Multi-Tier architectures. Proficient in server side distributed object development using J2EE, JMS, JNDI, RMI, Servlets, JDBC, IBM Websphere Server and JBoss Application Server and Tomcat Web Server, XML, WSDL & SOAP. Experience in web technologies J2EE, Servlets, JSP’s, JSP Custom Tags Libraries, Java Beans, Apache Jakarta Struts, Spring, Hibernate, JavaScript, JQuery, XML, DHTML and HTML. Proven experience in Tomcat and Websphere, Web logic Application Servers and JBOSS on Unix/Sun Solaris/Windows Platforms.  Good experience in Splunk UI/GUI development and operations roles Implemented Web services by applying SOA concepts in conjunction with SOAP. Experience in writing database objects like Stored Procedures, Triggers, PL/SQL packages and Cursors for Oracle, SQL Server, DB2 and MySQL databases. Involved in creating and then developing Spring based JAX-WS web services using Apache Axis 2, JAX-WS API web services. Proficient in writing promotion build scripts using Ant, Maven 2.0 and Apache Ivy. Proficient in unit testing the application using JUnit.  Experienced in implementing applications with Model-View-Controller (MVC) pattern using Jakarta Struts. Proficiency in Implementation of the version control software Clear Case, Subversion, CVS and VSS.  Strong Database development experience in writing functions, procedures, packages, triggers, and views in PL/SQL with strong knowledge of RDBMS fundamentals. Experience in Agile software development process, Test Driven Development and Scrum. Strong communication and interpersonal skills. TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE: Client: Tunstall, Pawtucket, RI\t\t\t   \t                     \t                  Sep 2016 – Till date Role: Java developer Responsibilities: Prepared technical design, unit test cases, detailed time estimation, traceability matrix, impact analysis and code reviewed documents for each iteration task.  Developed the application with iterative methodology, refactoring the existing code and writing new code. Created Use cases, Class Diagrams, and Sequence Diagrams for the system using JUDE UML modeling tool.  Used Spring Model View Controller (MVC) 2 architecture. Used JSPs in front-end, Spring framework in business layer and Hibernate in persistence layer. Involved in developing Spring IOC to communicate with the persistence layer.  Involved in using Spring AOP framework for security transactions, reusability logging purpose. Involved in developing Hibernate configuration and hbm files using tools.  Good experience in implementation of Internationalization (i18n) in web applications with spring frameworks along with JSP’s and Servlets. Developed front-end content using JSP, JavaScript, JQuery, HTML, JHTML and JSTL.  Used Struts Tiles framework to create layouts in user interface. Written SQL Queries and stored procedures to interact with Oracle 11g. Implemented RESTful web services using Jersey API and JSON. Developed complex Splunk dashboard by writing Splunk Queries.  Developed UNIX Shell scripts for automating project management tasks.  Configured Data Sources for the Oracle database system using IBM Websphere.  Implemented REST API Interface for Splunk searches Developed JUnit test cases for elements, web beans, handlers and view helper classes. Focused on Test Driven Development; thereby creating detailed JUnit tests for every single piece of functionality before actually writing the functionality. Involved in the defects resolution for the better quality and increased performance of product.  Performed the technical design reviews and code reviews.  Coordinated with Business Analyst, Architecture and QA team to ensure the quality and success for each iteration tasks.  Environment:  Java, JavaScript, JQuery, Servlets, JSP, Spring 3.0, JSTL, Hibernate 3.1,Web Services, WSDL,  UML, HTML, CSS, IBM Websphere Application Server, Splunk, JUnit, UNIX, Oracle. Client: Bed Bath & Beyond, Union, NJ                                                                                  Feb 2016 - Aug 2016 Role: Java developer Responsibilities: Involved in project design documentation, design and code reviews. Implemented MVC-Model 2 architecture using Struts 1.2 and other J2EE design patterns for the application development. Created and configured struts-config.xml, spring.xml files to manage control flow. Designed Use Case diagram, Class diagram and Sequence diagram using Rational Rose. Developed static and dynamic Web Pages using JSP, HTML, JQuery and CSS. Designed and implemented Tiles and Layouts to the existing JSP files. Implemented Spring Modules for Designing, Developing & Testing of Service Layer Business Components. Developed JSP custom tag libraries, and associated support in the Action Servlet, that assists in creating interactive form-based applications, which is the one of the primary area of functionality using Struts Framework. Consumed Web Services (WSDL, SOAP, and UDDI) from third party for authorizing payments to/from customers. Fixed the problems in the production log files by debugging using Splunk. Used Hibernate ORM framework as persistence engine, configured hibernate.xml file and Involved in Mapping, Coding and Fine tuning of hibernate Queries. Used Action classes to service requests from Action Servlet and Business Data on server-side and invoke respective Spring Injected Beans to process Database transactions. Configured connection pooling using Websphere application server. Designed XSDs, XML Schema for data transmission and XSL style-sheets to generate Excel sheets, pdf from xml documents. Developed and deployed the Application on Websphere using ANT build xml script. Developed Message based systems using Spring-JMS API and Message Driven POJOs. Developed Action classes, which communicate asynchronous messaging via JMS/MQ-Series to DB2. Used Clear Case as the version control system and application development using RAD. Configured and created application log file using Log4j. Implemented Junit for application Unit Testing. Environment: Java/J2EE, Struts1.2(Validation and Tiles), JMS1.1, Spring2.0, Hibernate3.0, JQuery, Puppet, Cheff, Websphere, Web Service, Unix, Maven, Windows, Splunk, JavaScript, HTML, DHTML, CSS, OOAD, JSTL, Log4J, Ant, UML, Rational Rose, Rational Clearcase, RAD, Junit, XML/XSL, XSLT, DOM Parser, Eclipse, Oracle 9i Client: Tenaska Power Services Co., Arlington, TX\t                                                 Apr 2015 – Dec 2015 Role: Java Developer\t Responsibilities:  Involved in the requirements gathering. Design, Development, Unit testing and Bug fixing Developed application using Struts, Spring and Hibernate. Developed rich user interface using JavaScript, JSTL, CSS, JQuery and JSP’s. Developed custom tags for implementing logic in JSP’s. Used Java script, JQuery, JSTL, CSS and Struts 2 tags for developing the JSP’S. Used custom tags to display logic specific data in JSP'S. Involved in making release builds for deploying the application for test environments. Used Oracle database as backend database. Wrote SQL to update and create database tables. Used Putty for UNIX login to check the server logs. Used Eclipse as IDE. Used Web Logic as application server. Used AJAX and JSON for asynchronous call to the servers. Used Spring IOC for injecting the beans. Used Hibernate for connecting to the database and mapping the entities by using hibernate annotations. Used JUNIT and JMOCK for unit testing. Used Maven and Hudson as build tool and deploying the application. Implemented Find Bugs tool which reports the errors in the project. Used SVN and CVS as repositories. Used Spring JDBC template with hibernate to access the data from the database. Used JAXB and Castor transformer for marshalling and Un-marshalling. Used SOAP UI for calling the Web-Services. Environment: Java 1.5, Spring, Hibernate, Web sphere, Struts 2, JSP, JSTL, SQL Developer, JQuery, CSS, Java Script, Maven,  Eclipse,  Find bugs, Putty, Design patterns, SVN. Client: Lincoln Peaks, Boston, MA\t        \t\t\t\t\tSep 2014 – March 2015  Role: Junior Java Developer  Responsibilities: Developed presentation tier using JSP, Struts framework and Presentation Facade. Used JSPs to develop presentation layer for the front end and struts to drive it and JDBC framework to persist the objects brought back from the data source (ORM). Designed, developed, and validated the presentation layer using HTML, JavaScript and JSP.  Used perforce for configuration management and version control. Coordinated with the BA and QA team for requirements gathering through to design document preparation. Used Rational Clearcase and Serena prototype creation tool for this purpose. Used Rational Software Architecture which is IBM’s eclipse based IDE and Websphere Application Server. Extensively used design patterns like DAO, value object, transfer object, presentation façade. Implemented JDBC Framework for Object relational Mapping to SQL Server Database. Extensively used Struts tag libraries (like html, bean, logic etc.) in the JSP pages. Developed Stateless Session Enterprise Java Beans (EJB) to encapsulate the business logic. Designed and developed various SQL Server database query scripts. Generated reports for batch processing using Hyperion. Involved in Application Development, Enhancements and Bug fixes and PIR process. Written unit tests using JUnit. Environment: Java EE 5, IBM Websphere Application Server 6, RSA/Eclipse 7.5, SQL Server 2005, EJB, Hibernate, Spring, Struts, XML,JNDI, Perforce, Hyperion, XML ,Spy, UML, ANT, JUnit. Client: Visual Soft, Hyderabad, India \t\t\t\t\t\t      Jan 2012 – July 2014 Role: Jr. J2EE Developer Responsibilities: Gathered/analyzed functional requirements for the new phase in design. Developed the user interface using JSP, Java Servlets and java Script. Contributed to architecting the framework according to the J2EE Design Patterns (Client tire, Middle tire, Business tire). Developed Use-case diagrams, class diagrams according to the UML standards. Developed both client and server side functionality using Struts and J2EE technologies. Developed Action classes to delegate the request to the business models and Action Forms. Created XML files to provide Context and Hibernate Mapping for database persistence. Worked on XSD’s (Schema Changes) and WSDL’s. Involved in writing complex queries using PL/SQL to extract data from database and to delete the data and to reload the data on Oracle database. Developed functional test cases for Integration and Functional testing, regression testing, and user acceptance testing. Developed various scripts for Creation and deployment of the code package using Weblogic. Implemented the SQL queries for database interaction. Worked as support in production for various production issues. Environment: J2EE 1.4, Struts1.1, JSP, AJAX, JDBC, Oracle 9i, Weblogic 8.1, JavaScript, Java Beans, EJB 2.0, HTML, UML, Junit, Ant ,Tiles Framework, Validation framework and Design Patterns, Windows XP."}