{"text": "Name: ruth ruth E-Mail: ruth.ruth@gmail.com Address: Qujing, China Github: https://github.com/ruth LinkedIn: https://linkedin.com/ruth Phone No. 284882361086 Overview Resource Skills: Over 16 years’ experience in the Information Technology industry. Extensive hands – on experience in administration of Window SharePoint Services 2.0, 3.0, SharePoint Portal Server 2003, Microsoft Office SharePoint Server 2007/2010/2013. Very Good experience in the development and customization of Window SharePoint Service 2.0, 3.0, SharePoint Portal Server 2003, Microsoft Office SharePoint Server 2007, SharePoint 2010, SharePoint 2013 using SharePoint Designer, Visual Studio 2005, 2008, 2010, 2012, 2013 and  C#. Extensive experience in create app for SharePoint Online (Office 365) Extensive experience in migrate SharePoint 2007, SharePoint 2010 to SharePoint 2013. Very good experience in Microsoft Windows Azure. 5 years of experience of Microsoft Dynamic CRM. Installation and Customization Microsoft Dynamics CRM 4.0/2011/2013/2015. Integrate Microsoft BizTalk Server 2006/2009 with Different System according Business requirements.  Web Content Management, Document and Records Management in SharePoint. Experience with complete application development life-cycle including requirements gathering, analysis and design, coding, testing and development. Extensive background in designing and building web-based applications using ASP.NET, ASP.NET MVC (2.0, 30.4.0, 5.0,6.0), JQuery AJAX, Silverlight, WCF, Twitter Bootstrap, AngularJS, KnockoutJS.  Hybrid Mobile Apps using Telerik Platform (Cordova), Native Mobile App for IOS, Android, Windows, Cross Platform Mobile apps using Xamarin. Extensive experience in building .NET applications. Programming Languages: C# (16+ yrs.), AJAX (9+ yrs.), VB.NET (14+ yrs.), ASP.NET (16+ yrs.), ASP.NET MVC (8+ yrs.), ASP/VBScript (8 yrs.), Visual Basic 6.0 (8 yrs.), PHP (5+ yrs.), JAVA/ JSP (1.5+ yrs.), Java Servlet (1+ yrs.), VB Script, Silverlight, JavaScript, HTML/DHTML (16+yrs), HTML5/CSS, XML Technology (XSL, XSD, XSLT) (9+ yrs.), C (2 yrs.), C++ (2 yrs.), SQL (14yrs), PL-SQL (7 yrs.), Visual C++ 6.0 (Familiarity), Visual C++ 2005. PHP Framework: Symphony ,Zend ,PEAR , CakePHP 3.0 ,  Laravel ,  Phalcon , Code igniter , Aura ,YII2.0,  FuelPHP, PHPixie. PHP/.Net CMS: DotNetNuke, Umbraco, Sitefinity, Kentico, mojoPortal, WordPress, CodeIgniter, Magento, Joomla 3.5, Drupal 8, Concrete5 5.6, PHP-Fusion 7.02.05, CMS Made Simple 2.0.1.1, Textpattern 4.5.7, Moodle 3.0, Forma Lms 2.0, LEPTON 2.1.0, CMS Made Simple 2.0.1.1, JAKCMS 2.2.6, Joostina CMS 1.4.4, Radiant CMS, Cushy CMS, SilverStripe, Alfresco, MODx, TYPOlight, Expression Engine, Radiant CMS, DokuWiki 2015-08-10a \"Detritus”, BlackCat CMS 1.2, PHPWiki. Microsoft Technologies: Window SharePoint Server 2.0 & 3.0(4+ yrs.), SharePoint Portal Server 2003, Microsoft SharePoint 2007/2010/2013, Microsoft SharePoint Designer 2007/2010/2013, BizTalk Server 2006, Microsoft Dynamics CRM 4.0/2011, InfoPath 2007/2010/2013, Active Directory Federation Service 1.1/2.0, SAML 2.0, Power Pivot. Third Party Controls:  Kendo UI (3 years), Telerik (5 yrs.), DevExpress (5 yrs.), DHTMLX  Mobile Technologies: MobileApp (IOS, Android, Windows), hybrid mobile app using Telerik Platform (Cordova) (2 yrs), Xamarin (2 yrs), Mono Mac (1.5 years), MonoDevelop (1.5), IOS Application (1.5 yrs.), Android Application (2 yrs). Ecommerce:  Magneto, osCommerce, Zen Cart, Opencart,Authorize.net, Prestashop, Drupal Commerce, Woo Commerce, WP e-Commerce, Jigoshop, Spree Commerce. JavaScript Framework: JQuery, JQuery UI, AngularJS (3+ yrs), Knockout JS (2+ yrs), Node JS (3 +yrs) API:  Twitter, Facebook, Google and LinkedIn, Google Maps Engine Operating Systems: MS Windows 95/98SE/Me/2000/XP/NT/2003/2008/7/8/10/2012 Source Controls: Visual SourceSafe, Microsoft Team Foundation Server, TortoiseSVN, GitHub, Visual Studio Online Git/TFS. Databases: SQL Server 2000/2005/2008/2012/2014 (16+ yrs.), Oracle (5 yrs), Access (7yrs), SQL Server Notification Service, SQL Server Reporting Service, SQL Server Integration Service, SQL Server Analysis Service, SQL Business Intelligence, MySQL, PostgreSQL, Interbase, ORM, MongoDB Others: Visual Studio (16+ yrs.), UML (Use case/Class Diagram 5yrs), Visual SourceSafe (5+ yrs), CSS (16+yrs), Flash (Familiarity), Dreamweaver (Familiarity), Photoshop (Familiarity), Visual Age for Java (1+ mo.), Seagate Crystal Report 8.0 & 9.0, 10.0 & 11.5 (8 +yrs), CNC Programming (Familiarity), Master Cam 9.0 (Familiarity), Auto Cad 2004. Programming Languages: C# (14+ yrs), AJAX(7+ yrs), VB.NET (14+ yrs), ASP.NET (14+ yrs), ASP.NET MVC (6+ yrs), ASP/VBScript (8 yrs), Visual Basic 6.0 (8 yrs), PHP (10 yrs), JAVA/ JSP (1.5+ yrs), Java Servlet (1+ yrs), VB Script, JQuery, Silverlight, JavaScript, HTML/DHTML  (9+yrs), HTML5/CSS, XML Technology (XSL, XSD, XSLT) (7+ yrs), C (2 yrs), C++ (2  yrs), SQL (14yrs), PL-SQL (7 yrs), Visual C++ 6.0 (Familiarity), Visual C++ 2005 (Continue), Window SharePoint Server 2.0 & 3.0(4+ yrs), SharePoint Portal Server 2003.  Microsoft Office SharePoint Designer 2007(6+ yrs), BizTalk Server 2006, Moss 2007, Microsoft SharePoint 2010, Microsoft Dynamics CRM 4.0/2011, InfoPath 2007/2010/2013, Mono Mac(1.5 years), MonoDevelop(1.5), IOS Application(1.5 yrs.), Android Application(2 yrs), Active Directory Federation Service 1.1/2.0, SAML 2.0, Power Pivot, Kendo UI(3 years), Telerik(5 years), AngularJS(2 years), Mobile App(IOS, Android, Windows), hybrid mobile app using Telerik Platform(Cordova)(1 year), Xamarin(1 year), ColdFusion. Operating Systems: MS Windows 95/98SE/Me/2000/XP/NT/2003/2008 Databases: SQL Server 2000, 2005, 2008 (14+ yrs.), Oracle (5 yrs), Access (7yrs), SQL Server Notification Service, SQL Server Reporting Service, SQL Server Integration Service, SQL Server Analysis Service, SQL Business Intelligence. Others: Visual Studio (14yrs), Visual Studio.NET (12+ yrs), UML (Use case/Class Diagram 5yrs), Visual SourceSafe (5+ yrs), CSS (14+yrs), Flash (Familiarity), Dreamweaver (Familiarity), Photoshop (Familiarity), Visual Age for Java (1+ mo.), Seagate Crystal Report 8.0 & 9.0,  10.0 & 11.5 (8 +yrs), CNC Programming (Familiarity), Master Cam 9.0 (Familiarity), Auto Cad 2004. \n Work History Work Experience Installation, Configuration and Administration of SharePoint 2007,2010/2013, Online. Develop SharePoint Hosted, Provided Hosted and Hybrid Apps in SharePoint 2013/Online. Integrated asp.net with AngularJS Integrated with Kendo UI Components. Creating various types of Apps in SharePoint 2013/Online.  Creating SharePoint solutions using Visual Studio 2010/2012/2013, .NET 4.0/4.5 framework, SharePoint Designer, JQuery and ECMAScript for SharePoint 2010/2013. Configure SharePoint Service Application like User Profile, Manage Metadata, Business Catalog Service, Secure Stored Service, and Search Service. Integration of custom SharePoint Standard workflow using SharePoint Designer and Visual Studio, Nintex Workflows. Development of taxonomy using the Managed Metadata Service Mentoring Sr. Net consultants on SharePoint Development SharePoint deploy using PowerShell Script. Architecting company-specific reusable framework for SharePoint Solutions/Web Parts/Features/Web Templates//Event Receivers/BCS. Ongoing client-facing consultation for gathering business requirements and proposing best-practice solutions in SharePoint 2010/2013. In-depth hands-on knowledge of the Microsoft Dynamics CRM platform, the entity model, security model, and Web services. In-depth hands-on knowledge of Advance Developer Extensions for Dynamics CRM / xRM framework. Hands-on experience architecting solutions that involve CRM customization to include server side code, custom business logic, integration modules, workflow assemblies and plug-ins Experience with customizing the Web client or Dynamics CRM for Microsoft Office Outlook to include scripting, integration/development of custom Web pages using the CRM user interface and style guides Hybrid Mobile Apps using Telerik Platform (Cordova). Native Mobile App for IOS, Android, Windows. MEAN Full Stack Web Application.  \nTechnologies & Methodologies included: Visual Studio 2010/2012/2013, Windows 2008 R2/20012 R2, SharePoint Server 2010/2013/Online, C#, ASP.NET, ASP.NET MVC Framework 3.0/4.0/4.5/4.6, WCF/WPF/WF, AJAX, MS TFS, JQuery/JavaScript, Hyper-V, SQL Server 20012/2014 R2, Telerik Controls. Installation, Configuration and Administration of SharePoint 2010/2013. Develop SharePoint Hosted, Provided Hosted and Hybrid Apps in SharePoint 2013. Integrated asp.net with AngularJS Integrated with Kendo UI Components. Creating various types of Apps in SharePoint 2013.  Creating SharePoint solutions using Visual Studio 2010/2012/2013, .NET 4.0/4.5 framework, SharePoint Designer, JQuery and ECMAScript for SharePoint 2010/2013. Configure SharePoint Service Application like User Profile, Manage Metadata, Business Catalog Service, Secure Stored Service, and Search Service. Integration of custom SharePoint Standard workflow using SharePoint Designer and Visual Studio, Nintex Workflows. Development of taxonomy using the Managed Metadata Service Mentoring Sr. Net consultants on SharePoint Development Deploy using PowerShell Script. Architecting company-specific reusable framework for SharePoint Solutions/Web Parts/Features/Web Templates//Event Receivers/BCS. Ongoing client-facing consultation for gathering business requirements and proposing best-practice solutions in SharePoint 2010/2013.  \nTechnologies & Methodologies included: Visual Studio 2010/2012/2013, Windows 2008/20012 R2, SharePoint Server 2010/2013, C#, ASP.NET, ASP.NET MVC Framework 3.0/4.0/4.5/4.6, Silverlight, WCF/WPF/WF, AJAX, MS TFS, JQuery/JavaScript, Hyper-V, SQL Server 20012/2014 R2, Telerik Controls DevExpress, AngularJS, Telerik Kendo UI.  SIAMS (Secured Identity & Access Management System) Application provides Authentication and authorization for other applications. Developing SharePoint Application of Govt. of Alberta Advanced Education & Technology Department. Analysis and Designing Client/Server Application Installing and Configuration SharePoint 2010/2013. Designing and developing custom Application Page for SharePoint in ASP.NET. SharePoint 2013 App Development for SharePoint Online, On-Promise. Creating Content Type and Deploy Content Type to Sandbox. Developing BDC for Custom List and Web Part.  Creating WSP and deploy solution package to server farm. WCF/WPF. Managing SharePoint Permission. Developing solution package and deploy to Server farm. Developing features for content Types, web Part and Custom Actions. Designing and developing Forms in InfoPath. Installation and Configuration ADFS 1.1/2.0. Protected Asp.net Web Application and SharePoint Web Application using ADFS 1.1/2.0 Migration from ADFS 1.1 to 2.0. Customization ADFS Pages. Integrated asp.net with AngularJS Integrated with Kendo UI Components. In-depth hands-on knowledge of the Microsoft Dynamics CRM platform, the entity model, security model, and Web services. In-depth hands-on knowledge of Advance Developer Extensions for Dynamics CRM / xRM framework. Hands-on experience architecting solutions that involve CRM customization to include server side code, custom business logic, integration modules, workflow assemblies and plug-ins Experience with customizing the Web client or Dynamics CRM for Microsoft Office Outlook to include scripting, integration/development of custom Web pages using the CRM user interface and style guides Technologies & Methodologies included: Visual Studio 2010/2012, Windows 2008 R2, ADFS 2.0, Windows Identity Foundation,  SharePoint Server 2010/2013,  C#, ASP.NET, ASP.NET MVC Framework 3.0/4.0,  Silverlight, WCF/WPF/WF, AJAX, MS TFS, JQuery/JavaScript, Hyper-V, SQL Server 2008 R2, DevExpress, AngularJS, Telerik Kendo UI .  Design and Developing Material Control Application for Hood Group. Gathering requirement for Material Control. Design SQL Server Database.  Design MVC model for Material Control. Designing and developing Application in ASP.NET. Creating WCF Web Services. Developing Silverlight Web Part.  Managing form based authentication. Technologies & Methodologies included: Visual Studio 2010, Windows 2008 R2, C#, ASP.NET, Silverlight, WCF/WPF/WF, AJAX, MS TFS, JQuery/JavaScript, Hyper-V, SQL Server 2008, and Telerik.  Developing Application for CPSA (Physician of Alberta). Analysis and Designing Client/Server Application Installing and Configuration SharePoint 2010. Designing and developing custom Application Page for SharePoint in ASP.NET. Creating Content Type and Deploy Content Type to Sandbox. Developing BDC for Custom List and Web Part.  Creating WSP and deploy solution package to server farm. Developing Web Services using WCF. Managing SharePoint Permission. Developing solution package and deploy to Server farm. Developing features for content Types, web Part and Custom Actions. Designing and developing Forms in InfoPath. Technologies & Methodologies included: Visual Studio 2010, Windows 2008 R2, SharePoint Server 2010,  C#, ASP.NET, Silverlight, WCF/WPF/WF, AJAX, MS TFS, JQuery/JavaScript, Hyper-V, SQL Server 2008, DevExpress .  Analysis and Designing Client/Server Application Installing and Configuration SharePoint 2007/SharePoint 2010. Designing and developing custom webpage in ASP.NET. Creating Content Type and Deploy Content Type to Sandbox. Developing BDC for Custom List and Web Part.  Creating WSP and deploy solution package to server farm. Creating and Customizing Work Flow using Visual Studio and SharePoint Designer. Managing SharePoint Permission. Developing solution package and deploy to Server farm. Developing features for content Types, web Part and Custom Actions. Designing and developing Forms in InfoPath. Set up Microsoft CRM Environments and demonstrate them to potential prospects. Lead Microsoft CRM team to implement CRM system for clients. Gather end-users’ business requirements and translate them into CRM Application functions with perform gap analysis design to complete the clients’ business requirements Create and develop Microsoft Dynamics CRM Custom parts (callout, workflow, data migration, email integration, new web forms, sitemap, ISV functions) to plug in into out-of-the box of MS CRM Solution. Perform gathering business requirements needs and translate into Microsoft Dynamics CRM functions. Customize CRM reports to specific business requirements need by using SQL Reporting Service. Strong experience to use C#, Jscript, Workflow assembly, Callout assembly, MS CRM SDK Tool, Data Migration for Microsoft Dynamics CRM customization parts. Provide end-users’ training for CRM system with post deployment support. Develop custom CRM Web Application Systems by using ASP.NET, SQL Server/Oracle for supporting online / e-commerce operations of small and medium businesses. Integrated SharePoint 2007 and MS CRM 4.0. Developed MS CRM 4.0 plug in and work flow assembly to support sales, accounting, and customer services business process for system integrator client. Integrated other web application with MS CRM by using IFrame and MS CRM Web Services. Technologies & Methodologies included: Win XP Professional , .NET Framework, VS.NET 2008, C#, JavaScript, SQL Server Reporting Service , ASP.NET, ASP.NET MVC Framework,  AJAX, WSS 3.0, Moss 2007, SharePoint 2010, MS-SQL Server 2005& 2008, Oracle 10g,Nintex work flow, Cruise Control, SQL Server Integration Service , Toad , WPF/WCF, Silverlight, Cruise Control, MS Build, Microsoft Dynamics CRM 4.0, Microsoft BizTalk Server 2009. Problem management and Incident management, Change management, Knowledge management, Dashboard for real time Technical management, Configuration management, Service Level management, Asset Management including License Compliance, Report and Data Analysis capabilities for strategic management and Quality management. Design and Developing Web Portal, Windows Base Application, Web Service. Analysis and Designing Client/Server Application Installing and Configuration SharePoint 2007. Database design and developing, database Configuration Application, database Upgrade Application. SharePoint Application was developed using medium Server farm configuration, Extensive use of personalization, branding, custom web parts, content types, InfoPath forms, and Custom workflows using Windows Workflow Foundation  Set up Microsoft CRM Environments and demonstrate them to potential prospects. Lead Microsoft CRM team to implement CRM system for clients. Gather end-users’ business requirements and translate them into CRM Application functions with perform gap analysis design to complete the clients’ business requirements Create and develop Microsoft Dynamics CRM Custom parts (callout, workflow, data migration, email integration, new web forms, sitemap, ISV functions) to plug in into out-of-the box of MS CRM Solution. Perform gathering business requirements needs and translate into Microsoft Dynamics CRM functions. Customize CRM reports to specific business requirements need by using SQL Reporting Service. Strong experience to use C#, Jscript, Workflow assembly, Callout assembly, MS CRM SDK Tool, Data Migration for Microsoft Dynamics CRM customization parts. Provide end-users’ training for CRM system with post deployment support. Develop custom CRM Web Application Systems by using ASP.NET, SQL Server/Oracle for supporting online / e-commerce operations of small and medium businesses. Developed MS CRM 4.0 plug in and work flow assembly to support sales, accounting, and customer services business process for system integrator client. Integrated other web application with MS CRM by using Iframe and MS CRM Web Services. Technologies & Methodologies included: Win XP Professional,  .NET Framework,VS.NET 2005, C#, VB.NET, JavaScript, Crystal Report 11.5, ASP.NET, AJAX, WSS 3.0, Moss 2007, MS-SQL Server 2005, Oracle 10g, Visual Source Safe, Toad, Microsoft Dynamics CRM 3.0, Microsoft BizTalk Server 2006. Design and Developing Web Application, Windows Base Application, Web Service. Database design and developing, Improve database performance. SharePoint Application was developed using medium Server farm configuration, Extensive use of       personalization, branding, custom web parts, content types, InfoPath forms, and Custom workflows using Windows Workflow Foundation. Technologies & Methodologies included: Win 2003 Server, .NET Framework, VS.NET 2005, C#, VB.NET, JavaScript, Crystal Report, ASP.NET, AJAX, WSS 2.0, SharePoint Portal Server 2003, MS-SQL Server 2005, Oracle 10g, Visual Source Safe Design and Developing Web Application, Windows Base Application, Web Service. Database design and developing, monitor and improvement database performance. Web Content Management using SharePoint, Creating and manage SharePoint Portal. Customize and Administration of SharePoint. Technologies & Methodologies included: Win 2003 Server, .NET Framework, VS.NET, C#, VB.NET, Crystal Report, ASP.NET, JavaScript, MS-SQL Server, Oracle, Visual Source Safe, SharePoint. Design and Developing Web Application, Windows Base Application, Web Service. Develop reports using Crystal Report and Integrated with ASP.Net Web Application/Windows Apps Database design, developing stored procedure, Triggers, Views and Performance improvement for large dataset. Technologies & Methodologies included: Win 2000 Server, .NET Framework, VS.NET, C#, VB.NET, Crystal Report, ASP.NET, JavaScript, MS-SQL Server, Oracle, and Visual Source Safe Design and Developing Web Application, Windows Base Application, Web Service. Developing Enterprise ASP.Net Web Application.  Database design, developing, Performance Monitor Technologies & Methodologies included: Win 2000 Server, ASP, Visual Studio, InterDev, VB, Crystal Report, JavaScript, SQL Server, ASP.Net, C#, Skills Maintenance & Education History Mechanical Related Computer Knowledge: •\tProgramming of CNC Milling Machine from CIPET, Ahmedabad •\tMaster Cam 9.0 from Infoquest Computer Academy, Gandhinagar"}