{"text": "Name: virginia virginia E-Mail: virginia.virginia@gmail.com Address: Chenzhou, China Github: https://github.com/virginia LinkedIn: https://linkedin.com/virginia Phone No. 53179477014 PROFESSIONAL SUMMARY: 6+ years of experience as Oracle Pl/Sql Developer and have experience in creating complex database objects like Stored Procedures, Functions, Packages and Triggers using SQL and PL/SQL. Experience in creating Collections like Associative arrays, Nested tables, Varrays. Experience in creating Cursors, using Bulk collect and for all in Cursors, Parameterized Cursors. Experience in creating Row Level and Statement level Triggers, Instead of Triggers, Compound Triggers Comprehensive Experience in various types of oracle technology based projects in multi-tier environment for sectors like Banking and Insurance.   Performed SQL and PL/SQL tuning, monitored production database using automatic workload repository (AWR), automatic database diagnostic monitor (ADDM). Experience of Data flow diagrams, Data dictionary, Database normalization theory techniques, Entity relation modeling and design techniques. Experience in Tables, Views, Constraints, Index (B Tree, Bitmap and Function Based). Developed Materialized views for data replication in distributed environments. Knowledge in Table Functions, Indexes, Table Partitioning, Collections, Analytical functions, Query Rewrite. Experience with Oracle Supplied Packages such as DBMS_JOB and UTL_FILE, DBMS_STATS and DBMS_SCHEDULER. Extensive involvement in development and Performance tuning of SQL and PL/SQL using HINTS, Bulk collect, Global Temporary tables, Explain Plan, Tkprof, Table Partitioning, Indexes and Join Optimization. Good knowledge on Logical and Physical Data Modeling using Normalization Techniques. Experience in Oracle utilities like Export/Import and data pump utilities like EXPDP/IMPDP.  Experience in Exception handling of System defined, User defined Exceptions. Excellent Communication, Interpersonal, Analytical skills and Strong ability to perform as part of a Team. Ability to work independently and to manage multiple competing priorities, and desire to learn new functionalities and technologies. Possess excellent communication and problem solving skills, and work ethics. Worked on Data Migration and Production support for the backend database and reporting applications. Excellent technical and analytical skills with clear understanding of design goals of ER modeling for OLTP and dimension modeling for OLAP. TECHNICAL SKILLS: Languages                                   : SQL, PL/SQL, T-SQL, UNIX Shell Script. Scripts/Web Technologies  : HTML, PHP, Java. Databases                                    : Oracle 11g, 12C, MS SQL SERVER 2005/2008,  Tools & Utilities                        : TOAD, SQL Developer, SQL*PLUS, Informatica, ADDM, AWR, Github,   \t\t\t\t\t    bamboo, Jenkins. OS                                                    : Windows XP/10, Linux. EDUCATION:  Chicago State University, Chicago, IL. \t\t       \t\t\t      Aug 2015-May 2017 Master of Science: Computer Science.   JNTU, Hyderabad, Telangana.                                                                                    Aug 2009-May 2013 Bachelors of Technology: Electrical and Electronics Engineering. PROFESSIONAL EXPERIENCE: Mastercard, O’Fallon, Missouri                                                                                        July 17-Till date      Role: Oracle PL/SQL Developer Project: Smartdata. The General Data Protection Regulation (EU) (\"GDPR\") is a regulation in EU law on data protection and privacy for all individuals within the European Union (EU) and the European Economic Area (EEA).According to the compliance the data has to be purged in accordance with the regulation. Responsibilities Created PL/SQL stored procedures, triggers and packages and created scripts for purging of data. Created cursor, collections and database triggers for maintaining complex integrity constraints and implement the complex business rules. Developed sql scripts for creating database objects such as tables, views and sequences. Created SQL*Loader and UNIX scripts as a part of data load process to load external data into Oracle database tables.  Work with Oracle Data Pump (expdp and impdp) which provides high speed, parallel, bulk data and metadata movement of Oracle database contents. Experience in using hints to direct the optimizer to choose an optimum query execution plan  Involved in preparing the test scenarios and performed unit tests on PL/SQL programs Experience in Atlassian products such as BitBucket, JIRA, Confluence, SourceTree, and Bamboo. Experience in all phases of Software Development Life Cycle (SDLC) such as Requirement gathering, Analysis, Development, Testing, Implementation and Support. Extensive experience in Data migration techniques using External tables, import and export, SQL*loader, bulk and batch processing. Validated and loaded data into Oracle Database using DB links and external tables from CSV files. Worked in Agile environment and participated in day to day processes like scrums and sprints using Rally. Worked with dev-ops team for flyway migration in different Dev and stage environments and solve complex problem during migration.  Hands on experience in writing, maintaining, testing and debugging code in applicable programming languages. Implemented PL/SQL scripts in accordance with the necessary Business rules and procedures. Participated and interacted with different teams from off shore and on shore from different countries for requirement gathering and solve complex problems. Environment: Oracle12c, TOAD, SQLDeveloper, MSExcel, Github, Jenkins, bamboo, UNIX.   Mphasis Corporation, NY                                                                                              Dec 2016-June 2017      Role: Oracle PL/SQL Developer Project: Connect Risk Engine Genesis. Risk engine interim is about a small business level insurance, which deals with property, vehicle, shipping, transportation level insurances. Here we build a module i.e. when a customer lose or damage his product or a property due to the reason like man made mistakes  or because of natural disasters we compensate the customer’s  with a logically calculated premiums according to the business rules .These premiums are calculated into benchmark premiums and manual premiums. Manual premium is calculated in an application called TAP and the premium we got from Risk Engine Interim Application is assigned to benchmark premium and the resultant score is calculated and this score decides the damage and its tier factors according to which a premium is calculated. Responsibilities Created PL/SQL stored procedures, functions and packages for auto renewal of quotes. Created scripts to create new tables, views, queries for new enhancement in the application using SQL Developer. Created indexes on the tables for faster retrieval of the data to enhance database performance. Used Bulk Collections for better performance and easy retrieval of data, by reducing context switching between SQL and PL/SQL engines. Created records, tables, collections (nested tables and associative arrays) for improving Query performance by reducing context switching. Involved in optimizing database performance by analyzing database objects, creating indexes, creating materialized views etc.  Participated  in  system  analysis  and  data  modeling,  which  included creating  tables,  views,   indexes,   synonyms and packages. Created programming code using advanced concepts of Records, Collections and Dynamic SQL. Involved in Performance testing, User Acceptance testing of the application and participated in Code and Design Reviews, Status meetings and Walkthroughs. Used UTL_FILE to load the data into oracle tables from FLAT, CSV and Text files..  Environment: Oracle 11g, SQL Server, TOAD, SQL DEVELOPER, XML publisher, Shell script, MSAccess, GIT, UNIX. CNA financial Corp, Chicago, IL                                                                                   Dec 2015-Nov 2016 Role: Oracle PL/SQL Developer Responsibilities: Experience in Oracle SQL  and  PL/SQL  including  all  database  objects: Stored procedures, functions, Packages , TYPE  Objects,  cursors, REF cursors, Parameterized cursors, Views,  Materialized  Views,   PL/SQL collections. Designed ER diagram using Visio, to set the logical and physical relationships of database. Designed and developed complex mappings by using Lookup, Expression, Update, Sequence generator, Aggregator, Router, Stored Procedure, etc. transformations to implement complex logics while coding a mapping  using Informatica.  Wrote sequences for automatic generation of unique keys to support primary and foreign key constraints in data conversions. Involved in implementing the data integrity validation checks through constraints and triggers. Worked on SQL reports and scheduling these reports from UNIX scripts. Developed Shell Scripts to automate job scheduling for various database related program execution like SQL script, PL/SQL Script and Data Loading. Created PL/SQL Functions, Procedures, and Packages to support reports. Validates data integration by developing and executing test plans including data design, test design, networks and hardware.  Developed program units for debugging, test the PL/SQL code and clearing the reports those with validation and settling the reports from day to day basis. Created SQL*Loader control files for moving the data from flat files to staging area tables. Involved in the migration project to load data from mainframe systems into oracle database. Used Shell scripting for host concurrent programs and migration scripts for deployment. Wrote Unix Shell Scripts, undertook Code Optimization and Performance tuning of the application. Environment: Oracle 11g, TOAD, XML publisher, Shell script, Reports 10g, MS Access, MS office, UNIX. Vectran Corporation, Hyderabad, INDIA\t\t\t\t                 April 2013- Aug 2015 Role: Oracle PL/SQL Developer Responsibilities: Coordinated with the front-end design team to provide them with the necessary stored procedures and packages and the necessary insight into the data. Involved in writing DDL and DML operations.  Worked very closely with functional team to understand their Development related requirements.  Written complex SQL queries with complexity using Inner/Outer joins, Union All, Intersect and minus set operators.  Created Table structures along with Triggers, Indexes like Bitmap and Function based Indexes.  Created Collections for accessing and storing complex data resulted from joining of large number of tables.  Used Database trigger for making history of insertion, updation, deletion and all kind of Audit.  Optimized critical queries to eliminate Full Table scans and reduce Disk I/O and Sorts. Handled errors using Exception handling extensively for the ease of debugging and displaying the error messages in the application.  Created partitioned tables and partitioned indexes to improve the performance of the applications Worked on SQL*Loader to load data from flat files obtained from various facilities every day. Used standard packages like UTL_FILE, DMBS_SQL, and PL/SQL Collections and used BULK Binding involved in writing database procedures, functions and packages for Front End Module. Extensively involved in preparing Detailed Technical Documents from the functional specifications.  Environment: Oracle 11G, SQL Developer, SQL *Plus, Toad, UNIX Shell Scripts."}