{"text": "Name: martha martha E-Mail: martha.martha@gmail.com Address: Xiangyang, China Github: https://github.com/martha LinkedIn: https://linkedin.com/martha Phone No. 141305175174 SUMMARY To obtain engineering management position in the field of design and development of new products.  Offers unique background combining experience, MS in Engineering Management and BS in Electronics Engineering with demonstrated success in: TECHNICAL SKILLS: Aviation:\tLicensed Instrument Rated Commercial Pilot, Certified Flight Instructor. Application:\tMicrolok II Application Logic, Cimplicity, Logic Developer PAC (GE), TatSoft (SCADA/HMI), Visio, Clear Case, Clear Quest, ADEL, Planning Management System (PMS), Teamcenter 2007 (UGS PLM Software), SAP and Material Display. Hardware:\tProgrammable Automation Controller Systems RX3i (GE), AutoCAD, Xilinx,  \tUSB Blaster, Oscilloscope and Logic Analyzer (PCI), Microlok II Hardware,   \tMicrolok II Hot Standby and PC Compatibles. Language:\tMotorola MC-68000, Intel 8086, C++, Python and Ruby. Operating System:\tWindows 2000, Windows NT, Windows XP, Windows Vista, Windows 7 and Linux. Protocols:\tTCP/IP, Intel IA-32, 10/100 Base-X, Ethernet and PCI Bus, Computer communication interfaces such as RS-232, RS-422, and RS-485, Communications standards such as ATM, Frame Relay, and T1/E1.      \t\t\t PROFESSIONAL EXPERIENCE: Alstom Signaling Inc.\t\t2015 – Present Project Engineering Manager  As a Project Engineering Manager, I am responsible for delivering the ATC solutions for the Massachusetts Bay Transportation Authority (MBTA) Boston, Shanghai Line 1 in China and Taipei Rapid Transit Corporation in Taipei, Taiwan. My day to day responsibilities include managing project related works performed below: Provides overall technical responsibility and supervision to assure timely and economical execution of projects to meet company standards and client specifications.  Review, approve and release engineering documentation, drawings and material requisitions of all disciplines, ensuring conformance to contractual specifications. Approves Purchase Order (PO). Approves engineering Variance Request (VR). Provides leadership and supervision to engineering teams comprised of multiple disciplines throughout the life of the assigned project. Develops and manages engineering plans, quality, and resources as per project requirement.  Manages engineering budget and schedule of the assigned projects. Provides guidance to engineering team regarding priorities and interfaces. Conducts engineering gate reviews, technical status reviews, as well as other design reviews. Provide to the management a complete and detailed project technical status report on a regular basis. Controls the correct circulation of the engineering documentation among the project engineering team during the project execution. Supports the project manager and/or the contract manager on technical issues of claims to/from the client/partners/subcontractors. Ansaldo STS A Hitachi Group Company\t2008 – 2015 Signal Engineer  As a Signal Engineer, I am responsible for delivering the hardware design application solutions to various projects. My responsibilities include project related works performed below: Implemented system level integration test execution of Southeastern Pennsylvania Transportation Authority (SEPTA) Positive Train Control (PTC) system and wrote accompanying test report for the various SEPTA PTC lines. Wrote vehicle installation manuals (Silverliner IV and V, JWC II Cab Car, AEM-7 and ALP-44 Locomotives) for the Southeastern Pennsylvania Transportation Authority (SEPTA) Positive Train Control (PTC) project. Implemented Automatic Train Protection (ATP) design modification to existing Washington Metropolitan Area Transit Authority (WMATA) Track Circuit.   Wrote signaling application logic for the interlocking in Toronto project    Designing wayside signal/switch cases for the Toronto project  Designing a wayside Book of Plan for the Toronto project. Wrote a system architecture specification, subsystems requirement specification for the MRS/Stadler project in Brazil. Designed an Automatic Train Control (ATC) system enclosure for the MRS/Stadler project in Brazil. Designed a safety relay board for the MRS/Stadler project in Brazil. Designed a mother board for the MRS/Stadler project in Brazil. Designed an interface cable for the MRS/Stadler project.  Wrote a Factory Series, Field Series and Field Type test procedures for the MRS/Stadler project in Brazil. Wrote a hardware integration specification for the CBTC Carborne Controller (CC) system. Designed, tested and field implemented CBTC Carborne Controller (CC) system. Involved in shock & vibe and climatic tests of CBTC Carborne Controller (CC) system. Wrote a Manufacturing Test specification (EU) for CBTC Carborne Controller (CC) system. Implemented a First Article of Inspection (FAI) and Manufacturing test at Shenyang Railway Signal Factory in China. Implemented design release of Montreal STM Train Simulator system. Wrote Hardware Requirement Specification and Hardware Detailed Design Specification for Montreal STM Train Simulator system.    Implemented design release of Montreal Wayside Track Signal Generator. Bombardier Transportation, PA\t2005 – 2008 System Design Engineer  As a system design engineer, my responsibilities included: Implemented the Cityflo 650 technology to-  Existing Metro-Madrid Transit line.  Yong-In South Korea Light Rail Transit. Design, tested and field implemented Intelligent Tag Reader Interface Module (TRIM) system. Involved in development of Norming Point system. Involved in development of Vehicle Mobile Data Radio Antenna system. Integrated and tested JEA-72 and JEA-953 & -954 Point Machine / Frog to South Korea Light Rail Switch system.    Involved in CE certification of wayside Automatic Train Control (ATC) systems, which included Automatic Train Protection (ATP), Automatic Train Operator (ATO), Base Data Radio (BDR), Train Registry System (TRS) and Tag Reader Interface Module (TRIM).   Involved in shock & vibe and climatic tests of Vehicle Automatic Train Control (VATC) system and the TRIM system. Pittsburgh Flight Training Center, PA\t2004 – 2006 CFI, CFII and MEI As a certified instructor, my responsibilities involved developing pilots. Trained and licensed 4 Private Pilots  Trained and licensed 1 Instrument Pilot  Trained and licensed 1 Certified Flight Instrument Instructor (CFII). Two aviators went on to becoming airline pilots. EDUCATION M.S., Engineering Management, 2014 School of Arts and Sciences Point Park University, Pittsburgh PA Professional Pilot Training, 2004 Delta Connection Academy, Sanford FL B.S., Electronics Engineering, 1996 College of Science, Engineering and Technology Norfolk State University, Norfolk VA AWARDS National Defense Medal, Rifle Marksman Badge, and Good Conduct Medal (USMCR)"}