{"text": "Name: elizabeth elizabeth E-Mail: elizabeth.elizabeth@gmail.com Address: Zhengzhou, China Github: https://github.com/elizabeth LinkedIn: https://linkedin.com/elizabeth Phone No. 893712137529 Python Developer with more than three years of experience in Development, Automation, Maintaining and Testing Software Quality for client/server and web based products. Proficient in full Software Development Life Cycle (Waterfall and Agile), including requirement analysis, test planning, effort estimation, execution, defect management, delivery, and support. Areas of technical expertise include:  Programming languages: \tPython, C / C++, Java and SQL Web Technologies: \t\tDjango, HTML, HTML5, CSS, Bootstrap, PHP, Java Script, REST Requests/Responses Database Tools: \t\t\tPostgreSQL, Sqlite, MySQL, Microsoft SQL Server Management Studio Scripting: \t\t\tBash Shell, VBScript, JavaScript and Groovy Script. Network Tools:\t\t\tWireshark, tshark, Tcpdump, Nmap, Airodump-ng, hping3, Kali frameworks. Protocols:\t\t\tOSI Model, TCP/IP, UDP, ICMP Python Libraries:\t\tPandas, Numpy, Seaborn, Matplotlib Machine Learning:\t\tRegression, Classification, Clustering Operating Systems:\t\tLinux, Windows, Mac OS, Kali Linux. IDE Tools & Utilities:\t\tJupyter Notebook, Spyder, Ipython, Atom, Vim, Sublime, Pycharm, Git, SVN Selected Key Accomplishments Developed automation test scripts with improved execution process; reduced time by 30%, saving overall execution costs and time on Gryphon project. Created a new framework for collecting and analyzing network data using Wireshark packet sniffer enabling the router to increase its   \toverall performance. Setup improved UI automation framework by rewriting code; increased regression stability and reduced execution time. Reduced the data extraction time by 50% on Cheric bank project. Professional Experience Network Data and Test Engineer • Gryphon Online Safety Inc • San Diego, CA\t\t\t\t2016–Present Gryphon network router is an AI based router which will provide the customizable parental controls and provides Intrusion Detection System 24/7 to secure all the devices connected to it by using Machine Learning and Artificial Intelligence and will warn users and quarantine the devices when a device was compromised. It has a framework to collect the network data and process it to learn the behavior of various IoT devices.  Designed and developed framework using Python and Wireshark libraries to analyze and process the network traffic. Developed API’s based on SQLite using Tshark, Scapy to collect, store and analyze the data Integrated the Data Processing framework with build system: OpenWrt and AWS Server. Responsible for simulating of IoT devices using Raspberry Pi and Linux platform for testing Intrusion Detection Created Hackable devices using Raspberry PI and Kali Linux for testing the framework developed. Responsible for integrating Intrusion Detection Framework with server and OpenWrt device. Developed Framework for visualizing the data using Seaborn and Matplotlib. Handle responsibilities of applying testing methodologies for testing various networking platforms and functionalities. Generated charts and drafted technical reports using Matplotlib and Seaborn. Developed automation scripts with Rest Assured Framework and Hping3 for web services testing. Performed End-to-End Testing (E2E) on Data Framework using automated scripts.  Assisted with debugging the Web Suite; used SQL queries in different contexts to verify the results and thoroughly debugged server logs using Splunk Services. Executed Continuous Integration of code and scripts using Jenkins and triggered the Continuous Delivery process using Jenkins build jobs. Prepared and reported execution status to senior management and product managers for every phase in the release. Played a key role in the triaging of production Incidents and execution of root cause analysis activities. Experience in monitoring tools such as such as Wireshark and Tcpdump. Following a Artificial Intelligence model, helping development by picking up Machine Learning work. Environment: Python, Wireshark, Tshark, hping3, Redmine, Pandas, Numpy, openWrt, PostgreSQL, Sqlite. Seaborn Junior Software Developer • Cheric Technologies • Hyderabad, India\t\t\t\t\t2013–2015 Developed parts of the “Online Credit Report” module with functional and integration testing of Membership Details, Bill Pay, Account Alerts and Message Center. Developed an API to integrate the Customer Details Database with the Front End. The project offered the bank customers best-in-class identity and credit management products with new and enhanced versions of their two existing products.  Designed and managed API system Development using fast http server and Amazon AWSs server. Maintained and enhanced a Django web-based application, which queries in SQL database and presents tabular data to the end users. Used MsSQL as a backend database and MsSQL database as Python connector to interact with MySQL server. Responsible for maintaining quality reference data in Oracle by performing operations such as cleaning, transformation and ensuring integrity in a relational environment. Involved in design, implementation and modifying the Python code and MySQL database schema on the back-end.  Developed an API, which will integrate the SQL Database with the Front End. Involved in writing SQL queries implementing functions, triggers, cursers, object types, sequences, indexes etc. Generated test reports from applications and compared with test reports of web suite applications; reported the bugs using Serena Team Track. Assisted in debugging the Web Suite using SQL queries in different contexts to verify the results. Designed Python object oriented for manufacturing quality, logging, debugging code optimization. Followed Agile methodology and involved in daily SCRUM meetings, sprint planning, showcases and retrospective and used JIRA as a tracking tool for the sprints. Implement Continuous Integration process for multiple applications using Jenkins and Hudson tools for Selenium and UFT scripts Performed web based (IE, Mozilla, Chrome, Safari) and database testing (SQL Server). Tested the assigned features thoroughly for user acceptance and integration testing using Web and Client - Server applications.  Performed User Acceptance Testing (UAT), sanity, functional, and regression testing for developed API’s and generated weekly status reports of bugs for each release. Environment: Windows XP, Python, MySQL, MsSQL, HTML5, CSS, Django LINUX, Agile Methodology, JIRA, Git and SQL  \t"}