{"text": "Name: mary mary E-Mail: mary.mary@gmail.com Address: Guiyang, China Github: https://github.com/mary LinkedIn: https://linkedin.com/mary Phone No. 436329336413 \t PROFESSIONAL SUMMARY: 8 Years of experience in Python Software Development, Infrastructure Automation, DevOps Methodologies and Linux administration with Masters in Computer Science Extensive experience as a Python developer in development, automation and deployment of code in cross platform environment.  Extensive experience in python development on system level, middleware and web frameworks.  Experience developing python modules and software using REST API, backend database, python Linux command line tools and extensive automation frameworks from scratch Experience working in Linux and Unix Environment and strong Linux systems experience in Linux flavors such as REDHAT, SUSE, CentOS, Ubuntu  Experience in configuration management tools such as Ansible, Chef and Puppet Experience in setting up Chef Workstation various enterprise nodes, setting up keys and working with chef Cookbooks, Chef Recipes, Chef attributes, chef Templates  Comprehensive experience working with Python libraries such as Django Web Frameworks, PARAMIKO, XML Parser, REST services, Python JSON Libraries  Extensive in-depth knowledge of automating performance benchmarks and certification process of HANA Appliances with SAP  Experience building performance monitoring solutions for server infrastructure, web applications and stand-alone applications for proactive monitoring and resolution to minimize business impact Extensive experience running analytics, provisioning and managing backend MySQL, POSTGRES and HANA Database for various frontend services Extensive experience in building python management controllers for deploying storage, networking and compute Node configuration  Experience working on system level components and full knowledge of handling filesystem using RAID, SAN, NAS, NFS, LVM Provisioning for infrastructure solutions. Hands-on experience with working on 3PAR Storage, LAN Switch, SAN Zoning and DL580 Servers Full Understanding of complete Software Development Life Cycle (SDLC); Expertise in Waterfall and Agile Methodologies Experience with Docker container management and working with Docker- Docker hub, Docker inspect, Docker commit  Experience in using virtualization tools like Virtual Box, VMware and provisioning virtual machines  Complete working knowledge of Network bonds, DHCP Server, DNS, SNMP and HTTP Ability to work closely with teams, to ensure high quality and timely delivery of build and release TECHNICAL SKILLS:\t\t\t\t\t\t Programming Languages:\tPython, C++, C Programming, Bash and Perl Scripting Database:\tMySQL, POSTGRES, MongoDB, SAP HANA Virtualization:\tVMWare, Hyper-V, KVM Web Services and Frameworks:\tREST, SOAP, Django, Flask, JSON, XML Cloud:\tOPENSTACK, AWS Containers:\tDockers Configuration and Systems Automation:\tChef, Puppet, Ansible, Jenkins, Kafka Operating Systems:\tSUSE, REDHAT, Ubuntu Linux, Unix, Microsoft Windows PROFESSIONAL EXPERIENCE: Hewlett-Packard Enterprise, Palo Alto, CA\t\t\t\t\t\tMar 2015 – Jun 2017 Python Developer Engineer\t\t\t\t\t\t Part of Mission Critical Systems in HPE, primarily responsible for designing, developing and building SAP HANA in memory database appliances. Experience working in complete Software Development Life Cycle.  Responsibilities: Worked on building python Automation Frameworks for Deployment of infrastructure solutions, configuration verification, Developed File system performance characterization and certification.  Worked on building Images in Linux SLES and REDHAT, software upgrade bundles, wrote reference architecture paper. Hands on experience in setting up Switches, storage 3Par and HPE PROLIANT SERVERS and Linux system Developed python infrastructure controller plane for deploying storage, mapping storage, applying Network configuration on large scale distributed cloud environment using python XML, JSON, PARAMIKO and python Unit test   Developed python backend management service for collecting detail storage, networking and compute configuration across multiple scale-out nodes on a large-scale cloud environment  Designed and Developed performance monitor in python to monitor performance of Storage IO, network, database and High Availability of nodes across distributed scale-out cloud servers, decreasing the manual process by 80% Developed analyzer using python PARAMIKO, XML, JSON by monitoring performance benchmarks, analysis of performance data collected and creating data matrix Developed python easy deployment tool and Ansible playbook for easy deployment of updates on all scale-out Nodes across distributed cloud environment  Designed and developed the server monitoring dashboard using the python Django Web Frameworks, HTML and CSS Took responsibility in each stage of Software Development Life Cycle and managed delivery of tasks within specified deadlines. Extensive experience using PARAMIKO, PYCRYPTO, XML parser and logging libraries in python software development on a distributed cloud backend Followed Object-Oriented design model for software development and used various Design Patterns (Singleton, MVC) for developing python analyzers Authored reference architecture paper on KDUMP, backup & recovery of data with HANA Appliances Developed and deployed HANA in containers used for design prototyping and debugging Maintained through technical documentation and user manuals for of all projects  Developed performance monitoring plane for SAP HANA deployed on OPENSTACK  Installed OPENSTACK on multiple nodes in distributed environment. Closely interacted with Principal Architects across multiple regions to research and optimize better design of HANA Appliances.  Researched and designed HANA appliances for deal specific customer requests   Developed OS image profiles in python for kickstarting configuration installation on RHEL and SLES. These profiles have intelligence to detect booting drive for installing RHEL and SLES Images Environment: Python, REST API, PARAMIKO, XML, SQL, Python Storage Libraries, Docker, OPENSTACK, Git, Linux systems, SUSE 11.x,12.x RHEL6.x,7.x SAP HANA, HPE Service Guard for High Availability, HPE 3Par Storage, HPE Switches, SAN, NAS, NFS, Network Cards,  ACCELOPS, Santa Clara, CA\t\t\t\t\t\t\t\tOct 2014 – Mar 2015 Python Developer\t\t\t\t\t\t\t Built automation framework from scratch using python and in-built libraries using REST API for Security information and event management virtual appliances. Developed python libraries to inject events, log information into backend Postgres database in virtual appliances.    Responsibilities: Developed from Scratch Python backend database services using XML, python libraries PARAMIKO, XML parser, and REST API Developed event parsing and display services using REST API and python libraries which injected events to POSTGRES database and parsed events Developed and implemented log, alerts and events ingesting feature into POSTGRES database in Security and event monitoring virtual appliances using REST API and XML Developed python monitoring data controller to insert data into POSTGRES SQL database and display on Virtual Appliances interface Developed Python data collection feature for SIEM virtual appliance that collected data and provided informative analytics for the root cause of bugs seen in Appliance Developed cloud management controller for deploying Virtual appliance on AWS with storage, Virtual private cloud networks Developed python performance analysis frameworks which used POSTGRES data base, REST API and in-built backend service to analyze virtual appliance product Worked in Agile development life cycle, attended scrum meeting and worked on priority issues for resolving. Participated in post-live project activities; including evaluation of success criteria, identification of best practices, lessons learned, and strategies for future releases and deployments Environment: Python, REST API, XML, Linux, Postgres Database, SQL, Configuration Management Database, AWS Meru Networks\t, Sunnyvale, CA\t\t\t\t\t\t\t\tNov 2013 – Oct 2014 Python Developer\t\t\t\t\t\t\t\t Worked on building proactive dynamic monitoring tool for virtualized WLAN Controller using REST APIs, MongoDB, Flask and Django. Monitoring tool displayed all detail information about the WLAN Controller and provided analysis of the logs and proactively sent alerts about virtualized WLAN Controller and networks Responsibilities: Developed data management plane in python to collect data on WLAN Controller, submit to SPLUNK for analysis and do root cause analysis, proactive user experience monitoring and dynamic alerting using MVC, Web Frameworks(Django), MongoDB Automating Tasks and scale systems by developing automatic test cases, building frameworks Developed using object oriented methodology a dashboard to monitor the all network access points and network performance metrics using Django, Python, MongoDB, JSON Developed application for monitoring, root cause analysis and management of WLAN data by parsing log using Python Django, MongoDB and creating JSON format Developed Python feature for parsing data from logs, alerts, network dump and create a analysis matrix to display Experience reading C++ code, understanding it and debugging the C++ code Application developed parses information from logs and provides analysis of data by mapping to information in database to provide analysis for proactive monitoring and alerts Developed application that used IP based protocols such as TCP, UDP, HTTP, SSL, for analyzing data of L2/L3 and WIFI Data for QA and testing process Interacted and communicated across multiple team and to discuss requirements, design aspects of application Used web2py, SQLALCHEMY, Python-eve, flask and MongoDB for developing proactive analysis application Experience and worked building applications using Model-View-Controller design patterns with python in client server environment setup Testing, Debugging and fixing issues related to Automation framework Understanding C++ implementation of Software Stack for debugging, implementation of framework Set up the PXT, Agilent boxes for simulation of wireless networks for testing Analyzing the data flow from Network and on Mobile devices for various configuration Developing XML based Testcases and Use cases for testing multiple Scenarios Environment: Python, C++, XML, SQLALCHEMY, Flask, Django, MongoDB, Linux, Postgres, SQL, Network TCP/IP, UDP, WLAN Controller, L2/L3 Networking Unitrends, Columbia, SC\t\t\t\t\t\t\t\tAug 2012 – Nov 2013 Python Developer Engineer\t\t\t\t\t\t\t Unitrends is a data backup and restore company, as a part of the company took responsibility to build data deduplication backup in C++ using hashing, networking and client-server model.  Responsibilities: Designed and developed the proactive monitoring software for the Backup appliances monitoring appliances storage, networking and logs. Designed and developed frameworks for determine aggregate throughput to database from Storage. Worked on Network, storage, VMWare, backup appliances. Created a data hash correcting feature to correct bad data hashes in DEDUPLICATED backups of client machine on server-side backups with VMWARE, HYPER-V which helped clean up bad hashes on 100% customer appliances in C/C++ on Linux Built and Created an SNMP framework using object oriented programming in python which would proactively Monitor Unitrends Software and Appliance on customer server appliances and send alerts. Sending various alerts and monitoring information from customer server to trap receiver server.  Built infrastructure management service in python for large scale distributed cloud using network and data controllers for proactive error detection and managing backup.  Developed performance analysis tool in python using REST API to find aggregate throughput for POSTGRES database read, write and query Completed performance testing of VMWare backup, Hyper-V backup on KVM for backup clients Used various LINUX tools to analyze performance problems Participated in the testing process through test review and analysis, test witnessing Built automation frameworks in python for Performance Analysis on running concurrent backups for VMWare and Hyper-V by developing tools to gather data from VMs Worked on backing up and recovery of VMWare, Hyper-V on backup servers Fixing bugs related to VMWare and Hyper-V Optimizing and prototyping Disks and RAID Controllers for servers by conducting performance analysis by performance analysis tools developed in python on Linux Kernel and recommending changes which improved performance of appliance by 30% Participated in the Software Development Life Cycle (SDLC) processes including Analysis, Design, Programming, Testing and Deployment Working on prototyping Controllers and Disks by performing Linux kernel Compatibility test, performance tests  Worked in Platform team in building image, managing code commits and managed continuous integration environment at office Prepared detailed design for Rejected product reviews message integration, logging the action events Used the technical document to design the database tables. Writing shell scripts for message monitoring for the production environment  Created Stored Procedures and Functions to be called by client Demons. Optimize SQL queries for better performance. Environment: Python, C++, Postgres, SQL, Linux REDHAT, RAID, SDLC, VMWare, Hyper-V, KVM, Network, performance improvements Intel Corporation, Bengaluru, India\t\t\t\t\t\t\t\tJul 2008 – Dec 2009 Python Engineer\t\t\t\t\t\t\t\t Designed and developed in C++ Server Management SDK APIs for SMBIOS in Intel Enterprise Servers, developed APIs for using in Intel deployment assistant software for RAID, BMC related firmware and to get remote server information related BMC IP, and Intel Server motherboard information.  Implemented Automation tool in C++ for getting Intel Server management system information using data structures defined  Implemented tool in C++ for automating more than 500 Intel Server Management SDK APIs for Server Storage features, client-server information, remote server information.  Developed APIs for Intel Deployment Software with features for RAID, Operating Systems and Server Management on new server platforms by bringing them up and updating required binaries Worked on embedded firmware for Intel server platforms and implemented APIs related to SMBIOS, Baseboard Management Controller and Field Replaceable Units Automated generation of queries and values combination for various test cases to provide comparison with development team output  Creating and Building VMWare ESXI server and validating Server Management Software APIs on Intel Enterprise Platforms Analyze the problems and provide initial analysis and technical solution for the issues. Design and implement the middleware services for Server Management Software and Monitoring Systems. Participated in the Software Development Life Cycle (SDLC) processes including Analysis, Design, Programming, Testing and Deployment Participated in post-live project activities; including evaluation of success criteria, identification of best practices, lessons learned, and strategies for future releases and deployments Environment: C++, Visual C++, Windows Driver Development Kit, Server Management SDK APIs, COM, Server Platforms, EFI EDUCATION & CERTIFICATIONS: M.S in Computer Science, University of North Carolina, Charlotte, May 2012 Master of Technology in Computer Science, PES Institute of Technology (VTU), July 2009 B.E in Computer Science, VIDYAVARDHAKA COLLEGE OF ENGINEERING, July 2007"}