{"text": "Name: margaret margaret E-Mail: margaret.margaret@gmail.com Address: Guangzhou, China Github: https://github.com/margaret LinkedIn: https://linkedin.com/margaret Phone No. 244872126716 Objective: To enhance my skills in Manual and Automation testing and gain experience with progressive organizations wherein the application of my technical and educational skills will be a significant contribution to the company’s success. Summary  8+ years of experience in analysis, design, development, testing and implementation of software applications.  More than four years of experience in Web-based application testing.  Extensive knowledge in gathering and understanding BRDs (Business Requirements Document), FRDs (Functional Requirements Document) and SDS (System Design Specification). Expertise on identifying the Test Scenarios based on business requirements and Design Specifications. Strong knowledge of Paper Claims, EDI Claims, electronic claims, member enrollment, and billing transactions. Hands on experience in Web Services Testing using SoapUI. Experienced in Web Services testing using SOAP UI, API Testing and Functional Testing in Agile. Experience with FACETS solution for healthcare. Understanding of HIPAA Standards and Compliance issues, HIPAA Privacy policy, opt in/opt out policy. Hands on experience in testing of all EDI X12 HIPAA 4010 and 5010 standards. Verified and validated membership and enrollment (834), and analyzed claim processing (837) transactions. Experience in Quality Assurance Testing of web based and client/server applications using Automation tools such as Quick Test Professional. Experience with testing various test cases for FACETS interfaces and tracking/explaining bugs to development teams Vast experience in writing test cases for the Facets applications.  Expertise in Facets extension development, Facets Testing, Facets Interfacing.  Familiarity with different aspects of Facets implementation lifecycle. Sound knowledge of facets test cases Hands on experience in testing XML files and transactions. Experienced in Data Driven Testing, Batch Testing, Functionality Testing, and Regression Testing using Quick Test Pro. Performed manual testing on UNIX and Windows platforms. Good understanding of business intelligence concepts and concepts related to reporting tools such as SSRS, WebFOCUS. Extensive experience in preparing test plans, test cases, test scripts and test reports,  Performed Black Box Testing, System Testing, Regression testing, final regression Testing, Integration Testing, end to end testing, Performance Testing, Stress Testing and Load Testing of Web-Based applications and Client/Server applications using Mercury Tools. Tracked bugs and created reports using test management/defect tracking tools like Quality Center and documented Test Documents Using MS Office Tools - Word, Excel, and PowerPoint. Used SQL extensively to perform backend testing.   Performed Usability Testing and User Acceptance Testing. Good knowledge in Multi-tier and Cross-platform skills.  Participated in team meeting to provide the status reports on test execution and results. Excellent team spirit and leadership qualities with good communication and interpersonal skills. Technical Skills: Test Automation Tools:\t\t\tQTP, MOJO Client/Server System: \t\t                Facets, Diamond, Quest, GAP, EAS, Availity Bug Tracking Tools:    \t\t\tQuality Center, Clear Quest, Jira, Bugzilla\t\t Operating Systems: \t\t\tUNIX, Win 98/00/XP/2003/7 and MS-DOS MS-Suite:\t\t\t\tMS-Word, MS Excel, MS PPT, MS-Project, MS Visio, MS Outlook Databases:\t\t\t\tMS SQL Server, Oracle, Sybase Reporting Tools: \t\t\tSSRS, WebFOCUS Professional Experience Client: Health Alliance Plan Corp\t\t\t\t          \t             October 2016 – Present Location: Detroit, MI\t Position: QA Analyst Project Description: Claims Processing Engine: Health Alliance Plan Corp (HAP) is a full-service health management company providing full range of HMO, PPO, and POS benefit plans. Health Alliance Plans was in the middle of coordinated series of projects, designed to improve their competitive positioning in market. Although efforts were made to provide information through other avenues, majority of customer contacts was through telephone. For this reason, HAP selected to enhance the capability of Customer Contact Representatives (CCR) to efficiently and effectively serve their customers. So they decided to deploy Integration Collaboration Solution (ICS). Specifically, dealt with the following business processes: Responsibilities: Experience with EDI transactions like EDI 834 (Benefit Enrollment and Maintenance),277/275(Health Care Claim Request for Additional Information and Response), 276/277(Health Care Claim Status Request and Response), 835(Health Care Claim Payment/Advice), 837 and (Health Care Claim: Professional, Institutional and Dental). Multiple 837map set developed for each client (clearinghouse, internal, and external trading partners), as well unique mappings were needed in each map to accommodate various conditions dealing with Provider, Subscriber, PAY-TO and BILL-TO Provider information needed to identify multiple conditions dealing with batch processing of claims. Conducted Functional Testing, Joint Functional Testing and UAT, documented and reported user feedbacks to management team. Involved system testing on EDI transaction 270/271 for both inbound and out bound.A Developed standardized FACETS testing, implementation and QA processes. Worked in DB2 data base, Sharepoint. Responsible for working with the team to review and modify process flows to increase productivity and effectively utilize FACETS features not provided by the legacy systems Worked with Trizetto Facets System implementation, Claims and Benefits configuration set-up testing, Inbound/Outbound Interfaces and Extensions, Load and extraction programs involving HIPPA 834 and proprietary format files and Reports development. Performed functional, integration, black-box, system, regression, performance, load/stress and user acceptance tests UAT. Validating all the information from HIPAA to FACETS. Worked with the client and stakeholders to design and configure all the required claims processing rules. Created Claim Test Data and tested various scenarios. Assisted informational needs in mapping of Test Cases.  Worked on the EDI claims including both the batch processing and direct data entry. Performed GUI testing, Integration testing, Regression testing, Ad -hoc testing, Negative testing, End to End testing, Load testing, User Acceptance testing on multiple projects. Client: Cardinal Health, Inc.\t\t\t\t\t\t                    Mar 2014 –Sep 2016 Location: Dublin, OH   Position: QA Analyst  Cardinal Health is a leading provider of products, services, and technologies supporting the healthcare industry. The Medi Pharma online service was designed to deliver refill medication to follow-up, disabled and elderly patients at their homes without the necessity to visit the physician. I was involved in implementing HIPAA EDI transactions in the application; also involved in modules: Pre-pricing claims, Claims Adjudication, Claims Payment, Coordination of Benefits (COB) and Adjustments. Responsibilities: Analyzed and defined testable requirements created and implemented test plans. Developed Test Cases/Conditions for manual and Automation testing of the above Applications and Reports. Gathered requirements from the users and analyzed the requirements. Involved in performing functional, application, integration, system, and regression Testing. Developed the Test Data for different Groups.  Communicated with development team to ensure testing issues are resolved. Prepared and executed SQL Queries to archive data for the project. Verified and Validated the Rates Calculations and Rate Renewal Calculations for different Products and benefits by Preparing and executing different SQL Scripts. Validate EDI Claim Process according to HIPAA compliance. Worked on HIPAA Transactions and Code Sets Standards according to the test scenarios such as 270/271, 276/277,837/835 transactions. Inserted variety of check points (Object Check point, table check point, test check point, etc.) to match the object properties captured during the recording session with the objects properties captured during the run session using QTP. Involved in creating and modifying reports that have been developed in Webfocus. Maintaining knowledge of Medicare and Medicaid rules and regulations pertaining to the Facets configuration and evaluating the impact of proposed changes in rules and regulations Validating the Claims for the Medicare part A and Part D for the network providers and pricing the claim.  Validating the subscribers and dependents profile that has been updated for the Medicare coverage program. Involved in testing complex reports generated by reporting tools WebFocus. Created reports that included a general overview, open bugs, new bugs and enhancement requests. Entered new bugs and maintained the current status of those bugs.  Maintained Test Matrix and Requirements Traceability Matrix. Performed Gap Analysis on the same. Evaluated clinical laboratory test results, patient demographics, pharmacy information, radiology reports and images, pathology reports, hospital admission/discharge/transfer dates, ICD 9 codes, discharge summaries, and progress notes. Designed and implemented SQL queries for testing and reporting Performed Functional, Regression and Usability Testing using QTP. Performed Compatibility Testing against different browsers and versions. Used HP Quality Center for reporting defects. Used HP Quality Center to enter and Report defects for Rate Quote Remediation. Prepared Application Testing Metrics Reports using MS Project. Prepared and submit the weekly test status reports to QA Lead and Manager. Followed and Implemented the SDLC to improve the Testing Process and Efforts. Coordinated with the Business users, BA’s and Testers in order to perform UAT Testing. Interacted with Business users and BA’s regarding the Requirement Issues. Involved in Weekly Testing Status meetings with Testing Team and Weekly Rate Quote Task force meeting with Business Users and Developers. Client: Health Now, Inc.\t\t\t\t\t\t\t                     Jan 2013 – Feb 2014                  Location: Buffalo, NY Position: QA Analyst Health Now New York Inc. is the leading healthcare company in Western New York. Since 1936, it has been a pioneer in providing quality healthcare services to companies and individuals in the region. Health Now New York provides the full spectrum of healthcare services and innovative funding arrangements. As a QA Analyst I was responsible for validation of claims workflow in to FACETS, Members Enrollment, validating Members benefits against different products and working in member’s accumulator.   Responsibilities Worked with Business Analyst and QA Lead in reviewing and analyzing the business requirements Documents and functional requirements. Imported preexisting Microsoft Word and Excel-based requirements and tests for analysis in QC. Prepared Test Cases based on business requirements and business rules for HIPPA EDI Transaction 834, 276/277, 270/271, 837/835. Analyzed HIPAA 5010 standards for 837, EDI X12 transactions, related to providers, payers, subscribers and other related entities. Maintaining knowledge of Medicare and Medicaid rules and regulations pertaining to the Facets configuration and evaluating the impact of proposed changes in rules and regulations. Involved in FACETS Implementation, involved end to end testing of FACETS Billing, Enrollment Claim Processing and Subscriber/Member module.  Coded scripts for testing the test cases and made enhancements for modified scripts using Quick Test Professional (QTP) Set claim processing data for different Facets Module.  Performed Positive and Negative Testing Manually. Actively participated in walkthroughs and enhancement meetings. Maintained Test Matrix and Requirement Traceability Matrix. Performed Gap Analysis. Performed Security Testing on the application. Tested user interface and navigation controls of the application using QTP. Experiences working in ANSI x12 837-835 EDI Transaction. Validate the date from EDI transaction. Tested the HIPPA EDI 834, 270/271, 276/277, 837/835 transactions according to test scenarios and verify the data on different modules.  Authored test case scenarios in Excel spread sheet and export them into Mercury Quality Center. Documented the test results and reported the status of assigned test tasks and issues to project QA Lead. Conducted Back-End Testing Using SQL Commands. Extensively used SQL statements to query the Oracle Database for Data Validation and Data Integrity. Executed test cases to find and report defects, determined defect fix priorities, did regression testing and closed the defect in Quality Center after the retest. Responsible for Performing Integration Testing, UAT testing. Customized Quality Center to suit the requirements of testing effort. Monitored the Defect Tracking Process and generated customized graphs and reports for the client using QC. Client: Great West Health Care\t\t\t\t\t\tApr 2010 - Dec 2012 Location: Greenwood, CO\t\t Position: QA Analyst Great-West Healthcare has been serving its customers for more than 50 years. At the forefront of consumer-driven healthcare, Great-West works to provide group and individual coverage with creative solutions to the continuously evolving needs of American patients. The Project involved redesign of the website. The objective of this project was to develop a shortened online application for all the existing products. These pages offer the flexibility to browse, choose and compare different kinds of insurance offered to the consumers. These pages are extremely dynamic and involve lots of complex java coding. My Role in the project was to test the redesigned web-based application used by the potential customers.\n Responsibilities Reviewed the Business Requirement documents and the Technical Specification documents. Developed Test Plans, Test Cases and Test Scripts to define scope of overall quality assurance testing. Conducted Functionality testing and Regression Testing using QTP. Created environment variables to pass variables between actions. Tested data to check HIPPA- eligible & participation check for individual coverage. Performed web application security vulnerability testing. Used parameterization to test the application for different kinds of data. Uncovered multiple issues related to the data population in the backend database manually. Prepared test scripts for automated testing using QTP. Conducted GUI Testing manually. Performed Security Testing manually using Positive and Negative Testing to ensure appropriate user authentication. Used Recovery Scenario Manager in QTP to handle exceptions. Worked on T-SQL and HTML extensively to design the UI Screens and add functionality/validations. Tested and detected bugs in the front end of the application. Performed UAT, Usability, Cross-Platform and Regression Testing during different stages of the application development. Used Quality Center to communicate bugs with other members in the project. Developed Test Cases and scheduled Test Runs in Quality Center. Participated in various meetings and discussed Enhancement and Project Change Requests. Coordinated with offshore teams on a daily basis to get the status updates. Performed negative testing heavily to encounter invalid unexpected values. Actively participated in project enhancement meetings. Education:  Bachelor in Computer Science from JNTU, India Master in computer Science from Virginia International University, VA"}