{"text": "Name: helen helen E-Mail: helen.helen@gmail.com Address: Nanyang, China Github: https://github.com/helen LinkedIn: https://linkedin.com/helen Phone No. 300125387815 Professional Summary: Over 7 years of experience working as QA Engineer for Software Development and Testing life Cycle including preparation of Test Strategies, Test Plans, Test Cases, Test summary reports for both Web and Client-Server Applications like Banking, Financial System, Telecom, Energy & Utilities and Insurance. Extensive Knowledge of Quality Assurance standards, methodologies and strategies with better understanding of Software Development Life Cycle (SDLC). Expertise in using both Manual and Automated Testing tools Selenium WebDriver, HP ALM and QTP. Exposure to Manual Testing of applications developed on Windows and UNIX platform. Strong experience in cross browser, cross platform web testing with Selenium RC and WebDriver. Expertise in using Selenium WebDriver API to automate tests on cross browser and cross platform environment. Key expertise includes testing & debugging GUI & Multi-Applications environment & automated testing using Selenium WebDriver. Proven knowledge in automated web application testing using Cucumber with BDD style programming using Gherkin and Selenium Web Driver. Experienced in developing Test Plans, Test Cases based upon the business requirements. Experience in Black Box, Positive, Negative, Data-driven, Integration, System, and Back-end testing. Performed Sanity testing, Smoke testing, Usability testing and Security testing of various applications. Experienced in Regression and Functional Testing. Hands on experience with end-to-end API Automation testing using SOA test and SoapUI. Experience in conducting Integration testing, Stress testing, and Load testing. Experience as Quality Assurance analyst for Web Based and Client server applications of the projects. Facilitated UAT (User Acceptance Testing) with the stakeholders and the business users. Strong experience in conducting User Acceptance Testing (UAT) and documentation of Test Cases. Expertise in designing and developing Test Strategy and Test Scripts. Experience programming in Java, Python, JavaScript, HTML, XML and SQL on Windows XP, Vista Operating Systems and UNIX environments. Proficiency in interacting with Oracle, SQL Server and DB2 databases using SQL. Expertise in Oracle table data manipulation using SQL queries and UNIX commands/UNIX scripts. Extensive knowledge agile, waterfall methodologies. Part of a Scrum team to discuss new features and functionalities, software walkthrough in daily scrum meetings. Participated in design Walkthroughs and Inspection meetings to review Test scripts and results. Excellent in communication, presentation, and interpersonal skills. Good team player with the ability to lead, manage and work independently in a time sensitive environment. Outstanding communication skills and ability to work effectively with technical teammates in order to translate requirements into an effective technical solution in Mortgage Loan Servicing, Mortgage loan origination, Asset management. Technical Skills: Professional Experience: Client: AllState Insurance, Chicago, IL.                                        \t                                                                      Apr 15 – Till date Enhancement to Wealth Management E-Commerce portal and development of customer datamart for holistic view of all customer accounts for cross selling of products. This would involve disparate sources of data Business, Home, Auto, Boat, Life, Renters, and Motorcycles. This also involved financial reporting using Business Objects. Role: QA Automation Engineer Responsibilities: Coordinate and schedule test milestones by engaging the development team, QA team and project manager.  Responsible for creating and tracking QA project plan, test plan, test strategy document. Identify dependencies, constraints, risks and issues. Responsible for QA execution and timeline adherence. Skilled using Selenium with JAVA, UFT, VB Script. Skilled on Mainframe software using UFT, VB Script. Identified test cases to Automated using Selenium WebDriver. Responsible for delivery of defect status reports. Created Python scripting to test REST API functionality for regression setup.  Performed Developed functional and regression test automation for mainframe software applications using UFT. Involved in testing web application API Restful. Responsible in design and implementation of Selenium WebDriver automation Framework for Smoke and Regression Testing. Developed Python scripts to automate the test cases. Extensively work with Selenium, generate multiple requests and execute them to identify the server responses under load based on various real time scenarios. Worked with designing and building automation frameworks in Cucumber BBD.  The entire Ruby scripting done using Cucumber framework Wrote and executed SQL queries to verify the data updates to various tables and ensure data integrity. Performed extensive SOAP and RESTful Web Services Testing using Soap UI Tool. Created and maintained a traceability matrix of the requirements and created test cases, as well as testing matrix of the test cases and any corresponding defects in HP ALM. Prepare test scenario and test case; log the defects using identified defect management tool and process.  Execute test case and test execution logs, pull the test case execution report. Participate in periodic meeting for defect triage, project status and test execution status meeting. Responsible for managing the offshore testing team, assigning work, interacting with client team during the testing life cycle.  Environment: Java, Selenium WebDriver, Cucumber, UFT, SOAP UI, Ruby, JavaScript, VB Script, Oracle OMS, iSeries/AS400 JDA, Hybris, Oracle Xstore POS, Quality Center, HP ALM, Windows. Client: Wells Fargo, Des Moines, IA.                                                                                                                          Dec 13 – Mar 15 RESPA/TILA Mortgage Compliance Originations project will address all system and process changes necessary to support CFPB rules published on November 20, 2013. These changes will include, but not limited to migration of the existing GFE, TIL and HUD-1 to the new Loan Estimate and Closing Disclosure, process adjustment to ensure compliance with new timing requirements, new calculations to support new fields on the forms, fee alignment, tolerance changes, revised changed circumstances, training and communications. Role: QA Automation Engineer Responsibilities: Responsible for defining the Test Plan, analyzing the Test Scenarios, preparing Test Case Documents. Worked in a structured and team-oriented environment with Agile/Scrum methodology. Identified test cases to Automated using Selenium WebDriver. Skilled using Selenium WebDriver and executing Selenium test cases and creating reports. Developed automation script using Selenium WebDriver for cross browser testing. Developed Test Framework in Selenium for UI Regression Test Automation and when necessary, and potentially execute Unit Test automation (Java). Design and Implementation of BDD framework using Ruby-Cucumber. Worked with Mainframe software using UFT and VB Script. Used Cucumber, Ruby gems, Watir and Page Object Model Framework. Developed automated script for back-end testing using Selenium WebDriver. Maintained Test Matrix and Project Matrix using an excel sheet to keep track of the Project's schedule and status. Setup the Automation framework using Selenium WebDriver to run test cases in multiple browsers and platforms. Performed functional testing to identify various critical points in the application and automated it by using Selenium.  Used Quality Center to report bugs and follow up. Used SOAP UI tool to test SOA based architecture application to test SOAP services and REST API. Developed data driven test scripts to check the same functionality with multiple sets of data. Conducted System Testing and User Acceptance Testing for every client and Conducted Backend testing writing extensive SQL queries. Performed Database Validation to check the updated data in the database using SQL queries. Reported test execution, defects and overall system status to the management team. Interacted with development and product management teams for the quick resolution of reported bugs and various technical issues. Environments: Selenium WebDriver, Watir WebDriver, Cucumber, Ruby, UFT, VB Script, Quality Center, SOAP UI, Agile, SQL, Mainframe, Windows. Client: Commerce Bank, Baltimore, MD.                                                                                                                  Aug 12 – Nov 13 Commerce Bank is a leading financial services company catering to commercial, small business and retail clients.\t\t The scope of this project was to enhance the online banking portal using Agile methodology, where upon a customer can view online banking demo, choose to receive alerts when bills are due, view and save up to seven years of online statements. Role: QA Engineer Responsibilities: Reviewed and analyzed the Business Requirement Documents and Technical requirement documents. Participated in writing High level Test plans, Test Scenarios, Test cases and Analysis and Presentation of Results Developed detailed Testing Methodologies, Test Matrices and Test Procedures. Design and Implementation of ATDD framework using Ruby-Cucumber. Experience with acceptance test driven development using Cucumber, Ruby gems, Watir and Page Objects Responsible in design and implementation of Selenium WebDriver automation Framework for Smoke and Regression Testing. Developed test scripts using Selenium WebDriver, Executed Automated Test Scripts & analyzed the results. Performed Regression testing on new builds, every modification in the application using Selenium WebDriver. Tested compatibility of application for dynamic and static content under various cross browsers using HTML IDs and XPath in Selenium. Stored Test Cases in the HP Quality Center /ALM Tool. Responsible in debugging the automation tests & fixing the errors in the automation tests. Responsible in database testing using SQL commands. Participated in Daily Stand-up meetings and provided status on work progress. Environments: JIRA, Cucumber, Watir WebDriver, Selenium WebDriver, Xpath, Ruby, ALM, Oracle, Windows. Client: Associated Bank, WI.\t                                              Apr 11 - Jul 12 \tScope of project spanned Migration from isolated functional Data Marts for diverse subject areas to holistically analytical infrastructure. New analytical environment would provide enhanced business intelligence, flexible reporting and scalable architecture. Subject areas encompassed savings, checking, accounts, demographics, statements, loans, investments and program management. Role: QA Tester Responsibilities: Participated in walkthroughs with BA team for Requirements review and Data Analysis. Tracked and reviewed the Requirements to make sure the Functionality of the Application is covered completely. Participated in creating Test Plan and overall Test Strategy for the Application. Developed Test Cases, Test Data and Test Scenarios for Functional, Integration and System Testing. Validated the Member, Billing, Provider and Authorization data in Front End. Performed Manual Testing for Functional, Regression, User-Interface (UI), End-to-End Testing. Tested the SOAP Requests and Responses using the tool SOAP UI. Created data sources to validate the web service with multiple sets of data, and was able to store the data in the Excel file using data sink. Inserted assertions in SOAP UI to validate the expected response from the web services (SOAP, RESTFUL). Developed Test summary reports and participated in meetings. Validated the reports and files using SQL statements. Tracked defects and conducted Bug review meetings. Continuously worked to check the Functionality of the Application after the stories are complete. Coordinated with Business Analyst, Developers and team members for fixing issues. Provided status reports to the test lead and participated in test status review meetings with the team members. Environments: Jira, SQL Developer, SOAP UI, Windows. Client: Farmers Insurance Company, Simi Valley, CA.                                                                                           Aug 09 – Mar 11 Farmers Insurance Group of Companies is a big name in both private passenger automobile and homeowners insurance, which offers Whole life insurance, Universal life insurance and Term Life insurance. This project involved the maintenance and development of a Web based intranet application for employees within the company. The employees can access complete customer account information, process insurance claims and authorize claims of the customers. Role: QA Tester Responsibilities: Created test plans & test cases for integration testing of the application and execute manual test cases and automate test scripts. Identified the scenarios which can be automated and wrote test scripts. Developed automation scripts for functional testing and Data driven testing of the application using QTP. Performed Data Driven testing using QTP to test the application with different sets of data for positive and negative test cases. Verified data integrity by back-end testing of the application by writing SQL queries. Reported and tracked the Bugs through HP Quality Center.  Performed regression tests and load tests to identify performance bottlenecks and provided improvement recommendations for the developers and closely worked with them in the development process. Responsible for dealing with developers and business analysts to better understand requirements, functionality and business process for QA testing. Executed SQL Queries and made sure that values entered in front end is stored successfully in the appropriate data tables. Coordinated with the Project Team and Configuration Management Team for build release. Involved in Coordinating with offshore teams. Environment: QTP, HP Quality Center, BugZilla, Oracle, MS SQL Server, UNIX/ LINUX, Windows. References: Will be provided upon request."}