{"text": "Name: elsie elsie E-Mail: elsie.elsie@gmail.com Address: Bangkok, Thailand Github: https://github.com/elsie LinkedIn: https://linkedin.com/elsie Phone No. 662636751678 EXPERTISE 6+ years of experience as QA Analyst/Tester with industry wide experience in Banking, Healthcare and IT domain with focus Quality Assurance, Data and Business Analysis.   Extensive experience with automation tools: Quality Center, QTP (Quick Test Pro)/QTP Framework, Load Runner  Extensive experience in Manual Testing, Automated testing and quality assurance of Client/Server and Web applications using both Black Box and White-Box testing techniques. Experienced in ETL/BI testing and written complex SQL queries to validate the data against different  Extensive experience with IBM Mainframe for analyzing the data in designing the ETL Process. Excellent Knowledge of Business Intelligence (BI) tools like MicroStrategy, Cognos and Crystal Reports. Proficient in Performance, Unit, scalability testing Reliability, Stress, Load and Volume Testing Experience in designing, creation and execution of Test Plans, Test Cases based on defined testing standards. Experience in tracking defects with bug tracking tools like Quality center, Bugzilla, Clear Quest. Expertise in using testing tools such as QTP, Quality Center and WinRunner for web services and client server applications Monitored version control and defect tracking activities using Rational Clear Case and Rational Clear Quest. Built report interfaces and data feeds. Co-ordinate in creation and execution of QA and testing processes, test strategies and plans, bug documentation and bug tracking and used Requirement management and bug tracking testing tools like Quality Center and Clear Quest.  Strong Expertise in SDLC, Project Management and Testing Lifecycle Methodologies like Rational Unified Process (RUP), Waterfall, Spiral and Agile models.  Implemented Testing Methodology process improvements for manual and automated test efforts. Proficient in analyzing the SRS (Software Requirement Specifications), Functional Design Documents and AUC (Application Use Cases) to formulate Test Plans, Test Strategies and Test Cases for Manual as well as Automated Testing for various applications to ensure proper business compliance.  Possess extensive knowledge of software Quality Assurance Techniques and excellent Analytical skills coupled with Good Communication and Interpersonal skills.  Involved extensively in Black Box Testing, System, GUI, Integration, Functional, User Acceptance, Database Testing and Regression Testing.  Prepare defect reports & test metrics for walkthrough sessions to help promote the application. Able to work collaboratively with testers, developers and business in testing complex and large projects and maintain detail QA documentation.  TECHNICAL SKILLS Programming and Scripting\t\t: C, JAVA, SQL, Visual Basic, JavaScript\t Databases\t\t\t\t: Oracle, MS SQL Server, MySQL, Teradata Requirement Management Tool\t: Rational Requisite Pro, Quality center, Test Director. Project Management\t\t\t: Microsoft Project, Microsoft Office Business Intelligence\t  : Business Objects, Cognos, Crystal  Report Testing tools\t\t\t\t: QTP, Win Runner  Bug ManagementTools\t\t\t: Quality Center, Bugzilla,ClearQuest PROFESSIONAL EXPERIENCE EAST WESTBANK, PASADENA, CA\t\t\t\tJAN 2014 - PRESENT  AUTOMATION QA ANALYST Responsibilities: Involved in the development of Test plan, Scenarios and Test scripts for manual, automation and functional testing of the CRM related Salesforce application Analysis of functional specifications and designing Test Plans, Test cases for Functional Testing Wrote and executed automated test cases using Selenium WebDriver to automate manual testing solutions. Used Firebug to identify Elements’ by ID, Name, CSS, XPath, and Links on Web Pages.  Performed Data driven testing using Selenium WebDriver, Junit functions and JDBC Connections which reads data from scripts using property and XML files.  On daily basis used build tools like Maven and Jenkins to build and regress automated tests into the CI process and for VCS used GIT; documented and tracked defects and produced detailed reports using Jira Created Maven projects and followed Page Object Model Framework  Involved with Daily Stand-up meetings with PM and Lead, and Dev team.  Participating in Code-review tasks once in a week with Manager, and Team Lead Log the Defects/Bugs using defect tracking tool with Jira and Zephyr cloud for Test Management tool Tested Salesforce applications in different types of browsers and versions, such as Internet Explorer, Firefox, Google Chrome to simulate production environment Performed Web Services testing and Validated XML request/response data using SOAPUI with Groovy scripting and Restful Web Services. Tested SOAP-based Web Services for enrolling customers, getting insurance information, creating claims Creating automation test scripts using Java with Selenium WebDriver for Salesforce Website Environment: Quality Center, ALM, Selenium, SQL, Oracle SQL Developer, Agile SCRUM, Share Point EXPEDIA, CHANDLER, AZ                                                                                                                JUNE 2011 – DEC 2013 QA ENGINEER Responsibilities: Involved in testing of various modules. Tested web application using TestNG and Selenium Framework and managed database on Oracle. Involved in preparation of Data Driven Automation Framework for Selenium WebDriver. Involved in manual testing of Mobile web applications and native App for Android Devices. Used Selenium GRID to execute test cases parallel on different target machines Experience in setting up the server and test infrastructure to allow for Selenium tests to be run in a distributed manner. Performed Data-Driven testing by developing Java based library to read test data from Excel & Properties files. Develop a Test Framework in Selenium &TestNG for Regression testing. Used JUnit as underlying API to run tests from Eclipse using assertions to validate test cases. Created UI mapping and Appium using properties files to separate code from locators.  Used SOAPUI for automating web services testing.  Created CA-LISA-Service Virtualization test automation framework. Worked on setting project for REST and SOAP based Web services in SOAPUI. Wrote integration tests using SOA, SOAPUI and Groovy scripts to call Web services and check the database for expected changes. Used Firebug to select CSS selectors and XPath to identify UI elements. Worked to break the software, captured logs from android devices through DDMS or remotely, filed bugs, triaged severity/priority edge case to blocker and followed up with SDE for fix Used SOA&SOAPUI to perform the testing of Restful web services for applications. Environment: SQL Server, LoadRunner, Oracle, Selenium. Rational Test Manager, Rational Clear Case, Test Director, RUP HEALTH NET INC., WOODLAND HILLS, CA\t\t\tJUNE 2009 - MAY 2011 AUTOMATION QA ENGINEER Responsibilities:  Developed test cases. Involved in design and implementation of Selenium WebDriver automation framework for integrations and regression test suites (TestNG and Maven). Configured Selenium WebDriver, TestNG, Maven tool and created selenium automation scripts in java using TestNG prior to agile release.   Worked on distributed test automation execution on different environment as part of Continuous Integration (CI) Process using Selenium Grid and Jenkins. Developed automated tests for continuous regression testing using Selenium, TestNG and Maven. Implemented Automated execution of tests (nightly and need based) using Maven and JENKINS. Tested applications in different types of browsers and versions, such as Internet Explorer, Firefox, Google Chrome to simulate production environment Designed, maintained and executed Automated Integration framework of API/Web Services across multiple test and production environments using SOA test. Created custom JSON/XML Assertors, for validation of SOAP (WSDL), and REST API calls, and Data Banks for storing and analyzing data input/output and error codes. Extensively used XPATH, Regular expression and classes to perform UI actions. Exported output/reports for all automated testing results. Done SOA testing for Payments API's using SOAP UI and Java framework for web services testing. Used SQL Queries in performing data validation to ensure data accuracy and data integrity by testing back-end components of new data warehouse products.  Environment: Agile, QTP, Windows, Oracle, Java, JavaScript, SQL, Apache webserver, Selenium, JIRA, Bugzilla, ClearQuest\t"}