{"text": "Name: minnie minnie E-Mail: minnie.minnie@gmail.com Address: Cangzhou, China Github: https://github.com/minnie LinkedIn: https://linkedin.com/minnie Phone No. 118230517349 Professional Summary: Six plus Years of experience in Quality Assurance/ Software Testing with emphasis on manual testing efforts. Involved in testing Web, Ecommerce, Retail, ETL and Healthcare applications.  Well versed with multiple years of proven experience in QC ALM.  Working knowledge of using QTP Scripts with Standard, Text, Bitmap, Image Checkpoints and Synchronization Points, Parameterization etc. Proficient in using Test Management tool Quality Center for Test Planning, Test Designing, Test Analysis, Test Execution, Defect Tracking and Reporting. Expertise in requirements analysis, preparation of test strategy, test plans and creating test cases. Worked in developing and maintaining Test Scripts, analyzing bugs and interacting with development team members in fixing the defects using Quality center. Ensure traceability of test cases to requirements, working with the project Business Analyst to ensure all requirements are tested. Expertise in different types of testing such as Functional testing, Integration testing, Regression testing, GUI testing, Back-end testing, Black Box testing and System testing, UAT testing etc. Worked in testing various Web Based Applications and Client server Applications. Tested Web services using Soap UI. Worked testing of applications on WEB and Mobile platforms at all the stages of software development and software testing life cycles. Hands on experience in Testing Mobile Application & Mobile Web Applications.  Worked on Rally, JIRA for logging defects, understanding the user stories, uploading test cases. Worked in Software Development Life Cycle (SDLC) and Software Testing Life Cycle (STLC). Expert in validating Databases, Oracle and MS SQL Server using SQL queries. Worked in testing the ETL BI Reporting using tool Pentaho and OBIEEwhich includes SAIKU Reporting-created and tested standard reports and custom& DWH reports, dashboards and SAIKU Analytics- created and tested DWH cubes. Extensive hands-on experience in testing large, complex software applications designed to automate common business processes, including automated and manual testing Attended daily scrum meetings for the new projects that followed Agile Scrum Methodology. Exceptional ability to work well in a team and individually. Worked on testing various Applications like Travel Applications, Expenses, Mobile, Retail and Ecommerce based Applications, HIPPA based Health care Applications etc. Solid management skills, demonstrated proficiency in leading and mentoring individuals to maximize levels of productivity, while forming cohesive team environments. Technical Summary: Operating Systems: Windows 98/2000/NT/XP/7, LINIX, VM, MS-DOS, UNIX (Sun Solaris 8, HP, IBM Compatibles), UNIX, Programming Languages:  C, C++, SQL, PL/SQL, Visual Basic, ASP, .Net, Java technologies. Databases: MS Access, MS-SQL, Oracle 8i/9.x/10.x, SQL server, UAT  RDBMS: Oracle Developer 2000. Testing Management Tools:  Quality Center/ Test Director, JIRA. Functional Testing Tools: QTP, Soap UI. Technologies: HTML, HTTP, VB script, ASP, XML, Java Script. Modeling: UML, Erwin, Visio Reporting: SSRS, Cognos, OBIEE 10g/11g, Micro Strategy, Pentaho    Mobile Platforms: iPhone OS, Android, iPad, BlackBerry Others: Word, Excel, Power Point, Outlook, Visio. Professional Experience: Client: Concur Technologies, Vienna VA\t\t\t\t\t\t\t\tFeb 2014 to Present Role: SR.BI Reports/ OBIEE Tester [Travel & Expense Management System integration T&E] Responsibilities: Performed regression testing against the various builds of the application. Wrote SQL queries and tested front end developed data in the databases. Understand the Requirements, Prepared and executed Test Cases manually according to the BRD, Technical Specification, Functional Design and Use Case documents, identifying applications functionality, test requirements and coverage. Tested Concur CGE Application in various environments like Preview, Stable on all Mobile platforms. Performed various Functionality, System, travel and Expense management Integration validations on Mobile platforms. Defects were tracked, reviewed, analyzed and reported using Quality Centre, JIRA. Worked on testing End to End flow of Travel and Expense Management Systems integration (T&E integration). Tested various Time Zone Calculations and last Date to Ticket in Travel... Verified this for Government contract and Non-Government Contract, Discount and Non-Refund fares for various Airlines Created the Amendments and verified the Reservation and expenses Summary and compared the Results with Authorizations [integration]. Tested various trip changes, updates, cancellations on various GDS.Also verified the Error Services for cancellations and trip Ticketing. Verified all Travel bookings- Car, Hotel, Air, rail and expenses on both Web and Mobile Platforms Verified fed rooms program rates appear in CGE during hotel availability search and booking processes. Verified trip request/History Screen accessed by View/Change Reservations in TAVS for a Trip  Interfaced with developers to resolve technical issues and investigated software faults. Defects were tracked, reviewed, analyzed and reported using Quality Center. Involved in testing Web services and XML with tool called ‘SOAP UI’. Used this tool to locate WSDL file on internet, create Test cases, run them, do load testing, security testing. Worked BI reporting Adhoc reporting, Adhoc Analytics- Creating Standard, Custom Reports by BI Reporting tool OBIEE and Pentaho. Created Standard Reports based on reservations- Air, Car, hotel, rail, Authorizations, Vouchers, Amendments etc and validated the the Prices, reservation details, Booking information, Expense details. Created and Validated DWH Reports for all Reservation updates, cancellations, Booking changes and tested that the data and information that is inserted in the front end  exactly matches with the data in the Reports.  Created custom reports and tested based on Trips booked, Authorizations& Vouchers created, Amendments, changes and updates  made to the existing reservations using OBIEE,Pentaho BI Reporting tool and validated that the changes made in the TAVS matches with the data in the Reports. Created DWH cubes by using Adhoc Analytics and also validated the data by using filters conditional statements etc. Created various types of dashboards and validated the total bookings made by the user and Total trips booked per Airlines using Pentaho and OBIEE BI reporting tools. Worked and validated creating reports using various formats. Validated the capability and ease of using prompts to select data on a report with specific attributes. Also validated the use of drilldown on reports and navigation on reports Interacting with Developers to discuss about the requirements/status of the defects Environment: Oracle (OBIEE), QC 10, Java, Soap UI, QC 10, Test planning, UAT, Net, SQL Server, Web Application, AGILE SCRUM, UML. Client: Harley-Davidson, WI  \t\t\t\t\t\t\t\t \t\tJan 2012 to Feb 2014 Role: QA Tester   Responsibilities: Reviewed the Requirements and analyzed them. Validating web based Ecommerce and documentation based on standards for software development. Assisted in Creating Detailed Timelines, Test Plans and Test Strategies for major releases. Conducted extensive Smoke Testing, Functional, Regression Testing and Sanity testing on the application. Used Quality Center for Planning, Execution and Bug Tracking and Bug reporting. Performed Harley Davidson Application Testing on various Mobile platforms. Tested different Applications and validated all the functionalities on different environments on IOS Testing, Android, iPhone, iPad etc. Having good experience in Feature testing, Functional testing, System testing, Compatibility testing, Retesting, in mobile handsets on both IOS and Android. Worked on QTP Integrated Environment (Actions, Synchronization, Recovery Scenarios etc.).Created and enhanced the test scripts using descriptive programming. Involved in testing General Merchandise like Men’s Apparel, Women’s Apparel, Home Items based on size, price, features, style, Collection. Knowledge of retail POS and inventory management applications. Experience testing Point of Sale (POS) and AS400 application environments Involved in testing prices of various Items, tax calculations, Add to Cart items, Verifying the shipping and Billing Addresses by using AVS (Address Verification System). Tested Various products like Bikes,Clothing,Home Décor , compared the items with various prices, placed orders, made payments and verified various credit and debit card payments integrated by using various third party Payment Gateways like Cyber source, Authorize.net, PayPal etc. Worked on Harley Davidson Cross View Customer care application which involves interaction with the customers in registering the customers, selecting the products for them, placing orders, making payments, Editing carts, Shipping Orders and also initiating the Returns for them if required. Tested various Shipping methods like Ground, Express, 3 days, 5 day shipping etc. and ensure all the information entered is correct. Verified the different Order Status such as Processing, Job Tickets, Complete order, Tracking order, Payments, Billing & Shipping, Pending order, and cancelled order. Verified applying PROMO Codes, Discounts, Coupons while placing the Orders for all types of items and products and also verified that Gift orders. Involved in testing all types of Returns for damaged goods and tested that the paid amounts are refunded along with Shipping and handling charges.  Done data validation for the OBIEE / Micro Strategy   reports.  Installed, configured SOAP UI to test web services using WSDL file given by Development team. Developed SQL scripts to verify the data populated in Database and checked successful transaction. Attended daily scrum meetings for the new projects that followed scrum methodology. Verified the different Order Status such as Processing, Job Tickets, Complete order, Tracking order, Payments, Billing & Shipping, Pending order, and cancelled order. Involved in weekly QA meetings, project walkthroughs, and reviews on regular basis. Tested entire functionality of the application on different browsers and operating systems based upon system specs. Environment: QC 10, Mobile, Java, WMS, Linux, Soap UI, Quality Center 10, Test planning, OBIEE, UAT, Net,SQL Server, Java, UNIX, Web Application, AGILE SCRUM, UML. Client: Transverse LLC, Austin, TX\t\t\t\t\t\t\t\t\tSept 2010 to Dec 2011 Role: Ecommerce QA Engineer/ETL BI Report Tester Responsibilities: Involved In understanding and analyzing the Requirements. Worked on Soap UI for testing the Web services (WSDL). Worked in defining Testing Methodologies, Designing Test Plans and Test Cases, Verifying and Validating Web based e-Commerce TRACT application. Attended daily scrum meetings for the new projects that followed Agile Scrum Methodology. Worked on testing general merchandise and other products like subscription, One-time products etc. Worked in testing the prices on various products, tax calculations, invoices. Also verified shipping and billing addresses, payments with credit cards, debit cards, bank transactions, checks, and cash through various payment gateways.Worked on adding coupons, discounts to all the products. Understanding the business logic and user requirements for manual and automated testing that includes test objective, Test plans, and test case and test procedures development using Rally. Involved in writing and implementation of the test plan. Responsible for functional, GUI & Regression testing. Investigated bugs and interacted with developers to resolve technical issues. Performed Quality Analysis on problem reports against software and the production system in order to confirm that problems truly exist and can be recreated for testing. Logged the defects and coordinated efforts with the development team to solve the problems using defect-tracking tool (QC ALM). Validated requirements for the application like Invoices, Products, Accounts, Agreements, and Subscriptions. Also validated TRACT reports as well as DWH reports. Created dashboards and validated the monthly, quarterly, yearly Revenues. Also validated the total prices of the products placed by the customers by using dashboards. Also created custom Reports validated the various products like subscriptions, one-time products, Subscriptions, Total prices, Agreements, Invoices by changing the System Preferences and adding fields in the filters Tested the back-end Database by preparing Queries with SQL to retrieve data from database. Held weekly status meetings showing progress and future testing efforts to the QA manager and validated the DWH Reports. Environment: QC ALM, Soap UI, WMS, JAVA, QC ALM, Windows 2000/XP, Windows, UNIX Client: Premier Inc., NC\t\t\t\t\t\t\t\t\t\tJan 2009 to July 2010 Role: QA Analyst-Health care Responsibilities: Assisted in Creating Detailed Timelines, Test Plans and Test Strategies for major releases and organized strategy review meetings. Conducted extensive Smoke Testing, Regression Testing and Sanity Testing on the application. Used Quality Center for Planning, Execution and Bug Tracking. Coordinated efforts with the development team to solve the problems using defect-tracking tool. Performed detailed test results analysis after each test execution cycle and maintained Test results. Developed SQL scripts to verify the data populated in Database and checked successful transaction. Attended daily scrum meetings for the new projects that followed Agile scrum methodology. Performed Integration, system Testing and executed Regression testing to identify errors in each modified build in the process of testing. Used Rally (Agile Project Management tool) for creating user stories, test cases, tracking defects. Proficient in working with testing tools and carrying out Functionality Testing, GUI Testing, Systems Testing, Integration Testing, Black Box Testing, User Acceptance Testing, and Regression Testing of Web based applications. Environment: QTP 10, Team track, Linux, Quality Center 10, Test planning, soap UI 3.0, UAT, SQL Server, Java, Unix, Web Application, AGILE SCRUM, Erwin, UML, Visio."}