{"text": "Name: pauline pauline E-Mail: pauline.pauline@gmail.com Address: Tongshan, China Github: https://github.com/pauline LinkedIn: https://linkedin.com/pauline Phone No. 424107336671 Professional Summary Over 6+ years of extensive experience as Quality Analyst and EDI QA in namely health care domain. Proficient experience in Manual testing of GUI and functional aspect of Client-Server and web based Application on multiple level of SDLC and STLC. Extensive experience in Functional Testing, Regression Testing, SystemTesting, User Acceptance Testing and Black Box Testing. Extensive experience in Test Plan development, writing and executing Test Cases. Extensive experience in Agile Methodology and Waterfall Methodology in handling SDLC. Experience in planning, documenting and coordinating End to End Testing, User Acceptance Testing (UAT) and Client Testing. Experience in working version control tools like Clear Case and SVN. Hands on experience in Project change control mechanisms, Impact Analysis, Risk Analysis, Defect Management, End to End Testing and Production issues/defects ad-hoc and regression Testing &support Having expert level experience with Functional testing in Functional System Integration testing, User Acceptance Testing, End to End Test Management, Running Automation scripts in Regression Suites and Non - functional security testing areas.  Worked on the scripting languages like VB Script, Java Script. Strong skills in Back-End Testing on Relational Database. Writing SQL queries, generating reports to ensure data integrity and validating business rules. Attended JAD sessions and SCRUM meeting to go over the progress of the project. Profound understanding of Insurance policies like HMO and PPO and experience with HIPAA EDI transaction codes such as 834(Enrollment and Maintenance), 820(Premium Payment), 270/271(Inquiry/response health care benefits), 276/277(Claim status request and response), 835(Remittance), 837(Health care claim). Good knowledge of Medicaid/Medicare claim processing.  Proficiency in Defect management including Defect creating, modification, tracking and reporting using Industry Standard tools like Quality Center, Clear Quest, TFS (Team Foundation Server). Performed Testing Life Cycle during various phase of application. Strong knowledge of Business Intelligence and Data Warehousing. Analyzed Gap Analysis documents to write Test cases and Test plans. Hands-on experience in Project change control mechanism, Impact Analysis, Risk Analysis. Worked on different modules of FACETS application like Membership, Claims and Providers. Having excellent experience working EDI HIPAA Medicare, Medicaid, (837I/P/D, 270/271,276/277,278,820,834,835) X12 transaction for both version (4010A, 5010). An excellent communicator, having a strong sense of organization and being able to manage time efficiently. Ability to lead the team, to work as an efficient team player, to learn the new technologies, handle the job responsibilities and easy adjust to local company’s disciplines and requirements. Technical Skills/Tools Professional Experience Client: Independent Health, Buffalo, NY       \t\t\t\t\t\t          Mar 2017 –  Oct 2017 Position: Quality Analyst Description: Independent Health plan has been one of the leading health care providers in Buffalo, NY. It offered patients with online access to their practice using interactive web pages. Patients could schedule appointments, request prescriptions, manage account statements, maintain personal records, and receive email notifications. The system also facilitated the health care providers to place claims request, which is processed with the aid of the Claims Processing System. Responsibilities: Involved in writing Test plans, Test cases and responsible for executing the Test Scripts. Responsible for designing, developing test plans use cases and executing test scripts. Processing of member enrollment and benefits (834) batch jobs corresponding to the claims (837). Used QTP to perform Functional Testing and Regression Testing. Conducted Frontend and GUI Testing manually as per the requirement for the end client. Resolved issues with member attributes, enabling multiple rules associated with member lookup process in FACETS. Involved in all phases of SDLC and implemented Test management best practices through Agile method working with Globally spread teams. The ECM (Enterprise Content Management) System Analyst supports the firm’s effort to manage both structured and unstructured data using HP Exstream. Created the SVN Repository and managed the central file repository. Worked with providers to Validate EDI transaction sets. This includes gap, impact and business rule validation for all 12 standard HIPAA 5010 transactions: 270/271, 276/277, 278/278, 820, 834, 835, 837 (IPD).    Documented Functional Specifications for Enrollment (834), Customer Service Interface, Claim (837) including Encounter Claim and Capitation Payment (820) and Authorized Representative for Medicaid Members. Performed front-end validation using Java Script. Formulated reusable test cases using HP QC for functional, Integration, GUI/UI, end-to-end, usability, security, smoke, black-box and regression testing. Tested the Medicare and Medicaid preferred Eligibility and EOB claims extract files. Managed defect tracking process, which include prioritize bugs, assign bugs and verifying bugs using ALM. Coordinated with concerned developer/developer teams for design reviews per the business requirements for both UAT and Production Testing. Performed test management and defect management using HP ALM. Performed Back End Testing running SQL queries in Oracle database using TOAD, generating reports to ensure data integrity and validate the inserted and updated data. Worked on different Modules like Membership, Claim and Provider in FACETS application.  Worked on HIPAA Transactions and Code Sets Standards according to the test scenarios such as 270/271, 276/277,837/835 transactions. Environment: FACETS 5.3,SQL, Oracle 12c, HIPPA 5010, XML, QTP, Agile, HP Exstream, Java Script, SVN, TOAD, HP ALM, MS Office, EDI 834, 820, 835, 837, 270/271 Client: Molina HealthCare, Long Beach, CA                                                                      Jan 2015 – Jan 2017 Position:  Quality Analyst Description: Molina health plan is a Health payer organization which enrolls members through government web portal using Federal Exchange program by processing 834 EDI transactions for Individual and Small Group Enrollments using TriZetto Facets. As a BA Analyst, I am responsible for creating user stories, processing 834 Files and verifying the standards and complete the Membership Enrollment Process in TriZetto FACETS using Agile/Scrum Methodology. Responsibilities: Defined Test plan, Test strategies, Test cases based on the requirements outlined in the test plan as part of the development cycle. Execute Functional Testing, Regression Testing, Security Testing, Database and Usability Testing. Support User Acceptance Testing phase of the life cycle. Converted most of the manual test cases into Quick Test Pro automated scripts. Participated in developing test plans templates and guidelines to be used by the project team with detailed screen layouts with regards to various types of corporate actions. The 834 transactions were broken down into several components depending upon the functionality achieved from each component and the integrity of these components. Worked to assess and respond with corrective actions for control gaps found in the UAT. Performed Front End Testing, Regression Testing, Functionality Testing using QTP Involved in the development of Test Plans and Test Cases. Involved in FACETS Implementation, involved in End to End testing of FACETS Claim Processing, Subscriber/Member module and Claim adjudication process. Creating claims for validating members benefits against different Medicare and Non-Medicare products. Performed Positive Testing and Negative Testing Manually. Extensively worked on all kind of Joints and Operators to fetch data from multiple tables. Tested and validated the database tables using SQL queries and stored procedures and performed Data Validation and Data Integration. Provided Efforts Estimate and coordinated the test schedule using Agile Testing methodology in UAT phase. Used Java Script for client validations. Followed Agile/Scrum Process throughout the SDLC. Create ALM Quick Test Professional Template to create new script in Test Suite Script. Conducted Data integrity and Data validation test manually. Checked the data flow from Front end to Backend and used SQL queries to extract the data from the database. Extensively used SQL statements to query the Oracle Database for Data Validation and Data Integrity. Used QTP to perform Functional Testing and Regression testing for monthly releases. Performed test execution and wrote and executed Test scenarios/Test scripts. Developed design specification writing Test Reports and documenting Test Results.  Identified customer requirements besides reviewing test plans and documented the development of these plans. Interacted with the technical team for the claims transactions design Logged and tracked defects using Application Lifecycle Management (ALM). Environment: Windows, Toad, QTP, Oracle 11g, HP ALM, FACETS 4.8, Java Script, MS Office, Agile, EDI 834, 837, 820. Client: Genesis Healthcare, Kennett Square, PA                                                                      Jun 2012 – Nov 2014 Position: Quality Analyst Description: Genesis healthcare is Pennsylvania’s Medicaid program. This is a public health insurance program, which provides needed health care services for low-income individuals including families with children, seniors, persons with disabilities. Genesis healthcare is financed equally by the State and federal government. Health Care Business Analyst on a HIPAA assessment project for a State government. My specific assessment areas Up-gradation of HIPAA X12 4010 transaction to HIPAA X12 5010 and ICD 9-CM (Clinical modification) to ICD-10-CM/PCS (Clinical modification/procedure coding system) . Responsibilities:  Development of test scenarios, test cases, execution of test cases and documentation of test results occurs as per the defined program schedule for each implementation event   Maintaining knowledge of Medicare and Medicaid rules and regulations pertaining to the FACETS configuration and evaluating the impact of proposed changes in rules and regulations. Upgrading the system from HIPAA 4010 to HIPAA 5010 converting ICD-9 to ICD-10. Involved in FACETS Implementation, involved end to end testing of FACETS Membership and Enrollment, Provider and Claim Processing. Worked on EDI Transactions (837/834/835/276/277) for Verification and Validation as part of System Testing. Use Subversion (SVN) version control system to maintain current and historical versions of files such as source code, web pages, and documentation. Worked in fast paced agile environment. Performed Java Script Testing, Functional testing to validate how better and feasible is the application to be used by the End-user. Identified the bugs and kept track of the defect report using Quality Center, and also performed Root cause analysis for defects. Involved in Unit Testing, System Testing, Regression Testing, Security Testing and Usability Testing. Played primary role as QA in analyzing requirements by interacting with client and business analysts and discuss with Development team separately to identify the testing scope as well as development (Coding) scope for those requirements.  Wrote Test cases and developed Test scenarios based on BRD, FRD and Use Case Documents.  Wrote SQL queries in Toad for Backend testing, Verification and Validation.  Worked on HIPAAEDI834 use cases and collaboration templates according business requirements.  Implemented the ANSI X12 Version 5010 EDI transactions (HIPAA) like (834, 837P, 837I, 835 remittances). Responsible for designing Test Steps, Requirement Mapping to Tests, Executing Tests manually, Defect Logging and Defect Reporting.  Performed Cross platform and Cross Browser Testing.  Raised defects and assigned to Development teams with appropriate severity levels.  Worked closely with developers to resolve the technical issues to meet the dead lines. \nTested user interface and navigation controls of the application using QTP. Experiences working in ANSI X12 837-835 EDI Transaction. Tested the HIPAAEDI834, 837/835 transactions according to test scenarios and verify the data on different modules.  Conducted Back End Testing Using SQL Commands. Environment: Toad, HIPAA, EDI 4010, EDI 5010, XML, QTP, FACETS 4.8, Java Script, Agile, SVN, Quality Center, ICD-9, ICD-10, MS SQL, MS Office. Client: Tufts Health Plan, Boston, MA                                                                                                   Feb 2011 – Apr 2012 Position: Quality Analyst Description: Tufts contracted with the Medicare Centers and Medicaid Services (CMS) to provide quick, easy, and affordable access to the health care service of their choice. Project involved integrating Market Prominence, Member enrollment and the Claims Processing System with the data warehouse to support the reporting requirements. Responsibilities: Participated in setting up testing environment. Involved in preparing Test Cases based on business requirement documents. Tested HIPAA Transactions and Code Sets Standards such as 837/835, 270/271, 276/277 transactions. Tested 837, 835, 270/271, 276/277 transactions. Authored and executed Test cases for Claims and Customer Service Workflow manually.  Responsible for writing the Test Cases and Test Scenarios based on the Functional Specification and technical Specification and documented in Quality Center. Executed Test scripts using QTP. Created VB Script files to automate file downloading and file opening for users. Worked closely with Agile Scrum team from several domains to ensure product testability while running Regression tests. Worked on configuration management tool SVN. Tested business integration between internal and external systems in a Service-Oriented Architecture SOA. Defects found during testing were logged in Quality Center. Worked on claims, Claims adjudication, Membership, Eligibility in different managed care products like HMO and PPO. Recorded scripts in Quick Test Pro to perform Functionality testing. Worked with providers and Medicare or Medicaid entities to validate EDI transaction sets or Internet portals.  This includes HIPAA4010,834, 820,837, 835, 270/271. Intensively involved in project testing efforts by doing Regression Testing and by helping UAT team in User Acceptance Testing  Logged the errors, reported defects, determined repair priorities and tracked the defects until resolution using Quality Center. Extensively used SQL statements to query the Oracle Database for Data Validation and Data Integrity. Responsible for performing System testing and Integration testing for release. Identified, analyzed and documented defects, error and inconsistencies in the application using Quality Center. Environment: MS Word, Excel, PowerPoint, FACETS 4.7/4.8, QTP, SQL, VB Script, Oracle, EDI,SVN, Agile, Quality Center  "}