{"text": "Name: margaret margaret E-Mail: margaret.margaret@gmail.com Address: Ho Chi Minh City, Vietnam Github: https://github.com/margaret LinkedIn: https://linkedin.com/margaret Phone No. 299781025601 PROFESSIONAL SUMMARY: Thorough understanding of different phases of Software Development Life Cycle (SDLC) and Software Testing Life Cycle (STLC) including Agile Methodology and Waterfall. Diverse work experience on Integration Testing, Functionality Testing, System Testing, Smoke Testing, GUI Testing, Regression Testing, Sanity Testing, Performance Testing, User acceptance testing (UAT), Parallel Testing Proficient in writing Test Scripts, Test Scenarios and Test Cases for Manual Testing Expertise in Mortgage domain  Experience in executing manual test cases, Black Box testing, integration testing and regression testing. Extensively worked on Quality Center, JIRA and Bugzilla to write Test Cases, Execute Test Cases, Log Defects, Track Defects and Prioritize Defects. Hands on experience in Data Manipulation, Data Definition languages in writing SQL queries. Experience in back-end testing to query and access database using SQL Skilled in validation and testing complex scenarios for the maintenance of quality standards in projects. Ability to achieve targets and deliver results in a high-pressure environment Effective team player, self-motivated, capable of adapting to new technology, strong problem solving and analytical skills, and inter-personal communication skills with a desire to achieve specified goals. Also has good client interaction and team skills with strong leadership and excellent interpersonal skills TECHNICAL EXPERTISE: Testing Tool:  \t\tALM, Quality Center, JIRA, BUGZILLA Database Tools:\tMicrosoft SQL server, Oracle SQL Modeling Tool:\tSnagIT, MS Visio, Lucid Charts Methodologies:\tWaterfall, Agile, Scrum Microsoft Office:\tMS Word, MS Excel, MS PowerPoint  Operating Systems:\tWindows 7/8/10 PROFESSIONAL EXPERIENCES: City 1st Mortgage Services, LLC \t Quality Assurance Analyst/Test Coordinator       Bountiful, UT Jan 2016 to July 2017 Description: This position encompasses the review and monitoring of customer mortgage transactions from origination through closing, funding and delivery (fulfillment period). To ensure adherence to Compliance and Regulatory requirements, Investor requirements, Bank policy and internal controls. In this project I worked in the initial procedure of purchasing a mortgage that is point of sale.  Responsibilities:  Responsible for preparing the reports and documents required for point of sale in loan origination system. Participated in Sprint Planning meetings with my QA lead with Business intent owners and IT team. Interact with business users like Loan Officers, Mortgage Consultants, Sales, Vendors and Business to analyze and test the business requirements. Trained new team members on the user cases and test cases. Coordinated assignment of test scripts from multiple departments and tracked test results. Created issue tracker and updated as needed. Coordinated with developers to ensure issues were addressed and resolved appropriately.  Developed status report, template and provided status reports to management. Coordinated test creation and execution plans and scripts for all new enhancements. Monitored requirements traceability to ensure complete test coverage. Managed defect process and supported user acceptance test. Prepared and led meeting between departments.\nReported developments to Project Manager using spreadsheet reports. Identified and worked to remove barriers to successful completion of the overall project, with particular emphasis on resolving issues with subcontractors\nFacilitated and coordinated the work of multiple project teams engaged in the establishment and implementation of new projects to support the Project Manager Conducted project kick-off meetings, defined project objectives and scope, tracked risks, assumptions, and managed detailed project schedules using Microsoft Project. Verified that the test cases are uploaded and mapped to the requirements in Quality Center. Reviewed the test cases with the Business, Compliance, BSA and Business Consultant and get the approvals. Monitored and report the testing results to the Project team on daily basis. Coordinated with QA team to manage and update the missing parameters of test cases and defects in QC. Performed Manual Testing to test the usability of the application. Enhanced UFT automation scripts with synchronization points, data table, parameterization and functions.  Conducted GUI testing to test the appearance and properties manually.  Performed Smoke Testing, Sanity Testing. Verified the web services for its functionality, reliability, scalability using SOAPUI web services test automation     tool. Conducted Smoke Testing of different Applications using SOAPUI. Performed back-end testing using SQL queries to validate data and perform Data integrity testing. Data mining on defects, test cases, requirements as required by the team. Analysis the testing activities as per the planned forecast for the given projects. Analysis the Weekly QA Metrics Reports for to correct the reporting errors. Tested each web services using SOAP messages Conducted User Acceptance Testing (UAT). Modified test scripts created by the system test team to meet UAT needs Supported User acceptance testing (UAT) in preparing the test scripts and test execution.  Getting updates and working with project team members for issues captured through metrics reporting. Documented and reported bugs using Quality Center. Environment: Agile, ALM, JIRA, BUGZILLA, Microsoft SQL server Genpact Mortgage Services, QA/UAT Analyst/Coordinator Irvine, CA April 2014 to Dec 2015   Genpact Mortgage Services is a specialized provider of end-to-end Mortgage origination and fulfillment services. The Company provides financial institutions and other mortgage lenders with private label Business Process Outsourcing (BPO) solutions designed to strengthen customer relationships. Genpact offering several web based applications that have a very broad range of functionality including (but not limited to) determining mortgage eligibility and managing the different mortgage plans. Responsibilities: Developed functional test plan based on business and functional requirements. Created Test Cases as per Business requirements.  Involved in Functionality, GUI testing, Regression Testing, Integration Testing, System Testing, User Acceptance Testing, Positive Testing and Negative Testing on Application.  Performed Sanity tests on production environment after deployment  Analyze and document test results, including re-testing of all previous failures.  Maintained Test Matrix for latest test results information.  Worked closely with developers in reproducing bugs reported  Participated in Walkthroughs and weekly status meetings Coordinated with team in creating and executing test plans and scripts for all new enhancements. Monitored requirements traceability to ensure complete test coverage. Managed defect process and supported user acceptance test. Developed and maintained productive working relationships with project owners, business functions, IT developers, vendors, and other project stakeholders. Conducted regular meetings, facilitated communications, ensured coordination, and cooperation among team members. Planned and facilitated project review meetings to expedite requirements and resolution of project issues. Guided the team on resource requirements, methodologies, tasks, dependencies, deliverables, risks, and other issues through the life of the project. Tested the back end using SQL queries  Logged the errors and track them using Quality Center and coordinated efforts with the development team to solve the problems  Tested web services by generating XML SOAPUI Requests and validated the corresponding XML SOAPUI Responses. Conducted Back-End Testing and Regression Testing using various phases of the application. Identified, analyzed and documented Defects, Error and Inconsistencies in the application using Quality Center. Performed data drive testing to validate the same set of operation with different set of data using QTP Reported and kept track of Software bugs. Interacted with Programmers to identify and resolve technical issues. Ensure the successful process of migrating software from the test into the production environment  Tested the Application on different Browsers like IE, Netscape and Mozilla. Environment: Quality Center/ALM, SQL, XML, SOAP UI HBCS Mortgage Corporation                                                                                  QA Analyst/Coordinator Edison, NJ Apr 2013 to Mar 2014 Description: Loan Information System keeps track of Loan Information and Payment records. Involve in the Design, Development and Testing of the custom designed application. The system includes accounts receivable, payables, overdue reminders calculation of fines and loan calculator. Testing for the interactive screens was done manually.  Responsibilities:  Worked on Agile methodology with Software Development Life Cycle phase.  Participated in the Daily Standup meeting as well as sprint meetings  Test Case Development/Preparation, creation, updates and Execution.  Reviewed the Test Plan maintained by the team.  Preparation of test data, Test Cases, Test Sets.  Written the Detailed Test Cases to cover all the steps to perform the procedure. Established customer expectations of project scope, deliverables, procedures for project communications and dissemination of information for team members. Coordinated assignment of test scripts to from multiple departments and tracked test results. Coordinated with developers to ensure issues addressed and found solutions accordingly.   Upload test cases and test sets on QC/ALM  Performed System Integration Test, Functional testing.  Performed execution of test cases manually to verify actual result meets the expected results.  Execute test cases and test sets to verify the expectation of requirement, update result in QC/ALM.  Defect logging with details and screen shot in QC/ALM  Prepared System Anomaly Reports/Requirement Traceability Matrix (SARS/RTM) for the defects identified during testing.  Prepared Daily Status Report to make sure that test case coverage has been done accordingly.  Interacted with the developers regarding priority of defects and update the status of defects once they are fixed.  Coordinated with the other teams involved in the testing.  Worked with business analysts, functional team and developers to resolve issues.  Reporting project status and setting goals to complete the assignment.  Environment: ALM, MS Office, Toad, Windows 10, Internet Explorer, Mozilla Firefox, Google Chrome  \t\t          PHH Mortgage \t Mount Laurel, NJ Quality Assurance Analyst                                                                      March 2011to Mar 2013 Description: Successfully implemented Point of Sales system and working towards implementation of its new Loan Origination System with Lender Processing System as the principal vendor. LPS Empower is a state-of-the-art enterprise wide loan origination system (LOS) that provides functionality for every facet of the origination process, including point-of-sale channels. Responsibilities: Assisted my QA lead in preparing Test plans for various test conditions.  Writing the Test cases and Test data according to Requirements.  Manually Conducted Positive and Negative testing.  Prepared Daily status Report.  Performed Integrated Testing, GUI, Functional and End-to-End Testing.  Performed Regression testing after each modification of the application.  Involved in creation and maintenance of Traceability Matrix.  Detecting, classifying, and reporting bugs through Quality Center.  Tested the projects were developed using SQL Server as the Back End.  Verified data integrity and data validity in Microsoft SQL Database using SQL Queries. Active interaction with team members, team lead and developers in review meetings to evaluate the progress and performance of the application.  Involved in weekly status meetings.  Provided Test Summary Report, Defect Reports using Quality Center. Environment: Quality Center, JIRA, BUGZILLA, Microsoft SQL server EDUCATION: Bachelors in Engineering - Bangladesh University of Engineering and Technology (Dhaka, Bangladesh)"}