{"text": "Name: emma emma E-Mail: emma.emma@gmail.com Address: Ahmedabad, India Github: https://github.com/emma LinkedIn: https://linkedin.com/emma Phone No. 470227986443   Career profile:   As a software developer with 4+ years of IT experience in Salesforce CRM platform and worked as a Developer/Administrator for 500-10,000 user base. Authored over 125 Apex classes, 85 Apex triggers and 70 Visualforce pages. Upgraded some applications from salesforce classic to lightning experience to develop rich user interface and better interaction of pages. Proficiency in SFDC administrative tasks like creating Profiles, Roles, Approvals, Process builders, Reports, Dashboards etc. Career highlights Actively analyzing and implemented the projects in a unique way and delivering the projects in time which increased the 40% revenue to the company. Achieved 80% closing ratio by qualifying clients and successfully designed the automation of converting 60% of leads into sales. 60% of the projects were implemented by using lightning components rather than classic and got 100% satisfaction from users. Achieved 100% success by providing the security and giving access to the resources by using permissions to the users. Technical Skills: Certifications: Certified salesforce administrator (201) Certified salesforce developer I (401) Certified salesforce app builder Link - http://certification.salesforce.com/certification-detail-print?conId=0034A00002sVHgKQAW Professional Experiences COMCAST                                                                                                                                                                                                           Philadelphia, USA.                                                                                                                                                    Salesforce Developer/Administrator                                                             \t              \t2017 Feb – Till Date Responsibilities: Extensively used Apex coding concepts to deliver self – contained and robust code segments without dependency on existing workflows and validation rules. Worked on Salesforce1 platform to build mobile app by enabling Lightning components for use in salesforce mobile 1 platform to make Lightning application mobile. Support specialties of escalated situations initiated by Salesforce marketing cloud, clients and partners. Developed Apex classes (custom / extension controller classes), Batch, schedule classes, triggers on standard/custom objects as per user requirements. Developed client-side pagination process. Configure salesforce and marketing cloud integration user along with configuration in salesforce. Written Apex classes to make an outbound integration to external application by generating necessary apex stubs from WSDL using WSDL2Apex.  Created B2B campaign workflow with the marketing team and maintaining a calendar for email campaigns. Good experience on developing partner communities and their customizations. Performing analysis on ongoing campaigns and preparing insight reports determining strategy for future limits. Set up, maintain and optimize email marketing campaign utilizing exact Target/salesforce marketing cloud. Managed customization of salesforce communities, performed various configurations related to communities, implemented knowledge management. Support the Email marketing manager in the development of new business requirements. Created modern enterprise lightning apps combining lightning design system, lightning app builder and lightning component features. Created various responsive visual force page for external user using lightning design system as well as standard components. Environment: Salesforce.com platform, Force.com platform, Workflow and Approvals, Reports, Custom Objects, Tabs, Email Services, Apex Language, Visual Force Pages, Components and Controller, Eclipse IDE Plugin, Data Loader. NBME Location: Philadelphia, USA. Role: Salesforce Developer/Administrator                                              \t               2015 Oct- 2016 Dec  Responsibilities: Proficient in using Eclipse based salesforce.com IDE to develop and deploy force.com software. Worked on implementing, developing and customizing customer communities based on client’s requirements. Support specialties in salesforce marketing cloud data management, API’s and mobile applications. Strong implementations and rollout experience with salesforce CRM clouds- sales, service, marketing and communities on Force.com platform. Took responsibilities to manage marketing automation efforts and handled all components email scheduling, management and deployment to increase customer satisfaction and enriched client experience. Managing of customer communities and customizing their dashboards views. Created web services using SOAP and REST, to integrate data with external systems and websites. Assisted the administrator in troubleshooting and solving problems. Organized marketing campaigns, campaign hierarchies, lead queries, assignment rules, web-to-lead and auto-response rules. Created triggers like sending emails to the portal users whenever they update their account information comparing their new information with their old information. Environment: Salesforce.com, Force.com, Apex, Data Loader, CRM, Import Wizard, Eclipse IDE,      Controllers, Visualforce Pages, JQuery, XML and Triggers. ZMENIT TECHNOLOGY SOLUTIONS Bengaluru, India. Salesforce Administrator                                      \t                                              2014Mar-2015 Aug Responsibilities: Worked with profiles and administrative permissions to grant/deny users access to platform features. Created custom objects, users, custom profiles, page layouts and record types to meet business guidelines. Migrated Accounts, Leads, Contacts, Opportunities sales data from external systems into salesforce. Created custom report types like summary and matrix reports to track pipeline insight, program opportunities. Invoked in salesforce.com application setup activities and customizes the apps to match the functional needs of the organization. Responsible for setting Field level security. Designed and developed User interfaces for salesforce users as per requirements. Environment: Saleforce.com platform, Data Loader, HTML, Custom Tabs, Email Services, Security Controls, Eclipse."}