{"text": "Name: marie marie E-Mail: marie.marie@gmail.com Address: Tehran, Iran Github: https://github.com/marie LinkedIn: https://linkedin.com/marie Phone No. 88852252458 _____________________________________________________________________________________ PROFESSIONAL SUMMARY\t 4+ years of overall professional IT experience in Salesforce.com and Force.com platform administrator. Experienced in analyzing business requirements, Entity Relationship diagram and implementing them to Salesforce Custom Objects, Junction Objects, Master-Detail relationships, LookUp relationships. Experience in Administration, Configuration, Implementation and Support on Salesforce.com platform. Worked on various salesforce.com standard objects like Accounts, Contacts, Opportunities, Products, Cases, Leads, Campaigns, Reports and Dashboards. Played a key role in UAT, SAT and training business users on SFDC system and process. Designed custom formula fields, field dependencies, validation rules, workflow rules and approval processes for automated alerts, field updates and email generation according to application requirements. Configured security and sharing rules at object, field and record level for different users at different levels of organization. Customized page layouts, search layouts, custom links, related lists and other components on a record detail and edit pages as per the business needs. Experience in Data Migration from ANT, Excel, MS outlook and Legacy Systems using Data Loader, Import Wizard, Cast Iron and other ETL tools. Worked with Dynamic Apex to access S-Objects and field describe information, execute dynamic SOQL, SOSL and DML queries. Experience in developing Apex Classes, Apex Triggers & Web services. Designed and developed SOAP based web services to integrate Salesforce with different external system. Experience in building Custom Applications that includes administration, configuration, implementing and support experience with Salesforce.com platform. Developed test classes and test methods to ensure maximum Code Coverage in Production Instance. Managing Business Process through various phases of a Project life Cycle (SDLC) Management, using methodologies like Agile, Business and Information Re-engineering.  Expertise in building Visualforce Pages, Visualforce Custom Controllers, Components, Custom Objects, Reports, Dashboards, Tabs and Customer Portal. Proficient in using JavaScript, J Query, CSS, HTML, DHTML, AJAX. Extensive knowledge about working processes such as time management and process optimizations. Capable of rapidly learning new technologies and processes, and successfully applying them to projects and operations. TECHNICAL SKILLS PROFESSIONAL EXPERIENCE Salesforce Administrator Avaya Inc, Denver, CO         \t\t\t \t                                           (Oct 2015 – Jan 2018) Avaya is a provider of next-generation business collaboration and communications solutions, providing unified communications, real-time video collaboration, networking and related services to companies all around the world. Implemented Salesforce mainly to track budgets for individual departments. Campaign in Salesforce was used for Campaign Management. Approval processes for Budget approvals. Reports and dashboards were also developed for graphical representation of data. Responsibilities: Responsible for performing Administrative functions in salesforce.com. Daily duties include creating user accounts for customers, partners, dealers and prospects. Created custom tabs for external URLs (Web Tabs) within Salesforce.com per user needs. Created custom objects, tabs, fields, related lists, custom views, etc. Created validation rules to ensure high quality data is being put into Salesforce. Created simple workflow rules that will send out an email to the appropriate or concerned manager when a relevant case is submitted into Salesforce. Monitoring mass emails and their templates. Familiar with audit trails and field history tracking tools. Experience in setting up roles and profiles. Experience in setting up and creating cases for selective dealers. Guided users to create new opportunities. Experience in implementing chatter (desktop and messenger) and communities functionality in Salesforce.com. Created custom views in cases to allow managers to see and track issues specific to their product line. Responsible for data migration. Maintaining Salesforce.com data quality and integrity. Coordinated and integrated third party applications. Helping users to export their contacts from outlook to Excel and import from Excel to Salesforce. Experience in deployment and rolling out updates to various departments. Effectively created the Picklists, dependent Picklists and junction objects to establish the connectivity among objects. Responsible for writing SOQL & SOSL queries with consideration to Governor Limits for data manipulation needs of the application using platform database objects. Worked effectively to ensure that the data is protected and is made available to the authorized users by customizing the user Roles, Role hierarchies, Profiles and Sharing settings. Trained users to customize their profile, chatter settings, update reminders, views, tabs, alerts, and reports. Monitored user adoption rates, user engagement percentage and responded as needed (additional training sessions, communication, etc.). Environment: Saleforce.com platform, Apex Language, Visual Force Pages, Custom Component, Custom Controllers, Workflow & Approvals, Custom Objects, Custom Tabs, Page Layouts, Email Services, Security Controls, HTML, Web Services, Reports, Sandbox. Client: Dex Media, Santa Monica, CA                                                                          Salesforce Administrator                                                                                               (Nov 2013 – Aug 2015) Dex Media is an advertising company, which helps many of the small and medium-sized business people in growing up their business levels. The company advertises its customers in industries, such as financial services, telecommunications, and healthcare, where reliable non-stop computing power is essential. The Dex Media keeps track of all their pre-sales and post sales operation in Salesforce with continuous integration. Responsibilities: Implemented the requirements on Salesforce.com platform and Force.com IDE Plug-in using Eclipse. Performed the role of Salesforce.com Developer in the organization. Agile Development Methodology was followed for the implementation. Worked closely with sales team and business analysts and performed detailed analysis of business and technical requirements. Designed the solution by customizing various standard objects of Salesforce.com (SFDC). Worked on various AppExchange products according to the needs of the organization. Worked on various Salesforce.com standard objects like Accounts, Contacts, Content, Reports and Workspaces. Designed, Implemented and deployed the Custom objects, Page layouts, Custom tabs, Custom Buttons, Custom Links and Components. Developed SOQL and SOSL queries to get data from different related objects. Created many Email Templates and Mail Merge Templates and was involved in doing the mail merge for different standard and custom objects. Created Custom Objects and defined lookup and master-detail relationships on the objects and created junction objects to establish connectivity among objects. Involved in creating a sync of contacts, email alerts, events and tasks between Salesforce to Outlook and Outlook to Salesforce successfully. Created various profiles and roles and configured the permissions based on the organizational hierarchy requirements. Used Chatter profiles for different users. Experience with Web services, API and Customer Portal sites. Created different Formula Fields for the various standard and custom objects. Created workflow rules and defined related tasks, time triggered tasks, email alerts, filed updates to implement business logic. Created many Approval Process needed in the different stages of the application. Environment: Windows 7, Force.com Platform, Salesforce Unlimited Edition, Salesforce.com Custom/Standard Objects, Custom Tabs, Page Layouts, SOQL/SOSL Queries, Workflow & Approvals, Reports, Crystal Reports, Force.com Eclipse Plug-in, Salesforce.com sandbox, MySQL, Data Loader, Email Services, Security Controls, java, WSDL, AJAX. Education: Bachelor in Computer Science from Gulbarga University, India Master’s in Business Administration from Gulbarga University, India  Status: I am a permanent resident of USA"}