{"text": "Name: mary mary E-Mail: mary.mary@gmail.com Address: Kuala Lumpur, Malaysia Github: https://github.com/mary LinkedIn: https://linkedin.com/mary Phone No. 527404962743 SPECIFIC EXPERTISE Over 7+ years of IT professional experience as Business Analysis in Banking and Healthcare domain Hands on experience gathering requirements, interviewing senior level company officials to gather requirements for documenting project functional specification. Strong knowledge & understanding of industry standard methodologies including Software Development Life Cycle (SDLC) and Iterative Software Development Life Cycle Process as per Rational Unified Process (RUP) and Agile Methodology. Expertise in gathering, analyzing, defining and documenting end user business requirements and system requirement specifications. Experience in administration, configuration, Implementation, and Support of Salesforce CRM, and Salesforce SFA applications based on Apex Language and leveraging Force.com Platform - world's first commercial Software as a Service (SAAS) application running in Cloud Computing Environment.  Experience in Salesforce.com SFA, Force.com Apex Classes, Apex triggers, Integration, Visualforce, Force.com API, SOQL, SOSL. Expertise with Administration and Configuration of Salesforce.com CRM to populate and maintain data.  Extensive experience in creating and documenting Business Requirements and System Functional Specifications including use cases.  Extensive experience in creating Wireframes / UI Design using MS Visio.  Successful in translating business requirements and user expectations into detailed specifications employing Unified Modeling Language (UML), drawing UML diagrams, Activity Diagrams, and State Diagrams using MS Visio.  Hands on experience in Administration setup like managing Users, Security Controls and Data Management on service cloud for HR team.  Generated custom Reports, Dashboards and analytical snapshot for management and various business unit personnel to provide detail information on key performance indicators (KPI). Conducted User Acceptance Testing (UAT). Experience in working with different modules of ALM/Quality Center such as Requirements, BPT, Test Plan, Test Lab and Defects. Proficient in using UML in behavioral, structural and architectural modeling – in creating Use Case, State, Activity, Class and Sequence diagrams. Experience in gathering user requirements, application development, testing and documentation using Rational Requisite Pro Experience in development methodologies like RUP, SDLC, AGILE and Waterfall Well-versed in project management tool (MS Project) for status reporting, planning and resource allocation. Experience in working with QA Testing Team, creating Test Plans, Test Cases and Test Scripts. Expertise in the management of System/User Request Change, and handle User Conflicts. TECHNICAL SKILLS CRM Tools: \t\t\tSalesforce CRM, Salesforce Administration, Siebel Salesforce Technologies: \tApex Class, Workflow, Validation, Approval Process, Trigger, Reports, Dashboards and Visual Force (Pages, Component & Controllers) Security Controls, Email Templates. Version Control Tools: \tClearCase, Visual Source Safe Requirements Gathering: \tHP Suite Project Management: \tMS project, MS Office Reporting tools: \tSFDC Report Builder, Microsoft Excel, MS Access and Report                                                                                                                                                                                            Service Languages/Tools: \t\tJAVA, Javascript, C, C++, Rational Requisite Pro, JIRA, MS Suite EXPERIENCE Bank of America, Charlotte, NC           \t\t\t\tNov 2014 to Present Salesforce Business Analyst Bank provides consumers and business clients with a wide range of products in Retail banking. As a BA, I worked on the Salesforce.com CRM platform which was implemented across all divisions and sub-divisions in order to manage their clients effectively and more efficiently.  Responsibilities: Interacted with various business team members to gather the requirements and documented the requirements.  Responsible for Salesforce implementations and training globally and looked after as Salesforce administrator and assistant developer.  Developed various Custom Objects, Tabs, Components and Visual Force Pages and Controllers.  Understood business goals and business context and translated them into technical specifications.  Worked on Salesforce.com platform Apttus and advanced Apttus configurations.  Experience with Salesforce data tools such as Data Loader and Eclipse Force.com IDE for data migration.  Experience integrating salesforce.com with other apps.  Techno-Functional experience with Salesforce Sales cloud and Marketing cloud as system administrator and guiding clients on CRM solution for sales, marketing and services teams.  Integrated the Web Services for extracting the data from external systems to display in the pages of Salesforce.com.  Involved in Salesforce.com application Setup activities and customized the apps to match the functional needs of the organization. Used Data Loader for insert, update and bulk import or export of data from Salesforce.com S Objects. Used it to read, extract, and load data from comma separated values (CSV) files.  Created page layouts, search layouts to organize fields, custom links, related lists, and other components on detail pages.  Used Apex Data Loader to migrate data such as accounts, campaigns from different legacy systems.  Implemented Standard and Custom Apex Controllers to handle business logic and used debug logs to trace the execution.  Created Custom Email Templates as part of sending alerts to users based on the business requirement.  Created Campaigns to send thousands of emails at a time using just an email alert workflow and a trigger.  Developed complex formulas to calculate response times and show flags reminding customer service reps to respond to customer queries in due time.  Used Enterprise WSDL and developed Inbound Custom Web Services to expose native logic to external clients.  Created Users, Roles, Public Groups and implemented role hierarchies, sharing rules and record level permissions to manage sharing access among different users.  Designed and deployed dynamic workflows, validation rules, Approval Processes and Auto-Response Rules for automating business logic. Developed Configurations in Salesforce for DocuSign E-Signature, a Digital Transaction Management System used to securely sign, send and manage the documents in the cloud.  Implemented Test Classes to cover positive and negative use cases for Classes and Triggers and achieved close to 100% coverage.  Performed IDE and Deployments across sandboxes and to Production Instance Premera BCBS, Mountlake, WA\t\t\t\tApr 2013 to October 2014 Business Analyst Premera is a health benefits company serving 1.6 million people, from individuals to Fortune 100 companies. They provide health, life, vision, dental, long-term care coverage, and other related services. The CRM based application is implemented on Siebel 8.1 to develop an enterprise wide customer service platform for Premera. eSAWS is built on .NET platform and focuses on non-CSR Premera customers. My role was to perform functional testing on both the applications, testing web services and verify the end to end integration. Responsibilities: Interacting with client to gather requirements and seeking clarifications. Creating System Requirements Specification with every possible detail to facilitate the developers in the code development. Review of Business Requirement Document to be able to validate the content of SRS.  Translating the requirements to developers and delegating work to them for analysis and code development.  Involved in Siebel implementation and maintenance of CRM functionality.  Create STM (Source to Target Mapping) documents for integration.  Create Functional and Technical documents for Siebel reports, workflows.  Create various roles, profiles and configured the permissions based on the organizational hierarchy requirements.  Use of modelling tools to depict various business processes and activities  Worked as a product owner /Business Analyst in an agile environment with monthly release and weekly sprints.  Managed the product backlog and worked closely with stakeholders to identify features for upcoming release.  Documented user stories and supported them with UML activity diagram and wire frame.  Used JIRA as a tool to manage product backlog and document user stories.  Worked closely with the developers and testers and conducted sprint planning meetings to review user stories.  Conducted weekly sprint review meeting with stakeholders to demo the features accomplished during the sprint.  Managed the application support product backlog using JIRA cards  Conducted Monthly Business Prioritization meetings with the stakeholders identify JIRA cards to be scheduled for the upcoming release.  Performed functional and GUI testing to ensure that the user acceptance criteria are met Co-coordinated the User Acceptance Testing (UAT) on a monthly basis with the SME's to make sure that all the requirements are addressed in the application  Analysis and testing the Acquisition process and FTP Process which are used to pull data from Business Objects.  Documented release notes for every release to provide an overview of features accomplished for that release. Medco Health Solution, Franklin Lakes, NJ \t\t\tJan 2011 – March 2013 Business Analyst Medco is a leading pharmacy benefit manager (PBM) with the nation's largest mail order pharmacy operations. Medco assists its customers to moderate the cost and enhance the quality of prescription drug benefits provided to members nationwide. This project was to modify the auto adjudication and processing of inpatient claims.  Responsibilities Analyzed business requirements and segregated them into high level and low level Use Cases, activity diagrams/Chart Diagrams using UML, defining the Data Process Models. Assisted the team as a liaison between the developers and project manager, and was instrumental in resolving conflicts between Testers and development teams. Development of standard documentation package (Requirements, Specification, Design, Operations, and Quality Testing Plans). Derived Business Requirements Document (BRD), Functional Requirement Specifications (FRS) based on User Requirement Specification URS. Understand and articulate business requirements from user interviews and then convert requirements into technical specifications. Created test strategies, test plans, wrote and executed positive and negative test cases using testing tools Involved in writing Test Cases based on the Functional Specifications, documenting them using Test Director as per HIPAA standards.   Involved in HIPPA various levels of testing like Integrity Testing, Requirement Testing, Balancing, Situation Testing, Code set testing and Business Scenario's specific testing over multiple releases. Converted various EDI files to different translation layouts and ran pre-edits for different clients. Analyzed the pre-edits against Client Profile and the input EDI files. Loops and segments were checked on the EDI files for the data sent for different fields Involved in writing business requirements, test plan, and defects in test director Involved in the HIPAA rules and regulations sessions Developed test cases based on business and functional requirement   Performed functional, Regression, System, Compatibility, User Acceptance Testing, for verifying application functionality.  Actively involved in walkthroughs and meetings with development team to discuss related issues. Developed SQL queries to conduct front end and backend testing Develop & Automate Data Validation Test Cases to test the application.  Enhanced Test cases in Test director as per the new functional requirements. Performed data driven tests with positive and negative data sets using flat file and data tables. All the issues that came up during this process were logged in Test Director as defects. Maintaining status reports and communicating with the Management on progress of work. MVP HealthCare, Schenectady, NY\t\t\t\tAug 2009– Dec 2010 Business Analyst  MVP HealthCare is a leading insurance organization that caters to the health insurance needs of the residents in NY. A FACET has been widely used across the network for the claim adjudication, claim processing and Provider Management. They provide health, life, vision, dental, long-term care coverage, and other related services. As a BA I also worked on a conversion project to upgrade their claims system FACETS which was required to accommodate EDI 5010 CMS compliance. Responsibilities:  Participated and organized requirement gathering sessions with the stakeholders to elicit and analyze requirements.  Assisted in preparing Scope Document by analyzing - various business domains interdependencies, end to end business processes of claims adjudication, various business domains scope statement, current business process flows and current system documentations. Developed solutions in compliance with the industry models / standards and implementation of Quality Management Systems & HIPPA regulation.  Involved in FACETS Implementation, FACETS billing, enrollment, and Claim Processing and Subscriber/Membership module.  Followed Workgroup for Facets Electronic Data Interchange standards for testing that need to comply with the HIPAA guidelines. Comprehensive understanding of specific provider type reimbursement methodologies. Including Dental, Anesthesia and DME Worked on Member Management, Eligibility, Claims and Billing modules within FACETS. Actively analyzed current business processes (Claims, Billing, Recipient eligibility and enrollment etc.) and worked with management to improve and implement enterprise solutions to ensure compliance Used Star Schema methodology in building the design of the logical data model into the Dimensional data modeling. Creation of  Gap/Impact Analysis and Operational Analysis  Document for Medicaid Subrogation Created and performed automated (SQL-based) report scrubbing to improve operational efficiency to define requirements and executing to delivery. Created and managed project templates, Use Case project templates, requirement types and trace-ability relationships in Requisite Pro. Produced various artifacts e.g. Functional Requirement Specifications (FRS) and Wireframes. As a point person responsible for resolving business rules/conflict resolution for the development team. As member of system architecture team designed and reviewed user interface. Developed Business case and assessed the ROI. EDUCATION Masters in Business Administration"}