{"text": "Name: anna anna E-Mail: anna.anna@gmail.com Address: Taizhou, China Github: https://github.com/anna LinkedIn: https://linkedin.com/anna Phone No. 6683391550 Profile: Over 8 years of solid SAP Sales and Distribution functional consulting experience. Two Full Life Cycle implementation experience including ECC 6.0 version and ASAP methodology: project preparation, business blueprint, realization, final preparation and go live & support. Exposure to gathering requirements from business users and doing Gap analysis to convert As Is to To Be system. Configuration, customization, production support and coordination aspects of SD Master Data, customer & material master data.  Extensive expertise in the Order-to-Cash cycle of Sales and Distribution module. Configuration of sales documents (Quotation, Inquiry, Orders, Credit Memo Requests, Debit Memo Requests, Contracts), deliveries and billing document. Configured item categories, schedule lines and maintained copying controls. Worked with special sales orders, complaints and Internet scenarios. Expertise in Logistics Execution (LE) functionalities like outbound delivery processing, picking, packing, goods issue, transportation, and ware house management and also worked on material listing & exclusions, transfer of requirements, availability checking and route determination.  Strong knowledge of Billing Procedures- invoices, credit memo, debit memo, rebates, individual & collective billing, and invoice split. Customization of Pricing in sales and distribution by defining Pricing Procedures and conditions types using condition technique. Created price, freight, rebate, discount condition types as per business requirements.  Expertise in Variant Configuration (VC), Bills of Materials (BOMs).  Well versed with Text and output determination, account determination, partner determination, order management, Credit Management. Strong knowledge in MM/Purchasing, Material Master, Vendor Master, Goods Receipt and Purchase Order. Extensive knowledge on special sales scenarios: Third party sales, inter-company invoicing, intra-company stock transport order, inter-company stock transport order, subcontracting, Scheduling Agreements.  Hands on cross module experience of SAP SD integration with MM, FI. Strong knowledge in SAP ABAP, EDI/IDOC, ABAP Query, LSMW. Effective team player with excellent work/time management skills and cross-functional awareness. Excellent leadership, communication and interpersonal skills. TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE: BJs Wholesale, MA\t\t\t\t\t\t\t\t\tApril 2018-till date SAP SD Consultant\t\t\t\t\t\t\t\t           \tSAP ECC 6.0 BJ’s Wholesale Club, Inc., is a leading operator of membership warehouse clubs in the Eastern United States.  RESPONSIBILITIES: Interacted with core team members to identify and understand business requirements, Process flow, and participated in development of business blueprinting for Sales and Distribution. Configuring Enterprise Structure, customer master data, article master data. Creating lead, prospect and account in SAP C4C and extracting those accounts as customer master in ECC.  Worked on inbound IDOC configuration for message type DEBMAS for importing customer master from SAP C4C to SAP ECC. Prepared functional specifications and monitoring batch jobs for sending article master data from ECC to BJs Order Management System and Warehouse Control System. Familiar and having knowledge on SAP Fiori for creating orders, delivery, invoice, following the OTC cycle for B2B sales in BJs. Worked on SAP Callidus Cloud for calculating commissions for BJs sales representatives by monitoring and importing their monthly sales data from SAP BW. Worked on SAP-CAR (Customer Activity Repository) for validating all the BJs Point of Sale transactions based upon different wholesale clubs. Configuring new order types such as Optical orders, B2B sales orders, and eComm orders. Item Categories, schedule line categories, delivery types, pricing and billing. Defined and assigned pricing procedure using condition types, condition records and condition tables.  Defined Output determination for delivery and shipping documents as well as for all Sales Orders and Billing Documents.  Prepared functional specifications and worked on various enhancements as per the business requirement and maintained Z – tables for enhancements. Worked on Standard EDI (850,855,856,816) functionality by writing Functional Specifications and worked closely with ABAP team. Worked on configuration of outbound interfaces from POSDW to other systems such as membership, enterprise data warehouse, etc. Worked on integrating applications using ALE Configuration and IDOC, including integrating with non-SAP applications such as Warehouse Management System. Configuring new order types such as Optical orders, B2B sales orders, eComm orders. Item Categories, schedule line categories, delivery types, pricing and billing. Created unit testing and integration testing scenarios for various sales and distribution business processes. Edgewell Personal Care, MO                                                   \t\t\t\t(Aug 2017 – April 2018) SAP SD consultant (Support)\t\t\t\t\t     \t\tSAP HANA release 2.0 Edgewell Personal Care is an American consumer product company which owns a number of brands like Schick, Wilkinson, Edge, etc. RESPONSIBILITIES: Working as SAP SD system analyst and experience in Design, configuration and End to End testing of Order to Cash cycle in SAP system in line with agreed timeframes, business requirements and global standards & providing production support.  Perform detailed requirements gathering/ documentation, conceptual design/prototyping, and functional testing in for new ABAP development tasks or modifying the existing one. Develop functional/technical design specifications to develop new or modify existing ABAP programs, reports, interfaces, enhancements & user exits. Worked on integrating applications using ALE Configuration and IDOC, including integrating with non-SAP applications, ALE / EDI interfaces, and extension of existing IDOC types.  Worked on configuration of ALE environment, developing outbound and inbound process, configuring partner profile with inbound process code. Modifications of current configuration in sap, addition of new configuration.  Configuring new order types such as sample orders, export orders, van sales orders, DSD orders. Item Categories, schedule line categories, delivery types, pricing and billing. Configuring new pricing procedures, Pricing Routines, and Pricing Formulas to meet the business requirements. Defining Transportation groups, Modes of Transportation, Shipping types and configured Route Determination. Worked on SD configuration like text determination, output determination, Availability Check, material determination and designing new functionalities as per business requirements. Working on SD business processes such as customer consignment, third party sales, stock transfer process, intercompany sales, foreign trade, & customer specific processes such as Logistic 940, EAC and C4C.  Supporting inbound & outbound interfaces such as Incoming sales orders by EDI/IDOC from customer, to EDI inbound (850,856) and outbound (850,855,810). Create/change/support custom transaction for delivery creation, sending shipping notification IDOC to TPM system, Getting inbound IDOC from TPS system for shipment creation. Supporting outbound interface to warehouse system through shipment for delivery picking, packing using handling unit. Inbound interface from warehouse system for shipment start & PGI of deliveries. Creating background job of customer invoice creation. Working on existing reports modification or issues. Working on Tickets and Change requests received through Service Now tool. Bridgestone, TN                                                                           \t\t\tFeb 2017 to Aug 2017 SAP SD/LE Consultant, (Full Life cycle)  \t\t                               \t\t SAP ECC 6.0 Bridgestone Corporation is a multinational auto and truck parts manufacturer and one of the largest manufacturers of tires in the world. RESPONSIBILITIES: Defined and assigned the enterprise structure for sales and distribution module as per the business requirements. Worked in Agile implementation and was Involved in 'AS IS' analysis, 'TO BE' model, Gap Analysis, interacted with users and process owners for business requirements gathering. Involved with the end-to-end Order to Cash (OTC) team, which included configuring new order types, item categories, delivery types, billing document types, sales agreements, pricing, output determination, text determination, credit control, etc. Configured various sales document types like standard orders, free of charge orders, credit memo requests, debit memo requests, return orders as per requirements. Created Pricing Procedures based on the client’s requirements using the condition technique through the creation of new condition tables, access sequence & condition types assigning them to customized pricing procedure. Pricing included material price, price list, customer specific prices, customer discount and material discount. Designed functional specification documents for complicated pricing routines to achieve the desired pricing requirements. Designed functional specifications for calculating delivery dates based on custom table. Configured Availability To Promise (ATP) and transfer of requirements. Created Partner functions and assigned them to the existing Partner determination procedure as per business requirements Configured Billing types including invoices, invoice lists, credit memos, debit memos and rebates. Worked on shipping relevant functions, creating deliveries, picking, packing and goods issue Configured Route determination based on shipping points and destination country, Transportation Group, departure zones  Worked closely with MM and FI functional consultants on SD integration aspects like Third-Party Order Processing, intra-company stock transport orders, inter-company stock transport orders and Revenue Account Determination and Credit management. Extensively interacted with ABAP programmers for preparing reports to meet Management Requirements and for developing enhancements/user exits by way of explaining the detailed requirements, giving specifications and other details of tables.  Worked on standard EDI (850,855,856,870) functionality by writing Functional Specifications and worked closely with ABAP team. Conducted workshops on training end users for SD Business processes and provided Post Go Live Support in the areas of Sales & Distribution. Topco, IL\t\t                                                                      \t\t\tJan 2016 to Jan 2017 SAP SD/LE Consultant, (Support)\t\t\t\t                      \t\tSAP ECC 6.0 Topco Associates LLC is the largest American retail food GPO (Group Purchasing Organization) and the third largest private company in Illinois. RESPONSIBILITIES: Involved in support for numerous production problems in SD and cross-functional applications. Defined and Assigned Sales Organization, Distribution Channel and Division and have set up Sales areas for customers. Configured new order types, Item Categories, schedule line categories, delivery types, pricing and billing. Worked on delivery blocks, Billing Blocks and on Special sales documents such as rush sale, returns, free of charge samples. Worked in various SD functionalities like text determination, output determination, Availability Check, material determination and designing new functionalities as per business requirements. Designed Copy Control Routines to facilitate copying necessary data from sales documents to delivery and billing. Involved in testing end-to-end Order to Cash cycle for various products. Involved in problem solving and configuration related to EDI inbound (850,856,867) and outbound (850,855,810). Configured new pricing procedures, Pricing Routines, and Pricing Formulas to meet the business requirements. Configured price relevant master data creating new pricing group for customers, new customer price list category and also defined pricing limits. Created Loading Groups, Shipping Conditions and configured Shipping Point Determination. Delivery document types, Delivery Item Categories, Shipping Point Determination, Route Determination, MRP and TOR, Availability Check.  Defined Transportation groups, Modes of Transportation, Shipping types and configured Route Determination. Strong experience in configuration of LES Shipping and Transportation. Worked with MM team to configure Third Party Order Processing, stock transport orders and setting up sales bill of materials (BOM) in material master. Designed a process for Credit Management, which helped in maintaining good system performance though the volume of sales orders is high. Prepared functional specification documents for mass processing of Idoc’s and their error handling procedures. Worked with ABAP programmers by writing functional specifications for user exits. Trained end users for SD Business processes and provided Post Go Live Support in the areas of Sales & Distribution and Logistics Execution Cemex USA Inc., TX                                               \t                \t\t\tFeb 2015 to Jan 2016     Sr. SD Functional Analyst, (Full Life cycle)\t\t                                \tSAP ECC 6.0 Cemex provides industry-leading products and solutions for customers around the world.     RESPONSIBILITIES: Translated AS-IS business process requirements into TO-BE SAP functional and   configuration blue prints to provide high-level estimates for design implementation efforts. Performed GAP analysis.  Set up Enterprise Structure and created customer master data, material master data and customer-material information record. Configured order types, delivery types, billing types, incompletion procedures,    copy controls and text controls. Configured Item Category determination, schedule line category determination, customer material information and text determination. Defined new Pricing Procedures with manual and automatic condition types, access sequence, condition tables and condition exclusions.  Worked on setting up Tax Determination with external tax package system, Vertex, by ensuring necessary data maintained in SAP and proper tax value returned. Configured Shipping point determination, route determination, batch determination, scheduling, delivery types, picking, packing and Transportation. Prepared functional specifications and worked on various enhancements as per the business requirement and maintained Z – tables for these enhancements. Designed settings for automatic credit control by defining customer risk categories and credit groups for blocking sales documents if credit limit is exceeded. Worked closely with Account Receivables (AR) department. Prepared functional specification documents for customized reports and interfaces. Worked on Partner Determination, material determination and output determination procedures. Performed the analysis of the legacy system and legacy master data files to build the conversion strategy. Created unit testing and integration testing scenarios for various sales and distribution business processes. Phoenix Motorcars, CA                                              \t               \t\t Jun 2014 to Feb 2015     Senior SAP-SD Consultant, (Support) \t\t\t                                \tSAP ECC 6.0 Phoenix Motorcars is a leader in developing light and medium duty electric vehicles for the service and government fleet markets.  RESPONSIBILITIES: Responsible for the creation of Variant Configuration Master Data including Classification, Dependencies, Material Masters, Bill of Materials, Routings and Pricing Tables and Conditions.  Worked closely with various business units and ERP team in identifying and solving VC related problems. Configured incompletion procedures, Copy Controls, availability check, delivery blocks and their status. Worked like third party order, Inter-company sales, cash sales, rush orders, returns (credit memo & debit memo), contracts, schedule agreements and consignments processes. Configured new Pricing Procedures, pricing routines and pricing formulas. Determination of the best discount among multiple Condition types using Condition exclusion groups. Configured output determination, partner determination, account determination and text determination. Managed configuration of complicated Inter-Company transactions (SD/MM/FI), including special multiple values for transfer pricing to allow for different reporting views.  Delivery Scheduling and transportation scheduling were configured. Output determination and control for sales order documents order acknowledgment, pick list, shipping note, bill of lading, pro forma invoice, invoice etc were also configured. Rebate Processing - Configuration and design of rebate processing and sales deals, pricing procedures, account assignment, accruals and payment and settlement procedures. Third party processing through the plant and the vendor were defined, account keys were assigned to G/L accounts and pricing procedure determination was defined.  Assisted the ABAP programmer with the testing of the programs, developing the implementation plans, and training. Kansai Nerolac Paints Limited, INDIA                                      \t\t\tMay 2011 to Jun 2014      SAP SD Functional Consultant, (AMS) \t\t                                          \t\tSAP ECC 6.0 Nerolac Paints, a leading paint company in India offers a wide range of paint colors & decorative wall painting solutions for homes & offices. RESPONSIBILITIES: Configured the enterprise structure with sales areas and plants. Configured account groups for customer master: field selection, assignment to partner functions, definition of new partner functions and partner determination.  Defined item categories, schedule line categories, order reasons and blocking reasons. Involved in designing various sales and distribution module functionalities like availability check, picking and packing, credit management, stock transport orders, output determination and billing.  Configured pricing procedures, material determination and text control. Worked with MM, FI and CO consultants in maintaining integration areas. Provided production support. Education Qualification Bachelor’s in Computer Engineering, Mumbai University"}