{"text": "Name: annie annie E-Mail: annie.annie@gmail.com Address: Nanchang, China Github: https://github.com/annie LinkedIn: https://linkedin.com/annie Phone No. 53376020470 Certified SAFe Scrum Master (SSM) with 7 +years of professional experience. Experience using Agile Methodology with the SCRUM and SAFe Framework using XP (Extreme Programming) techniques like Acceptance Test Driven Development (ATDD) and Test-Driven Development (TDD), Pairing and Refactoring.   Expertise in transitioning organizations from traditional Waterfall to Agile using the SAFe framework.  Focused on Continuous Integration, Continuous Deployment (CI/CD) and enabled Pair-Programming. Experience in spearheading Agile Games to get a better grip of key Agile principles for the team and customized various formats for retrospective meetings and analyzing the burndown.  Seasoned Entrepreneur with an expertise in client-vendor relationship. Experience with Business Process Mapping. Experience in leading cross functional teams across the globe in different time zones. Assisted the progress of Scrum ceremonies such as Sprint Planning, Daily Stand-ups, Sprint Review & Sprint Retrospective.  Experience in facilitating SAFe ceremonies. Experience in working as a servant leader with ART, scrum teams in conflict resolution. Empowering the teams by increasing Transparency, Inspection, Adoption, Focus, Courage and Respect. Experience in working with Portfolio, Program Management, RTE, Scrum masters, development team on designing and executing daily stand ups.  Participated in Scrum of Scrums and notified the RTE about roadblocks, correlated dependencies and aligned the project goals. Facilitated Team Breakout sessions in the Program Increment planning.  Manifested SAFe core values in the team and following the Agile manifesto. Used Agile best practices like – timeboxing, user stories, daily stand ups, frequent demos, test driven development, retrospective & continuous integration. Excellent track record of working directly with the customers and guiding customers to accomplish their vision using agile methodology. Team-player with the ability to work within a collaborative environment. Creative and efficient in proposing solutions to complex, time-critical problems. Collaborative in driving decisions. Strong analytical and problem-solving skills with a high attention to detail. Experience in conducting interviews and performance evaluations of the resources. Developed business requirements, write user stories and root cause analysis.  Excellent Mentoring skills, People skills, Leadership skills, Communication and Collaboration skills.  CERTIFICATIONS\t Certified SAFe Scrum Master TECHNICAL SKILLS Databases\t\t: \tOracle, MS SQL Server, MS Access Tools\t\t\t: \tMS Office, MS Visio, JIRA, Power Designer, Smart Draw  EDUCATION  Masters of Science – New Jersey Institute of Technology  PROFESSIONAL EXPERIENCE United Healthcare, Raleigh, NC\t                                                                 May 2019 - Till Date\t Project: COMPAS Role:  Scrum Master Environment: Agile, Rally, CA Agile Central United Health Group Inc. is an American for-profit managed health care company which offers health care products and insurance services. The healthcare unit has 4 divisions and the focus here was on Medicare and Retirement. The product in question here is COMPAS. It is an ensemble online application taking care of enrollment, fulfilment, letter writing, agents etc. COMPAS also communicates with various systems. Some of these are AVAYA and OPTUM. I have been involved as a Scrum master for 3 teams with the following projects, spanning one product: Avaya: With AVAYA, COMPAS receives a bulk of users registered during the Annual Enrollment period (AEP). COMPAS then sends an outbound file to AVAYA - which makes automated calls to those users. Upon validation, AVAYA sends a disposition file back to COMPAS and it is processed and stored there. OPTUM: With OPTUM, it is a multi-factor authentication (MF) project. COMPAS already had SiteMinder for authentication purposes, but decided to add a more secure authentication system through OPTUM. The Employer web and Provider web users register first and are then added to the Work Queue. Every time a login attempt is made through EWEB/PWEB, OPTUM takes over and validates with the information in its database and also provides yet another layer of authentication with an access code to be entered (sent to registered phone number/ email ID).  COMPAS-Portfolio: COMPAS in itself needed work in the form of upgrades. It was using Java 1.7 and we were upgrading it to 1.8. It was of pivotal importance that all the functionalities work fine with the upgrade and issues are resolved. As a consequence of the upgrade, fortify issues had to be fixed as well and MF would then be merged with Portfolio.  Responsibilities Responsible for holistic Agile transformation for teams new to Scrum and helped the adoption of Rally/CA Agile Central.   Coached teams to Agile concepts and principles.  Mentored and Coordinated with off-shore Agile teams for cadence.  Provided Knowledge Transfer (KT) sessions to team for Rally usage - such that they can be self-sufficient and self-organize to update tasks, state of their stories, defects on the board.  Facilitate daily stand-ups, backlog refinement, story sizing, sprint planning, review, and retrospectives. Brought in Agile best practices such as time-boxing, continuous integration, code/design reviews, transparency, accountability, tracking, product visioning, spiking, slack, generalized specialist, technical debt reduction, self-management empowerment and role training. Took on the role of a servant leader and helped remove impediments. Due to the lack of a defined Product Owner, wore two hats on some occasion - writing user stories and prioritizing them. As a consequence, was heavily involved with the Business user and the analyst to break down stories prior to grooming.  Some of the day-today tasks involved the timeboxed daily stand-ups, removing impediments for the team and building/assimilating enough content in the order of priority for the subsequent sprint(s). Taking small baby steps towards a SAFe setup; as the team was still very new to scrum. Leveraging a Scaled Agile platform was in the agenda and the scope warranted it.  Foster productivity, visibility, predictability, team empowerment, continuous improvement, success and happiness of the team to deliver quality software product and improve business value delivery. Foster team morale, sustainable velocity, quality and incremental value delivered. Imbibed the three pillars of scrum – Transparency, Inspection, Adaptation which uphold every implementation of empirical process control. Protecting the team from over committing and making sure the team does not commit under either. Leveraged the Kanban board during stand-up sessions by moving tasks, created swim lanes based on iteration, stories, expedite if necessary. Improved visibility across the team and stakeholders.  Monitor sprint progress and progress towards release plan using release burn-down/burn-up charts. Encourage open, honest and respectful communication within the team, develop a sense of commitment and accountability to each other, and keep the team focused. Bed Bath & Beyond, Union, NJ\t                                                                May 2017 – April 2019 Project: Return process automation (RLM) Role:  SAFe Scrum Master Environment: SAFe Agile, JIRA, GitHub, Jenkins, Google Suite, Store Lucid Chart Bed Bath & Beyond Inc. and subsidiaries is a retail chain which sells a wide assortment of merchandise home furnishings as well as food, giftware, health and beauty care items and infant/toddler merchandise. The Company owns over 1,000 stores. The project here is about building a Return Logistics Management (RLM) software. It involved automating the entire return process system; with modules such as scanning, return payment medium, fraud mitigation, reasons for return, vendor consultation for fit and finish, warehouse dispatching, amongst several others. I was involved as a SAFe Scrum master for this project employing the principles of the Scaled Agile Framework. Responsibilities Lead teams on the train to committing to PI objectives during PI Planning. Coached teams to SAFe Lean agile principles. Participate and prepare PO for System demos as well as PI system Demos. Provide insight of the team’s progress towards achieving PI objectives during ART syncs. Work with other scrum masters and RTE in identifying cross dependencies during Scrum of Scrums. Guided teams in fostering innovation with the lean start up cycle.  Encouraged team members to adapting to the continuous delivery pipeline and adapting feature toggles. Used XP (Extreme Programming) techniques like Test Driven Development (TDD), Pairing and Refactoring. Worked with RTE to preparing for system demos and PI system demos. Facilitate daily stand-ups, backlog refinement, story sizing, sprint planning, demo, and retrospectives. Resolve impediments and protect the team from distractions and changes during sprint execution. Empowered teams to self-organize and grow cross-functionality. Educated Product owner on keeping the product backlog in ready-ready state. Work with product owner to refine and prioritize product backlog, develop release plans, assist breaking of epics to create and add user stories in the backlog. Facilitate negotiations between product owner and development teams on priorities, dependencies and during story sizing. Protect team from over-commitment, manage backlog, prioritize resolution of defects/bugs for timely delivery. Support, educate and assist the team on adapting to scrum framework and techniques. Monitor sprint progress and progress towards release plan using release burn-down/burn-up charts. Publicizing the team's progress and successes to make sure they are highly visible to product owner / stakeholders. Encourage open, honest and respectful communication within the team, develop a sense of commitment and accountability to each other, and keep the team focused. Engage with management to assist in removing organizational and systemic impediments Coach the team to self-organize, collaborate, prioritize, self-manage, and to adapt to engineering practices such as pair programming, continuous integration, code reviews, continuous testing, etc. Serve and help teams to track and monitor status, enter task and time, dependencies, and blockers. Foster productivity, visibility, predictability, team empowerment, continuous improvement, success and happiness of the team to deliver quality software product and improve business value delivery. Foster team morale, sustainable velocity, quality and incremental value delivered. Represent teams in Scrum of Scrums to address dependencies and impediments, to share experience and knowledge. Jet.com, Hoboken, NJ, USA                        \t                           \tJun 2015 – April 2017 Project: Partner with Jet Role: Scrum Master Environment: Agile, JIRA, GitHub, Jenkins Jet is an American e-commerce retailer company headquartered in Hoboken, New Jersey. The company focuses on selling curated brands and city essentials, all in one place. The project here included creation of a platform (Partner with Jet), through which third party vendors could sell their products through Jet.com. This drastically improved the diversity of products available on the site and thus catering to a larger customer base. I was involved as a Scrum master for this project. . Took on the role of a servant leader and helped remove impediments. Facilitated scrum ceremonies which involves Sprint Planning, time-boxed 15 minutes Daily stand up, sprint review and sprint retrospective.   Conducted  the daily scrum meetings with on-site and offshore teams as well, to identify impediments and track progress. Imbibed the three pillars of scrum – Transparency, Inspection, Adaptation which uphold every implementation of empirical process control. Protecting the team from over committing and making sure the team doesn’t under commit. Designed program and team structure, formulated the playbook to be used as a transformation guideline by the teams and held sessions to make transformation champions aware of the approach. Brought in Agile best practices such as time-boxing, continuous integration, code/design reviews, transparency, accountability, tracking, product visioning, spiking, slack, generalized specialist, technical debt reduction, self-management empowerment and role training. Hands on Scrum Master for two teams for a period of time. Lead teams through Agile adoption. Was assigned to newly forming teams to be coached on agile principles and help them with smooth transition into Agile methodology Created Project roadmaps, identified deliverables, helped Product Owners in managing priority and delivery of the product. Conducted daily scrum meetings with offshore and on-site teams to identify impediments. Assisted Product owner in prioritizing the features. Provided training and coaching in Agile Development principles and practices to development teams, Product Owners and Scrum Masters. Tracked and managed project budget, resource allocation, funding availability and time reporting activities Managed scope and controlled change in order to ensure team makes progress without facing scope creep and other change related impediments Worked on facilitating communication, removing blockers and making sure the project runs smoothly Implemented agile principles, processes, and methods such as iterative and incremental development. Wipro Tech, Chennai, India\t                         \t\t\t\t               July 2012 – Dec 2014 Project: Self-checkout application  Role: Scrum Master Client: Spar Hypermarket Environment: Agile, Rational Team Concert, Confluence         Wipro Limited is an Indian multinational corporation that provides information technology, consulting and business process services. The project here involved developing a self-checkout application for one of the clients. This enabled customers cut the queue in-store by reducing the wait time and reducing the company’s overheads. I was involved as a scrum master for teams working on this project by facilitating sprint ceremonies amongst several other tasks.  Responsibilities Facilitate daily stand-ups, backlog refinement, story sizing, sprint planning, demo, and retrospectives. Resolve impediments and protect the team from distractions and changes during sprint execution Empowered teams to self-organize and grow cross-functionally. Educated Product owner on keeping the product backlog in ready-ready state. Work with product owner to refine and prioritize product backlog, develop release plans, assist breaking of epics to create and add user stories in the backlog. Facilitate negotiations between product owner and development teams on priorities, dependencies and during story sizing Coach business analysts in writing user stories and building a backlog of quality user stories. Protect team from over-commitment, manage backlog, prioritize resolution of defects/bugs for timely delivery Support, educate and assist the team on adapting to scrum framework and techniques Monitor sprint progress and progress towards release plan using release burn-down/burn-up charts. Publicizing the team's progress and successes to make sure they are highly visible to product owner / stakeholders. Encourage open, honest and respectful communication within the team, develop a sense of commitment and accountability to each other, and keep the team focused Engage with management to assist in removing organizational and systemic impediments Coach the team to self-organize, collaborate, prioritize, self-manage, and to adapt to engineering practices such as pair programming, continuous integration, code reviews, continuous testing, etc. Serve and help teams to track and monitor status, enter task and time, dependencies, and blockers. Foster productivity, visibility, predictability, team empowerment, continuous improvement, success and happiness of the team to deliver quality software product and improve business value delivery. Foster team morale, sustainable velocity, quality and incremental value delivered. Represent teams in Scrum of Scrums to address dependencies and impediments, to share experience and knowledge. Managing a team of cross functional teams in the change control configuration process using the scrum framework Tech Mahindra, Chennai, India                                                                             May 2011 – Jun 2012 Project: Car infotainment system Role: Business Analyst Client: Mahindra & Mahindra Ltd. Environment: RUP, SAP Power Designer, MS Visio, Smart Draw  Tech Mahindra Limited is an Indian multinational provider of information technology, networking                technology solutions and Business Process Outsourcing to various industry verticals and horizontals.  The project was for their Automotive parent company, which involved developing a software for their car infotainment system. I was involved as a functional Business Analyst primarily for reports. Responsibilities Getting high level requirements (BRDs) from PO, Stakeholders, reference groups, SME. Worked with the account managers, managements, and report requestors to gather requirements, get report requests. Designed and Developed Use Cases and analysis diagrams, activity diagrams, sequence diagrams, state diagrams, data models using MS Visio. Built ER diagrams using Smart Draw. Documenting low level functional requirements (FRDs) for the project in terms of features broken down to user stories.  Feedback from focus groups for requirements and improvements. Involved in GAP analysis between existing and new ERP models and change management.  Performed Smoke test and User acceptance test. Involved in creating business processes and modelling diagrams using Rational Unified Process (RUP).  Used MS Project to manage project time lines and prepared Need Analysis documents of the requirements gathered through JAD sessions. Documented all the changes in the initial templates and was responsible for Release Management. Helped in providing sales, margin and ROI analysis for proposed direct-to-consumer initiatives, and productivity of online destinations and merchandise positions."}