{"text": "Name: helen helen E-Mail: helen.helen@gmail.com Address: Huanggang, China Github: https://github.com/helen LinkedIn: https://linkedin.com/helen Phone No. 443263680694  Professional Summary: Software Development Engineer in Test with 8 years of experience in all phases of Software Testing Life Cycle (STLC). Developed Test Strategy, Test Cases, Test Plans and Automation Test scripts using Selenium and Java. Experienced in Automation and Manual testing while working in diversified domains such as Pharmaceutical, Healthcare, Life Insurance, E- commerce,Financialand Retail. Expertise in designing and developing strategic Test plans, Test Cases, and Test Reports for manual test. Preparing test cases for the system covering SRS document, design document, reviewing them with the developers and finalizing the test cases.  Extensive work experience on User Acceptance Testing, Functionality Testing, GUI Testing, Regression Testing, Integration Testing, System Testing, BlackBox Testing and End to End testing. Extensive experience in Manual Testing like Quality Center. Extensively experienced in Software Development Life Cycle (SDLC) working on client/server and distributed web-based systems. Expertise in Analysis and Review of Functional Requirements Documents and System Requirement Documents. Proven knowledge in working ATTD atmosphere.  Works well in an agile environment Proficient in all forms of testing including System, Regression, Smoke, Functional, Integration and User Acceptance Testing (UAT). Experienced on test methodology on Waterfall & Agile methodology. Expertise in Selenium automation using Selenium WebDriver, Selenium Grid, JAVA, JUnit & Maven Performed Mobile App Testing in both smart phones and tablets for Android like HTC, Nexus and Samsung using Robotium/Appium. Designed and implemented different automation frameworks from starch like Page Objects framework, Keyword Driven framework, Data Driven framework and Hybrid framework for a number of projects Expertise in writing Selenium WebDriver automation scripts in JAVA for highly transactional E-commerce websites. Executed automation scripts on different browsers/environments & reported defects/results to the team Proven ability in developing BDD scripts with Cucumber and writing step definitions for behavior.  Maintained the Selenium & JAVA automation code and resources in source controls like CVS, SVN over the time for improvements and new features Software Testing Life Cycle (STLC) experiences include Test Planning, Test Analysis, Test Design, Construction and Verification, Testing Cycles, Final Testing, Implementation and Post Implementation. Exposure in programming languages and scripts like Java, JavaScript, GIT. Experience in validating Regular and Ajax control using Selenium locators (XPath, CSS, id and name). Automated the infrastructure in AWS using web services and Performed configuration, deployment and support of cloud services including Amazon Web Services (AWS). Experienced in reading the test data from excel spreadsheet using API and TESTNG Data provider. Experience on testing web services (SOAP, REST) using SOAPUI Tools. Ran the scripts for multiple users using controller in Load runner for CCT GUI/APIregression/Load testing. Generated Test Scripts and validating the scripts using Synchronization point. Expertise in using Bug tracking Tools Mercury/HP Quality Center,Bit Bucket, Rational Clear Quest, Bugzilla, Rally and JIRA. Experience in Continuous integration tools like Maven, Jenkins and Tortoise SVN Subversion client to manage different versions of the source code.  Experience in Behavior Driven Development (BDD), Acceptance Test Driven Development (ATDD) using Cucumber, Gherkin. Wrote Features, Scenarios, Scenario Outlines, Step definitions for BDD in Cucumber. Experienced in making Data Driven, Keyword Driven, Hybrid and Page Object Model frameworks with Selenium to maintain test suite. Experience in configuring application framework by processing excels spreadsheets using Apache POI. Expertise in different types of testing like Automation testing, Manual testing, Integration testing, System testing, Smoke testing, Regression testing, JUnit Testing, Black box testing, Functional testing, Database testing, GUI testing, Web / UI and (UAT)User Acceptance Testing. Experienced with SQL and Oracle, to run the data integrity tests for backend testing and JDBC establish connectivity between the Java Programming language and a wide range of databases. Experience with UAT testing along with data setup, Environment setup and coordination between users, Development, Business Analyst and Product Management teams. Experience with build tools like Ant, Maven, GIT. Utilized Jenkins, Git, and Eclipse for deployment on test servers and to move towards CI/CD. Testing facets core application and UAT modules by following standard testing procedures Took ownership of automation and led the automation team by mentoring the team as required Excellent experience of build tools like Maven and managing JAVA automation projects using them. Experienced in using software Management Tools such as ALM/Quality Center. Experienced in developing and analyzing Test Plans, Test Strategy, Test Cases and Test Results using HP Quality Center/ALM. Expertise in bug tracking tools like HP ALM/Quality Center and for reporting modification requests. Experienced in using basic SQL Queries to retrieve Data from the Databases. Expertise on Automation Testing Tools like UFT/Quick Test Professional (QTP), Selenium. Expertise in the Functional and Regression testing of Web applications and its functionalities using UFT/QTP. Experienced in using Descriptive Programming for Key-word driven Testing using QTP/ UFT. Expertise in producing and maintaining project specific processes and work ethics.  UsedHPQCfordefectmanagementandreporting,alsofollowedupwiththedevelopmentteamtoverify bug fixes and update bug status. Performed functional testing by executing the QTP Scripts from Test Director. Used Python to launch QTP scripts from command line for continuous integration testing. Created unit and functional test cases through use of testing tools such as Python.  Responsible for creating Soap-UI project to test all web services exposed by all modules. Performed Manually GUI Testing, Functional Testing, Black Box Testing, UAT, and System, Transactions and Regression testing, Positive and Negative testing.  PerformedthebackendtestingbypreparingSQLscripts.Thedataonthefront-endapplicationwaschecked against the back-end database using SQL queries. Technical Skills Development Methodology: Agile, Scrum, Waterfall Programming Language: JAVA, C#, Ruby Automation Tools\t: Selenium IDE/Web Driver/Grid, Test Director,Cucumber, Quick Test pro IDE Tools\t: Blue-J, Eclipse, Net Beans,  Artifacts                      : Test Plan, Test Case, RTM, Test Summary Report, Bug Report Project Management tools: OpenProj Test Management       : HP Quality Center, JIRA, Bugzilla Databases \t: SQL Server Management Studio 2008/2012, MySQL, Oracle, Ms-                                           Access Packages\t\t: Microsoft Office Operating Systems\t: Windows, OS/X, UNIX/LINUX Utilities                 : Eclipse, GIT, SVN, IntelliJ Professional Experience DTCC, New Jersey, NJ\t\tMay 2017-Till Date Role: SDET Responsibilities: Analyzing requirements and developing detailed test plan, test scripts, and prepare necessary test data for test execution in Agile Environment. Effective use of logical functions in order to handle more than one scenario in test cases to handle application logic and device behavior.  Preparing the test data for new automation scripts and Making the enhancements in the existing data as per the requirements. Developed external custom functions using VBScript and using Descriptive Programming for QTP.  Performed Data driven testing using Selenium and TestNG, Bamboo CI functions which reads data from property and XML files. Uploading and executing the action based scripts from Quality Centre/ ALM. Worked with the team in enhancing the selenium framework to perform UI automation. Tracking, reviewing, analyzing and comparing the Defects by using Bit Bucket. Prepared both action based and component based scripts using QTP. Component based scripts were stored in Quality Centre. Executed the action based scripts from Quality Centre/ ALM. Parameterized the tests by entering different sets of data using QTP. Reported defects using QUALITY CENTER/ALM to the development team and followed up for the defects. Responsible for updating testing status and preparing testing requirement specifications Assigned the tasks of testing data set-up, testing environment, and reviewing test scripts on a periodic basis.  Developed Keyword Driven and Data Driven frameworks to retrieve test actions, test data from Excel files and SQL Databases. Configured Maven for JAVA automation projects and developed Maven project object model (POM). Developed, executed and maintained Selenium automation scripts for trading web application. Environment: Selenium Webdriver, QTP/UFT 12.52, Jenkins, ALM 12.21, Rally, Bit Bucket, Java, Agile Methodology, Windows 7/8, Oracle, MS Office. GSK, Philadelphia, PA\t\tJanuary2015 – May 2016  Role: SR.QA Automation/SDET Tester Responsibilities: Excellent experience of build tools like Maven and managing JAVA automation projects using them Collaborated closely with design development and project management teams to ensure testing protocols met. Communicated with clients and stakeholders to test for client requirements correctly. Implemented automation using Selenium WebDriver, JAVA, Selenium Grid, Cucumber, Maven. Extensively automated regression and functional test suites by developing test cases, test suites using Selenium WebDriver, JAVA, JUnit. Developed Keyword Driven and Data Driven frameworks to retrieve test actions, test data from Excel files and SQL Databases. Configured Maven for JAVA automation projects and developed Maven project object model (POM). Used Maven, Selenium Grid to execute Selenium automation suites on different platform, browser combinations in parallel.  Involved in converting manual test scenarios into automated scripts to run the same on UFT which involves validation of service calls from back end of the application. Used VB Scripting in UFT, Generate test result using UFT and analyzing actual result and expected result. Effective use of logical functions in order to handle more than one scenario in  test cases to handle application logic and device behavior.  Preparing the test data for new automation scripts and Making the enhancements in the existing data as per the requirements. Uploading and executing the action based scripts from Quality Centre/ ALM. Worked with the team in enhancing the selenium framework to perform UI automation. Tracking, reviewing, analyzing and comparing the Defects by using Bit Bucket. Analyzing requirements and developing detailed test plan, test scripts, and prepare necessary test data for test execution in Agile Environment. Developed test scripts on Expert View and enhanced those scripts using Functional Libraries from scratch and performed regression testing for every new release using QTP as an automation tool with VB scripting. Used Firebug and XPath for the web based application testing with selenium for the commands and locator application.  Enhanced the automation scripts in QTP/UFT by using actions and reusable actions. Developedautomation scripts usingSeleniumWebDriverandJava.UsedEclipseIDEtodevelop & debug the code. Environment: Selenium Webdriver, QTP/UFT 12.52, Jenkins, ALM 12.21, Rally, Bit Bucket , Visual Basic, Java, Agile Methodology, Windows 7/8, Oracle, MS Office. Centene, St.Louis,MO\t\t\t\tOctober 2012- December 2014 Role:  SDET/ SR QA Engineer Responsibilities: Gathered specifications and business requirements prior to application testing. Analyze requirements, design documents, PDF and develop detailed test plan, test cases, test scenarios, test scripts, and prepare necessary test data for test execution in Agile Environment. Automated System testing for trading transactions, exchange operations and payment methods using Selenium WebDriver, C#. Performed Parallel, Cross – Browser, multiple platforms Testing using Selenium Grid and TestNG. Ran the scripts for multiple users using controller in Load runner for CCT GUI/API regression/Load testing. Extensively used C#.Net for developing the user controls. Developed BDD tests using Cucumber by writing features and Developed Required Selenium support code in Java. Developed, executed and maintained Selenium automation scripts for trading web application. Used Jmeter to test the performance, load and functional of the application. Developed Hybrid automation framework in C# by using Page Objects framework, Keyword Driven & Data Driven frameworks. Automated running smoke tests and build report generator for daily builds. Used Selenium Grid, NUnit test scripts to run automated test cases in parallel on 5 environments. Browser (IE, Firefox, Chrome, Safari) where Platform (Windows 7,8/10Vista/XP/Mac OS). Customized test Result in QTP. Read Excel Data into Custom QTP Data Table using Custom Function. File System Object (FSO). Used for loop, Conditional if statement to handle application logic. Designed Functions Library, Functions Subroutine's common function, regular Expressions and Environment Variables using QTP in VB Scripts. Used Descriptive, Synchronization, Call function, Parameterization, Checkpoints, Error Handling, Recovery Scenarios, Regular Expressions to enhance test affectivity also created reusable actions by using QTP/UFT. Developed test scripts on Expert View and enhanced those scripts using Functional Libraries from scratch and performed regression testing for every new release using QTP as an automation tool with VB scripting. Maintained and updated the scripts for every release either by updating the object property value for a specific object or by adding new objects to Object Repository Prepared test data and test results (input / output files) for data driven method by using Global and Local spreadsheets in QTP for multiple testing. Tested JSON Web services for creating deleting modifying a big set of pools and Products, by writing pure white box test cases. Prepared both action based and component based scripts using QTP. Component based scripts were stored in Quality Centre. Executed the action based scripts from Quality Centre/ ALM. Parameterized the tests by entering different sets of data using QTP. Reported defects using QUALITY CENTER/ALM to the development team and followed up for the defects. Used Python to launch QTP scripts from command line for performing continuous integration testing. Responsible for estimating required components for SOA testing.  Handled the tasks of assisting senior SOA testers in developing test strategies and in gathering testing requirements Responsible for updating testing status and preparing testing requirement specifications Assigned the tasks of testing data set-up, testing environment, and reviewing test scripts on a periodic basis. Ran the scripts for multiple users using controller in Load runner for CCT GUI/API regression/Load testing. Designed the Manual and Goal oriented scenarios using LoadRunner Controller module Responsible for modifying and extending open source applications like Ruby Performed other essential job responsibilities under the guidance of senior SOA testers.  Experienced in Python scripts for performing Load tests on applications Automated the infrastructure in AWS using web services and Performed configuration, deployment and support of cloud services including Amazon Web Services (AWS). Involved in the Database Testing using SQL queries of the application like checking all the tables in the Database and checking whether the data is moving in the respective tables. Experienced in trouble-shooting various problems during design & development phase of automation scripts. Used Robotium/Appium tool to develop automation test scripts on Android platforms for native applications on mobile devices. Worked on Selenium GUI Object / element verification is done through XPath, CSS Locators.  Quality Center was used for tracking and bug reporting and documentation of the whole QA process. Coordinate with UAT, project management teams performed User Acceptance Testing (UAT) with the users.] Environment: QTP/UFT 12.02,Selenium Webdriver, SOA, LoadRunner, ALM 12.02, C#, TFS 2008/2010,Appium/Robotium,Oracle, Python, XML, HTML,Javascript,jmeter, Visual Basic, SQl, Agile Methodology,Windows 7/8, MS Office. Paccar, Seattle, WA\t\t\t\t\tDecemeber2011-September 2012 Role:  SDET/ SR QA Engineer Responsibilities: \t\t Responsible for reviewing and documenting various Quality assurance reports, preparing Test plans and creating the required test scripts. Performed Manual Testing of the application functionality to complete black box testing of the application. Used different test scenarios to validate the functionality for the application. Creating and generating system test scripts for different test scenarios covering all aspect of project functionality Developed test cases for Functional testing, GUI testing and Usability testing to ensuring the quality of the application. Used Jmeter to test the performance, load and functional of the application. Utilized Jenkins, Git, and Eclipse for deployment on test servers and to move towards CI/CD. Creating test cases for ETL mappings and design documents for production support Tested JSON Web services for creating deleting modifying a big set of pools and Products, by writing pure white box test cases. Extensively used C#.Net for developing the user controls. Extensive experience in ETL/ Data warehouse backend testing and BI Intelligence reports testing. Creating Manual test cases for application based on requirement documents like Functional Specifications, Business Requirement Document and Use cases. Ran the scripts for multiple users using controller in Load runner for CCT GUI/APIregression/Load testing.  Wrote Descriptive programming using QTP. CreatedExceptionhandlers(Recoveryscenarios)anduser-definedfunctionsInvolvedinRegressiontesting, Unit testing, System testing and User Acceptance Testing DataclassinteractswithMSSQLdatabaseandextractdata.BasedonthedataQTPscriptperformsspecific operations. Running various reports on bugs and defects generated during test execution daily.  Developedautomation scripts usingSeleniumWebDriverandJava.UsedEclipseIDEtodevelop & debug the code. Configured Selenium WebDriver, TestNG, Ant tool and created selenium automation scripts in java using JUnit prior to agile release. Involved in automating test cases using Selenium WebDriver with TestNG. Used Robotium/Appium tool to develop automation test scripts on Android platforms for native applications on mobile devices.  ResponsibleforcreatingandmaintainingautomationacceptancetestsuiteusingSelenium.Alsoresponsible for converting automation scripts to new framework using Selenium WebDriver, Java and Testing. Environment: Quick Test Professional 10.0, Selenium Webdriver, Quality Center9.0, HTML,TFS 2008/2010,ALM,JIRA, Python, Pearl, WindowsXP/Vista, Informatica power center,Load Runner,SQLServer,Web Services, Robotium/Appium ,Agile Methodology Global Logic, Hyderabad, India\t\tJune 2009- Nov 2011Role: Ecommerce TesterResponsibilities:     \t\t\t\t\t\t\t\t\t Involved in development of test cases from functional requirements, technical specifications and use cases. Executed Manual Test Cases by using positive and negative test scenarios. Prepared Traceability Matrix to show the test coverage requirement vs. Test scripts. Performed module testing, integration testing, system testing and Usability Testing per the technical specifications. Performed Regression testing at various phases of the project development. Performed Test Run manually and maintained logs in Test Lab of HP Quality Center. Used Test Director and Mercury Quality Center for updating the status of all the Test Cases & Test Scripts that are executed during testing process. Used Test Director and Mercury Quality Center for updating the status of all the Test Cases & Test Scripts that are executed during testing process. Took part in the team bug review meeting. Use of tracking systems to upgrade process and quality control procedures. Design and execute manual test scripting and cases. Responsible for logging the defects, keeping track of them and verifying the bugs are the fix. Bugs are reported using JIRA and ALM Involved in re-testing the test cases and closing the defect. Participated in peer review with team and developers to review test cases/test scripts. Prepared the test documentation using MS Word. Participated in Walk through of test plans and test cases. Took part in Test Closure Activities and in providing the Test Closure Document to the stakeholders. Environment: Manual Testing, Mercury Quality Center 10.0, HP ALM, Windows XP, UNIX,  Microsoft Tools (Word and Excel).  References: Will be provided upon request."}