{"text": "Name: martha martha E-Mail: martha.martha@gmail.com Address: Qiqihar, China Github: https://github.com/martha LinkedIn: https://linkedin.com/martha Phone No. 702784301890 Summary Innovative  IT  professional  oVering  5  years  experience   leveraging   sohware   test   engineering   and test methodologies to deliver highly eVective and creative quality solutions to business and technology challenges. Utilizes highly attuned analytical skills to develop IT and business strategies employing cutting- edge technologies to increase productivity. Consistently drives high standards of service through eVective team management, communication, and strategic planning to develop and manage strong client relationships. Highly organized with strong capacity to prioritize workload, delegate deliverable, and steer project completion within established  deadlines. Core Competencies Selenium ( Data Driven, Hybrid frame work, Testng) Test Case Management Java Point of Sale testing Regression Testing Boundary Testing User Acceptance Testing System Testing JIRA \n E-commerce- Endeca Training & Mentoring Database Testing Bugzilla HP Quality Center Test Strategy Preparation Test Plan Preparation Defect Management Unit Testing February, 2014 - September, 2015 \nWork History Test Analyst- As a Lead Cognizant Technology Solutions Client was an established and leading global index specialist providing investment solutions, serving asset owners and investors globally Objectives:- Revamp of the website to make more attractive and easy accessible to the customer. Now the users can easily commence idea for investment without  paying. Roles & Responsibilities:- Performed detailed analysis of business requirements and developed comprehensive plans defining and scoping project requirements. Test Plan, Test Strategy and Test case creation and  Execution. Coordinated with the offshore & Onshore team members & reviewing the test deliverable. Coordinated with the client to analyze the  defect Performed Status reporting. Performed Metrics Measurements. Performed Automation testing ( Selenium with Hybrid frame work) on regression suites Performed defect management Jun, 2013 - January, 2014 \n Test Analyst Cognizant Technology Solutions Client:-Worked in diVerent areas of Hospitality & Retail domain , such as USA  leading  Retail Departmental Store Website Objectives:- In Faceted Navigation of the eCommerce new Enhancements had been done and in these enhancements few existing functionalities and new functionalities have been   tested. Roles & Responsibilities:- Performed Requirement Analysis. Performed Test Plan, Test Strategy and Test case creation and Execution. Performed Test data creation. Coordination with the offshore team members & reviewing the test deliverable. Status reporting. Metrics Measurements. Test case & Defect Management using  QC. Performed  content management and UI view changes using  Endeca. . February, 2013 - May, 2013 \nTest Analyst Cognizant Technology Solutions Client:-Worked in different areas of Hospitality domain , such as Global Casual Dining Restaurant Chains (USA) Objectives:- The validations as part of the project included validation of the Brinker online ordering websites and mobiles apps for new launched  products. And need to check the end of Day(EOD) process after updating the EOD  process. Roles & Responsibilities:- Performed Requirement Analysis. Performed Test Plan, Test Strategy and Test case creation and Execution. Performed Test data creation. Coordination with the offshore team members & reviewing the test deliverable. Status reporting. Metrics Measurements. Performed Test Case & Defect tracking using Test Case Management  tool. October, 2012 - January, 2013 \n Software Tester Cognizant Technology solutions Client:-A chain of Bakery-cafe Fast Casual restaurants- Panera   Bread Objectives:- The validations as part of the project included validation that the online ordering is operating   correctly Roles & Responsibilities:- Performed detailed analysis of business requirements and developed  comprehensive  plans defining. Created Test case preparation, Test execution. Performed Defect Management using JIRA. Prepared Root Cause Analysis. January, 2012 - October, 2012 \nSoftware Test Engineer Cognizant Technology Solutions Client:-One of world’s top three QSR - Burger King  Corporation Objectives:- The validations as part of the project included validation of RODX after moving to SICOM POS from MICROS POS. Validations as part of this project included validation of the Menu Management   module. This involved validation of the menu items which were rolled out every week as part of the menu in the restaurants in US. Also involved validation of the reporting  module. The users used to use an Excel based tracker to track the daily activities and manage the workload. This is now being implemented using MS  Access."}