{"text": "Name: helen helen E-Mail: helen.helen@gmail.com Address: Kolkāta, India Github: https://github.com/helen LinkedIn: https://linkedin.com/helen Phone No. 413502343925 SUMMARY 8+ Years of experience in Administration/Development including analysis, modeling, design, coding, testing and implementation on various business domains like Financial, Insurance and manufacturing. Configured, Implemented, administrated and maintained the salesforce.com platform. Widespread experience in performing the administrative and development related tasks. Analyzed Sales, Marketing, Customer Service and Customer Support business processes used by salesforce.com customers and recommended ways to improve their processes using salesforce.com. Proficiency in SFDC Administrative tasks like creating Profiles, Roles, Users, Page   Layouts, Email Services, Approvals, Workflows, Reports, Dashboards, Tasks and Events. Good Experience in SOAP based Web services. Excellent work experience in designing of custom objects, custom fields, role based page layouts, custom Tabs, custom reports, report folders, report extractions to various formats, design of Visualforce Pages, Snapshots, Dashboards, Apex Classes, Controllers Hands on experience in Salesforce.com CRM integration, developing and deploying custom integration solutions. Excellent skills in creating/troubleshooting/modifying Apex code and visual force pages. Extensive experience in lead, case management, web-to-lead, Web-to case, Email-to-case. Good experience in working on Eclipse IDE with Force.com Plug-in for writing business logic in Apex programming language. Strong knowledge on Administration setup, Apex, Visual Force and experience with different SFDC development tools like Force.com Eclipse IDE and integration tools like Apex Data Loader. Developed and worked on different Salesforce.com environments such as sandbox and production environments.  Extensive experience using declarative features like validation rules, workflows,CTI, Approval processes, Escalation Rules, AppExchange sharing rules automation for satisfying complex business process automations. Experience in all phases of Software Development Life Cycle, quality management systems and Agile project life cycle processes. Pervasive Knowledge  in designing of custom objects, custom fields, Pick list, role based page layouts, Workflow Alerts and Actions, Validation Rules, Approval Processes, custom Tabs, custom reports, report folders, report extractions to various formats, design of Visual Force Pages, Record Types, Dashboards, and Email generation according to application requirements. Having Administration experience on CRM Applications  like Data Exports & Imports, Application Support, Security Administration, Maintenance, and User & Security Management. Experience in Sales cloud, Service cloud, Partner portal and Customer portal. Experience in developing client-specific solutions on force.com platform using Apex classes and Triggers, Visual Force, Force.com IDE, SOQL, SOSL Experience in web technologies like HTML, XML, JSP, JavaScript, SOAP Web services, and WSDL. Worked with team members for full-cycle projects, such as developers, to complete consulting projects on time, and deliver outstanding consulting services to salesforce.com clients. Ability to write quality, high performance code using the programming language(s). TECHNICAL SKILLS PROFESSIONAL EXPERIENCE United Health Group,  Baskin Ridge (NJ)\t\t\t\t\tDec’14 - Present Sr. Salesforce Developer / Lead Responsibilities: Developed Visual Force Pages, Visual Force Custom Controllers Components, Advanced Search Functionality, Custom Objects, Analytic Snapshots, Tabs, Tags and Components.  Designed, developed and deployed Apex Classes Extension Classes to support Visual Force pages development, Test Classes for Unit testing and Apex Triggers for various functional needs in the application. Involved in coding for modules for all the Sub-Application of the CRM application which involves extending existing SFDC standard components using Apex, Visual Force and other utilities.  Worked on various salesforce.com standard objects like Campaigns, Leads, Accounts, Contacts, Opportunity, Forecast, Cases, Reports and Dashboards. Implemented Angular Js and bootstrap in Visual force Pages. Developed Apps using Angular JS to create a cross platform web app to access Salesforce data using REST API. Implemented Web-to-lead to track and solve leads from the website. Created different Workflow rules and Approvals for various campaign processes. Designed, and developed the Custom objects, Validation rules, Page layouts, Custom tabs, Components, Visual force Pages to suit to the needs of the application. Designed, developed and deployed Apex Classes, Controller Classes and Apex Triggers, packages for various functional needs in the application. Working with AppExchange to use managed packaged apps for improving application features. Configured AppExchange apps to meet user preferences. Increase functionality by installing AppExchange apps to enable Customer Service Surveys.  Integrated SFDC with Oracle Apps via fusion Middleware using SOAP based Integration both Standard and Custom Objects. Collaborated CTI into CRM platform to allow the call centers to perform and analyze the records while resuming the call from the console. Incorporated TCA architecture in SFDC by creating various Custom Objects related to Account and Contact for SFDC-CDH Integration  Performed detailed analysis of business and technical requirements and developed the Apex classes using other Platform based technologies like Visual force, Force.com IDE. Developed and configured various Reports for different user profiles based on the need in the organization. Created email templates and inbound emails using Visual force for the clients and customers.  Maintained data cleanliness and accuracy by adding custom validation rules, custom formulas, reports and dashboards.  Extensively involved in Unit Testing using Test Methods using Force.Com utilities. Participated in the training sessions provided by the Salesforce team and support end users Environment: Saleforce.com platform, Quotes, Role Hierarchies, Sharing Rules, Email Templates, Reports, Dashboards, Custom Objects, Custom Tabs, Email Service,  Security Controls  Nabors, Houston, TX \t\t\t\t\t\t\tMar‘14 - Dec’14  Salesforce Developer / Administrator Responsibilities: Created Users, Roles, Public groups and implemented Role hierarchies, Sharing Rules and Record level permissions to manage sharing access among different users.  Used Force.com developer toolkit including Apex Classes, Apex Triggers and Visual force pages to develop custom business logic. Customized application to extend Salesforce functionality and wrote Apex Classes to provide functionality to the visual pages. Implemented/Implementing Security Settings and configured profiles and permission sets. Experience working in service cloud, supporting cases, developed workflows and triggers for Automated case resolutions. Involved in design and development of different views and page layouts for different profiles. Designed various WebPages in Visual Force for customers  to  select  a variety of services  offered  by  the  org  and    integrate  them  with  the   pricing team. Involved in UI and DB Design for Mobile application. Involved in all the phases and pre-production/production support activities. Involved in replication of Salesforce CRM data to SharePoint Involved in architectural discussions around real time synchronization of SharePoint Document libraries with Salesforce content Libraries Created and used Email templates in HTML and Visualforce. Used SOQL & SOSL for data manipulation needs of the application using platform database objects. Worked on the security level setting in the company for all the levels. Used force.com connects to interact Salesforce with lotus notes to insert contacts and add the emails and also integrate the chatter with sametime  (a feature for messaging within lotus notes) which is used within Sita.  Worked with various salesforce.com objects like Accounts, Contacts, Leads, Opportunities, Cases, Solutions, Knowledge, User specific Reports and Dashboards. Designed, and developed Apex Classes, Controller Classes, extensions and Apex Triggers for various functional needs in the application. Worked as enhancement developer and team member, performed the roles of Salesforce.com Developer and Administrator in the organization Responsible for setting up  web service  integrations Implemented Inside  sales  telephonic  plug-in   application  implementation Worked closely with sales team and business analysts and performed detailed analysis of business and user requirements, designed the solution by customizing various standard objects of SalesForce.com (SFDC) Environment:Saleforce.com platform, Apex, Visual Force , Data Loader, Workflow & Approvals, Reports, Custom Objects, Custom Tabs, SOQL, SOSL, Email Services, Sales cloud, Service cloud, Security Controls, Visualforce Controllers, Sandbox data loading, Data Loader, SQL  AT & T,  Plano, TX.\t\t\t\t\t\t\t\tJul‘13 - Feb ‘14  Salesforce Developer/Administrator Responsibilities: Performed the roles of Salesforce.com Admin and Developer in the organization. Created search layouts to organize fields, custom links, related lists, and other components on a record detail and edit pages. Interacted with various business team members to gather the requirements and documented the requirements. Designed and developed SFA based Application on Force.com Platform in Salesforce.com environment with Apex programming language at backend and Visual-Force pages as user interface. Created various Reports (summary reports, matrix reports, pie charts, dashboards and graphics) and Report Folders to assist managers to better utilize Sales force as a sales tool and configured various Reports and for different user profiles based on the need in the organization. Configured Sales Force Automation (SFA) for Campaign management, Opportunity Management, Account and Contact Management, Data Quality Management, Developed complex workflows and approval processes for automating business logic Used Force.com platform for developing feature rich and user friendly Visual force pages for enhancing Salesforce UI. Developed various Custom Objects, Tabs, Entity-Relationship data model, validation rules on the objects and tabs, Components and Custom links. Used Salesforce.com developer toolkit including Apex Classes, Controllers and Triggers, Visual force, Force.com IDE, Migration Tool, Web Services API. Configured federated login to ensure that single sign on in implemented across the company Enabled Salesforce connections between partner sales force orgs and the client’s org.  Created search layouts to organize fields, custom links, related lists, and other components on a record detail and edit pages. Used Salesforce Automation Process (SAP), Created workflow rules and defined related tasks, time triggered tasks, email alerts, field updates to implement business logic. Worked on Salesforce.com Application to Setup activities and customized the apps to match the functional needs of the organization. Environment:SalesForce.com CRM Application Platform, Apex Language, Visual Force, HTML, JavaScript, Custom Objects, Tabs, Workflows, Approval Processes, Email, Messaging, Dashboards, Reports, Eclipse, Sandbox, Production environment, SSO, Sfd2sfdc.  Apollo Health Care, Phoenix, AZ\t\t\t\t\t\tDec‘11 - May ‘13 Salesforce Developer / Analyst Responsibilities: Worked on various salesforce.com standard objects like Accounts, Contacts, Leads, Campaigns, Reports and Opportunities. Involved in Salesforce.com Application Setup activities and customized the applications to match the functional needs of the organization. Maintained release notes and release plan for every release. Effectively communicated with client, team in Knowledge Transfer sessions. Performed the role of Salesforce.com Developer in the organization. Implemented escalation rules, automatic case generation and their escalation to call center representative, and generated email alerts for quick issue resolution. Interacted with various business team members to gather and documented the requirements. Implemented the requirements on Salesforce.com platform and Force.com IDE Plug-in using Eclipse. Closely worked with SalesForce.com teammates while implementing the solutions for the requirements. Developed several Triggers, Apex classes and Visual force pages as part of the application development.  Worked on various salesforce.com standard objects like Accounts, Contacts, Leads, Campaigns, Reports and Opportunities. Customized the Dashboards to track usage for productivity and performance of business centers and their sales teams. Designed, Implemented and deployed the Custom objects, Page layouts, Custom tabs, Components to suit to the needs of the application. Created Custom Objects and defined lookup and master-detail relationships on the objects and created junction objects to establish many-to-many relationship among objects. Created various profiles and configured the permissions based on the organizational hierarchy requirements Customized tabs for different business users groups and business centers.  Created the workflows for automated lead routing, lead escalation, alerts and custom coaching plans. Experienced in the use of Data Loader and scheduling timely data backup operations using Apex scheduler. Implemented escalation rules, automatic case generation and their escalation to call center representative, and generated email alerts for quick issue resolution. Used Salesforce Chatter to provide real time notifications of changes in accounts, leads and opportunities to help sales and service teams to be more efficient. Performed the role of support engineer for the internal users and helped them in getting used to the application, generated reports and saved them for further access to the users. Integrated Salesforce CRM and the legacy system using Cast Iron Integration Systems. Customized the entire Salesforce.com applications to incorporate the business requirements which involved creating Web Forms and processing the data in SFDC with the extensive usage of Web services API. Installed and maintained AppExchange apps such as Experian QAS, Smart sheet and Zuora. Used the sandbox for testing and migrated the code to the deployment instance after testing. Involved with Salesforce.com Premier Support and handled the support cases with the help of salesforce.com support. Environment:  Saleforce.com platform, Apex, Visual Force , Data Loader, Workflow & Approvals, Reports, Custom Objects, Custom Tabs, Email Services, Security Controls, Sandbox data loading, Data Loader, SF Explorer and Eclipse IDE Plug-in, AppExchange apps, Flows, SOAP and REST API  Symmetric Solutions,  Hyderabad, India\t\t\t\t\tAug’08 - Sep’11  Software Engineer Responsibilities: Involved in analysis and design phases of Software Development Life Cycle (SDLC/Waterfall).  Developed the application using Eclipse as the IDE and used standard features for editing, debugging, compiling, formatting, build automation and version control (CVS).  Involved in Object Oriented Analysis and design using UML and create activity diagrams, sequence diagrams, class diagrams and use case diagrams for various use cases using Rational Rose. Implemented the controller using J2EE (Servlets). Development UI modules using HTML, JSP, JavaScript and CSS.  Involved in the integration of spring for implementing Dependency Injection (DI/IOC).  Primarily focused on the spring components such as Dispatcher Servlets, Controllers, Model and View Objects, View Resolver.  Used different types of controllers like simple form Controller, Abstract Controller and Controller interface etc.  Used Different types of View resolvers like Internal View Resource resolver, Resource Bundle View resolver and XML view resolver.   Integrated Tiles Framework with Struts Framework Used JavaScript for client-side validations, and AJAX to create interactive front-end GUI.  Involved in coding for presentation layer using JSF framework, JSPs, Java Script, XML/XSLT. Developed and deployed EJB components (business tier) into the Websphere Application Server (WAS). Used JDBC to access Oracle database and implemented connection pooling. Written stored procedures to add, update and delete data from Oracle Database Implemented struts validation framework for serve side validation. I was part of the design team to finalize the design/ architecture of the project and developed core modules. Experience in application design and development with a comprehensive knowledge of Java and J2EE.  Involved in testing the application during the system and integration test phases. Perform system requirements analysis, definition, allocation, and documentation. Environment: Java 4, JSP 2.0, Servlets 2.0, Apache HTTP Server"}