{"text": "Name: florence florence E-Mail: florence.florence@gmail.com Address: Madrid, Spain Github: https://github.com/florence LinkedIn: https://linkedin.com/florence Phone No. 552430574423 SUMMARY Over 7 years of experience in Quality Assurance and Software Testing in Finance and Sales force CRM/SFDC.  Excellent skills in writing Test Plans and Test Cases.  Performed planning and development of Test Plans, Design Test Cases and Test Scenario to meet product’s business requirements. Extensive experience in testing Client/Server and Web-based Applications.  Proficient knowledge in various types of Software Testing such as Integrated testing, System Testing, Black box testing, Positive Testing, Negative testing, Performance Testing, Stress Testing, Load Testing, Volume Testing, Data Driven Testing, Back end Testing and Regression Testing Expertise in project Managementtools such as Test Director and Quality Center, Microsoft Test Manager, Jira.  Good Knowledge in Java Programming and Data Structure. Strong knowledge & experience working in teams implementing Agile Methodologies.  Knowledge of Encompass testing which involved one-to-one marketing and business intelligence to capture attention, close more loans, and improve client management. Worked closely with the project manager to estimate best/worst case scenarios, track progress with weekly estimates of remaining work to do, conducting informal meetings ad hoc and as needed. TOOLS: Testing Tools:\tUFT, QTP, SOAP UI, Selenium Web Driver Project Management Tools:ALM, Quality Center,JIRA, Basecamp, Bugzilla Operating Systems:\t\tUNIX, Windows  Others:\t\t            MS Office Suite- Word, Excel, MS Visio, Postman,DocuSign Languages:\t\tJava, SQL, HTML & XML Professional Experience: Capital One, McLean, VA November 2016 to Aug2018 SFDC Tester The project involved implementing Salesforce CRM and integrating it with existing Salesforce projects (Salesforce cloud).  I also configured and supported Salesforce.com CRM system for the Franchise Development Division that improved leads capture rate, management and conversion. Responsibilities: Reviewed Business requirements, IT Design documents and prepared Test Plans for all assigned project releases. Involved in creating Test Plans for the different aspects of the project according to the business specifications in coordination with the QA lead and project manager.  Involved on testing the new functionalities based on test cases and coordinated with developmentteam in fixing the issues. Extensive hands on testing experience of web application implemented using Angular 2.0, Node JS framework. Performed Negative testing to find how the functions and variables perform when they encounters invalid and unexpected values.  Managed the Salesforce.com CRM application. Extensively worked on Excel, Word and MS Project Involved in Encompass (Stand alone application) testing which provides one system of record for closing high quality loans. It is a one-to-one marketing and business intelligence system to capture attention, close more loans, and improve client management. Developed Scripts to work on Cross Browsers (IE11, Chrome and Firefox) Created Apache Maven archetype so that the framework can be used in different projects to avoid creating frame work from the scratch. Tested and test scripts for design and deployment the Custom objects, Custom tabs, validation rules, Workflow Rules, Auto-Response Rules, Page layouts, Components, Visual Force Pages to suit to the needs of the application. Knowledge in Salesforce.com SFA, Force.com, Apex Classes, Apex triggers, SFDC Integration, Visual force, Force.com API, SOQL, and SOSL. Tested various SalesForce application standard objects like Accounts, Contacts, Cases, Leads, Campaigns, Reports and Dashboards. Involved in data mapping and migration of data legacy systems to SalesForce.com objects and fields.  Automated functional and regression manual test cases in Selenium using Java Scripts. Tracked bugs and prepared the bug reports using the HP ALM Defect Management Tool and also interacted with the developer team to discuss technical issues.  Conducted database testing. Involved in Collateral Management System (CMS) application testing which allows accessing the data stored in your collateral valuation documents to automate compliance and risk checks appraisal data validation, and to monitor the performance of operations. Involved in creating test cases for Regression Testing and assist test lead during the testing activities. Analyze the requirement coverage and traceability to ensure the testing coverage Knowledge of Mortgage Industry Standards Maintenance Organization (MISMO) whichfollows an approach to the development and maintenance of a comprehensive set of standards and data points for all stages of the mortgage loan life cycle.  Involved in the User Acceptance testing (UAT) to check the reliability for end user.  Environment: Windows, UI, Visual Source Safe,Selenium, HTML 5, CSS 3, Angular 2.0, Node JS, Web API, Salesforce.com (SFDC), Sales force CRM ,HP ALM, Collateral Management Systems,JIRA.  Bank of the West, San Francisco, CA\t February 2014 to October 2016 Automation Tester The project involved implementing Salesforce.com CRM and integrating it with existing investment projects catering to mutual funds.  I also supported testing effort for Salesforce.com (SFDC) CRM system for the Franchise Development Division that improved leads capture rate, management, and conversion.\n Responsibilities: Worked extensively on CRM using Sales force for creating a cloud ready application that was tailored for the client’s needs. Involved with preparation and execution of test cases and scripts. Involved with Functional, Regression and Integration Testing. Assisted the team lead in preparation of test plan. Involved in reviewing functional requirement documents and the technical specification. Worked on Apex Classes, Apex triggers. Performed Functional testing of the system using both manual testing and automation tool Selenium. Performed Regression testing, Integration testing, and system testing manually.  Involved in performing Negative and Positive testing by executing various test scripts. Involved with Functional, Regression and Integration Testing. Assisted the team lead in preparation of test plan. Prepared SIT exit report for UAT preparation Prepared test Cases, analyzing bugs, interaction with team members in fixing errors for User Acceptance Testing (UAT) Validated data for existing clients using SQL queries.  Extensively used the HP ALM tool for all the test management activities like Release Planning, Test Planning, Test case Execution, Requirement Traceability and Reporting. Experience in performing end-to-end User Acceptance Testing (UAT). Conducted Data testing and collaborated with Data Analyst for data mining and defining data. Actively participated in the team involving test plan analysis, go/no-go decisions based on test scripts results.  Effectively coordinated with the development team for closing a defect. Prepared Test Scenarios by creating Mock data based on the different test cases. Perform defect Tracking and reporting with strong emphasis on root-cause analysis to determine where and why defects are being introduced in the development process. Involved in testing data reports in Informatica. Written several SQL queries for validating the front-end data with backend. Written several complex SQL queries for database testing, data validating. Validating the data passed to downstream systems. Created, updated, check and delete data using SQL queries.  Hands on with extensive SQL queries and populate tables according to the functional and specifications. Written SQL statements to retrieve the data from one or multiple tables using Oracle. Interacted with developers to resolve technical issues and investigated software for faults. Performed regression testing for fixes using UFT and closed the defects in HP ALM. Involved in the end-to-end test and responsible for the Quality Assurance of this application to\ncomplete in record time. Analyzed the results of load test by using static and drill-down graphs Worked with ALM for defect tracking and defect management Used ALM to log and address defects issues and also for change management Tested the product in various platforms, UNIX, and Windows. Environment:  Agile, HP ALM, HP UFT, Salesforce CRM, SFDC Sandy Spring Bank, Olney, MD\t\t\t\t\t\t\t August 2011 toDec 2013 Automation QA tester I was involved in the project which integrated Salesforce CRM with web-based application OTS (Online Transaction System). This application was developed for online transactions like accessing personal accounts, checking balances, loan rates, payment of bills, transfer of funds between its customers and between its bank and other institutions. Responsibilities: Developed and Documented Test strategy, scenarios and Test cases, test plan in accordance with the Business Requirements Documents.   Strongly participated in manual and automated testing. Involved in developing Test Plan, Test Strategy, Test Cases, and executed them in test lab Quality Center and excel sheets. Involved as part of automation team using QTP, and execute test scripts. Developed and Maintained Test Matrix on various dimensions like test status to reflect the test progress Tested critical bug fixes including critical fixes and coordinated with developers in release of bug fixes meeting tight timeline. Involved in Release support - Release to QA, involved in environment setup, testing the release process. Analyzed user requirements and prepared test approach document. Performed Back End Testing by executing SQL queries on Window and UNIX platform. Performed Regression Testing, Functional, UAT and Ad-hoc testing.    Involved in preparing the Automation Design document, identifying the test cases to be automated for Regression Testing. Participated in weekly team meeting to assign testing tasks and acquisition of status reports from individual team members. Conducted Bug review meeting to discuss resolution of issues Performed rigorous manual testing such smoke testing, Integration testing, Regression Testing, End to End Worked on Apex Classes, Apex triggers, SFDC Integration, Visual force, Force.com API, SOQL, and SOSL. Participated in the agile development methodology, iteration and agile release process. Worked with Quality Center for defect tracking and defect management Used Quality Center to log and address defects issues and also for change management Tested New Features and their impact on existing functionality before each release. Performed Cross browser, Smoke and Security testing for the web-based projects. Performed Regression testing on Production environment before Mobile website is redirected. Participated in Walk through, Requirement review and Defect report meetings periodically. Involved in the User Acceptance testing (UAT) to check the reliability for end user.  Environment:Agile, SFDC, Quality Center,QTP, Share point server  Education – Bachelor’s"}