{"text": "Name: alice alice E-Mail: alice.alice@gmail.com Address: Kinshasa, Congo (Kinshasa) Github: https://github.com/alice LinkedIn: https://linkedin.com/alice Phone No. 976207017059 \t\t Professional Summary: Around 6+ years of IT experience with 4+ years of experience in Salesforce.com CRM platform as an Administrator and Developer and 2 years of experience in JAVA technologies. Experience in creating custom objects and integrating existing desktop and web apps. In-depth understanding of CRM business processes like Forecasting, Campaign Management, Lead Management, Account Management, Case Management and merging management. Salesforce certified Force.com Developer. Good knowledge on Case Assignment and Case escalation rules.  Extensive experience in using Roles, Profiles, Email Services, Page Layouts, Workflow Alerts and Approval Process in Salesforce.com. Experience with lightning components. Good Understanding of salesforce.com, Sales Cloud, Service Cloud, AppExchange, Chatter and Salesforce Communities. Extensive experience on integration related to force.com and other Salesforce platform technologies (Security Integration, User Interface Integration, Business Logic Integration, and Data Integration Created Queues, Public Groups and Email Templates. Good experience in SFDC related technologies such as Apex, Visual force, Apex triggers. Configured and maintain User profiles, role hierarchy, sharing rules, Security and Password policies.  Experience in developing Client-specific solutions on force.com platform using Apex Classes and Triggers, Web service API, Force.com IDE, Validation rules, SOQL and SOSL. Working knowledge in generating Reports, Dashboards, customized reports and analysing the data in Salesforce. Acquainted and well versed with CRM processes like Sales, Marketing, Customer Service and Customer Support and recommended solutions to improve their processes using SFDC. Extensive experience in implementation of Salesforce Chatter.  Good experience on creating Object/Tab/Field, Formula, Record Types, Activity Management, Queues, Groups. Expertise in developing, deploying and integrating Salesforce.com CRM.  Experience in using different tools - Apex Data Loader, Import Wizard, SFDC Data Export etc. Extensively worked on Salesforce.com sandbox and production environments including creating Sandboxes and refreshing it time to time.  Experience in Database Design, functions, triggers, DDL, DML SQL queries. Excellent analytical, Interpersonal and Communication skills, fast learner, hardworking and good team player. Capable of rapidly learning new technologies and successfully applying them to projects and operations. Technical Skills Education Bachelor’s Degree in Information Technology (Jawaharlal Nehru Technological University), INDIA. Professional Experience Tunstall, Pawtucket, RI\t\t\t\t\t      Dec 2015 to Present Salesforce Administrator/ Developer\t \t  Responsibilities: Responsible for gathering the requirements by coordinating with the business analysts, developers and project managers, in order to better customize, and utilize the full functionality of the Salesforce.com CRM solution. Worked with standard Salesforce.com objects like Accounts, Contacts, Leads, Cases and Opportunities. Designed, developed and deployed the Custom objects, Page layouts, Custom tabs, Components. Developed interactive Visual Force Pages to save time for users. Converted Validation rules to triggers so as to provision Permission Sets. Developed lightning components to be implented within the community. Proactively created Apex Triggers and Apex classes and also developed and managed complex workflows, approvals, validation rules, assignment rules and system triggers. Defined the lookup relationship and master-detail relationship on the objects that helps in associating the records and defining a parent-child relationship in which the master object controls certain behaviors of the detail object respectively. Effectively created the Pick lists, dependent Pick lists and junction objects to establish the connectivity among objects.  Involved in customizations of the legacy system and also the migrated data to newly implemented cloud based CRM solution.  Experience working in service cloud, supporting cases, developed workflows and triggers for automated case resolutions.  Experience with lightning components Responsible for writing SOQL & SOSL queries with consideration to Governor Limits for data manipulation needs of the application using platform database objects. Worked effectively to ensure that the data is protected and is made available to the authorized users by customizing the user Roles, Profiles and Sharing settings. Migrated entire data from legacy system to newly implemented cloud based CRM Used the sandbox for testing and migrated the code to the deployment instance after testing. Involved in the data validation /Integrations of the source system with Salesforce.com. Developed different Visual Force Pages to suit to the needs of the application using different Visual force components. Used Force.com Eclipse IDE plug-in to manage, author, debug and deploy Force.com applications in the Eclipse development environment. Created custom buttons and links on Account and Relationship Group object for generating auto Reports. Worked in Sales cloud integration project. Environment: Saleforce.com platform, Visual Force (Pages, Component & Controllers), Visual Work flows, Apex Language, Data Loader, HTML, Workflow & Approvals, Reports, Custom Objects, Custom Tabs, Sandbox data loading, Eclipse IDE Plug-in.Salesforce1. AT&T, Middle Town, NJ\t                                                                                         Sep 2014 to Nov 2015 Salesforce.com Administrator/ Developer Responsibilities: Participated in analyzing the Requirements, preparing the Design documents based on the specifications and Developing and Maintaining the application. Worked on various standard objects including Accounts, Contacts, Leads, Campaigns and Cases. Designed, Implemented and deployed the Custom objects, Page layouts, Custom tabs, Components to suit to the needs of the application. Developed and deployed Apex Classes, Controllers, Extensions and Apex Triggers for various functional needs in the application using Eclipse IDE. Developed VisualForce Pages to show customized content for certain things according to client need. Defined Lookups and Master-Detail relationships on the objects. And also created junction objects to establish many-to-many relationships among objects.  Worked on Sales cloud and Service cloud. Created Workflow rules and defined related tasks, time-triggered tasks, email alerts and field updates to implement business logic. Used SOQL and SOSL with consideration to Governor Limits for data manipulation needs of the application using platform database objects. Actively participated in gathering the requirement documents, analyzing, designing and development using Sales Force.com.  Involved in the deletion on duplicate records utilizing Cloud Services Used Data Loader for insert, update, and bulk import or export of data from Salesforce.com Objects and it to read, extract, and load data from comma separated value files. Used the Sandbox for Development and Testing and Migrated the code to the deployment instance after testing. Used GitHub for Version Control, Jenkins to deploy Apex code. Involved in all phases of testing. Environment: SalesForce.com Platform, Apex, VisualForce (Pages, Component & Controllers), Pages, Data Loader, HTML, Java Script, CSS, Workflow & Approvals, Reports, Eclipse, GitHub, SharePoint, Jenkins, HP ALM, Service Now, BME.   Williams Sonoma, San Francisco CA\t\t\t                                               Jan 2014 to Aug 2014 Salesforce.com Developer/Administrator\t Responsibilities: Involved and interacted with various business user groups for gathering the requirements for CRM implementation. Administered, configured, and maintained Salesforce.com application user profiles, roles, assigning permission, generating security tokens, validation Rule, upgrade installation. Designed, developed and deployed the Custom objects, Components, VisualForce Pages to suit to the needs of the application. Developed APEX Classes and APEX Triggers for various functional needs in the application. Analysed and evaluated complex business requirements and recommended solutions. Developed and deployed workflows and approval processes for opportunities and products/ assets management.  Involved in Design, development, planning, testing and integration of Salesforce cloud services, data and accounts and integration between Mulesoft and Birchstreet for 1 way SSL  Worked with objects like Accounts, Contacts, Leads, Campaigns, Cases, Opportunity, Reports, and Dashboards Developed Custom Objects, Custom Reports and configured the Analytic Snapshots to dump the data on regular basis for the sales performance and lead generation statistics. Used the sandbox for testing and migrated the code to the Production environment after testing. Proficient in using Eclipse based Salesforce.com IDE to develop and deploy force.com software. Created workflow rules and defined related tasks, email alerts, and field updates Wrote Custom Formula fields and Validation rules Involved in Data mapping specifications to create and execute detailed system test plans. The data mapping specifies what data will be extracted from an internal data warehouse, transformed and sent to salesforce.com entity. Created and used Email templates in HTML and VisualForce. Integrated the web services by generating the necessary stubs from the WSDL files for extracting the data from the home grown applications by using the home grown web services.  Interacted with the Salesforce.com premium tech support team on a regular basis. Environment: Saleforce.com platform, Apex Language, VisualForce (Pages, Component & Controllers), Pages, Data Loader, S-Controls, HTML, Java Script, Apex Triggers, Web Services, Reports, Custom Objects, Custom Tabs, Email Services, Security Controls, Sandbox data loading, Eclipse IDE Plug-in. FRY INC, Ann Arbor MI\t\t\t\t                                                              Oct 2012 to Dec 2013 Salesforce.com Administrator/ Developer\t Responsibilities: Created user Roles and Profiles, security controls and shared settings. Developed Custom Objects, Custom reports and configured Analytical Snapshots to dump the data into on a regular basis for sales performance and lead generation statics.  Worked on various SFDC standard objects like Accounts,Contacts, Leads, Reports and Dashboards. Implemented field level security, profiles and audit trail setup. Used eclipse Force.com toolkit for creating Apex Classes and Apex Triggers to develop custom logic and objects. Migrated leads, accounts and contacts to the Sales Cloud with help Jitterbit.  Created the workflows for automated lead routing, leadescalation, alerts and customcoachingplans. Provided the training to the internal business users to use the application and develop their own custom reports.  Customized the Dashboards to the track usage for productivity and performance of business centers and their sales teams. Delivered project reports using conation of custom objects and standard objects. Used Data Loader for Data Management in force.com platform. Assisted in guiding the customers on Service Cloud implementation.  Perform administration tasks as needed, managing custom fields, integration and data clean up.  Designed, developed and deployed the Custom objects, Components, VisualForce Pages to suit to the needs of the application. Environment: SFDC, Force.com, Controllers, Sharing Rules, Windows server 2003, Web services, Triggers, Controllers, Workflows, Email Updates. \t\t\t\t\t Mind tree, Hyderabad, India\t\t\t                                                           June 2010 to Aug 2012 Java Programmer Responsibilities:  Analysed Business, gathered Requirements, System Specifications from Business analyst, Business owners, System owners and System operators. Prepared feasibility, scope and technology efforts; documented and presented to management. Created System Requirement documents. Involved in complete SDLC starting from analysis phase, design, development, testing, implementation, production issues and documentation. Developed Administrative console using Java, PL/SQL, and HTML. Configured Visual Source Safe (Version Control System). Used Java, JSP, Servlets, JavaScript, DHTML, HTML, CSS, XML, Windows, SQL, PL/SQL, MS SQL Server, and Visual Source Safe to develop, test and maintain this application. Created Unit Test documents. Involved in integrated testing, load and stress testing. Created Views and Indexes for improved performance. Worked with Cascading Style Sheets(CSS) Environment: HTML, JavaScript, CSS, PL/SQL"}