{"text": "Name: esther esther E-Mail: esther.esther@gmail.com Address: Shenzhen, China Github: https://github.com/esther LinkedIn: https://linkedin.com/esther Phone No. 910788693673 Summary\t Over 6 years of IT experience in SQL Database Administration, System Analysis, Design, Development & Support of MS SQL Servers in Production, QA, Reporting Services, and Development environments. Configuring, Upgrading, Maintaining, Migration and Administration of MS SQL Server. High Availability of database servers using Database Mirroring, Replication and Log Shipping. Creation of users, configuring permissions and assigning roles to users. Created maintenance plans to perform index rebuilding, reorganizing and update the index statistics. Experience in using Performance Monitor, SQL Profiler to optimize queries and trace long running queries and deadlocks. Strong skills in Relational Data Base Management System (RDBMS) Design, Development Professional Accomplishments\t N.C.R Duluth, GA\t\t\t\t \t\t     May 2013 – Present SQL Server Database Administrator/Developer Monitoring database size and disk space in Production, Staging & Development environments. Backing up and restoring databases as a Disaster Recovery Maintenance and Contingency plans. Using Replication Monitor to check the performance of replication. Setting up profiler trace to capture activities on the server. Analyzing Event viewer to check errors related to replication, Mirroring and log shipping. Writing queries to release free space in database log files. Configuring Mirroring, Replication and Log Shipping. Creating logins and granting access to user by assigning server and database roles. Optimizing queries by creating clustered, non-clustered indexes and indexed views. Conducting Performance Tuning using SQL Profiler and Windows Performance Monitor. Scheduling Maintenance plans (Rebuild and Reorganize indexes, backup and cleanups). Installing SQL Server on the server and client machines, providing connections to databases. Migration of data across different databases and different servers. Created and fine-tuned Stored Procedures using Execution Plan for better performance.     Willvan Insurance Norcross, GA\t\t\t\t \tMay 2012 – April 2013   SQL Server  Database Administrator  Installation and configuration of SQL server.      Report creation using (SSRS).        Scheduling Maintenance jobs and backups.   Created and fine-tuned Stored Procedures using Execution Plan for better performance. Setting up and Administering Security (creating windows and SQL server logins, assigning server, database and schema roles and permissions).       Setting up and Monitoring Database Mirroring, Log shipping, Clustering and Replication (snapshot, merge, and transactional).   Setting up and Administering Security (creating windows and SQL server logins, assigning server, database and schema roles and permissions).      Maintaining, Developing and Implementing policies and procedures for ensuring the health and integrity of the company database       Development of Backup and Recovery strategies.       Performing Database Migration and database upgrades    Developing SSIS packages for ETL processes                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               Skills\t Windows Servers 2003, 2003r2, 2008, 2008r2, 2012, 2012r2 Programming Languages: TSQL 3rd Party Monitoring Tools: Spotlight  RDBMS: SQL Server 2000/2005/2008/2008R2/2012/2014,2016  Education & Training\t BSc Industrial Chemistry                                                                                                                                                University of Benin "}