{"text": "Name: ruth ruth E-Mail: ruth.ruth@gmail.com Address: Karachi, Pakistan Github: https://github.com/ruth LinkedIn: https://linkedin.com/ruth Phone No. 349675510726 Professional Summary: 7+ years of Experience in Database Design, Development and Business Intelligence of Microsoft SQL Server2000/2005/2008/2012/2014 in Development, Test and Production Environments. Hands on Experience SQL Server Integration Services (SSIS) and SQL Server Reporting Services (SSRS) with good knowledge on SQL Server Analysis Services (SSAS). Strong experience in T-SQL development with MS SQL Server 2014/2012/2008 R2/2008/2005. Involved in designing, developing and testing of the ETL (Extract, Transformation and Load) strategy to populate the data from various source systems. Experience in writing expressions in SSRS. Created many Drill through, Drill Down, Parameterized, Cascading, Conditional, Table, Matrix, Chart and Sub Reports reports using SSRS. Good understanding of SQL Server Reporting Service (SSRS) on Report authoring, Report management, Report delivery and Report security. Expertise in Microsoft Integration Services SSIS (Control Flow tasks, Data Flow tasks, Transformations, Database administration tasks). Involved in usage of various SSIS components such as For-loop, for-each loop, Fuzzy lookup, Variables, and Error Handling. Excellent knowledge of using Variables and Expressions in packages of SSIS Experience in providing Logging, Error handling by using Event Handler, and Performance Tuning in SSIS packages by using Row Transformations, Block and Unblock Transformations. Experience in creating jobs, SQLMail, Alerts and schedule SSIS Packages using SQL Server Agent. Experience in SQL Server SSIS (Integration Service) package design, constructing, and deployment Good knowledge of Azure Subscription, Firewall setting, Connecting with SSMS on premises, Creating and managing Azure SQL Databases.  Good understanding and designing of Star and Snow Flake data models Schema  Created beautiful reports by mixing Excel, Charts & Power Pivot. Used excel sheet, flat files, CSV files to generated Tableau Adhoc Reports. Solid Knowledge in developing cubes using Partitions, KPI’s, and Perspectives, slow changing dimensions (SCD) etc. and created various user roles (SSAS). Transformed data from one server to other servers using tools like Bulk Copy Program (BCP), Import and Export wizard and SQL Server Integration Services (SSIS) Experience in Data Modeling (Logical and Physical Design of Databases), Normalization and building Referential Integrity Constraints. Designed schemas. Built tables, FKs, PKs, etc. by providing a structure that meets the business needs. Tuning the performance of stored procedures and large T-SQL Queries using Clustered Indexes, efficient coding standards. Experience in design, development, and implementation of SQL Server Analysis Services (SSAS) reports/cubes. Expertise with DDL and DML statements, RDBMS’s, data dictionaries. Excellent Analytical, Communication and Interpersonal Skills. Proficient in Technical Writing and Presentations and a Good Team Player. Education Details: B.Tech in Computer Science, CHARUSAT University, Gujarat, India Technical Skills: Professional Experience: HSBC, IL \t\t\t\t\t\t\t\t                    Jan 2016 to till date  SQL Server BI Developer Responsibilities:  Involved in Agile methodology by analyzing business requirements and understanding the functional work flow of information from source systems to destination systems, completed work through Sprints.  Analyzing existing high-level ETL design documents and data mapping documents and updating them. Developed SSAS Cubes by creating Measure Groups, Dimensions, Aggregations, Hierarchies, Partitions and Perspectives using SSAS. Developed SSAS Cubes using Star Schema with partitions, aggregations, hierarchies and perspectives. Developed complex T-SQL queries, Views, Common table expressions (CTE), stored procedures and functions.  Loading CSV data files into SQL Server staging tables using SSIS.  As part of conversion, loading data into staging tables and then to operational tables and validation of data generated as part of Claim-Center application using SSIS. Developed and deployed SSIS packages from OLTP and various sources to staging and staging to Data warehouse using Lookup, Fuzzy Lookup, Derived Columns, Condition Split, Slowly Changing Dimension and more.  Designing Enterprise reports using SQL Server Reporting Services (SSRS 2012), which make use of multiple value section in parameters, cascading parameters, matrix dynamics reports and other features of Reporting service.  Using SSRS for development of reports for Business users from different sources like tables, stored procedures and development of various types of reports.  Used Team Foundation Server as Source Control to store Packages, Reports and SQL Scripts and share it among team members.  Worked on Performance of Stored Procedures using SQL Profiler and the performance of the reports as well.  Developed Package configurations for Integration, Test and Production environments and execution of SSIS packages automatically.  Development of different types of reports like Parameterized reports, Drill down reports, Ad- hoc reports, Snapshot reports and Sub reports on data mart database using SSRS. Monitored performance and optimize SQL queries for maximum efficiency.  Used complex expressions to Calculate, Group, Filter, Parameterize, and Format the contents of the report according to the requirement. Worked in configuration of report server and report manager scheduling, give permissions to different level of users in SQL Server Reporting Services (SSRS). Environment: SQL Server 2008 R2/ 2012, 2014, Visual Studio 2005/2008/2010/2012, MS Access, MS- Excel, SQL Server Integration Services, SQL Server Reporting Services, SharePoint, SQL Azure, VB Script, C# AIG, Houston, TX         \t\t\t\t\t\t                                 Feb 2014 to Dec 2015 SQL DBA/ SQL Server BI Developer  Responsibilities:  Created reports like Drill-Down, Drill-Through, Chart, and Sub Reports using SQL Server Reporting Services (SSRS).  Created SSRS reports using Bar charts, Line charts, Pie charts.  Created gauges and used gauges as Key Performance Indicators using SSRS.  Created complex stored procedures for Reporting services.   Implemented SSIS packages to load the Data into Staging, ODS and dimensional model.  Designed and developed SSIS packages using various control flow and data flow items to transform and load the data from various databases and into server integrations services (SSIS).  Configured package with checkpoints, package logging, error handling and event handling to redirect error rows and fix the error in SSIS.  Developed SSIS Packages for data matching, compare source and destination data based on id and get the new and updated records and then used conditional split to select that new records before inserting into the database.  Created Dimensions with the SSAS cube wizard and refreshing the cube to get the latest information updated for OLAP databases. Deployment of Cubes to the production server.  Used Performance Monitor and SQL Profiler to optimize queries and enhance the performance of database servers.  Created Clustered and Non Clustered Indexes on tables for performance optimization of complex stored procedures.  Generated daily, weekly and monthly reports for the managers using SSRS.  Designed and created OLAP cubes on data warehouse.  Good experience in using Multidimensional Expressions (MDX) for querying and manipulating the multidimensional data stored in OLAP cubes. Designed a partitioning strategy to refresh cubes effectively.  Created SSAS cubes with multiple fact measures groups, and multiple dimension hierarchies based on the OLAP reporting needs.  SSAS cube development in both SQL 2005 and 2008 for financial planning and operational performance metrics.  Extracted data using SSIS from OLTP to OLAP. Based on the required reports, identified various data sources and established the connections using SSIS and constructed data source view.  Designed and implemented data access stored procedures and triggers for automating tasks and job scheduling.  Involved in extracting the data using SSIS from OLTP to OLAP.  Implemented SSIS data transformation scripts, created maintenance procedures and provided data integrity strategies Environment: SQL Server 2005/2008, SSRS 2008/2005, SSIS 2005, SSAS, T-SQL,  Excel, Access, Windows 2000/XP TJX Companies Framingham, MA\t\t\t\t\t                Oct 2012 to Jan 2014 SQL Server BI Developer Responsibilities:  Designed SSIS Packages to extract data from various OLTP sources, Text Files, XML (Extensible Markup Language) Files, MS SQL Server 2008/2012, Excel and MS Access 2007 to EDW system (SQL Server 2012).  Wrote T-SQL queries with the help of Stored Procedures, Functions, Triggers, Cursors, Views, and Indexes.  Planned, Defined and Designed data based on business requirement and provided documentation.  Gathered data and documenting it for further reference.  Designed Database using Erwin data modeler.  Applied various data transformations like Slowly Changing Dimension, Aggregate, Sort, Multicasting, Cache Transform, Conditional Split and Derived column etc. in SSIS.  Developed SSIS Packages using Look Up Values & implementing rules provided by Business in the mapping document.  Developed SSIS packages using Fuzzy Look Up and Fuzzy Grouping for data cleansing purpose.  Used SSIS Variables for storing the values, which are used in various components of Data Flow Task.  Developed Unit Test Plans for SSIS packages for checking the functionality of each component.  Modified the existing SSIS packages to meet the changes specified by the users.  Scheduled Jobs for executing the stored SSIS packages, which were developed to update the database on Daily basis.  Created the Load packages for loading the CSV files from DB2 into SQL Server using SSIS 2012.  Generated parameterized reports, sub reports, tabular reports using SSRS-2012.  Designed, Developed and Deployed reports in MS SQL Server environment using SSRS-2012  Generated Sub-Reports, Drill down reports, Drill through reports and Parameterized reports using SSRS 2012.  Created SSRS reports to retrieve data using Stored Procedures that accept parameters. Scheduled the monthly/weekly/daily SSRS reports to run automatically onto the Dashboard  Responsible for Monitoring and Tuning SSRS reports performance.  Configured the report viewing security for various users at various levels using Report Manager  Scheduled report and exported in PDF format in SSRS.  Fine-tuned SQL Queries for maximum efficiency and performance.  Provided documentation for all kinds of SSRS reports and SSIS packages.  Environment: MS SQL Server 2008/2012, SSRS, T-SQL, SSIS, Visual SourceSafe, Win 2003 Advanced Server, Erwin, ASP.Net, C# Akron solutions, India \t\t\t\t\t\t                                July 2010 to Aug 2012 SQL DBA/ SQL Server Developer Responsibilities:  Creation of user Databases and managing security, created stored procedures.  Involved in up gradation from MSSQL server 2000 to 2005.  Writing stored procedures, checking code for efficiency. Routine backups and restoration.  Data Transfers between various servers using DTS.  Defining and creating indexes for query optimization and revising scripts for optimal performance.  Testing stored procedures performance and path of execution using SQL Profiler.  Recovering the Backups of MS SQL Server production databases in test servers as part of regular maintenance activities.  Optimized the T-SQL query performance with modifications in T-SQL queries, removing unnecessary columns, establishing necessary joins.  Involved in preparing detailed technical documents.  Involved in code review and preparing unit test cases.  Created Linked Servers to retrieve data from other databases.  \nEnvironment: MS SQL Server 2000/2005, SQL, T-SQL."}