{"text": "Name: ethel ethel E-Mail: ethel.ethel@gmail.com Address: Bangalore, India Github: https://github.com/ethel LinkedIn: https://linkedin.com/ethel Phone No. 518843766756 PROFESSIONAL SUMMARY  Over 8+ years of experience in IT industry comprising of delivery management, design, development, release & deployment and cloud implementation. Good experience on DevOps tools such as Ansible, Puppet, Chef, Vagrant, Jenkins, maven, ANT, SVN, GIT and Docker. Experience in Infrastructure Development and Operations involving AWS Cloud platforms, EC2, S3, EBS, VPC, ELB, AMI, SNS, RDS, IAM, Route 53, Auto scaling. Set-up database in AWS using RDS, storage using S3 bucket and configuring instance backups to S3 bucket. Worked with IAM service creating new IAM users & groups, defining roles and policies and Identity providers. Created alarms and trigger points in Cloud Watch based on thresholds and monitored server’s performance, CPU Utilization, disk usage. used Splunk to detect Prod issues. Used terraform in managing resource scheduling, disposable environments and multitier applications. Experience in Configuration Management tools like Ansible, Puppet and Chef. Implemented puppet modules to automate configuration of a broad range of services. Experience in configuring and managing Puppet master server and experience in updating and creating modules and pushing them to puppet clients.Configured Nagios to monitor EC2 Linux instances with puppet automation. Experience in writing ansible/puppet playbooks/manifests to automate infrastructure as code. Experience in setting up Chef Workstation, Server and Clients, and maintained Chef Recipes and cookbooks to simplify and expedite deployment of applications and mitigate user error. Used GIT to keep track of all changes in source code. Experienced in Branching, Merging, Tagging and maintaining the version across the environment using SCM tools like GIT and Subversion (SVN) on Linux platforms. Experience with any Enterprise deployment automation tools like Udeploy, XLDeploy. Set up Continuous integration for major releases in Jenkins. Administration of Jenkins server- Includes Setup of Jenkins Master, Slave, Configure Nightly builds, and parameterized builds and deployment automation. Experienced with Docker container service, and Dockerized applications by creating Docker images from Docker file. Hands on experience in Docker Architecture using Kubernetes. Familiarity with Kubernetes, Mesos, Docker Swarm. Experience inmonitoring tools like Nagios, Splunk and cloud watch. Experience in using Tomcat, web logic, JBOSS, web sphere application servers for deployments. Expertise in using build tools like Maven, ANT for the building of deployable artifacts such as Jar, War&Ear from source code. Application Deployments & Environment Configuration Using Puppet. Experience in managing the artifacts generated by MAVEN in the Nexus repository. Experience in Querying RDBMS such as Oracle, MYSQL and SQL server by using PL/SQL for data integrity. Hands on Experience in writing, shell scripts, Bash, Perl, Python, Ruby scripting on Linux. Experience with bug tracking tools like JIRA, Bugzilla. Exposed to all aspects of Software Development Life Cycle such as Analysis, planning, Developing, testing and implementing and post-production analysis of the project. Experience in installing patches, upgrades, system configuration, performance tuning Unix/Linux/windows systems. Managed environments DEV, QA, UAT and PROD for various releases and designed instance strategies. Ability to grasp latest technologies and to properly apply new tools to build applications. Excellent written and verbal communication skills, strong organizational skills, and a hard-working team player. TECHNICAL SKILLS: Professional Experience: Change Health Care, Nashville, TN\t\t\t\t\t\t\t[May 15 – Till date] Sr. DevOps /AWS Engineer Responsibilities: Migrating and maintaining build and test environments into the Cloud Infrastructure. Worked on spinning up EC2instances, Creating IAM Users and Roles, Creating Auto Scaling groups, Load balancers and monitoring through Cloud Watch for the applications likeS3,VPC,RDS, AMI,Route 53, etc. Utilize AWS CLI to automate backups of ephemeral data-stores to S3 buckets, EBS and create nightly AMIs for mission critical production servers as backups.  Used Git & Subversion(SVN)as source code repositories, managed for branching, merging &tagging the files. Used Jenkins for CI and CD purposes and build failures alerts, management of build tool plugins like Maven. Experience working on Docker Hub. Created Docker images using a Docker file, worked on Docker container snapshots, removing images and managing Docker volumes. Worked on Jenkins and Docker interactively and integrating together for enterprise scale infrastructure configuration and application deployments. Used uDeploy to integrate with multiple build systems and to provide an application model handling multiple projects or \"components\". Integrated Docker container orchestration framework using Kubernetes by creating pods, Config Maps and deployments.  Managed Kubernetes charts Using HELM. Used Kubernetes to manage containerized applications using its nodes, ConfigMaps, selector, Services and deployed application containers as Pods. Worked on Terraform for managing the infrastructure through the terminal sessions and executing the scripts through the terminal.  Used terraform for automating VPC’S, S3 buckets, and security groups. Used various components of Chef including chef server, workstations, Nodes, configurations of chef-client and writing cookbooks and recipes for Chef and assigning roles to nodes. Maintained build related scripts developed in shell for Maven builds. Created and modified build configuration files including POM.xml. Scheduled automated nightly builds using Jenkins. Automated various infrastructure activities like Continuous Deployment, Application Server setup, Stack monitoring using Ansible playbooks and has Integrated Ansible with Jenkins. Demonstrated how Ansible along with Ansible Tower can be used to automate different software development processes all over the organization.  Configured the Ansible playbooks with Ansible Tower so that other users can run them with just push of a button. Performance Monitoring of CPU, Memory, Disks, Network using various monitoring tools like Nagios. Automated the contiguous process writing code using shell, Bash, python scripting languages. Deployed the java application into web application servers like Apache, Tomcat. Designed workflows in Atlassian JIRA to deal with issues, and maintained all the user stories for tracking as per Agile. Environment: CHEF, Ansible, AWS, GIT, Jenkins, Terraform, Docker, ANT, MAVEN, Shell Scripting, Kubernetes, SHELL Scripting, Python, JIRA, NAGIOS, LINUX, Red Hat. Thomson Reuters, Dallas, TX\t\t\t\t\t\t\t[Nov 14 – Feb 15] Sr. DevOps / AWS Cloud Engineer Responsibilities: Planning, deploying, monitoring, and maintaining Amazon AWS cloud infrastructure consisting of multiple EC2 nodes and VMWare VM’s as required in the environment. DevOps and AWS cloud Engineer for a team that involved different development teams and multiple simultaneous software releases.  Creating S3 buckets and also managing policies for S3 bucket and utilized S3 bucket and glacier for Archival storage and backup on AWS.Configured S3 to host static web content. Designed AWS Cloud Formation templates to create custom sized VPC, subnets, NAT to ensure successful deployment of WEB applications and database templates. Used Elastic Load balancer for pinging EC2 instances in round-robin process and health checking of EC2 instances along with Route 53. Created monitors, alarams and notifications for EC2 hosts Using Cloud Watch. Used Terraform in AWS VPC to automatically setup and modify settings by interfacing with control layer. Deploy and monitor scalable infrastructure on Amazon services (AWS) & configuration management using puppet. Deployed LAMP based applications in AWS environment, including provisioning MYSQL- RDS and establishes connectivity between EC2 instance and MySQL-RDS via security groups. Designed Puppet modules to manage configurations and automate install process. Maintenance of source code in GIT. Extensive experience in using version control systems includes Subversion(SVN), GIT and GITHUB.Implemented continous integration using Jenkins and GIT. Creating repositories, branches, tags in GIT and assist developers to fix merging issues and Creating Local Virtual Repositories in Artifactory for the project and release builds. Implemented the setup for Master slave architecture to improve the Performance of Jenkins.  Generated scripts in Maven, Perl&Bash Shell, build activities in QA, Staging and Production environments. Worked on docker and created virtual instances with docker. Worked on Docker container snapshots, attaching to a running container, removing images, managing directory structures and managing containers. Documented release history, build configuration and build procedures in detail.  Developed build and deployment scripts using ANT and MAVEN as build tools in Jenkins to move from one environment to other environments.  Expertise in JIRA in issue tracking and project management, Change Management and Release Management. Responsible for ensuring Systems & Network Security, maintaining performance and setting up monitoring using Cloud Watchand Nagios. Environment: Puppet, AWS (EC2, VPC, ELB, S3, RDS, Cloud Watch, Route 53, VPC, EBS, ELB), GIT, Jenkins, Terraform,Docker, ANT, MAVEN, Shell Scripting, Perl Scripting, Python,JIRA, NAGIOS, UNIX, LINUX. Bed Bath and Beyond, Union, NJ   \t\t\t\t\t\t[Jan 14 – Oct 14] Role: DevOps Engineer\t Responsibilities: Designing and implementing for fully automated server build management, monitoring and deployment by using Devops technologies like Ansible. Used GIT & SVN as source control systems to manage code. Involved in leading Automation Deployment Team by working with Ansible. Created Ansible playbooks, to automate system operations. standard business requirements and create cloud based solutions to meet those requirements,Architect cloud applications on Azure. Wrote ANT and MAVEN Scripts to automate the Build Process using Jenkins. Involved in editing the existing ANT/MAVEN files in case of errors or changes in the project requirements. Used Shell/Perl Scripts to automate the Deployment Process. Used Jenkins, Build forge for Continuous Integration and deployment into Tomcat Application Server. Coordinating with development teams to perform builds and resolve build issues. Coordinated with developers, Analyst and Mangers to make sure that code is deployed in the Prod environment. Built and Deployed Java/J2EE to a web application server in an Agile (CI) environment and automated the whole process. Maintained JIRA for tracking and updating project defects and tasks. Maintained and troubleshoot systems performance and network monitoring with Nagios. Developed Python batch processors to consume and produce various feeds. Managed and document all post deployment issues utilizing the post Deployments Issue Log. Environment: Ansible, Python, SVN, GIT, Jenkins, Azure, Apache Tomcat, ANT, Shell Scripts, Perl Scripts, MAVEN, JIRA, NAGIOS, UNIX, LINUX. Sun Trust Bank, Atlanta, GA\t[Sep 10 – Dec 13] Build/Release Engineer\t Responsibilities: Release Engineer for a team that involved different development teams and multiple software releases. Developed and implemented Software Release Management strategies for applications according to agile process. Built and Deployed Java/J2EE to a web application server in an Agile continuous integration environment and automated the entire process. Build and deploys J2EE applications in Web Sphere. Created Puppet manifests, profiles and roles module to automate system operations. Assist with maintaining current build systems, developed build scripts, and maintained the source control system. Used IBM Rational Clear Case (UCM) as Version Control. Managing the source codes repository of multiple development applications using SVN as a code repository. Developed Shell/Perl/Python Scripts for automation purpose. Responsible for designing and deploying best SCM processes and procedures. Used Jenkins as a continuousIntegration tool for automation of daily process. Involved in writing POM files to establish the code quality tools integration. Releasing code to testing regions or staging areas according to the schedule published. Build and deployed J2EE applications in WebLogic. Used ClearQuestas a ticket tracking tool. Monitoring System/Application Logs of server using Splunk to detect Prod issues. Environment: Java/J2EE, SVN, GIT, Jenkins, Puppet, Maven, ANT, WebLogic, Python Scripts, Perl Scripts, Shell Scripts,Splunk, ClearQuest. HDFC Bank, India[Jan 09 – Aug 10] Role: Linux Administrator Responsibilities: Administered, maintained Red Hat (RHEL 5x, 6x, SUSE 10, 11, CENTOS 5, 6) operating systems, Troubleshooting Hardware, Operating System Application & Network problems and performance issues; Deployed latest patches for, Linux and Application servers, Performed Red Hat Linux Kernel Tuning. Created and modified applicaation related objects, created profiles, users, roles and maintained system security. Experience in implementing and configuring network service such as HTTP, DHCP, and TFTP. Administered Linux servers for several functions including Apache/Tomcat server, mail server and MySQL databases in both development and production. Managed Disks and File systems using LVM on Linux Performing failover and integrity test on new servers before rolling out to production. Planned, scheduled and implemented OS patches on Linux boxes as a part of proactive maintenance. Monitoring CPU, memory, Hardware and software RAID, file systems, network using the tools NAGIOS monitoring. Installed configured Virtual Network Computing (VNC) server/client. Performing kernel and database configuration optimization such that it limits i/o resource utilization on disks. Maintained proper documentation of all the activities carried out during the project. Environment: Red Hat Linux, CentOS, Autosys, VMware vSphere 4., VMware ESX 3.5.0, Shell Scripting, Tomcat, MYSQL, Nagios."}