{"text": "Name: betty betty E-Mail: betty.betty@gmail.com Address: Saint Petersburg, Russia Github: https://github.com/betty LinkedIn: https://linkedin.com/betty Phone No. 306139607068 Summary:\t Front-end Developer with 7+ years of experience, as a Sr. Front End Developer with proven background successfully managing all facets of site development, from initial design and architecture to site deployment and client management. Solid expertise in Web designing technologies like HTML4/5, CSS2/3, JavaScript, Ajax, JSON, DOM, AngularJS, NodeJS, JQuery, Backbone. Experience with Responsive Web Design (RWD) using Twitter Bootstrap with involvement in several web application development projects. Solid experience working with CSS Preprocessors like SASS and LESS; using mixins, functions, custom grid systems following object oriented modular CSS patterns; Working with complex CSS Layouts, Positioning, Key frame Animations and Pseudo Elements. Expert in various JavaScript frameworks such as AngularJS, NodeJS, Express and Bootstrap. Experience in other JavaScript libraries such as JQuery, Backbone. Strong experience in Responsive Web Design, Mobile Web App Development, Single page Web App Development, resolving Cross-browser Compatibility issues. Develop intuitive, user-friendly, and visually appealing front-end interface and optimize applications for performance, speed and various operating device. Utilized the Component API within Angular to build the application in a component approach rather than a traditional approach; Created reusable custom directives and components within the application. Demonstrated ability to complete high-end projects in deadline-oriented environments. Adept at successfully revamping Web sites to enhance user satisfaction and retention time, streamline navigation, and increase ad revenue and sales. Good Experience in working with debugging tool such as Firebug for Mozilla, IE Developer Toolbar for Internet Explorer, Web Inspector for Safari, and Developer Tools for Chrome. Strong expertise in using templates and MVC architecture using tools like BackboneJS and AngularJS Have sound understanding of HTML5 APIs like localStorage, navigation, sessionStorage, etc Involved in functional testing, debugging the application, production bugs fixing and enhancing the app. Experience designing and developing adaptive UI components, Widget for Desktops and Mobile screens with different screen resolutions. Sound knowledge on unit testing and integration testing frameworks and libraries like Jasmine, Mocha,Protractor; test runners like Karma; assertion libraries like Chai, Expect, Should.  Hands on experience in consuming & parsing JSON/XML data. Experience with using third party JQuery plugins like Validator.js, Lightbox.js, Bootstrap, Moment.js  plugins. Worked with various Version Control Software/Systems like Git, SVN, Mercurial; Managed source code hosting on Bitbucket, Gitlab and Github. Proficient at quickly adapting to new environments, new technologies and facing new challenges. Technical Skills: Professional Experience: Cardinal Health, Dublin, OH                                            \t\t\t\t         Jan 2016 – Present Sr. UI Developer Cardinal Health is a health care customer Services Company that provides medical products and pharmaceuticals and cost-effective solutions that enhance supply chain efficiency from hospital to home. The project deals with developing an application, used to maintain information of patient which includes all the personal information,diagnostic reports, insurance data and all other information entered by the physician. As a Sr. UI Developer, my responsibility was to develop the corresponding UI screens and reusable dashboard widgets within the application using Angularjs. Responsibilities: Gathered business requirements, prepared Software Requirement Specification (SRS) document. Created Visio charts for the workflow architecture of the system. Involved in complete development of 'Agile Development methodology /SCRUM' and tested the application in each iteration Developed microservices using Express framework in Node.js, and integrated them via Angular services. Designed and developed web pages using with HTML5, CSS3, Ajax, JSP and Angular based on the W3C standards and Web 2.0. Created custom directives, components within the application for maximum reusability. Created the UI interface using JavaScript, JQuery, CSS3 and HTML5. Extensively used JavaScript, JQuery UI and JQuery to provide UI functionality. Worked on the application developed using HTML5, CSS3, JSON, and Node.js. Management of a Portal application allowing management of user accounts and privileges using Angular.js framework. Worked with technologies such as JQuery and Ajax to make the website more attractive and user friendly. Used Grunt as the task runner to manage the frontend build pipeline. Developed core angular services to consume a REST API implemented using Spring MVC. Used a component driven approach along with the MVC architecture using Angular.js Worked on the modernization of a legacy and outsourced UI, there-by migrating a traditional application to a single page application. Used RequireJS module loader to manage dependencies within the AngularJS application. Developed the administrative UI dashboard using Angular.js alongside jQuery. Utilized various jQuery plugins to build Accessible Rich Internet Application (ARIA) to make it look more intuitive and accessible. Developed DAOs (Data Access Objects) and SQL queries to support system functionality. Used Team Studio and Build Manager tools to develop Notes applications and promote the new design to test environment. Analyzed and reported latest industry trends for business implications. Develop online applications using OOP JavaScript paradigm. Implemented and tested the enterprise application with JQuery, Spring MVC. Extensively Implemented user interface designs from UI specifications and product requirements. Involved in finding out the bugs, broken links and missing images etc. and rectifying them. Developed dynamic e-mails using JavaScript, and hand coding of HTML, XHTML, and CSS. Collaborated with team members in design, analysis, coding, testing, and website review. Provided assistance in online campaigns and online marketing strategy execution. Environment: HTML5, CSS3, JavaScript, AJAX, JSON, XML, JQuery, Angularjs, Bootstrap, Dreamweaver CS5, Grunt, ECLIPSE, Sublime Text, Atom, GWT. Penn Mutual Life Insurance Company, Horsham, PA                                      \t      Oct 2014 – Dec 2015 Sr. UI Developer This company creates a world of possibilities-one individual, one family and one small business at a time. it help people do more in life by creating solutions that deliver the complete value of life insurance across life's stages. As a member of the CSC(Customer Service Center) team, where the customer can interact with the customer support members and can report, resolve their issues/problems in time using the web application, my responsibility was to work on the dashboard user interface. Responsibilities Implemented user interface guidelines and standards throughout the development and maintenance of the website using JavaScript, JQuery, CSS, and HTML. Utilized Angular as the core framework to build the entire application by leveraging the MVC architecture. Used a widget based approach in developing custom directives to develop dynamic responsive plug and play widgets in Angular. Used Bootstrap as the main CSS framework for initial prototype; Used Sass as the CSS preprocessor to build and manage application styles. Worked on the reporting page within the Dashboard application displaying historical data processing rates; Developed a D3 charting service to create custom chart components on the fly. Involved to create the User Interactive web pages in a professional manner using web technologies like HTML5, CSS3, Javascript based on the W3C and ADA standards. Utilized the ng-grid component, and implement an internal data table custom directive to display tabular data in a grid format. Setup framework for all current and future front-end projects to use AngularJS and Jasmine for framework, organized module definitions and unit tests; Karma test runner to run the tests. Involved in write application level code to interact with APIs, Web Services using AJAX dealing with JSON and XML data. Developed Custom Tag Libraries for the use in web pages by using JSTL packages for the development of the Web Pages.  Used a TDD (Test Driven Development) approach to build the application. Utilized the Jasmine framework to write the unit tests and run them on headless browser like PhantomJS using Karma Implemented custom filters using Angular to format data consumed by the API on the frontend. Used Gulp as the orchestrator o build front-end assets. Worked on Cross-Browser compatibility issues and fixed the bugs for several browsers. Enhanced and built reusable components across different modules using Custom directives and components.\n Environment: HTML5, CSS3, JavaScript, AJAX, JSON, XML, JQuery, Bootstrap,  AngularJS, Scala, Gulp, Eclipse, ANT, Maven, Git, Linux, Apache and MySQL. Citibank Miami, FL\t\t\t\t\t\t\t        \t                  Mar 2013 – July 2014 UI Developer Responsibilities: Hand code digital projects using HTML5, CSS3, SASS, JavaScript and JQuery  Used JavaScript Design Patterns to develop storage module. Analyzed and prepared time estimates for the assigned tasks. Used Eclipse as IDE. Helping to creating an Angularjs interface that will replace and end-of-life product mostly used by management and sales team Developed Presentation layer with Struts 1.1, JSTL, and JSP, tiles and JavaScript. Built Web pages that are more user-interactive using jQuery plugins for Drag and Drop, Auto Complete, JSON, JQuery, JavaScript, Bootstrap.  Developed rich user interface for a policy configuration tool using JQuery. Used \"twitter bootstrap\" along with \"angular-ui\" bootstrap for HTML components style definitions and user interface elements such as dialog boxes and tooltips.  Developed Business layer and Data layer with Enterprise Java and Hibernate.  Involved in the code review meetings with the developers. Developed test cases using Jasmine and run them on browsers using karma. Wrote stored procedures and triggers. Also involved in SQL query tuning and optimization. Developed XML Schemas. Achieved common look and feel among all the pages and eliminated lot of rework and repeated code on presentation layer by using Tiles framework.  Used SVN as source control system. Ensured project plan commitments are met. Resolved issues and dependencies with components of different subsystems by effectively communication with other groups. Environment: JavaScript, Ajax, JQuery, HTML5, XML, CSS3, Jasmine, Karma, LESS, Sass, Bootstrap, SQL. Sprint, Kansas\t\t\t\t\t\t\t\t                 May 2012 - June 2013 UI Developer Responsibilities: Used HTML & CSS to build the underlying UI; Native JavaScript to attach behaviour within frontend web pages Rapid prototyping of design concepts; Involved in all SDLC phases Analysis, Design, Development, Testing and Deployment Developed cross browser compatible HTML and CSS reusable templates and integrated the UI. Created highly dynamic user interactive web application with extensive use of jQuery.  Experience with jQuery with templating via Handlebars and Bootstrap.  Hands on experience on creating responsive apps for smart devices using responsive design and media queries. Used jQuery, AJAX for service calls on pages to interact with the server for information. Utilized various JavaScript and jQuery libraries, AJAX for form validation and other interactive features. Utilize JSON, XML response and transform complex collections using Lodash library. Used Ajax, JSON to send request to the server to check the functionality of the websites. Testing the website on multiple browsers with their old as well as latest release using headless browser like Phantomjs via Karma Used JSON for storing and exchanging information between browsers and servers. Active participation throughout the entire software development lifecycle from project inception, to code development and elaborate testing of the various modules. Used  the Jasmine framework to write the unit tests. Environment: HTML, CSS, JavaScript, JSON, JQuery, XHTML, XML, AJAX,  MySQL. 3i-infotech, India                                                                         \t\t\t      July 2011 - April 2012 \nWeb Developer \n   Responsibilities:  Managed application state using server and client-based State Management options. Implemented AJAX functionality using JSON and XML.  Involved in complete SDLC life cycle - Designing, Coding, Testing, Debugging and Production Support.   Wrote extensive HTML, CSS and JavaScript code to build dynamic pages.  Developed and designed the various screens and its architecture in accordance to UI Specs.   Implemented XML parsing code for different application.   Designed and built REST Web services interfaces implemented in Java.   Maintained and manipulated databases for XML parsing for applications in MYSQL.  Wrote application level code to interact with the backend Java, AJAX and JSON.  Handled all aspects of the web application including development, maintaining, testing and debugging. Environment: HTML, CSS, MySQL, JavaScript, Design Patterns, JSON. \nZensar Technologies, Hyderabad, India                                                                      Sep 2009 – Jun 2011      Web Developer Responsibilities: Gathered and analyzed all necessary requirements by involving in discussion sessions. Co-ordinate with BA group for better understanding of functional requirements, Analyze and Design the business requirements to document and implement. Design and development of web pages using HTML, CSS including Ajax controls and XML. Tested/Debugged web browser using Firebug. Involved in writing the properties, methods in the Class Modules and also developed web services using HTTP. Played a vital role in defining, implementing and enforcing quality practices in the team organization to ensure internal controls, quality and compliance policies and standards. Worked with View State to maintain data between the pages of the application. Successfully wrote and implemented SQL Queries, Stored procedures and Triggers in SQL server. Worked extensively with the File management and image libraries. Created required Views, Indexes and Clusters. Created database triggers to implement business rules and writing stored procedures. Created packages to do complex aggregations on large volume of data and loaded the aggregated data into reporting tables in data marts. Environment: HTML, CSS, MySQL, JavaScript."}