{"text": "Name: julia julia E-Mail: julia.julia@gmail.com Address: Zhumadian, China Github: https://github.com/julia LinkedIn: https://linkedin.com/julia Phone No. 192788397301 PROFESSIONAL SUMMARY: Having 8+ years of professional experience in designing, implementing and deploying commercial Enterprise Applications for Multi-tiered-distributed software products and distributed applications using Java/J2EE technologies. Expertise in various phases of Software Development Life Cycle (SDLC) of the application like Requirement gathering, Design, Analysis and Code development. Experience in defining and designing the layers, components of the project using OOAD methodologies and standard J2EE patterns and guidelines. Proficient in Web development technologies like HTML, JavaScript,Python,PHP,CSS,XML and XSL/XSLT. Sound Knowledge of Bootstrap Framework for Responsive Web Applications. Experience in developing components using AngularJS, Ajax, JQuery etc. Developed Python web services for processing JSON and interfacing with the data layer. Good exposure on design patterns like Front Controller, Data Access Object (DAO), Data Transfer Object (DTO), Service Locator and Singleton. Worked with Relational Database Management Systems including Oracle, MySQL, SQL Server and DB2. Expertise in working with Spring, Struts, JSF, EJB, Ajax, SOAP and REST Web Services and JSON, Hibernate. Experience in writing Struts action classes, Hibernate POJO classes and integrating Struts and Hibernate with Spring for processing business needs. Designed and developed the application using Java Server Faces (JSF) framework and Spring web flow. Performed building and deployment of EAR, WAR, JAR files on test, stage systems in Web Logic Application Server.  Excellent knowledge in OOPS (Object Oriented Programming Structure) Strong knowledge about Multithreading, Collections and Exception handling mechanisms in Java. Implemented single sign-on (SSO) Authentication Scheme with IIS web server for to authenticate and identify users.  Experience in using Maven and ANT for build automation. Expertise in working with GOLANG. Involved with Active Directory and NTLM login methodologies. Knowledge in developing applications using Agile and SCRUM methodologies. Installing and troubleshooting single sign-on hardware and software at facilities throughout the country. Experience in CMS configuration. Expertise in designing and developing enterprise and web applications using java and J2EE technologies like Servlets, JSP, JDBC, JNDI, JMS, JUNIT. Expertise in using version control systems such as CVS, SVN and GIT. Proficient in developing and deploying Java/J2EE applications on Application Servers–JBoss, IBM Web sphere, Web logic and Apache Tomcat. Competent in Database development using SQL, PL/SQL, TSQL, Stored Procedures, Functions, Packages, views, cursors and Triggers.  Experience in using Eclipse IDE, RSA, RAD, WSAD for development. A good team player with excellent communication, presentation and interpersonal skills and ability to prioritize and coordinate work across different geographic locations. Education: Bachelor of Technology from JNTUH, India. Technical Skills: Professional Experience: Mazda, Irvine - CA\t\t\t\t\t                                             April ’15 – Till Date Role – Sr. Java Developer Description: The project is all about the reach of the product worldwide. This project is the application that holds all the details about the product and the customer details and invoices. This system also holds the information about the various models and the redesigning done for the customers and its invoices. This application was mainly used to determine the kind of vehicles are mostly preferred by the customers and what all the modifications that can be accommodated to increase their customer base. Responsibilities: Working closely with the customers and involved in reviewing and understanding the Business requirements. Actively involved in requirement understanding discussion, technical architecture discussion, knowledge sharing, design discussion with Customers and Offshore team members. Developed front-end/presentation tier using Ext-Js JavaScript library. Involved in developing the Controller framework using Annotated REST based spring controller. Involved in setting up the application Service layer using SpringIOC framework. Used Oracle data base for storage and retrieval of data from the database. Expertise in migration and upgrading of WebLogic Server and updating JDK versions and installing Service Packs of WebLogic server  Involved in setting up multi data source Spring-Hibernate integration, created configurations for AOP transactions. Developed Web services using Apache Axis SOAP engine that would be exposed to external applications to retrieve data from e-Client servicing platform. Developed and consumed web services using Jersey REST Client. Developed single page web application using Angular JS for front end. Used Python scripts to update content in the database and manipulate files. Design & Develop single page, responsive web application interface using custom MVC JavaScript framework, Ractive.js, Html 5, JavaScript. Managed and Maintained Oracle and NoSQL Databases in Production domain  Implemented Single Sign on (SSO) Authentication Scheme with IIS web server for to authenticate and identify users.  Worked on Creating Security Roles, Micro Strategy User Groups and Users, assigning security roles to Users and Groups.  Involved in developing Servlet based services for cross region system communication.  MicroStrategy scripting for automated reporting object deployment. Involved in Active Directory and NTLM login methodologies. Implemented various J2EE Design patterns like Singleton, Service Locator, Business Delegate, DAO, Transfer Object, and SOA.  Developed and Performed Test Batches/Interfaces as per design Writing the GOLANG programs to maintain large amounts of code. Involved in application specific Data modeling and used Hibernate frame work. Involved in writing ANT build scripts for building front end frameworks, controller layer, service frameworks and Web service modules. Involved in assigning work to the team members, technical guidance to the team and reviewing the deliverables from offshore to ensure the deliverables with high quality. Environment:WebSphere Application server 7.0, Spring 3.1.1, Hibernate, Micro Strategy web, Micro Strategy Dashboards,Single Sign-on , Micro Strategy Web server, WebLogic Server,Unix, Oracle 10i, Ext-JS 3.1, Rational Application Developer 7.5.4, Axis Web services 1.4, Java/J2EE, Spring,Spring Web Flow,SOAP web services, Jersey REST, Multithreading, JMS, JSF, JUNIT 3.0, ANT, CVS, Apache axis2 and CXF,. SuperValu Inc, Salt Lake City - UT\t\t\t\t\t                   Oct’13 – April ’15 Role –Sr. Java/J2EE Developer Description: This application automates the process of introducing a new product in a store. It allows the internal users (called Category Managers) to create new products at corporate level and add these in different regions. Application business logic includes past sales history, and consumer purchase patterns to optimize the pricing and inventory at each region. Responsibilities: Worked on customer site for application implementation, UAT support and knowledge sharing with customer Handled Base Portal design, portal layout and skeleton components development Took ownership of the Portal Investments (Time deposit, Call deposit) module and leading the team for implementing the Investments module Worked on Ext-JS based portal front office UI solution & worked on migration of portal back office to use JQuery ajax and Angular JS features Involved in preparing Portal installation document, portal architecture document, Investments module design document and developing core application frameworks Involved in tool based application performance tuning which includes identifying the bottlenecks and providing resolution in the architecture, application design, application code and database queries Involved in functional specification reviews, design reviews, code reviews, test case reviews and tracking all the issues identified in the reviews to closure. Developed REST architecture based web services to facilitate communication between client and servers. Used the light weight container of the Spring Frame work to provide architectural flexibility for inversion of controller (IOC). Implemented the caching mechanism in Hibernate to load data from Oracle database. Implemented application level persistence using Hibernate and Spring. Managed and Maintained Oracle and NoSQL Databases in Production domain  Infrastructure member of a worldwide cloud initiative and team lead of OpenStack cloud platform deployment with compute-Nova, network-Neutron, dashboard-Horizon, block storage-Cider, identity- Keystone, deployment/management-Fuel and orchestration service-Heat along with MongoDB, MariaDB, Cassandra databases, application configuration and automation tools such as: Chef and Puppet.  Providing the status updates to management, in case of any deviation in original plan alerting the management upfront and take corrective actions Involved in project team induction and training Involved in writing MAVEN and BAMBOO build scripts for building front end frameworks. Environment:WebLogic Portal server 10.2, JSR168 Portlet, CMS Experience, WebSphere, RAD, Polaris Intellect J2ee framework, Java/J2EE, Spring, Struts, EJB 2.1, Struts 1.2, JMS, Windows XP, Unix, Oracle 10i, JQuery1.7.1, BIRT Chart Library 3.0, WebLogic Workspace studio 10.2 and Eclipse 3.3, Axis Web services 1.4, Hibernate 3.3.2 Grand Bank of Texas, Dallas - TX\t\t\t\t\t                     Mar’12 – Sep’13 Role – Java Developer Description: This application involves core banking, consumer and corporate e-banking, mobiles banking and web based cash management of universal banks Worldwide. It implements features like user validation and profile management. It also provides functionalities to manage various accounts, bill payments and transactions Responsibilities: Involved in the development of various use cases, sequence diagrams using UML. Involved in design and development of architecture of the application using MVC Model 2 design patterns and Struts framework using JSP and controller Servlets.  Used Enterprise JavaBeans for processing business rules.  Developed the spring AOP programming to configure logging for the application. Implemented service Oriented Architecture developed web service components, which were acting as producers and consumers. Designed and developed interactive static HTML screens as screen level prototype Also used Angular JS to create single page applications. Implemented web services using SOAP protocol for transferring message to MQ-Series and also made Asset component as a service. Developed JavaScript for client side validation and developed Cascading Style Sheet (CSS). Involved in design and development of JSP based presentation layer for web based account inquiry using Struts custom tags, DHTML, HTML, and JavaScript.  Developed server side application which handles the database manipulation with the back-end Oracle 9i database using JDBC 2.0. Involved in using Performance monitoring tools. Developed PL/SQL, stored procedures and functions to manipulate the database. Deployed the application components into BEA WebLogic application server. Environment:J2SE, Core Java 1.5, JSP 1.2, Servlets 2.3, Struts 2, EJB 2.0, JDBC 2.0, JSF, Ant, Log4j, JUnit, BEA WebLogic application server, Oracle 9i, HTML, DHTML, CSS, XHTML, JavaScript. Thomson Reuters, Hyderabad–India                                                                                        Aug’10- Feb’12 Role – Java Developer Description: Thomson Reuters the world's leading source of intelligent information for businesses and professionals. Thomson ONE contains tools for market research, analysis, monitoring, portfolio management and more. Thomson ReutersPropGen is an innovative sales proposal generator tool that allows a Financial Advisor to create multi-asset investment proposal recommendations using analysis of client's portfolio and investments. PropGen tool allows creation of investment roadmap, Product Catalog to filter, compare and select suitable securities and investment products and access to Thomson Reuter's comprehensive database of mutual funds, variable annuities and stocks. \t\t\t\t\t Responsibilities: Study and analyse the business process flow and existing system. Participated in design discussions and object model development workshop sessions for different lines of business.  Configured Hibernate second level cache using EHCache to reduce the number of hits to the configuration table data Developed various Servlets and Java Interfaces as part of the integration and process flow required for the system. Worked on the Spring framework like Spring IOC and Spring DAO. Identified the areas of improvement and the scope of the enhancements in the system. Upgraded this application from application wise storage to Lever-wise storage for better relation and feasibility with client. Created a loosely couple component model to give the better flexibility to handle frequent business changes. Involved in developing Use Case, Class, and Sequence& Components Diagrams as part of the documentation. Environment:Core Java 1.4, JSP, Servlets, EJB 2.0, Websphere Application Server, Oracle 10g Database, Toad 9.7, SVN (Subversion Version Control System), My Eclipse IDE. Synfosys, Hyderabad – India                                                                                                 June ’08 -  Aug’10 Java Developer Description: This software aims at totally managing the day-to-day task management of Software Company. It is used to assign tasks for the users. The user for whom task is allotted can view his task; enter status and deviation for the task. The PM or PL views the task with its status and deviation and enters comments for the task. Task can also be assigned to the users through email.  Responsibilities:  Designed the Front-end screens (GUI) using JSP, Servlets, HTML and JavaScript. Developed the Action Classes, Action Form Classes, created JSPs using Struts tag libraries and configured in Struts-config.xml, Web.xml files. Worked on Java, JDBC, XML and XSLT. Used Eclipse as the development tool. Performed code review and unit testing for the application. Committing the updated files to repository using SVN. Designed and developed Framework Components using different design patterns, involved in designing MVC pattern using Struts Framework. Created several Exception classes to catch the error for a bug free and environment and orderly logged the whole process using log4j, which gives the ability to pinpoint the errors. Involved in Deploying and Configuring applications in Web Logic Server. Environment: Java SE5, J2EE1.4,Struts1.3, JSP2.0, Servlets2.5, JDBC3.0, HTML, XML, CSS, SVN, SQL, XSLT, Eclipse3.4, Oracle10g Database, Web Logic Server10.0, Log4J and Windows."}