{"text": "Name: anna anna E-Mail: anna.anna@gmail.com Address: Jieyang, China Github: https://github.com/anna LinkedIn: https://linkedin.com/anna Phone No. 164117594118 Summary of Qualifications Proactive, and result oriented Sr. Business Systems Analyst with 8+ years of experience in business Requirements Gathering and analysis, Object-Oriented Design, Data Modeling, application development, maintenance and IT service management. Extensive experience in Software Development Life Cycle (SDLC) methodologies and techniques with expertise in Requirements Gathering, Analysis, Development, and post-production support of various applications. Expert in creating Specifications and developing Conceptual, Logical/Physical ER Diagrams. Extensive years of experience in Business process re-engineering, Business process improvements, Historical Data Reports Analysis. Extensive working knowledge in various SDLC methodologies like Waterfall, Agile Scrum and Rational Unified Process (RUP).  Analyzed source systems, business requirements, and developed User, Functional and Non-Functional requirements. Experienced in client-oriented roles in domains like Finance, Wealth Management, Banking and E-Commerce, Information Technology (I.T.). Business writing skills in creating Business requirements document (BRD), Use-Case Specifications, Systems Requirements Specification (SRS), High level and Low level documents (HLD/LLD). Proficiency in gathering SMART (Specific, Measurable, Attainable, Realistic, Timely) requirements and transforming them into functional specifications focusing on workflow analysis and design, user interface design, and process flow modeling. Good understanding in preparing Responsible, Accountable, Consulted, and Informed (RACI) Matrix. Organized and facilitated Requirements Gathering Sessions and JAD sessions with Subject Matter Experts (SME’s) and stakeholders in order to document decisions regarding future state of business processes. Well acquainted with workflows and Unified Modeling Language (UML) diagrams such as Use case diagrams, Activity diagrams and Sequence diagrams, thereby helping the development team in understanding the requirements. High expertise in tracing requirements throughout the development process and verifying adherence to Requirement Traceability Matrix(RTM). Proven successin eliciting requirement, As-Is and To-Be analysis, GAP analysis, Cost benefit analysis, Risk assessment, and SWOT analysis. Exceptional ability to visualize and develop fully integrated solutions by assessing current situations and business issues from people, process, and technology perspectives. Extensive knowledge of Object-Oriented Programing (OOPS)concepts, MS Office Suite, MS Project, and gathering user requirements and technical documentation. Proficient in writing User Stories and handling the Requirements Churn in the Scrum. Facilitated Sprint ceremonies for each sprint in Agile Scrum Methodology as Scrum Master. Highly skilled as Scrum Master in facilitating scrum team to perform better and conducting Planning poker, MoSCoW and other techniques in Scrum Process.  Good knowledge in writing Data Dictionary for data models. Designed and implemented SQL queries using joins, unions, outer joins, group by and aggregate functions to extract data from different databases (Oracle, SQL Server) for timely reporting and validation. Very good understanding of database concepts like Data Warehousing, Data Structures, Schemas, Data Marts, Data-Entity Relationships and User Administration. Involved with extensive client interactions and converting business functionalities into Service Oriented Architecture (SOA) models across heterogeneous IT environments. Experienced working in Three-tier architecture, Ajax, Web Services (SOAP, WSDL), and Client Side Validation as well as Server Side Validations. Collaborated in various types of testing like Functional (Black-Box) testing, End to End Testing, Regression Testing, and User Acceptance Testing (UAT). Excellent communication and interpersonal skills, capable of communicating with highly technical engineering teams. Exceptional mediator between external and internal customers, capable of interpreting their needs and positions to ensure the coherence and success of the projects. CERTIFICATION Scrum Master Accredited Certification (SMAC) TECHNICAL SKILLS EDUCATION B-Tech in Computer Science and Engineering PROFESSIONAL EXPERIENCE JP Morgan Chase, Columbus, OH\t\t\t\t\t\t\t\t      June 2014 – Present Sr. Business System Analyst Project Description:The project was interrelated between Mortgage and Insurance with two different work streams. The first work stream was in regarding to high risk loans, the option was given to worthy customers that they could avail insurance on high risk loans. The second work stream was based on newly avail home loan, an insurance option was given on the newly purchased home. Roles and Responsibilities:  Developed a good knowledge of Amortization, Bi-Weekly Mortgage, Fixed Rate Mortgage, Adjustable-rate mortgage (ARM), Annual percentage rate (APR), Balloon payment, Two-step mortgage, Foreclosure. Used JIRA to keep track of the issues that are logged and in-progress along with the person responsible. It helps to generate reports to see the current status of the issue. Used Agile Scrum Methodology for the iterative development of the application and facilitated weekly sprints and daily stand up meetings. Actively Involved in Pre-Analysis of project withSubject Matter Experts (SMEs) and Development team. Involved in the development of reports from Data Warehousing Systemas part of the redesign of the Mortgage Asset Management System. Captured and defined the vision and scope of the project in the Functional Requirement document/Technical Specification Requirement Document. Gathered and documented business requirements from user groups, stakeholders and vendors by using MoSCoW technique, conducting open and closed interviews and discussions sessions. Created Pre-JAD artifacts and Post-JAD artifacts, and facilitated JAD sessions for better understanding and refining of requirements in coordination with teams. Conducted Sprint Planning Meetings with product owners and development team to kick off the Sprint. Involved in interviewing business users, asking detailed questions and carefully recording the requirements to convert them into User Stories. Managed business requirements and documented Requirements Traceability Matrix (RTM) in Requisite Pro. Provided Gap Analysis, Cost Benefit Analysis and understanding the business perspectives on many financial and operational issues. Implemented SWOT analysisto short list all the shortcomings as well as the strengths, and to understand various opportunities. Worked on all aspects of data warehouse development including data modeling, data analysis/design, cube building and ETL functionality under an SOA platform. Created Use Cases, Class diagrams, Sequence diagrams, Activity diagrams etc. using UML tools. Generated process flows to understand the various steps in the Mortgage loan lifecycle and desired functionality of the new system by interacting with users, management, SME, stakeholders, lenders and underwriters. Overlooked scripting of Client Side Validation and Server Side Validation to ensure inclusion of functionalities based on the new enhancement of the project. Involved in business requirements, analysis, design, project planning & scheduling, creating UAT Test Cases. Utilized SQL to query tables in retrieving sample data from mortgage customer profiles stored in the system. Generated ad hoc SQL queries using joins, database connections and transformation rules to fetch data from the SQL Server database systems. Used Cognos dashboard to generate a report to highlight the requirement pass/fail in testing during UAT. Used Tableau to give live demo of the projectby visualizing and analyzing all the data, create dashboards to consolidate views and also to keep tracking of various tasks of project. Collaborated with the implementation team and provided guidance for the development/integration team. Environment: Agile-Scrum, SharePoint(2010), Microsoft Office, HP ALM v11.5, Oracle, .Net, Spot-fire, JIRA, HPQC, SQL Server, MS-Visio, IBM Cognos PricewaterhouseCoopers (PWC), Tampa, Florida\t\t\t\t\t\t\t     April 2013 – April 2014 Business System Analyst/Scrum Master Project Description: The project was to add a new module in previous development of wealth management platform to create a scenario analysis where financial analyst could be able to manage the investment in the best possible way by addressing the uncertainty and visualizing how the investment will behave in best case scenarios and worst case scenarios. The scenario was analyzed through three major modules, which were, historical back-testing, current scenario, and forward looking hypothetical assumptions. Roles and Responsibilities: Analyzed the prior documentation and business processes for full understanding of the project. Interviewed area experts, asking detailed questions and carefully recording the requirements in a format that can be reviewed and understood by both business people and technical people. Developed good knowledge of Asset Allocation, Commodities, Bond Pricing,Corporate Bonds, Fixed Income, Credit Risk, Market Risk, Standard & Poor’s 500 (S&P 500) Index, Share Buyback, Payout Ratio. Gathered Business Requirements, through constant interaction with the Product owner, SME’s, Designer and Developers to get a better understanding of the business processes. Analyzed and optimized the complete processand prepared Business Requirement Document (BRD) and Functional Requirement Document (FRD). Coordinated and conducted Joint Application Development (JAD) and walk through sessions involving business unit stakeholders, and technical analyst utilizing strong interpersonal, oral and written communication skills. Performed Gap Analysis of business rules and system process flows to define current processes and determine future business requirements, creating As Is/To Be mapping for all new enhancements. Experience capturing all aspects of Wealth Management through Use Cases &Process Flow Diagrams using MS Visio and UML modeling diagrams such as Activity Diagram, Class Diagram, Sequence Diagram using IBM Rational Rose. Helped developers in making the application more live by putting more dynamic content by using Java Script. Provided technical assistance in identifying, evaluating, and developing systems and procedures that were cost effective and met business requirements. Worked with Project Management resource, Revenue Planning, Budget Allocation, Work Breakdown Structure (Monitoring and Reporting Progress). Identified all back-end dependencies for .Net framework and documented them in requirements documentation and design document. Conducted Stand-Up Meetings and created Sprint Burn-Down Charts to understand the remaining work and calculated the Velocity to make sure teams involvement in the work. Identified and created User Stories and Use Cases from requirements for the better understanding of the team. Coordinated and prioritized outstanding defects and system requests and prepared Requirement Traceability Matrixes (RTM) to track such requirements. Extensively worked on the SharePoint application and managed the enterprise content and document management. Assisted ETL developers mapping the extracted data from source system and load into the target system after applying required transformation. Wrote SQL Queries to extract data from different data sources to map into central repository using Informatica. Put all the data in BRD which also included the look of the system through GUI screen using MS Visio. Actively involved in the creation of Test Plan, Test cases and involved in User Acceptance Testing (UAT). Environment: Agile-Scrum, JIRA, SQL Server, Informatica, MS Office, .Net, SharePoint (2010), MS Project, MS Visio , HP ALM, XML, Oracle, IBM Rational Rose Direct Buy, Merrillville, IN\t\t\t\t\t\t\t\t\t\t  Nov 2011 - March 2013 \tSr. Business Analyst Project Description The scope of the project was to provide a new functionality of cashback &reward program in an existing E-commerce platform. The new functionality was able to register interested customers and based on their purchasing habits system could generate various cashbacks & rewards options. Along with this functionality a new feature of Google ad-sense was implemented which works as pay-per-click technology. Roles and Responsibilities: Gathered business requirements by participating in JAD sessions, interviewing business users and stakeholders, conducting one to one sessions and consulting existing systems documents. Assisted in Use Case Modeling and prepared Functional Requirements documents (FRD). Used Waterfall Methodology throughout the project lifecycle. Coordinated and controlled Change Request for the clients by conducting impact and cost analysis, prioritizing and mitigating changes. Prepared Change Request form to provide details of the changes requests, and obtained approvals from the appropriate stakeholders. Performed SWOT and GAP Analysis to discover new functionality requirements, prioritized them on the basis of actual business needs. Designed and developed Use Case diagrams andalso involved with design team in creation of Activity Diagrams and Sequence Diagrams to depict process flows. Used MS Visio for Process modeling, Process mapping and Business Process flow diagrams. Understood the As-Is system, developed the To-Be system concepts and also prepared the System Process Maps. Performed requirement analysis by gathering both functional and non-functional requirements based on interactions with the process owners & stakeholders. Also documented and represented them in Requirements Traceability Matrix (RTM) using IBM Requisite Pro. Developed conceptual and logical ER diagrams for the database. Created Data Dictionary for the data models. Strong knowledge of Client-Server validations and developed client validations using JavaScript. Good knowledge of IIS web server that is used to host all the websites. Performed Data Mappings based on the specified business requirements. Developed project schedules, timelines, status, system schematics and process work flows. Managed changes and worked on the change requests during all phases of the project. Presented meeting agendas and progress of the project to the senior management. Assisted and guided software architects and developers during the design and development phase. Strong knowledge of SOAP and WSDL to understand the requirements. Good knowledge on SOA that is predominant for the e-commerce, which is a 3-tier architecture. Assisted in design review meetings to make sure all the requirements are covered in the development project scope. Worked with the project manager to organize project activities and to communicate with other business center managers and stakeholders of the project. Involved in writing Test Plans, Test Cases and Test Scripts usingHP Quality Center. Discussed limitations, risk, dependencies and assumptions pertaining to the scope of the application. Extensive documentation using Word, Excel and Visio. Involved in User Acceptance Testing (UAT) for successful implementation of requirements and generation of reports. Used JIRA for defect tracking, facilitating and monitoring the process. Environment:MS Visio, MS Word, MS Excel, SQL, MS Access, Clear Case, Clear Quest, Waterfall HDFC Bank, Noida, India  \t\t\t\t\t\t\t\t\t\t   Feb 2010 – Sept 2011 Business Analyst Project description:The project was an enhancement to existing Online Banking Portal that will help customers to apply for credit card account via Internet. System also allowed user to update profile online and to submit credit card payments online. Roles and Responsibilities: Gathered business requirements by driving user-group meetings and working with various global, cross-functional and virtual teams. Prepared project deliverables throughbusiness workflow analysis, process analysis, user requirement documents (Use Cases & Use case diagrams) and managed the requirements. Responsible for business system analysis of customizing the product with SDLC. Documenting artifacts including, but not limited to, Functional Specifications, and the Use Case Specifications. Responsible for understanding current processes and tools and experience in reviewing and analyzing documentation. Experienced in working with technical writing teams and ensures the delivery of a high quality software application. Identified all use case components including basic, alternate and exception flows. Used Visio to model the process using UML to create Behavioral and Structural Diagrams. Experience in Facilitating organizational change strategy development and objective setting with a cross-functional group of Business/State stakeholders. Created examine matrix, used quality heart for test management, watch and report system defects and bugs fixes. Designed and developed Use Cases, Use stories, Activity Diagrams, Sequence Diagrams, UML and Business Process Modeling. Conducted client side validation to study ETL operations on the involved databases and the Data Warehouse. Trained the designers and developers on logic operations for credit insurance and other type of policies. Created test input requirements and prepare test data for data driven testing. Used HP QC and Load Runner forfunctional, GUI, performance, load testing. Worked along with the development team to solve browser compatibility issues. Environment:Waterfall, SharePoint (2007),MS Visio, MS Office, MS Project, SOA, MS Access, Oracle, HP QC, HP LoadRunner HSBC, New Delhi, India\t\t\t\t\t\t\t\t\t\t    Nov 2008 – Jan 2010 Business Analyst Project Description:The project is about enhancing the payment management module of the company. The project deals with creating addition functionalities of payment methods. Roles and Responsibilities: Worked closely with key stakeholders, Subject matter experts (SME's) and cross functional teams to gather business requirements. Acted as a liaison between the technology team and business users. Used Waterfall methodology for the development lifecycle. Involved in creating business processes and conceptual and logical data modeling diagrams using MS Visio. Prepared the Functional specifications, and tested the interfaces. Conducted meetings to understand the workflow, processes and assisted inGap analysis to derive requirements for existing systems enhancements. Troubleshooting and advised about various compatibility issues on multiple platforms. Identified and documented use casesunder Waterfall methodology. Synthesized User Interface and Business Process Requirements and translated it into the Business Requirement Document(BRD), to be used as input to the functional design specifications. Defined As-Is and To-Be systems, Use Cases and Use Case Scenarios using Rational Rose. Created and worked onUse Case Diagrams, Activity Diagrams, Flow Diagrams. Facilitated with JAD sessions with the management groups, vendors, users and the IT Group for open and pending issues to develop specifications. Facilitated various issue resolution and defect resolution meetings. Conducted Functional Walkthroughs, coaching as well as User Acceptance Testing (UAT) sessions. Held team discussions to deliberate over various scenarios that could take place and impact the project. Assisted Project Manager with time-capacity and resource management. Environment:MS-Office Suite, MS-Visio, UML, Rational Rose, MS Project, Unix, HPQC 10, SQL, Java script, HTML, SQL server, Oracle and Waterfall State Bank of India, Noida, India\t\t\t\t\t\t\t\t\t      Sept 2007 - Oct 2008 Business Analyst Project Description:The scope of the platform was enormous and includes customer relationship management (CRM), investment management, and portfolio accounting, brokerage, account reconciliation processing, and order management. Roles and Responsibilities: Interacted with prospects, clients and industry representatives in gathering business requirements and ensure that end deliverables meet original client needs. Actively participated in focused session to gather requirement and documented them modeling UI Diagrams. Facilitated and coordinating meetings and workshops to establish relationships within the internal and external business community. Worked with development project teams with regards to functional specifications, quality assurance scripting, and product rollout. Proactively recommended innovations and modifications which were in compliance with industry requirements and consistent with corporate objectives and goals to improve operational processes, systems, policies and procedures. Utilized business-process methodologies to facilitate the streamlining of design processes through business and technical resources within component-based architecture. Reviewing, analyzing, evaluating and recommending business systems, component applications and user needs. Composed detailed descriptions of user needs, program functions, and steps required to develop or modify applications. Worked with software engineers and business units, assisted in formulating and defining system scope and objectives through research and fact-finding, combined with a basic understanding of business systems and industry requirements. Documented and communicated key decisions, open issues, case studies, workflow and functional requirements. Created UML use case, activity diagrams for the interaction between the analyst reports and reporting systems. Assisted quality assurance with creation and execution of acceptance tests as needed. ENVIRONMENT:Waterfall, MS Visio, MS Office Suite, UML, Windows XP, MS Project"}