{"text": "Name: agnes agnes E-Mail: agnes.agnes@gmail.com Address: Fuzhou, China Github: https://github.com/agnes LinkedIn: https://linkedin.com/agnes Phone No. 15094105259 Professional Summary: Experience in all phases of Software Development Life Cycle (SDLC) which involves requirement gathering, requirement analysis, design, development, implementation & enhancement of projects in SalesForce.com. Experience in working across various SFDC implementations covering Sales Cloud, Service Cloud, Salesforce1 Mobile Administration. Extensively workedon SOAP and REST APIs Integration and design necessary data flow integration. Experience in Object Oriented Analysis / Design / Development / Testing and Implementation, Client/Server Architecture. Experience in Salesforce Lightning components design & amp, designing compact layouts using Apex triggers, Page layouts, Visualforce pages, workflows for Mobile platform. Experience in Service cloud and Sales cloud administration. Knowledge on Marketing Cloud- Marketing Campaigns, Campaigns hierarchies, Lead Queries, Assignment Rules, Web-to-Lead and Auto Response Rules. Experienced in creating the Lightning components and Lightning Applications. Worked with Salesforce Marketing Cloud to gather customers from social media. Set up Marketing Campaigns, Campaign Hierarchies, and Lead Queries, Assignment rules, Web-to-Lead and Auto-Response rules. Developed Table View for related lists using Lightening Components, Controller, Helper class . Extensive experience in developing APEX classes, Triggers, Visual force pages, Controllers, writing Workflows, Integration and Force.com API.  Experience in working for Financial domain based projects. Experience working across various SFDC full life cycle implementations covering Service Cloud, Sales Cloud, Custom Cloud, Marketing Cloud, Knowledge Management, Sales / Service Cloud Custom Application Development and configuring cloud applications. In-depth understanding of CRM business processes like Forecasting, Campaign management, Lead Management, Order Management, Account Management, Case Management and merging management. Experience working with Force.com IDE, data migration and updates through the tool App Exchange Data Loader in Salesforce.com. Good understanding of CPQ. Extensive work experience on designing of custom objects, custom fields, role based page layouts, custom Tabs, custom reports, report folders, report extractions to various formats, design of Visualforce Pages, Snapshots, Dashboards. Strong working experience with various salesforce.com standard objects like Accounts, Contacts, Opportunities, Products and Price books, Cases, Leads, Campaigns, Forecasting, Reports and Dashboards. Experience in installing Salesforce AppExchange Apps, configured and maintained user security permissions in compliance with organizational needs. Experience in creating many Work Flows, Validation rules, Approval Processes, Triggers, Sharing Rules and also the most complex Apex classes to meet the client’s requirement and functionality. Proficient in Creating Custom Page layouts based on record types design and implementation. Experience in designing junction objects and implemented various advanced fields like Pick list, Custom Formula Fields, Field Dependencies, Validation Rules, Work Flows, and Approval Processes for automated alerts, field updates, and Email generation according to application requirements. Expertise in designing & developing dynamic web content using Ajax, JSF, JSP,HTML, XML, JavaScript & other web development tools/technologies. Expertise with Object Oriented Design (OOD), Analysis (OOA), based on Unified Modeling Language (UML) architecture. Hands on Experienced in database development using SQL/PL-SQL in MySQL, SQL Server 2005, Oracle. Good exposure to RDBMS, SQL and PL/SQL, writing SQL scripts for efficient report generation. Excellent communication and inter-personal skills, accustomed to working in both large and small team environments. Highly motivated self-starter with Excellent Communication, Presentation and Problem Solving Skills and committed to learning new technologies. Technical Skills: SFDC Technology      :Apex classes, controllers and extensions, Apex, Triggers,     Visual Force Page, SOQL, SOSL, Jquery. SFDC Tools                :Apex Data Loader, Informatica Cloud, Cadence, COGNOS \t                        Force.com IDE (Eclipse). Certifications: Certified in ADM 201. Certified as a Platform Developer 1. OPTUM - UHG, Minneapolis MN\t\t\t\t Aug 16 – Present Sr. SalesforceDeveloper Responsibilities: Performed the role Salesforce Developer in the organization. Design and Develop Technical Document following best practices. Implemented Apex classes as per the needs of the application. Extensively worked on REST and SOAP Integrations. Worked on Service Cloud and Sales Cloud simultaneously.  Hands on experience in using the Aura framework and Salesforce lightning Design System (SLDS). Developed Process Flow for custom objects using Lightening Design System components which helped business units to have an overview of the record status. Setup LiveAgent as part of case management implementation inside service cloud. Extensively worked on End-to-End real-time web Service integration Customized Service cloud with service console, Cases, Chatter Answers. Developed Triggers, Apex classes and visual force pages as per the needs of the application Created mini page layouts, search layouts and page layouts to organize custom fields, custom links and other components on detail and edit pages of the record. Worked on standard objects like Accounts, Contacts, Leads, Campaigns, Reports, Cases (case management) and Opportunities. Experience on Data Loader. Worked on Salesforce Lightning Design Systems (SLDS) components in the Lightning Application.  Implemented the new country and state pick list. Created custom objects, custom fields, pick lists, field dependencies and validation rules. Created page layouts, search layouts, custom links, related lists, workflows and other components on a record detail and edit pages. Developed Process Flow for custom objects using Lightening Design System components which helped business units to have an overview of the record status. Maintained user security permissions as per the organizational needs. Created Custom Objects and defined lookup and master-detail relationships on the objects and created junction objects to establish many-to-many relationship among objects. Configured the business login hours, Profile based login IP address restrictions and Organization wide login IP address restrictions. Implemented the application requirements on Force.com IDE Plug-in using Eclipse. Migration of code to deployment after the successful testing on the sandbox Communicated regularly with the SFDC designated super users to support them in their role and provide information and training on new features and functionality. Worked on Custom Labels and Custom Settings. Setting up different languages. Implemented Salesforce.com web services client using Salesforce web services API, Java, XML and partner WSDL. Environment:Salesforce.com, Visual force (Pages, Component, & Controllers), Lightning Component, Sales Cloud, Service Cloud Security Control. AT&T, Chicago, IL.\t\t\t\t\t Jan 15– Jul 16 Sr.SalesforceDeveloper/Admin Responsibilities: Extensively worked on End-to-End real-time web Service integration Performed the role Salesforce Developer and Admin in the organization. Implemented Apex classes & Triggers as per the needs of the application. Created Users, roles, profiles, public groups and implemented role hierarchies and sharing rules to provide shared access among different users. Experience on Data Loader.  Design and Develop Technical Document following best practices. Setup LiveAgent as part of case management implementation inside service cloud. Implemented the duplicate management rules on contact and Account. Implemented the new country and state pick list. Experience with Salesforce &Force.com Platforms in all aspects (customization, design and security, managing an App at AppExchange). Lightning, Process Builder, Dataloader. Customized Service cloud with service console, Cases, Chatter Answers. Worked on Service Cloud and Sales Cloud simultaneously.  Worked on standard objects like Accounts, Contacts, Leads, Campaigns, Reports, Cases (case management) and Opportunities. Set up Marketing Campaigns, Campaigns hierarchies, Lead Queries, Assignment Rules, Web-to-Lead and Auto Response Rules (Marketing Cloud). Created custom objects, custom fields, pick lists, field dependencies and validation rules. Created page layouts, search layouts, custom links, related lists, workflows and other components on a record detail and edit pages. Worked on CPQ. Worked with Salesforce Marketing Cloud to gather customers from social media. SetupMarketingCampaigns, CampaignHierarchies, and LeadQueries, Assignmentrules, Web-to-Leadand Auto-Responserules. Maintained user security permissions as per the organizational needs. Developed Triggers, Apex classes and visual force pages as per the needs of the application Creating custom objects, custom fields, tabs, Record types and list views.  Created mini page layouts, search layouts and page layouts to organize custom fields, custom links and other components on detail and edit pages of the record. Created Custom Objects and defined lookup and master-detail relationships on the objects and created junction objects to establish many-to-many relationship among objects. Created the workflows for automated lead routing, lead escalation, alerts and custom coaching plans. Configured the business login hours, Profile based login IP address restrictions and Organization wide login IP address restrictions. Developed Apex classes, Lightning components, triggers and explored FSC functionalities customize as per the business needs. Implemented the application requirements on Force.com IDE Plug-in using Eclipse. Created test scenarios and packages in sandboxes and migrated them to the production. Migration of code to deployment after the successful testing on the sandbox Communicated regularly with the SFDC designated super users to support them in their role and provide information and training on new features and functionality. Worked on Custom Labels and Custom Settings. Setting up different languages. Worked on different types of email templates. Implemented Salesforce.com web services client using Sales force web services API, Java, XML and partner WSDL. Involved in authoring Business Requirement Documents (BRD) into System Requirement Specifications (SRS) and identifying interface and business process specifications. Environment:Salesforce.com, Visual force (Pages, Component, & Controllers), Sales Cloud, Service Cloud Security Controls, Escalation rules, Marketing Cloud, Assignment rules, Record types, Custom objects and Fields, Time based triggers, Triggers, Workflow Rules, Data loader, SOQL, SOSL, Lightning Component, Apex Schema Builders, and Custom Tabs, Advanced use of Microsoft Excel. Dell | Dell Financial Services, Austin TX.                    Sep 13 – Dec 14 Sr. Salesforce Developer/Admin Responsibilities: Performed the roles of Salesforce.com Administrator in the organization. Interacted with various business user groups to gather the document requirements. Experience on Data Loader. Worked closely with sales team and business analysts to perform detailed analysis of business and technical requirements and designed the solution by customizing various standard objects of SalesForce.com (SFDC). Created Web to Lead for partner on boarding and deal registration forms. Developed Queues for the specific leads based on the lead assignment rules. Created approval process for the partner and deal registration users. Set up Marketing Campaigns, Campaigns hierarchies, Lead Queries, Assignment Rules, Web-to-Lead and Auto Response Rules. Service Cloud enhancements - Portal entitlement wizard changes (discovery & design). Implemented the logic to find the existing matches for the account, contact and opportunity. Wrote various queries in generating reports using combination of custom objects and standard objects. Designed and deployed Custom tabs, Custom Objects, Components, Visual Force Pages, Entity-Relationship data model, validation rules, Approval Processes and Auto-Response Rules for automating business logic. Used Force.com developer toolkit including Apex Classes, Apex Triggers and Visualforce pages to develop custom business logic. Performed administration tasks as needed, managing custom fields, integration and data cleanup. Involved in security levels and privileges by customizing Salesforce.com Profiles and Roles. Migrated Accounts, Leads, Contacts, Opportunities and sales data from external systems into Quest Salesforce.com instance. Worked with field & page layout customization for the standard objects like Account, contact, Leads. Involved in customizing custom objects, tabs, fields, page layout as per the business need.  Worked on moving data from external legacy system into Salesforce application using Informatica cloud, Apex Data loader& CSV files. Used the sandbox for testing and migrated the code to the deployment instance after testing. Worked on Unit testing, for the customizations and developments done during the project. Provided the training to the internal business users to use the application and develop their own custom reports. Prepared user manual and technical support manual. Environment: Saleforce.com platform, Sales Cloud, Service Cloud, Apex Language, Visualforce Pages, Custom Component, Marketing Cloud, Custom Controllers, Workflow & Approvals, Custom Objects, Custom Tabs, Page Layouts, Data Loader. Northern Trust - Chicago, IL\t\t\t  Mar 12 – Aug 13 Sr. Salesforce Administrator Responsibilities: Involved in Salesforce.com Application Setup activities and customized the applications to match the functional needs of the organization. Performed the roles of Salesforce.com Administrator / Implementer in the organization. Interacted with various business team members to gather and documented the requirements. Implemented the requirements on Salesforce.com platform and Force.com IDE Plug-in using Eclipse. Experience in working across various SFDC implementations covering Sales Cloud, Service Cloud. Customized Service cloud with service console, Cases, Chatter Answers. Closely worked with SalesForce.com consultants while implementing the solutions for the requirements. Worked on various salesforce.com standard objects like Accounts, Contacts, Leads, Campaigns, Reports and Opportunities. Customized the Dashboards to track usage for productivity and performance of business centers and their sales teams.  Designed, Implemented and deployed the Custom objects, Page layouts, Custom tabs, Components and S-Control to suit to the needs of the application. Created Custom Objects and defined lookup and master-detail relationships on the objects and created junction objects to establish many-to-many relationship among objects.  Implemented Marketo in detail for setup for users in such a way that Campaigns help users to evaluate each marketing activity (Marketing Cloud). Installed and configured Marketo AppExchange app to automate and measure demand generation campaigns that generate more high-quality leads (Marketing Cloud). Created the workflows for automated lead routing, lead escalation, alerts and custom coaching plans.  Implemented escalation rules, automatic case generation and their escalation to call center representative, and generated email alerts for quick issue resolution. Performed the role of support engineer for the internal users and helped them in getting used to the application, generated reports and saved them for further access to the users. Used the sandbox for testing and migrated the code to the deployment instance after testing. Supported the data migration activities for migrating the data from various business centers and business center users with the support of Saleforce.com. Involved with Salesforce.com Premier Support and handled the support cases with the help of salesforce.com support. Environment:Force.com, Marketing Cloud, Platform, Salesforce Enterprise Edition, S-Controls, Salesforce.com Custom/Standard Objects, Custom Tabs, Page Layouts, Sales cloud, Service Cloud, Force.com Web Services API, SOQL/SOSL Queries, Workflow & Approvals, Reports, Eclipse, Force.com Eclipse Plug-in, SalesForce.com Sandbox, Email Services, Security Controls, Marketo, HTML, Java Script, CSS,  WSDL, SOAP. Infor Global Solutions, India.                                                            Oct 10-Dec 11                                                         Java Developer Responsibilities: Extensively involved in designing the system and documenting Use Cases, Class diagrams, Sequence diagrams using Visio. Created graphical user interfaces (GUIs) using the JSP components. Client-side validations are done using JavaScript. Involved in installing and configuring WebSphere Application Server for development and deployment. Deployed JSP’s, Servlets and EJB’s onto WebSphere application server. Extensively developed Java Beans Components. Used JUnit for unit testing and for regression tests. Used Ldap for user Authentication. Involved in configuring JDBC connection pooling to access the database server. Wrote SQL queries, stored procedures, modifications to existing database structure as required per addition of new features. Environment:  Java 1.4, J2EE, JSP 2.0, Servlets 2.3, JDBC, EJB 2.1, XML, Struts 1.1, WebSphere Application Server 5.1, WSAD, Oracle 9i, Tomcat 5.0, CVS, HTML, Rational Rose, Junit, JavaScript, UNIX and Windows. Intec Interface GM Pvt Ltd, India.\t\t\t\t    Mar 09 – Oct 10                                                Java/J2EE Programmer Responsibilities: Developed the code using agile methodology with daily meetings to keep track of the progress and Issues pertaining to the project. Worked on implementation of GUI module with Struts Framework. Used Java Database Connectivity (JDBC) to connect from the Java application to the Database. Involved in the Database design like creating tables with constraints and writing SQL queries, Views and functions on Oracle database using TOAD. Designed and developed front end using HTML, CSS, JSP’s, Struts (tiles and tag libraries) and user validations using Java Script, JQuery. Involved in fixing defects using testing tool known as Mercury Quality Center. Worked on My Eclipse and deployed the GTM application using WebLogic Application server. Used Log4j for logging. Used CVS for version control. Involved in testing using JUnit. Involved in designing sequence and class diagrams with UML and Data flow diagrams using eUML2. Environment: Java, Servlets, JSP, Struts, JavaScript, JQuery, HTML, CSS, XML, JDBC, Oracle, TOAD, JUnit, Log4j, Ant, eUML2, Mercury Quality Center, CVS, WebLogic, MyEclipse. Education: Bachelor’s in computer science from India.  References:  Will provide up on Request. "}