{"text": "Name: frances frances E-Mail: frances.frances@gmail.com Address: Zhangzhou, China Github: https://github.com/frances LinkedIn: https://linkedin.com/frances Phone No. 753630690757 PROFESSIONAL SUMMARY Having around 8 years of experience in Information Technology with 4 plus years of executing END-TO-END BPM project in Pega (PRPC) BPM tool (PEGA PRPC v6.2 and 7.1).  Secured PRPC CSA & CSSA Certification. Expertise in analysis, design, development and managing Work Flows, Class Structure design, User Interface (UI), creating various Flow Actions, Activities, Correspondence rules, HTML Fragments, Security and Java in the PRPC application. Experience in design and development of large scale Business Process Management (BPM) and Business Rules Engine (BRE) applications using Pega Rules Process Commander (PRPC). Proficient in Pega Implementation life cycle. The Implementation cycle includes modeling of business process, PRPC tool installation, development, testing, and deployment. Involved in defining Class Structure and Hierarchy based on Pega practiced guardrails. Developed Activities, Properties, Decision Rules, Declarative Rules, When Condition, Process Flow and User Interfaces like Harness & Section. Involved in customizing out of the box reports based on the requirement. Domain knowledge in Insurance and Banking. Expertise in designing complex process flows, UI screens, services, connectors and various other Pega components.  CERTIFICATIONS: Certified PEGA Senior System Architect (CSSA). Certified PEGA System Architect (CSA).  TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE: AIG, IN                                                                                  \t\t\t                      Dec’2014 – Present Sr. Pega SSA  Worked on the project that enables customer to request terms and conditions, update personal information and setup claims directly through the client's website.  The aim of this application is to establish transparency and user friendly straight-forward online procedure in the client's website. Responsibilities: Involved in all phases of SDLC including requirement collection, analysis, design development and testing. Identified work flows, business rules and developed flow charts and activity diagrams. Performed cross browser compatibility analysis and testing. Worked extensively on portal, harness, flow actions and sections. Reviewed Business Requirement Documents and the Technical Specifications. Created Operator ID, Access groups and Access Roles for different customers. Contact Pega Systems with any product specific issues. Extensively used Clipboard and Tracer for debugging of processes developed. Created When Conditions and Validation rules for implementation and validation purpose. Used List View and Summary View rules to create reports. Responsible for code reviews to ensure its compliance with Pega Guardrails. Identified and documented test conditions/scenarios from the business requirements and functional design for claims processing. Environment: Pega PRPC 7.1SP1, Oracle 10g  MasterCard Worldwide, MO                                                  \t\t\t    Nov’2013 – Nov'2014 Sr. Pega SSA  Worked on Card Design, additional & terminate sponsorship and ICA delete application. The Business Rules engine was integrated with various databases and other subsystems to automate the processes from end to end. These applications provide a clear in-sight of the process to the customer. Improved customer experience and reduced the paperwork involved.  Responsibilities: Worked in Agile methodology involving sprint cycle of 1 month.  Involved in Designing, Development, testing and enhancement of the application. Analyze requirements gap and coordinate with Line of Business. Worked extensively on Process flow, Activities, Decision rules and User Interfaces. Implemented complex business logic and involved in Designing High Level Class structure and Work flows using Pega PRPC. Created Access groups and Access Roles for Customer and different teams within MasterCard. Contact Pega Systems with any product specific issues. Involved in the design and development of Look and Feel enhancements of the Application. Troubleshoot issues using Tracer, Clipboard and Log files. Analyze and Improve performance using PAL and DB Trace. Periodically Monitor Log files for abnormal issues. Creation of Rules for Validation, Integration rules like Rule-Connect-SQL using different RDB and Obj methods. Achieved Integration of PRPC systems with External Systems using Connector and Services.  Environment: Pega PRPC 6.1SP2, HTML,  MS Office Suite, MS Visio, JIRA2, Oracle 10g, IBM Web sphere Application Server 7.0.  CITI Mortgage Inc., TX                                                           \t\t\t                  Apr’2012 – May’2013 Sr. Pega SSA The Loan Review system (LRS) application automates the process of quality review (Pre-Purchase Review) of the loans to be purchased by CITI Mortgage from other small vendors.  The system is integrated with the legacy database to fetch new loans for processing and to update the results.  This system will increase the number of loans acquired by the Organization without corresponding increase in the number of employees hired.  Responsibilities: Involved in gathering business requirements, development, production support and enhancement of the application. Responsible for creating the Product/Patch for Production Deployment. Provided Rule set management in various environments. Created various levels of process flows, flow actions, sections, harness, Agents, activities and SLA rules. Responsible for rule set management in all the environments. Responsible for retrieving the pzpvstream column of the pc_work table and sending it to the legacy reporting system in XML format. Integrated the system with legacy database by creating Connect- SOAP and Connect SQL rules. Troubleshoot various issues related to Connect-Soap rules, Reports, Activities, Process flows, Decision Tables,SLA, Flow Actions, Agents and Agent Schedules. Responsible for communicating with the Support Request team of Pega Systems for any product specific bug and hot fix. Defect tracking and resolving using HP Quality Center 9.2. Managed an Off-shore team of 2. Involved in designing the test cases to evaluate the system based on various scenarios. Environment: Pega PRPC 5.5, HP Quality Center, XML, MS Office Suite, MS Visio, Oracle 10g, IBM Web sphere Application Server 6.0. Chartis, Parsippany, NJ     \t\t\t\t\t\t\t      Apr’2011–Mar’2012                                                                               PRPC Developer OneClaim application is for creation of Claim processing for UK, APAC, US region across different LOB’s. During FNOL Claim will be created and assigned to Adjusters. Adjuster can modify the Claim details. Adjusters can add the feature to the particular claim. Application has the functionality of Litigation and settlement.                    Responsibilities:  Understanding the business requirements from the BRD. Analyzing and identifying the rules based on the requirements. Defect Analysis and Bug Fix. Design and construct the User Interface through Harness and Sections which are required for implementing customer requested functionalities Implementing ListToList Controls in the User Interface.  Converting all Assignments to include a Customer defined SLA. Performance tuning by Pega Log Analyzer using Pega log and Alert log.  Modified out of box reports and created new reports using List view and Summary view rules. Applying HotFix and Coordinate with Pega Consultants to resolve any problems raised through SR’s(Service Requests) Troubleshoot and communicate with PEGA Support team in order to resolve technical issues which require hot fix from PEGA systems. Participated in meetings with BAs, DBAs, PM for reviews and walkthroughs Help developers in resolving any issues Provided the weekly project status to the senior management. Environment: Pega PRPC V6.2, AES Performance Monitor Tool, SQL, WebSphere, 6.1,MS Visio 2003 Caritor India Pvt Ltd, India                                                        \t\t\t     Jun’2008 – Mar’2011 Java Developer  Responsibilities:  Perform detailed analysis of project requirements and design application architecture. Design Business validation and implementing them in the Business Objects. Perform reviews of modeling diagrams and source code. Conduct code walk through sessions with the java development team. Since the data that need to be passed between different tiers is huge, used Transfer Object pattern. Used Data Access Objects (DAO) to abstract and encapsulate all access to the data source. Used Persistence – MYSQL service to call the custom selects and updates to the database. Code Generate DAOs Used Locator class to lookup business class and also the success information given a page action. Used Servlets, JSPs, and MVC framework Developing DB mapping XML files in Hibernate. Designing the User interface using JSF, HTML and Java Script. Used Rational Application Developer for Application Development and SVN for version control.  Perform Integration, Unit and Regression testing on the application components. Research & Development activities to solve the technical challenges faced during the development phase of the project. \nEnvironment: Java1.4, J2EE 1.4, JSP 2.0, Servlets 2.4, XML, XSLT, Hibernate, Spring Framework, VSS version controller, MySQL 5.0, UML, Web Sphere portal server 5.0, Rational Application Developer 6.0"}