{"text": "Name: julia julia E-Mail: julia.julia@gmail.com Address: Zhoukou, China Github: https://github.com/julia LinkedIn: https://linkedin.com/julia Phone No. 804693588204 7+ years of diverse experience as a Business Analyst in developing and implementing innovative business processes. In-depth knowledge and experience in full SDLC with RUP, agile and waterfall methodologies. Functional experience in health Care Industry with vast knowledge on Medicare and Medicaid. Expertise in creating the companion guides on various EDI transactions. Specialize in HIPAA 5010 implementation including GAP analysis Expertise in impact analysis on the key application systems (claims processing, reporting, payments) and business process of health insurance companies. Clear understanding of ICD-9-CM and ICD-10-CM/PCS Well versed with ANSI X12, HIPAA and HL7 standards. Facets support systems were used to enable inbound/outbound HIPAA EDI transaction in support of HIPAA 834, 835, 837 270/271 transactions. Medical Claims experience in Process Documentation, Analysis and Implementation in 835/837/834/270/271/277/997(X12 Standards) processes of Medical Claims Industry from the Provider/Payer side Exceptional ability to maintain and build client relationships with business owners to identify, prioritize and document business requirements. Extensive experience in Healthcare/Claims adjudication with knowledge of industry compliance standards like HIPAA and EDI X12 transactions (834, 837, 835, 270/271, 276/277) Proficient in all phases of Requirement Management, including gathering, analyzing, detailing, and tracking requirements. Expertise in creating prototypes and mock-ups for user interface designs. Experience in Business Requirement and System Specifications Analysis. Specialized in creating UML Diagramslike Use Case, Activity and data flow diagrams using Rational Rose and MS-Visio and consistently translate business requirement into IT solutions. Extensive knowledge of reporting tools such as SQL and ACCESS for underlying database tables and resolve data issues.  Expertise in RDBMS concepts and running SQL queries. SKILLS Professional Experience: LA Care Health Plan, Los Angeles, CA\t\t\t\t\t\t         Apr 2014– Present Sr. Business Analyst\t\t Description: L.A. Care Health Plan is the nation’s largest publicly operated health plan. L.A. Care’s mission is to provide access to quality health care for Los Angeles County's vulnerable and low-income communities and residents and to support the safety net required to achieve that purpose. Responsibilities: Interacted with stakeholders to get a better understanding of client business processes and gathered requirements.  Performed extensive Gap Analysis identifying the functional gap between AS-IS and TO-BE processes.  Developed UAT Test Plan to guide select group of key end-users in testing the business processes on the application.  Created Requirement Traceability Matrix (RTM) for each system to map the Technical Requirements to the Business requirements.  Developed the Master RTM to map BRD, Test cases and Test results.  Assisted in Data Mapping of inbound data to the outbound data through various downstream systems.  Facilitated communication between Business, Developers and Enterprise Architect for any outstanding issues and questions.  Involved in testing efforts in partnership with external vendors confirming the coordination between two cross functional team concludes efficiently and effectively. Conducted analysis on System Integration Testing (SIT) results and worked with Business to get approvals on the test results.  Maintained a daily Defects Log in HP ALM for keeping track of the open and closed defects.  Organized and led requirement gathering meetings with the purpose of creating and defining the Business Requirement Document (BRD)  Created Use-Cases to demonstrate software architecture and interaction of system components before prototyping.  Conducted UAT Test Plan and BRD walkthroughs with business to review the testing strategy and lockdown the requirements respectively.  Environment: MS Office Tools, HP ALM, SOAP UI, Oracle, QNXT 5.01, MHC Legacy system, Claim Test Pro,  CareAdvance, web services, SQL server 2012, TOAD, Putty and UNIX. Affinity Health Plan, Bronx, NY\t\t\t\t\t\t\t     Aug 2013 – Feb 2014 Business Analyst Description Affinity Health Plan is an independent, non-profit managed care plan that serves the needs of over 210,000 residents of the New York Area and provides healthcare coverage through its family health plus, Medicare & Medicaid programs. Affinity Health Plan implemented FacetsEnterprise administrative system, a new core system built by Trizetto, with updated technology to allow for more efficient claims processing, membership enrollment and provider data maintenance & getting access to customer records.  Responsibilities: Assisted the project manager in the creation of the project charter & vision document during the inception phase of the project. Performed GAP analysis as it pertains to membership management and claims processing to evaluate the adaptability of the new application with the existing process. Produced Activity diagrams with defined swim lanes as part of the claims process analysis. Involved in gathering and prioritizing requirements using 1 to 1 interviews, brainstorming & developing questionnaires. Translated business requirements into functional specifications and documented the work processes and information flows of the organization. Used TriZetto HIPAA Gateway to comply with HIPAA standards (270/271, 276/277 & 837) for EDI transactions. Coordinated with the developers and IT architects to design the interface of the new system according to the X12 (270, 276, 278, 834, 837 (I, P, D) standards. Participated in all phases of the Facets Extended Enterprise administrative system implementation to include the planning, designing, building, validation, testing, and Go-live support phases. Involved with various aspects of the project's needs such as the logging, tracking, and resolution of issues, current state workflow assessments. Created a detailed use case scenario. Assisted the Quality Analyst (QA) in creating test plans, test data and conducted manual testing to validate functionality. Clarified to claims personnel the new Affinity payments and Explanation for payments (EOPs) for same claim processing cycle. Clear understanding of Medicare (Part A, Part B and Part D) and Medicaid benefits. Assisted the QA in performing simple SQL queries for QA testing and data validation. Conducted user training pertaining to old and new Affinity Provider ID appearing on documents providers receive from Affinity (mainly occur with EOPs, capitation rosters, PCP membership rosters, provider directory listings and some system generated letters). Environment:Facets, Oracle, MS Project, MS Office suite, MS SQL, Rational Suite, Citrix, MS SharePoint.  Merck Pharmaceuticals, Whitehouse Station, NJ               \t\t\t        Jan 2012–  Jul 2013 Business Analyst Description Merck & Co., Inc. is a global research-driven pharmaceutical company dedicated to putting patients first. Merck discovers, develops, manufactures and markets vaccines and medicines to address unmet medical needs.  I joined BA team in the final stage to facilitate the enhancement of LKR System (License Knowledge Repository, Release1), which included working on enhancement /change requests & adding the same into the original FRS Document. I also developed Test Plan & Test Specification document for UAT. In addition to work for release 1, I was also involved in doing the GAP Analysis for enhancement & completing the FRS document for Release 2 and maintenance issues for Release 1 and Release 2. Responsibilities: Interfaced with the client as part of the Requirements Engineering team to finalize the project scope. Assisted the PM in developing Use Cases and project plans and also managed changes to the scope of the project.  Conducted user interviews, gathered Requirements, analyzed the Requirements and managed changes using Rational Suite. Improved productivity by gathering business process requirements and translating them into high quality Functional specifications, shared between the internal users of Document Management System (DMS) Developed business process models in RUP to document existing and future business processes. Performed extensive Requirement Analysis including data analysis and gap analysis.  Designed and developed project document templates based on SDLC methodology. Participated in various stages of data and requirement analysis for project needs. Identified internal and external system requirements, design and configuration set-up, also created User Documentation and conducted training classes. Developed business requirement specification documents as well as high-level project plan.  Designed and developed Use Cases, Activity Diagrams, Sequence Diagrams, and OOD using UML. Assumed ownership of Use Case Diagrams, Use Case narratives and other various artifacts. Developed test plans and test cases for the Documentum system. Relieved pressure off the PM by maintaining artifacts and portions of the project binder.  Documented and delivered Functional Specification Document to the project team. Assisted the Project Manager to develop both high-level and detailed application architecture to meet user requests and business needs. Participated in the logical and physical design sessions, assisted and developed high and low level design documents. Assisted with user testing of systems, developing and maintaining quality procedures, and ensuring that appropriate documentation is in place. Core responsibility involved complete manually testing of the User Acceptance Test (UAT) Functioned as the primary liaison between the business line, operations, and the technical areas throughout the project life cycle.   UAT testing performed along with call center managers to make sure that application meets their requirements. Data mapping, logical data modeling, created class diagrams and ER diagrams and used SQL queries to filter data within the Oracle database Assisted the PM in performing Risk Assessment, Management and Mitigation.   Environment: Microsoft Office Suite, Microsoft Visio, UML, J2EE, Windows, Oracle, SQL, SQL Server, Quality Center. CIGNA Healthcare, Raleigh, NC\t\t\t\t\t\t\t    Jun  2010 – Dec  2011 Business Analyst Description CIGNA Healthcare provides quality health insurance at affordable prices. I worked particularly on analyzing Facets interfaces involving a new feature for SPP (Strategic Partnership program). My duties included working with claims module and processing them for various scenarios. I had responsibility of testing mainframe systems for CBoR (Claim Book of Records). As an analyst, worked on ETL projects to construct and verify data requirements.  Responsibilities: Conduct gap analysis between the current system and new requirements to be implemented thereby mapping the business requirements to the application Involved in training and test session on HIPAA Privacy policy. Prepared high level and detailed system requirements documents for the application Analyzed HIPAA 5010 standards for 837P transactions, related to providers, payers, subscribers and other related entities Involved HIPAA regulations in Facets HIPAA privacy module Involved EDI Claim Process according to HIPAA compliance.  Involved in daily Scrums to determine the status of the project and impediments, if any Involved in sprint planning meeting to identify the tasks for the sprint and getting team members acceptance/commitment for the assigned tasks. Involved in Sprint review meeting with the team and stakeholders to review the achievements from the sprint and get approvals Identified the requirements that go in each sprint, collect them in the sprint backlog and collecting and managing the requirements that are not part of the current sprint into the product backlog Designed the Internet based application and managed the business and design specifications in the business specific wikis Write high level and low level business requirements and design mock-up screens for the application Analyzed the existing data model and provided suggestions and recommendations Translated the requirements prepared for SDLC methodology to User Stories and implementing Agile methodology as a standard for the ongoing project Wrote user stories and acceptance criteria for the requirements of the project Involved in daily scrum meeting to discuss any roadblocks or impediments in the project path Involved in sprint planning session to identify the features and functionalities that should be achieved by the new application Preparing Requirements Traceability Matrix and Test cases to insure the desired functionalities are present Identified various points of integration among the new and existing applications and required integration with other IT components Worked closely with the business team, development team and the quality assurance team to ensure that desired functionalities will be achieved by the application Provided business and technical suggestions and recommendations during the project life cycle Environment: MS Office Tools, Windows XP, MS Project, RequisitePro, MS Visio, MS PowerPoint, Mercury Quality Center, MS-SharePoint, MS-Word, MS-Excel, Facets  Health Corporation of America HCA, TN\t\t\t\t\t\t    Feb 2009 – May 2010 Business Analyst  Description I worked as a Business Analyst on Medicaid Claims Processing, which includes prioritization of claims, creating Medicaid reports and checking the status of claims. I also worked with Facets application where the implementation of Facet newest applications was involved to help healthcare payers improve productivity, enhance service and improve service.  Responsibilities: Facilitated Joint Application Development (JAD) Sessions for communicating and managing expectations involved in FACETS Implementation, involved end to end analysis of FACETS Billing, Claim Processing and Subscriber/Member module Worked closely with the Lead BA in establishing team goals Writing /Test Scenarios/Test Cases/Test Matrix Used the Rational Unified process methodology for the application development and created Use cases, activity diagrams and drafted UML diagrams using MS Visio Followed theRUP methodology for the entire SDLC Involved in writing and executing test cases using MQC based on the requirements  Assisted the development team during the second and third iteration using the RUP model Developed design Specification writing Test report s and documenting Test results  Used RUP to create use cases, activity, class diagrams andworkflow process diagrams Worked with the Project Manager on various Project Management activities like keeping track of Project Status and Deadlines/Milestones Environment:  Windows XP, Mercury Quality Center, MS-Visio, MS Project, XP EDUCATION Bachelors in Business Administration"}