{"text": "Name: margaret margaret E-Mail: margaret.margaret@gmail.com Address: Manila, Philippines Github: https://github.com/margaret LinkedIn: https://linkedin.com/margaret Phone No. 361507928135 \t Professional Summary: 8+ years of Business Analyst experience with strong understanding of Software Development Life Cycle. Expertise in Life Insurance, Property & Casualty, Claims Process and Rating Engine application, Credit Card Industry, Mortgage Loan Origination and Loan Servicing, Retail/Investment Banking. Good understanding of cash management, capital market, SWIFT, STP and credit risk, and trade and payment life cycles. Expertise in conducting market research, data gathering, and independent analysis in collaboration with client's colleagues and outside firms (e.g. investment managers).  Excellent organizational, communication and documentation skills along with a remarkable ability to gather requirements to bring out quality product. Proficient in facilitating joint application design (JAD) sessions, large scale meetings for interviewing Subject Matter Experts (SMEs), interviews, correspondences, reports, project status reports, and presentations. Excellent knowledge in Corporate Finance, Investment Banking, Credit Risk, Asset Management, Wealth Management, Risk Management, Investment Products.  Experienced in project planning, project design/business design, creating documents and diagrams. Extensive Knowledge working with ETL tools like Informatica Power center, Data stage, Microsoft SSIS.    Experienced in analyzing business requirements at all stages of software development life cycle (SDLC) models such as Agile, Waterfall and RUP. Proficient in creating and documenting use case scenarios and story boards. Proficient in modeling diagrams and processes including activity diagrams, use case diagrams, sequence diagrams, data flows diagrams and class diagrams. Conducted usability and user acceptance testing (UAT) on behalf of end users. Performed walkthroughs and peer reviews with developers and business. Proficient in Microsoft Office suite. Excellent Visio diagramming skills. Working knowledge of SQL. Skilled at learning new concepts quickly, working well under pressure, and communicating ideas clearly and effectively. Technical Skills Methodologies: RUP, Agile, Waterfall. Requirement management tools: Rational Requisite Pro, iRise, Axure, enterprise Architect. Project management tools: MS project Business Modeling: Rational Rose, MS Visio. Defect tracking: MQC, Test Director, Rationale Clear Quest/ Clear case. Web technologies/languages: SQL, C++, Java, VB-scripts, XML, XSLT, web-services, SOA, HTML, CSS, .NET, TSL, ODBC, OLTP, FTP. Front- End tools: Microsoft Excel, Access, Front Page, Flash, SharePoint. Database: MS SQL Server, MS Access, Oracle, IBM DB2, and SQL * Plus, SQL * Loader, Toad 7.6. Operation System/platform: MS Windows 2003/XP/2000/NT, AS/400, UNIX, Sun Solaris, Apache HTTP Server. Experience:  Client:\tBarclays Capital, NY            \t\t\t\t\t\t               Sep 16 – Oct 17 Sr. Business/Systems Analyst\t\t\t Barclays Capital Financial services provider engaged in retail and commercial banking, credit cards, investment banking, Mergers & Acquisitions, wealth management and investment management services. The objective was to assist Managers in carrying out various kinds of Mergers & Acquisition analysis and also worked as a credit analyst for a brief period of time also developed data conversion strategy for data migration from legacy systems to Technology product modules.For the functionality of the client, customer and sales divisions used Loan Origination Systems (LOS) LPS Empower. Interfaces to other products and legacy systems including Lending exchange with ability to electronically order/track document services such as appraisal, credit reports, etc . Responsibilities: Created detailed Use Case documents, Business Requirement Document, Functional Requirement Documents (FRD) and other business documents necessary for the development team and their better understanding of project milestones. Facilitated and managed meeting sessions with committee of SMEs from various business areas of Mortgage. Conducted JAD sessions with stakeholders, management and LPS technical team to determine the scope, processes and requirements of the project Primary duties included analyzing existing Client Server Empower platform and work towards making it better and robust. Assisted Project manager in establishing project methodology, estimating resource needs, handling conflicts with finances and deadlines and presenting propositions to project sponsors. Involved in Client and user group interaction, Design and Specification development based on discussions with various users from different departments and studying the existing system. Developed script to perform Data validation on Account level by using Teradata SQL Assistant, SQL scripts. Exposed to and worked with Subject Matter Experts in Fixed Income Annuities, Equities, Swaps, Finance, Trading Cycle, Portfolio Analysis & Management, Asset Management, Bonds and Bond Trading Cycle, Pricing, Derivatives.  Worked on compliance related regulatory issues. Performed Data mapping, logical data modeling, created class diagrams and ER diagrams and used SQL queries to filter data. Modifying existing reporting procedures to eliminate dependence on current Client Server Empower systems thus making reporting error free and accurate. It involved migrating existing processes from Client Server Empower systems to Empower.net systems. Obtained Data requirements, identified data sources, determined the content of data fields and created Data Mapping Documents and performed Data Extraction and Data Compilation using SQL queries. Preparing for conducted User Acceptance Testing (UAT) before Empower.net can be released. Designed, developed, and maintained various Business unit reports by using Teradata, SQL, and Ms Excel. Extract data from Teradata, Excel and flat files into SAS Datasets. Worked closely with the technical and QA teams during all phases of the project starting from inception to transition. Environment: Microsoft Office Suite, Casewise modeler, Borland Caliber RM, Unix, Documentum, Windows NT/XP, Oracle, SQL, SQL Server, Sybase, VBScript, C#. DOORS, C++, NET, ASP.NET, Business Objects, Test Director, Load Runner JP Morgan Chase, Newark, Delaware\t\t\t\t\t\t             Nov 14 – Aug 16 Sr. IT Business Analyst Mortgage Express (MX) Project: Worked on Mortgage Express project, where Mortgage Express the loan origination system is replacing the old system named CLOSR.  This requires either removing or enhancing the existing functionalities. Also worked on various other projects for instance Loan Funding, Condominium Implementation, Planned Urban Development (PUD), Federal Housing Administration (FHA), Dream Maker, Retail Org etc. Worked in an Acceptance Test Driven Development methodology . Responsibilities:   Be thoroughly knowledgeable of loan products and maintain compliance with lending, underwriting and government requirements. Evaluate the financial strengths of the borrowers to determine the risk and repayment capacity. Work in agile environment to gather, elicit and analyze business requirements through JAD sessions. Lead story breakdown sessions with business users and agile teams. Work as a liaison between the business and technical team to convey the business needs to the system architects. Designed and developed Informatica mappings and workflows/sessions to load data from Source systems to ODS and then to Data Mart.  Understand the high level business requirement, functional requirements, and process flow of the system. Perform gap analysis and study the use cases. Understand the impact of requirements on different teams and create Impact Matrix. Translate business requirements into user stories, and groom them with the business, technical and cross functional team and receive approvals from business users.User stories are written in Gherkin Language. Prepared year-end financial statements (P&L, Cash Flow, Balance Sheet) and budgets for the company.  Lead Q&A sessions with the business, quality assurance and development team. Lead pin drop sessions with business to review stories from each agile team and place them in the process flows for traceability. Review the test case scenarios with the quality assurance team and be involved in the testing phases.  Involved in data mining from data warehouse to further analyze the data for business needs.  Data mapping, logical data modeling, and  used SQL queries to filter data within the  database tables.  Participate in User Acceptance Testing with business partners.  Resolve queries and actively troubleshoot defects. Take lead to run stand up calls to take updates from the team during the absence of Scrum Master. Take the lead role on most of the projects. Participate in weekly status meetings of the ongoing projects. Work on other tasks as assigned by the Lead Business Analyst or Project Manager. Environment: MS Office (Word, Excel, Power point, Visio), SQL Server, Informatica, HP Quality Center, Enterprise Data warehouse, JIRA  First Niagara Bank, Pittsburgh, PA       \t\t\t\t\t\t               Apr 13 – Oct 14 Business Analyst The scope of the project was to Implementation of TLM (Transaction Lifecycle Management) Cash Management application at First Niagara Bank, which is a replacement of an existing legacy system. This application is supplied by the vendor SmartStream (STL).  TLM is also known as Global Cashman Application. The Global CashMan application will match the received projected cash flows with the actual cash flows received from the Key Bank’s Nostro Agents. Responsibilities:   Worked with different business teams like Prime Services, OTC settlements team and FXOps team to understand the cash projections that they create when they book a trade. Developed knowledge of Balance Sheet, Income Statement and Statement of Cash Flows. Developed knowledge of Business Process Management (BPM) and Cash & Liquidity Management. Developed understanding of the Reconciliation of cash flows to understand the scope of the project. Defining the scope of the project and identifying the major actors, using various elicitation techniques to gather requirements. Developed business requirement documents, use cases, functional and non-functional documents and process diagrams including context, dataflow and decomposition diagrams. Responsible for decomposing High Level Business requirement into functional specifications. Define the data sources, data loads and data transformation using ER Diagrams. Used MS-Visio for model diagrams, MS-Word for documentation and used UML for visual modeling. Author Data Flow diagrams, Activity diagrams, Sequence diagrams and Business Process models with special detail to Sub-Processes. Design message formats, queues, systems interfaces, and worked with the traders though interviews, Questionnaire and JAD sessions. Analyze, collected and prepared user requirements, definition, scope and expectations for deliverable plans. Delivered system documents, processes, diagrams, and test cases. Liaise with all the stakeholders at all levels and worked closely with teams of BAs, developers, testers and product control throughout the entire development life cycle to ensure a quality product is delivered. Extensively involved in Data mining, Data mapping and Data modeling. Extensively done GAP analysis in the project as there were numerous 'As-Is' and 'To-Be' conditions. Identified various data sources for the system including Charles River Trading System, investment systems and data warehouse.  Designed the conceptual data and business process models. Performed multiple SQL queries using Query Analyzer / TOAD for Data Analysis; created database driven reports with output to MS Excel and custom reports such as SQL file count, Ad-Hoc reports, and monthly migration reports Wrote SQL Queries to extract data from different data sources to map into central repository using Informatica.  Wrote SQL queries for documenting and retrieving data from database.  Performed testing of applications using HP Quality Center and prepared test scripts, managed testers and maintained defect tracking with the help of the QA team. Responsible for conducting the testing and defect analysis. Responsible for writing training manuals and training of the end users.  Environment: SQL Server 2008,  MS Visio 2007, MS Project 2007, Rational Requisite Pro,   Informatica Power Center 8, UML, XML, HTML, HP QC.  M&T BANK, Buffalo\t\t\t\t\t\t\t\t\tJan 12 – Mar 13 Business Analyst M&T Bank is the leading bank expanding largely in the Greater Washington market with 800 +branches in five states and multiple mergers. PACE was an application developed to serve as a front end gateway for creating customer profiles for database and created a unique customer record based on CIP (Customer Identification Program) information corresponding with the history of all transactional data for that customer that could be retrieved in other systems. As part of an enhancement effort, the system allowed pre-approval of customers for cross-sell and servicing of mortgages and other real-estate backed loans in first or second liens, lines of credit and all types of loans including credit cards. This involved online loan application and processing for retail and business customers with the benefit of existing relationship savings in getting better ROI. The system capabilities were enhanced to service in accordance with a Home Affordable Modification Program (HAMP), RESPA (Real Estate Settlement Procedures Act), default servicing and collections. The system facilitated expanding the customer base to create a deeper and longer relationship by offering choice of direct deposit and ACH transfers, qualify for lower payments, refinance and debit consolidations.  Components: Credit Pre-approval Engine, online application, promoting cross-sell, paperless processing in real time thus cutting time and cost. Responsibilities:   Acted as a liaison between top level management, system design and end users and created a structured plan to elicit requirements and create logical flows of business processes and rules to ensure all components are addressed and integrated into the system. Interviewed subject matter expertise and developed the scope, goals and objectives of the project. Conducted brainstorming sessions to analyze   and determine the usability of the functions.   Conducted JAD sessions to elicit requirements from end user focus groups and translated into functional specifications. Communicated with technical teams and business users to develop mutually agreeable solutions. Used Visio and Power Point to maintain operational and technical flows. Documented and prepared business requirement documents (BRD) and created use cases and converted them into system specifications. Analyzed data and information, creating functional and business process descriptions, Created class diagrams and sequence diagrams for process validation. Participated in functional application, design and analysis for different modules, generated test cases for User Acceptance Testing (UAT) and reviewed data from application testing. Managed requirements, version control and tracked functionality changes during the project life-cycle using Requirement Traceability Matrix (RTM). Used RUP model and Object Oriented model during the project. JP TURNER & COMPANY, LLC, Atlanta, GA\t\t\t\t\t              May 09– Dec 11 Business Analyst  JP Turner is a full-service investment firm offering a diverse array of products and services (fixed income investments, stocks, bonds insurance products, mutual funds, annuities, UITs, money management and real estate investments).  The company wanted to integrate their financial data coming from different sources such as analytics, trading, pricing and accounting. The project was to consolidate all the information in one location to have consistent view of investment data. We implemented Eagle Pace System (Data Warehouse—Data Hub) to meet the information consolidation requirements of the company.  Responsibilities:   Interviewed SMEs (Subject Matter Experts), portfolio managers and elicited requirements for implementation of Eagle Pace by conducting workshop sessions.  Understood the project scope and assisted Project Manager in resource planning of the project plan using MS Project.  Thoroughly analyzed the workflow and modeled the process flow diagram using MS Visio.  Followed SRUM methodology. Ensured that user stories are good, had business values and story points. Accountable for ensuring user stories have acceptance criteria. Proficiently helped development teams to break down large user stories for execution. Advised product owners, scrum masters and teams to improve their ability to create good product backlogs. Actively assisted in the acceptance and validation of the stories by testing the delivered stories. Analyzed the business understood region specific industry needs and enhanced product vision to meet such needs and grow business.  Accessed pace database using Toad and wrote SQL queries to make sure business rules are being applied as per the requirements. Performed data analysis on various reference data of securities coming from Bloomberg and Reuters etc. FTP’d various securities and non-securities files from different servers to Eagle Pace Server during initial set up. Excessively used excel sheets advanced features (VLOOKUPS, Macros, Pivot Tables etc.) for comparative data analysis of different securities information. Communicated Eagle Investment Systems for testing support during the Eagle Pace implementation. Coordinated and worked with User Group during User Acceptance Testing (UAT). Environment:  MS Visio 2003, UML 2.0, MS Project 2003, MS Excel 2003, MS Access 2003, MS PowerPoint 2003, MS Word 2003, MS Visual SourceSafe 6.0, Toad 7.6.0.11, Oracle 9i, XML \t"}