{"text": "Name: olga olga E-Mail: olga.olga@gmail.com Address: Zunyi, China Github: https://github.com/olga LinkedIn: https://linkedin.com/olga Phone No. 231966192908 8+years of experience in Software Development Life Cycle SDLC including requirements Analysis, Design specification, Leading, Code development, Code integration, Application Maintenance, Testing, in Java and J2EE Applications. Working knowledge and experienced in multi-tiereddistributed environment, OOPS and OOAD concepts, good understanding of Software Development Lifecycle (SDLC) and Service Oriented Architecture (SOA). Expertise in Core Java concepts including Collections, Exception Handling, Multi-Threading, Generics and Java I/O etc. web services interface to Java-based runtime engine and accounts. Customized Restful Web Service using Spring RestfulAPI, sending JSON format data packets between front-end and middle-tier controller.  All the functionality is implemented using Spring IO/Spring Boot and Hibernate ORM. Implemented Java EE components using Spring MVC, Spring IOC, Spring transactions and Spring security modules.  Deployment of Cloud service including Jenkins and Nexus on Docker  using Terraform.  Strong experience on DevOps essential tools like Chef, Puppet, Ansible, Docker, Kubernetes,  Create RFP (Request for Proposal) microservice to provide RESTful API utilizing Spring Boot with Spring MVC.  Developed Java/J2EE code, business logic using Spring Hibernate framework and OOP concepts, involved in Peer code reviews.  Experience in using Struts framework with features like Tiles, ValidatorFramework and Spring MVC framework. Worked in DevOps group running Jenkins in a Docker container with EC2 slaves in Amazon AWS cloud configuration. Also made myself familiar with surrounding technologies such as Mesos (and Msosphere) and Cabernets. Excellent knowledge of Amazon EC2, Amazon S3, Amazon Elastic Load Balancing and other services of the AWS family.  Expertise in developing both Front End & Back End applications using Java, Servlets, JSP, HTML, JavaScript, Spring, Hibernate, JDBC, XML, Documentum, XMetal, Maven, MySQL, Oracle 9i. Strong Programming skills in designing and implementation of multi-tier applications using Core Java, Servlet, JDBC, JSP, JMS, JSTL, Hibernate, EJB, Spring Frameworks, JavaBeans and Struts. Experience in front end development using HTML5, CSS3, JavaScript, jQuery, Ajax, JSON andJSTL. Extensive experience in Java/J2EE programmingtechnologies like JDBC, Servlets, JS. Expertise in developing applications using Hybris, Java, J2EE Technologies, JDBC, JSP, Servlets. Experience in installing, configuring, tuning Apache Tomcat, JBoss. Good Knowledge of using IDE Tools like Eclipse, NetBeans for Java/J2EE application development.  Implemented Web services using spring CXF and Mule ESB. Possess strong working knowledge of Database Programming using SQL, PL/SQL, Triggers and Stored Procedures. Expertise in database modelling, administration and development using SQL,PL/SQL in Oracle and SQL Server environments. Versatile team player with good communication, analytical, presentation and inter-personal skills. Experience in conducting Requirement Reviews, Design reviews and Code reviews with the Enterprise Architecture teams to meet the company standards. TECHNICAL SKILLS: Languages\t\t\t:\tJava, C, C++, ASP.NET JEE Technologies\t\t:\tWeb Services,JNDI, JDBC, Servlets,J BOSS JSP,JavaBeans Reporting Tools\t:\tOracle BI Publisher 10g/11g Web frameworks            :\tStruts, Spring MVC, Spring,Maven ORM frameworks       : \tHibernate,Hybris Scripting Languages      :\tJavaScript,JQuery,Angular JS. Markup Languages            :\tHTML, CSS, XHTML,XML Application/Web Servers       : \tJBoss, WebSphere, Perl, WebLogic and Tomcat/VM TCServer  DBMS\t\t\t: \tDB2, Oracle, PL/SQL, JBOSS, MySQL,MS Access.  Operating systems    \t: \tWindows 9x/NT/2000/XP, Unix, Linux. IDE Tools\t\t\t: \tEclipse, NetBeans. Professional Experience: Dupont Pioneer, Des Moines, IA                                                        Aug 2016 to Present Role: Sr. Java Developer, Description:DuPontPioneer is a cloud provider of human capital management (HCM) solutions. Ultimate's award-winning UltiPro delivers HR, payroll, talent, compensation, and time and labor management solutions that seamlessly connect people with the information and resources they need to work more effectively. \t Responsibilities: Involved in study of User Requirement Specification.  Actively participated in the daily scrum meetings to produce quality deliverables within time information and helped clearing ambiguity in requirements document. ScrumAgile Areas of expertise includeAgile Principles, Tasking Meetings/Retrospectives, Communication Relative Estimation, Story-Based Development, Iteration/Sprint Planning Meetings and Conflict Resolution.  aggressive monitoring of partitioning versus topic production via JMX interface (s) ; developed Kafka standalon POC's with the Confluent Schema Registry, Rest Proxy, Kafka Connectors for Cassandra and HDFS. Performed configuration, deployment and support of cloud services including Amazon Web Services.  Strong knowledge on Virtualization, Cloud Computing and Web services. Performed configuration, deployment and support of cloud services including Amazon Web Services (AWS) Worked on developing the flexible search queries to fetch the data fromHybris data base.  Developed the application implementing MVC Architecture, integrating JSF with Hibernate and spring frameworks.  Worked on creation and managing IT infrastructure and application stack using AWS Cloud Formation and writing the template file using Json. Build scripts on AWS cloud for scheduling EC2 auto scaling load balancer with python SDK.   Managing the multi-tier and multi-region architecture using AWS Cloud Formation  Worked in modern, mobile ready responsive front end development with CSS3 media queries, AJAX, Bootstrap,AngularJS,React JS, and jQuery.  Developed web servicesSoap, WSDL and web services clients using JAXB and XML,  API Identification and Resource Definition based on REST principles for various APIs.  Responsible for providing architectural guidance to external business team in ApigeeAPI\nmanagement.  Design and develop RESTful API capabilities on Java/node.js technologies and deploying in \nAWS and implement API proxies on Apigee Edge.  Responsible for creating and designing APIs using Apigee Edge  Designing API workflow, identifying common design patterns and policies.  Experience inAPI Management best practices.  Specialized and mentored fellow engineers in topics related to the above and also the programming interface between IBM developer portal andAPI Connect. RESTful services andAPI database web interface developement.  Website design and webpage hosting.  Developed JMS (MDB) solutions to transmit data over XMLinorder to save data  asynchronous way through WebSphere MQ messaging.  Used Struts framework to implement the MVC architecture. Developed various J2EE components like Servlets, JSP, JSTL, AJAX, SAX, XSLT, JAXP, JNDI, LDAP, JMS, and MQ Series by using RAD. Integrated Spring (Dependency Injection) among different layers of an application.  Designed the application by implementing JSF Framework based on MVC Architecture, simple JavaBeans as a Model, JSP and JSF UI Components as View and Faces Servlet as a Controller.  External customer portal is developed in annotation based Spring MVC and Hibernate.  Designed and Developed End to End customer self service module using annotation based SpringMVC, Hibernate, JSP and JQuery.  Implemented Java EE components using Spring MVC, Spring IOC, Spring transactions and SpringSecurity modules.  Used Java Message Service (JMS) for reliable and asynchronous exchange of Important Information such as loan status report. Used Spring framework for dependency injection, transaction management.  Used Spring MVC framework controllers for Controllers part of the MVC Implemented Business Logic using POJO's and used WebSphereto deploy the applications. Developed Rest architecture based web services to facilitate communication between client and servers. Used JMS (Asynchronous/Synchronous) for sending and getting messages from the MQ Series.  Configured hot folder configurations, customized checkout process for client requirement. Used Java Persistence API (JPA) through Hibernate. Used Spring with ORM to integrate Spring Framework with hibernate and JPA. Used Eclipse as IDE for development of the application.  Assisted Oracle DB development team in developing stored procedures and designing the database.Used SVN for version control  Created rich client using Ajax to pull the data from database.  Interacted with Business Analysts to come up with better implementation designs for the application.  Environment: JAVA, J2EE, Servlets,Spring,WSO2, Hibernate, Apache Axis2, WSDL, Rest, JMS, SOAP Web Services, HTML, JavaScript, JDBC, Agile Methodology, PL/SQL, XML, JBOSS, HornetQ, UML, UNIX, Oracle 11g, WebSphere Application Server, OIM 11g R2, Eclipse. Molina Healthcare, Long Beach, CA\t\t\t\tOct 2015 –July 2016 Role: Sr. Java Developer Description:Molina Healthcare offers Medicare advantage plans designed to meet the needs of individuals with Medicare or both Medicaid and Medicare coverage. Played the role of Java Developer for Funds and Consumer Plan. It is a web-based application developed for customer insurance planning and claim reporting. Worked with business team to modify applications according to changes in insurance plans. Involved in designs, codes, tests, debug, and support those programs. Responsibilities: Developed application using Java/J2EE technologies - Java, spring, Hibernate, Web Services, XML, and JSON. Experience inAPI Management best practices.   Designing API  workflow, identifying common design patterns and policies.  Experience in API Management best practices.   Developed a REST API to send the information to Docusign through XMLGateway and Docusign \nis calling a REST API is sending a envelope, that envelope contains all the documents name and the customer information.  Involved in the JMS Connection Pool and the implementation of publish and subscribe using Spring JMS. Collaborate in the automation of AWS infrastructure via territory and Jenkins - software and services configuration via chef cookbooks.  Able to create scripts for system administration and AWS using languages such as BASH and Python.  Define AWS security groups which acted as virtual firewalls to control the incoming traffic onto one or more AWS EC2 instances.  Used AWS to build Java applications that work with Amazon S3,Amazon EC2, Amazon SimpleDB, and more.  Using Java Message Service (JMS) for reliable and asynchronous exchange of important information such as status report.  Worked on JMS Connection Pool and the implementation of publish and subscribe using Spring JMS. Developing restful web services in Java.  Developing service using Spring core, Spring web MVC concepts. Developed applications using different J2EE Design Patterns such as Singleton, Business Delegate, Session Façade, Service Locator and DAO. Created new REST API's using JAX-RS specifications to get matching subsidies for Key Stroke and MPX Applications.  Developed web services to allow communication between applications through REST over HTTP. Experienced in installing, configuring and administering Web Logic based domains, clusters, servers and resources (JDBC, JNDI, JMS etc.) in distributed environment for SOA.  Designed RESTful web services with JSON representation for handling AJAX requests.  Used CVS for Code versioning and branching.  Followed Agile process, created and maintained User stories in JIRA. Actively participated in Sprint grooming, retrospectives and daily stand up meetings.  Deployed and tested the application in Tomcat application server in Windows and Linux environments.  Used Tools like Toad, SQL Developer, and Crucible Review as part of product implementation.  Environment: Java/ J2EE, Spring,Hibernate, SOAP,WS02, REST, ESB, JMS, HTML5, CSS 3, AJAX, SQL / PLSQL, Oracle 10g, Net Beans, CVS, Maven, JUnit, Windows, AWS, Linux, Toad, SQL Developer, Apache Tomcat, Angularjs, SAML, Core Java. Bank of America, NY                                                            June 2014 to Sep 2015 Role: Java Developer  \t\t\t\t\t Responsibilities: Played a pivotal role in the analysis and requirements gathering Involved in design and development of the project  Co-ordination with Client and onsite leadsDeveloped User interface using JSP, JavaScript, AJAX, JSON, Angular JS,HTML, and CSS.  Worked withAngular JS for creating own HTML elements for building a companied website which is an open source project.   Used Bootstrap andAngular UI to make the application user-friendly in the development of the Navigation bars, Tables, Sliders, Calendars etc.   Implemented a Single Page Web Applications (SPA) based front end for displaying user requests, user records history and security settings various users using JavaScript andAngular JS. Used AngularJS to create single page applications.  Developed framework like spring MVC and Spring Bean Factory using IOC, AOP concepts.  Implemented design patterns such as Singleton, Session Façade, and Factory.  Developed POJO classes and used annotations to map with database tables.  Developed and consumed RESTful web services using Spring REST architecture.  Used Hibernate ORM tool for establishing communication with database.  Developed various triggers, functions, procedures, views in MySQL database.  Used SVN to control versions in project.  Performed unit testing by using Junit testing tool and debugged using Log4j. Developed automated process for builds and deployments using Jenkins and Maven. Built the application using Maven scripts and deployed using tomcat server.  Followed agile methodology for development process. Involved in preparing document at each stage of the project. Environment: Java 1.6, J2EE, Spring 3.0, Hibernate, Web Services, MySQL, Tomcat, JQuery 2.0, Jenkins, Maven 3.2, Log4j, JSP 2.0, JavaScript, AJAX, JSON, Angular JS, HTML 4.0/5.0, and CSS 2.0/3.0, JUnit 4.12. Client:HomeTelos - Dallas, TX\t\t Sep 2013 – May 2014 Role: Java Programmer Description:Worked on real estate asset management application in customizing and adding new functionality to family of HomeTelos Products Home Tracker and Bid Select to provide customizable and comprehensive solutions for managing and marketing real estate owned assets.  Responsibilities  Worked with BA team to understand the requirements and implement the new functionality and work  the issues from the existing application code.  Developed the project in Java, different J2EE technologies like Struts, JSP,Servlet,JavaScript, HTML, and CSS. Implementation of MVC architecture by separating the Business Logic from the presentation Logic using Struts framework.  Used JDBC in Data Access layer for data manipulation.  Developed DAO classes for the data interaction and service classes for the business logic Apache Tomcat, web server was used for deployment and administration of components.  Used Eclipse as software development platform for developing the whole application.  Created Action classes part of the Struts framework and mapped in the struts configuration file.  Developed XSD, WSDL for SOAP web services. Used SoapUI as web services testing tool  Created SQL queries and stored procedures.  Developed and deployed the applications using Tomcat. Used SVN for the version management.  Environment: JSP, Servlets, HTML, CSS, JavaScript, JDBC, JBOSS, Eclipse, SQL, Struts. Neon Technologies, Hyderabad, India                       Sept 2010 to July 2013 Role: Java Developer Responsibilities: Involved in analysis and design phases of Software Development Life Cycle (SDLC). Worked as a part of the Business Analysts team to understand the requirements. Written Technical Design Document for the application Development UI modules using HTML, JSP, JavaScript and CSS. Designed and developed application based on Spring MVC design pattern, used spring validation and wrote validation rules. Developed components using Spring Framework (Spring MVC, Spring DAO, Spring AOP) Primarily focused on the spring components such as Dispatcher Servlets, Controllers, Model and View Objects, View Resolver. Responsible in development of Web Services using SOAP based Web Services. Involved in the implementation of DAO using Spring-Hibernate ORM. Used Hibernate, object/relational-mapping (ORM) solution, technique of mapping data representation from MVC model to Oracle Relational data model with a SQL-based schema. Involved in the implementation of beans in Application Context.xml. Worked with the XML and developed Web Services using APACHE Axis. Extensively worked with Oracle to write store procedures and views Writing service methods and SQL queries to interact with the Oracle DBMS and writing test cases using JUnit Frames and also in Mango DB. Wrote different stored procedure and did fine tuning of slow performing SQL. Written Triggers and Views as part of development of the Application. Developed the client side validation for the entire screen using Java Script Setup Data access layer with JDBC Template and Hibernate Template on Spring framework. Developed the project with good security features using hidden fields and encryption Prepared detailed design specifications and performed code reviews. Involved in Code Review Corrections & Bug fixing. Developed Test cases for Testing Environment:Java, J2EE, Spring MVC 2.5, JSP, JavaScript, Web Service, Hibernate 3.0, CSS, JAX-WS, J Boss 4.0.3 Oracle 11g , JUnit, AJAX,SQL, UNIX,HTML, SVN, Maven, SQL Developer. Encore Theme Technologies, Chennai, India                       Aug 2008 to July 2010 Role: Junior Software Developer   \t\t\t\t Description:Shutterfly provides a range of products and services that make it easy, convenient and fun for consumers to upload, edit, enhance, organize, find, share, create, print and preserve their memories. Customers use our products and services to stay connected to their friends and family, to organize their photos and videos in a single location, to tell stories and to preserve their memories.  Responsibilities: Performed analysis for the client requirements based on the developed detailed design documents. Developed Use Cases, Class Diagrams, Sequence Diagrams and Data Models using Microsoft Visio. Developed Struts forms and actions for validation of user request data and application functionality.  Developed JSP's with Struts custom tags and implemented JavaScript validation of data. Developed programs for accessing the database using JDBC thin driver to execute queries, prepared statements, Stored Procedures and to manipulate the data in the database.  Involved in developing business tier using stateless session bean. Used JavaScript for the web page validation and Struts Validator for server side validation. Designing the database and coding of SQL, PL/SQL, and Triggers and Views using IBM DB2. Design patterns of Delegates, Data Transfer Objects and Data Access Objects. Developed Message Driven Beans for asynchronous processing of alerts. Used ClearCase for source code control and JUnit for unit testing.  Involved in peer code reviews and performed integration testing of the modules.  Environment: Java, J2EE, Struts 1.0, JSP, JDBC, Eclipse,  EJB, ANT, XML, IBM Web Sphere, JUnit, DB2, CVS. Educational Qualification: Bachelor's in computer science MAY 2008, JNTU INDIA"}