{"text": "Name: virginia virginia E-Mail: virginia.virginia@gmail.com Address: Suzhou, China Github: https://github.com/virginia LinkedIn: https://linkedin.com/virginia Phone No. 291980411413 Summary:                                                                8 years of experience in Routing, Switching and Firewall Security, including hands-on experience in providing network support, installation and analysis for a broad range of LAN / WAN/MAN communication systems. As a Network Engineer I was involved in the configuration & troubleshooting of routing protocols: MP-BGP, OSPF, LDP, EIGRP, RIP, BGP v4. Configured IP access filter policies Design, implementation and operational support of routing/switching protocols in complex environments including Spanning Tree, 802.1q, etc. Experience with JUNOS platform and worked with IOS upgrade of Juniper devices Created VLAN and Inter-Vlan routing with Multilayer Switching. Substantial lab testing & validation prior to implementation of Nexus 9k, 7K, 5K & 2K connecting to blade servers Configuration and troubleshooting on Juniper EX4500 and EX8200 switches Strong hands on experience on PIX (506, 515, 525, 535), Palo Alto, ASA (5505/5510)Firewalls. Implemented security policies using ACL, Firewall,IPSEC, SSL, VPN, IPS/IDS. Proficient in Cisco IOS for configuration & troubleshooting of routing protocols: MP-BGP, OSPF, LDP, EIGRP, RIP, BGP v4, MPLS Routing Protocols - (RIPV2, OSPF, EIGRP & BGP), ACL's, NAT, VLAN, STP,VRRP, VTP, HSRP & GLBP In-depth knowledge of deploying and troubleshooting LAN, WAN, Frame-Relay, Ether-channel Strong hands on experience in layer-3 Routing and layer-2 Switching. Dealt with Nexus models like 9k,7K, 5K, 2K series, Cisco router models like 7200, 3800, 3600, 2800, 2600, 2500, 1800 series and Cisco catalyst 6500, 4500, 3750, 3500, 2900 series switches Worked on ACE load balancers. Experience with F5 load balancers - LTM, GTM series like 6400, 6800, 8800 for the corporate applications and their availability Configuring, Troubleshooting and Testing of networking system Expertise in network protocols, Firewalls and Communication Network design. Has Cisco technology experience/knowledge in design, implementation, administration and support  Provided 24x7x365 availability and on-call support as required Excellent working knowledge of TCP/IP protocol suite and OSI layers Sound knowledge of Routing and Switching concepts and MPLS design. Experience with cisco application centric infrastructure (ACI) Good knowledge in network hardware and technologies including routers, switches, bridges, hubs, Ethernet, frame relay, wireless, etc. Experience with Cisco flexpod.  Have knowledge of NNM and BMCBladelogic Server Automation tool Have good knowledge in intrusion detection and prevention systems (IDPS) Familiar with Cisco firewalls PIX 515, ASA 5500, series, knowledge of Juniper, Palo Alto and Check Point Firewalls. Have good knowledge with Qos and Cos. Working knowledge of the Payment Card Industry Data Security Standards (PCI DSS) and assessment processes. Experience with riverbed technology. Dealt with Cisco IP phones, ACD and VOIP devices and configured Voice VLAN’s for Prioritizing voice on the network and did the documentation accordingly with changes. working knowledge of Sarbanes Oxley Section(SOX) 404 internal controls and audit processes. Experience in configuring and troubleshooting various WAN technologies like MPLS, T1, T3, DS3 and ISDN Experience in Python. Education:Bachelors in Electronics and Communication, JNTU, Hyderabad, India Certifications: Cisco Certified Network Associate (CCNA) Cisco Certified Network Professional: (CCNP) Technical Skills: - CISCO & OTHER VENDOR EQUIPMENT\tNexus 9k, 7K, 5K, 2K & 1K, Cisco routers Cisco GSR 12416 (7200, 3800, 3600, 2800, 2600, 2500, 1800 series) Cisco Catalyst switches (6500, 4900, 3750, 3500, 2900 series), Meraki switches, Juniper Routers and Switches,HPE comware switches, PIX Firewall (506/515/525/535), ASA Firewall (5505/5510), Cisco ACE Load Balancers, Fortinet firewall ROUTING PROTOCOLS\tRIP, IGRP, EIGRP, OSPF, IS-IS, BGP, HSRP, and VRRP& GLBP. Infrastructure services: DHCP, DNS, SMTP, FTP, TFTP, IGMP LAN TECHNOLOGIES\tEthernet, Fast Ethernet, Gigabit Ethernet, & 10 Gigabit Ethernet, Port- Channel, VLANS, VTP, STP, RSTP, 802.1Q WAN TECHNOLOGIES\tFrame Relay, ISDN, ATM, MPLS, leased lines & exposure to PPP, DS1, DS3, OC3, T1 /T3 & SONET Packet Switched WAN – ATM, FRAME RELAY, MPLS VPNs OS PRODUCTS/SERVICES \tDNS, DHCP, UNIX, LINUX, MAC OS X, Microsoft SQL Server 2008, Windows Server 2003, 2008, 2012, Windows 7/NT/Vista/XP, 10, VMware, Active Directory, IIS. NETWORK SECURITY \tNAT/PAT, Ingress & Egress Firewall Design, VPN Configuration,Internet Content Filtering, Load Balancing, IDS/IPS, NAC, Dynamic, Reflexive ACL, and authentication AAA (TACACS+ & RADIUS) SECURITY TECHNOLOGIES\tCisco FWSM/PIX/ASDM, Cisco ISE, AMP, SourceFire, open DNS Nokia Checkpoint NG, Juniper SRX, Palo Alto, ACE Module and F5 Load Balancers  Professional experience:  Liberty Mutual, Dover, NH                                                               Sept 2014 - Present Sr. Network Engineer/ Security Responsibilities: Hands on experience with the configuration and implementation of various Cisco Routers and L2 Switches. Data center experience with migrating cisco devices to juniper network. Experience in datacenters with Tier1/2 clustered & backup environments management & troubleshooting  Hands on experience with development on L2&L3 protocols (STP,RSTP,LACP,LDP,OSPF, BGP) Extensive experience in configuring and implementing EIGRP, OSPF and BGP. Design, Configure and Deploy a variety of security products such as firewalls, Intrusion Detection, VPN appliances, vulnerability assessment tools, event and log analysis, security change tracking and other network security systems and devices. Hands on experience with the configuration and implementing of various Juniper& Arista Routers and switches. Experience with Juniper M, MX series products Hands on experience with HPE Comware switches. Supported core network consisting of Cisco 7200 series routers running multi area OSPF. Worked on 2600, 3500, 7613 Cisco Routers and 4500 and 6500 series Cisco Switches. Configured and deployed BIG-IP LTM 6900 for providing application redundancy and load balancing  Configuration of EIGRP and OSPF as interior gateway protocol with route filtering and route redistribution. Responsible for service request tickets generated by the helpdesk such as troubleshooting, maintenance, upgrades, patches and fixes with all around technical support  Supporting EIGRP and BGP for problems of L2/L3 in internal teams & external customers. Providing daily network support for national wide area network consisting of MPLS, VPN and point to point site. Support customer troubleshooting of load balances to ensure proper functionality. Upgrading used DHCP to automatically assign reusable IP addresses to DHCP clients. Support customer with the configuration and maintenance of PIX, Palo Altoand ASA firewall systems Hands on experience with Cisco API (Application programming interface) Built site-to-site IPsec VPNsover Frame-relay & MPLS circuits on various models of Cisco routers to facilitate adding new business partners to new and existing infrastructures. Installation and administration of Checkpoint R 75.40 Firewall. Experience with cisco application centric infrastructure (ACI) Worked on documentation to create Visio diagrams using MS Visio. Worked with Project Engineering to ensure the reliability and maintainability of new and modified installations. Providing the Root-cause and Root-Cause Failure Analysis (RCA, RCFA) Worked on F5 BIG-IP LTM 8900, configured profiles, provided and ensured high availability. Worked on F5 load balancers deploying many load balancing techniques with multiple components for efficient performance. Experience on Cisco ISE for users accessing the network on an authorized, policy-compliant device. Using NAC managed and secured internal environment of the network Experience with Network Admission Control (NAC) in designing. Enforced security policies by blocking, isolating, and repairing noncompliant machines using NAC Established user identity, location, and access history, which can be used for compliance and reporting using Cisco ISE Installation, Maintenance, Troubleshooting Local and Wide Areas Network (ISDN, Frame relay, NAT, DHCP, TCP/IP).  Experience working with SDN and NFV concepts.  Configuration of Access List ACL (Std., Ext, Named) to allow users all over the company to access different applications and blocking others. Configured STP for loop prevention and VTP for Inter-VLAN Routing. Hands on experience with Nexus Switches 2K, 5K, 7K and 9k. Experience with juniper routers with routing protocols as OSPF, BGP, LDP. Knowledge of and worked with Wireless controllers and access points (WAP). Design, implementation and support personnel to configure and operate the Juniper Networks products Responsible for maintaining current documentation of LINUX systems, server configurations, administrative tools, and procedures for implementation/adaptation of products and services. Responsible for Managing VMware client. Experience with Cisco Prime Infrastructure. Experience with Cisco ASA and Checkpoint Firewalls Experience with Fortinet Firewalls Practical experience with MPLS, BGP, OSPF, IGMP V1 & V2 protocols Support ongoing efforts in defining best practice policies for Juniper product applications used by Customer Created standard access lists to allow SNMP, NTP and logging servers. Documented new VPN enrollments in a database and create standard procedures for further improvement. Experience with application performance management tools (Solarwinds, Netscout) to troubleshoot, analyze bandwidth and user traffic issues. Experience with Datacenter environment. Experience in design and build of Greenfield setup of network in a Data center. Experience running and troubleshooting of the network cabling. Experience with shipping and receiving of Data Center equipment Troubleshoot traffic passing managed firewalls via logs and packet captures.  Configured multiple domain name services (DNS), email services (Exchange Server), web, and file transfer protocol services (FTP) for various platforms including line leasing through DHCP servers. Configuring various advanced features (Profiles, monitors, iRules, Redundancy, SSL Termination, Persistence, SNATs, HA on F5 BIGIP appliances SSL termination and initiation, Persistence, Digital Certificates, Executed various migration/upgrade projects across F5 and hands on with F5 BIGIP LTMs/EM and WOM Proficient in VoIP infrastructure and protocols- SIP, MGCP, SCCP and SRTP. Cisco Unified Communication Manager(CUCM) Experience in Cisco Unified Call Manager Express and High Availability solutions.  Provided training and support of InformaCast (Singlewire) to implement the upgrade InformaCast server software from 9.0.2 to the latest available version that is supported on the Cisco Unified Call Manager (CUCM) version. Hands on experience with Flexpod. Manages and develops upgrades to the company's telephone system. Oversees all telephone changes, including routing for seating assignments. Hands on experience withcisco iWANtechnologies, specifically Wan Optimization & DMVPN Hands on experience with iWAN deployment Hands-on knowledge of the installation, implementation, and maintenance of NetApp platforms Experience with cisco merakiMX80 switches Juniper experience on routing products (MX5 through MX960) and security products (SRX) Networking protocols worked with included but not limited to TCP/IP, DNS, WINS, DHCP, VPN, Terminal Services, Routing and Remote Access, Network Design, wiring and cabling. Key contributor in the execution of all regulatory and compliance (SOX, PCI, etc.) readiness assessments and information sessions. Hands on experience with deployment & support in Unified Communication Domain. Experience with SIPTrunking for PSTN access, call flows and troubleshooting. Experience with SQL  Experience with Shell scripting, Perl&Python, with knowledge of Python web framework Django. \t\t OnDeck, NYC, NY                  Jan 2013 – Sept 2014 Network Engineer Responsibilities: Network Architect for datacenter consolidation project. Consolidated 16 global datacenters consisting of Cisco 6500, 4500, 2800, ASA 5540, F5 BIG-IP 3600. Consolidation was in preparation to upgrade datacenters to Nexus 9000, 7000, 5000, 2000, and ASR 1000 backbone infrastructure.  Provided Cloud Network Infrastructure support for global clients. Included setting up new VPNs, NAT, and URL configuration Implemented 802.1X port authentication solution using Cisco ISE and Microsoft Active Directory Primary responsibility is to design and deploy various network security & High Availability products like Cisco ASA other security products Install, Manage & Troubleshoot Large Networks & Systems Administration on Windows & Linux platforms in Development, Lab & Production Environments Monitored network performance, availability, and reliability using tools such as Wireshark, Net flow, Solar winds. Worked extensively in Configuring, Monitoring and Troubleshooting Cisco's ASA 5500/PIX security appliance, Failover DMZ zoning & configuring VLANs/routing/NATing with the firewalls per design Worked on F5 Load Balancers – Configuring rules, Profiles, Nats/Snats, Load Balancing Responsible for Cisco ASA, Palo Alto firewall administration across our global networks Set up site-to-site and remote access VPN, and created security policies on firewalls Implement and configured GLBP (on core switching and also for VPN redundancy), HSRP on different location of office on the switched network and managing the entire multilayer switched network Hands-on implementation and configuration of routers, hubs, switches, Wireless Controllers, Wireless Access points, and cabling in a large enterprise LAN / WAN / WLAN environment Good knowledge and experience with Wi-Fi technologies. Troubleshooting and installing of CRS, ISR, GSR, ASR9000 and Nexus devices. Engineering the configurations for the different branches, campus locations Worked on the redistribution of connected routes on all OSPF devices so that all connected subnets are advertised via OSPF Configuration and extension of VLAN from one network segment to other segment between Different vendor switches (Cisco, Juniper) Dealt with creating VIP(virtual servers), pools, nodes and applying iRules for the virtual servers like cookie persistency, redirection of the URL Hands-on configuration and operational knowledge ofJuniper Networks routers and switches Design, and configuring of OSPF, BGP on Juniper Routers and SRX Firewalls Configuring IPSEC VPN on SRX series firewalls Configuration and troubleshooting on HSRP, VRRP, GLBP, RSTP, MST related issues coming in network environment Experience with Fortinet and Checkpoint Firewalls Expert knowledge of routing protocols including BGP, OSPF, IGMP Experience with multi-domain security management (provider 1) Configuration and extension of VLAN from one network segment to their segment between Different vendor switches (Cisco, Juniper) Using UCS C series server, simplified and fast deployment of applications Conversions to BGP WAN routing. Which will be to convert WAN routing from OSPF to BGP (OSPF is used for local routing only) which involves new wan links. Migration of existing IPSEC VPN tunnels from Pre-Shared key to Certificate Authority for purpose of scaling Provided input to Risk Management Plan to anticipate reliability-related, and non-reliability-related risks to impact plant operation. Experience using Splunk monitoring tool Experience using Qos Expert knowledge with Windows OS 7 & 10 Experience with Shell scripting& Perl. Experience with event-driven programming in Python Experience with Automated Call Distribution (ACD), dealing with inbound and outbound calls Responsible for Cisco ASA firewall administration across our global network \t\t\t\t QVC Studio, West Chester, PA                                                    Oct 2011 – Dec 2012 Network Engineer Responsibilities: Configured IP RIP, PPP, BGP, IS-IS and OSPF routing protocols Involved in the configuration & troubleshooting of routing protocols: MP-BGP, OSPF, LDP, EIGRP, RIP, BGP v4. Configured IP access filter policies. Experience with Checkpoint Firewall policy provisioning Identifying technical problems and debugged hardware and software related to LANs/ WANs, different kind of workstation (PC/ MAC/ LINUX), laptops, printers, and copier. Identify, design and implement flexible, responsive, and secure technology services Experience with Cisco ASA and Checkpoint Firewall Administration, Rule Analysis, Rule Modification Configured and implemented Nexus 5K and 2K in lab environment Experience with configuring Nexus 2000 Fabric Extender (FEX) which acts as a remote line card (module) for the Nexus 7000. Test Equipment Network Instruments OPNET, Ethereal/Wireshark. Troubleshoot traffic passing managed firewalls via logs and packet captures Configured and resolved various OSPF issues in an OSPF multi area environment. Managed fast Layer 3 switched/routed LAN/WAN infrastructure as a part of Network team. The LAN consisted of Cisco campus model of Cisco 3550 at access layer, Cisco 6513 at distribution/core Check for DNS issues by pinging the server’s name. Experience with Wireshark, Test TCP& OPNET Understanding the JUNOS platform and worked with IOS upgrade of Juniper devices Configuration and troubleshooting on Juniper EX4500 and EX8200 switches Implementing VoIP solutions using SIP & H.323, also have sound knowledge of Avaya VoIP products Managed inbound calls with ACD Convert Branch WAN links from TDM and SIP circuits to MPLS and to convert encryption from IPSec/GRE to Get VPN. Configuring and troubleshooting CISCO catalyst 6509, 7609, 7613 with Supervisor cards, Cisco 3640, Cisco GSR 12416,21418(with PRP and RPR processors) Configuring RIP, OSPF and Static routing on Juniper Routers Designed and implemented Cisco VoIP infrastructure for a large enterprise and multi-unit office environment. Met aggressive schedule to ensure a Multi-office reconfiguration project which was successfully delivered Experience with AMP to strengthen defenses and protect against known and emerging threats Experience using AMP Continuously track activity and communication on devices and on the system level to quickly understand root causes and the history of events leading up to and after a compromise Experience with implementing Application centric infra-structure ACI Maintained an advanced level of knowledge in the technical areas relevant to SOX, PCI DSS and other regulatory requirements. In-depth knowledge of open internet standards and protocols such as: Ethernet, Wi-Fi. Configuration and troubleshooting of Cisco catalyst 6509,7613 with supervisor cards Design, implementation and operational support of routing/switching protocols in complex environments including BGP, OSPF, EIGRP, Spanning Tree, 802.1q, etc. Estimated Project costs and created documentation for project funding approvals. Managed various teams involved in site surveys, cabling specifications, Network equipment installation and configuration. Implemented redundant Load balancing technique with Internet applications for switches and routers. Experience with implementation and management of Cisco Call Manager servers Experience with Windows Server 2012 Planned resources and presented project status to higher management. Excellent troubleshooting knowledge on T1, T3, OC-3 and OC-12. Apollo Health, India                                                                          Aug 2010 – Sep 2011 Network Engineer Responsibilities: Migration of RIP V2 to OSPF, BGP routing protocols. Configured EIGRP for Lab Environment. Implemented ISL and 802.1Q for communicating through VTP. Working with Client teams to find out requirements for their Network Requirements. Designing0 solutions for frozen requirements using Cisco Routers and Switches. Deploying the network infrastructure to meet the requirements Experience working with F5 Load Balancer LTM and GTM module Experience configuring Virtual Device Context in Nexus 7010. Experience with Juniper JUNOS operating system and working on M and MX series routers Created VLAN and Inter-V lan routing with Multilayer Switching. Substantial lab testing & validation prior to implementation of Nexus 7K, 5K & 2K connecting to blade servers Understanding the JUNOS platform and worked with IOS upgrade of Juniper devices Completed service requests (i.e. – IP readdressing, bandwidth upgrades, IOS/platform upgrades, and etc) Providing technical consultancy for better application response using QoS Monitor performance of network and servers to identify potential problems using Sourcefire Performed RIP, OSPF, BGP EIGRP routing protocol administration. Installed wireless access points (WAP) at various locations in the company. Maintained redundancy on Cisco 2600, 2800 and 3600routers with HSRP. Real time monitoring and network management using Cisco Works LMS. Provided technical support on hardware and software related issues to remote production sites. Other responsibilities included documentation and support other teams Blooms Software solutions, IndiaMay 2008 – July 2010 Network Engineer Responsibilities: Managed network connectivity and network security, between Head offices and Branch office Responsible for Internal and external accounts and, managing LAN/WAN and checking for Security Settings of the networking devices (Cisco Router, switches) co-coordinating with the system/Network administrator during any major changes and implementation Responsible for the installation, configuration, maintenance and troubleshooting of the company network. Duties included monitoring network performance using various network tools to ensure the availability, integrity and confidentiality of application and equipment Installation & configuration of Cisco VPN concentrator 3060 for VPN tunnel with Cisco VPN hardware & software client and PIX firewall Configured application load balancing using F5 LTM. Configuration and troubleshooting on Juniper EX4500 and EX8200 switches Dealt with Cisco IP phones and VOIP devices and configured Voice VLAN’s for Prioritizing voice on the network and did the documentation accordingly with changes. Configured, Managed and troubleshooting 802.1X authentication for windows server-client   based environment. Configured Firewall logging, DMZs& related security policies & monitoring Creating Private VLANs & preventing VLAN hopping attacks & mitigating spoofing with snooping & IP source guard Involved in troubleshooting of DNS, DHCP and other IP conflict problems Implementation of name resolution using WINS & DNS in TCP/IP environment Configured FTP server for inside/outside users & vendors Implemented the security architecture for highly complex transport and application architectures addressing well known vulnerabilities and using access control lists that would serve as their primary security on their core & failover firewalls"}