{"text": "Name: helen helen E-Mail: helen.helen@gmail.com Address: São Paulo, Brazil Github: https://github.com/helen LinkedIn: https://linkedin.com/helen Phone No. 707286803731                                                                   PROFESSIONAL SUMMARY Around 8 years of experience in Salesforce.com CRM as Administrator/Developing, Data management including build Profiles, Roles, Users, Email Services, Approvals, Workflows, Reports, Page Layouts, Dashboards, Actions, Tasks and Events and implementation on various business domains. Troubleshooting issues and resolving cases. Strong knowledge of Sales, Service and support automation. Implemented Security and Sharing rules at Object, Field and Record levels for different users in the organization. Hands on experience in implementing Validation Rules, Field Dependencies, Assignment Rules, Work Flows, Process Builder and Approval Processes for automated alerts, field updates & Email generation according to application requirements. Experience in Salesforce lighting features like activities, contextual Hovers, Opportunity board, Customizable dash board. Provided ongoing salesforce.com maintenance and administration services including periodic data cleansing, custom objects, workflows Experienced in all phases of Software Development Life Cycle (SDLC), quality management systems and project life cycle processes. Skilled in Salesforce.com (SFDC) development and implementation. Experience in Salesforce Customization, Data Validation, Sales, Marketing, Customer Service and Support Administration. Experience on Sales Cloud, Service Cloud and Extensive experience using Salesforce.com's Administration, Territory management, Creating Roles, Profiles, Page Layouts, Workflow Alerts, Actions and Approval Workflow Data Validation. Technical Knowledge about Salesforce lighting schema builder, process builder, app builder, components and lighting connect. Proficient in Bulk Data Migration from Traditional Applications to Sales Force using on demand Apex Data Loader.IO. Experience in customizing standard objects like Accounts, Contacts, Opportunities, Products, Cases, Leads, Campaigns and Custom objects as per client’s need. Experience in Data Migration using Data Import Wizard, Jitterbit data loader, Apex Data Loader and generating custom reports and dashboards. Experience in creating the relationships/junction objects like Master-Child, lookups, Entity Relationship data model. Proficient in data management, data manipulation, VLOOKUP, CRMFusion’s demand tools. Ability to perform Validation Rules, work flows, e-mail services and approval processes.  Proficiency in installing App Exchange applications Experience in database language SQL.  Having Good and clear understanding of object oriented programming language concepts. Experience in web design technologies such as HTML, JavaScript, and CSS. Capable of rapidly learning new technologies and processes, and successfully applying them to projects and operations. Excellent work ethics, self-motivated, quick learner and team oriented. Continually provided value added services to the clients through thoughtful experience and excellent communication skills. CERTIFICATIONS Salesforce.com Certification – 201 Administrator Salesforce.com Certification – 401 Platform Developer I TECHNICAL SKILLS WORK EXPERIENCE Client: State of Indiana, IN                                                                                                                                   Mar 17 - Current Role: Sr Salesforce Consultant Responsibilities: Experience in Development, Administration, Configuration, Implementation and Support of Salesforce CRM based on Apex language and leveraging Force.com Platform.   Experience in Integrating App Exchange Applications with Salesforce, Mass E-Mail Management, Application management using Force.com     Experience in understanding business requirement to design the required entities like custom objects, creating the relationships and junction objects. Involved in various activities of the data migration project, involving information gathering, analyzing the model of the existing org, redesigning and customizing the new org. A team player with strong work ethic, a positive attitude and ability to make the best use of individual resources. Committed to excellence, and a prudent developer with strong problem-solving, analytical skills and communication skills. Involved in configuring, customizing and maintaining the new Production org and sand boxes.  Setup new Users and Profiles, configured the User permissions and Role based access based on the organizational hierarchy. Manage the Salesforce Database by monitoring the integrity of data entry accuracy, enter all donations, assign appropriate flags, and more. Responsible for all migration activities related to configuring Data Loader, uploading data in CSV files into the Production Org, checking for the correctness of the data. Worked on various salesforce.com standard objects like Accounts, Contacts, Leads, Opportunities, Reports and Dashboards. Used Lightning process builder for visualizing and creating automated business processes.  Captured Leads originated from the corporate web-site and routed to marketing teams using assignment & auto response rules Created Web-to-Case forms and Email-to-Case response system to handle effective case management. Manage customers with profiles, permission sets, roles, and sharing rules in customer portal.  Environment: Salesforce.com, triggers, workflow, validation rules, Data loader, AppExchange, report, dashboard, Force.com IDE, Java, JavaScript, HTML, sandbox, Custom Objects, Custom tabs, Security Controls.  Client: Stericycle, IN                                                                                                                                          Aug 16 – Mar 17 Role: Sr Salesforce Developer Responsibilities: Worked closely with Business Users for requirements gathering, analyzing the requirements, and documenting the functional & non-functional requirements.  Designed, developed the Custom objects, Page layouts, Custom tabs to suit to the needs of the application.   Designed, developed and deployed Apex Classes, Controller Classes and Apex Triggers, packages for various functional needs in the application.  Performed detailed analysis of business and technical requirements and developed the Apex classes using other Platform based technologies like Visualforce, Force.com IDE.   Created workflow rule to automate opportunity-naming convention to be defaulted with Account name, Primary Product & close date. Build & assigned users in the role hierarchy as per the design of Solution/ Technical architect. Created multiple custom profiles & permission set to meet the business requirement & process. Created email services, page layout, mini page layout workflows, record types & field level security as per the user stories.   Captured Leads originated from the corporate web-site and routed to marketing teams using assignment & auto response rules. Designed, and developed the Custom objects, Record Types, Formula fields, Page layouts, workflow rules, tasks, emails and alerts to track customer related tasks and activities. Deployed meta-data & customization into multiple environments using change sets. Provided daily support to the user community (Data Management, Password access, How-to & Process related questions). Used change sets for deployment. Experienced on Salesforce reports and dashboards, communities, customer portals, partner portals, knowledge management, content management. Worked closely with project manager to co-ordinate, track and monitor project progress and status.  Environment:  Saleforce.com platform,Triggers,force.com Role Hierarchies, Sharing Rules, Email Templates, Reports, Dashboards, Custom Objects, Custom Tabs, Email Services, Security Controls, Approval process. Client: USAA, TX                                                                                                                                                      Oct 15 – Aug 16    Role: Salesforce Administrator/Developer Responsibilities:  Manage users, Public Groups, Profiles, and Roles within the Salesforce CRM; this involved designating access to the applicable user within the user hierarchy.  Created user profiles and configured the permissions based on the organizational hierarchy requirements. Created various Reports (summary reports, matrix reports, and dashboards) and Report types to assist managers to better utilize Salesforce.  Implementing of various QA topics in customer communities etc.  Created workflow rules, approval process and defined actions like Tasks, Email alerts, outbound message and Field updates.   Analyzed and created custom Profiles as required for the business needs and implemented object level, field level and record level security. Developed Workflow Rules, Approval Processes and customizations within salesforce.com  Created custom report types and generated Reports using the report types  Used Data Loader for insert, update, and bulk import or export of data from Salesforce.com Objects. Used it to read, extract, and load data from comma-separated values (CSV) files. Creating and managing Customer portals, Self-service portals, knowledge and cases via portals. \n Organized Email Templates and Mail Merge Templates and was committed in doing the mail merge for various standard and custom objects. Created Chatter group and its daily digest. Added Global picklist values for the State and dependent picklist for cities. Responsible for Salesforce.com inquires regarding issue resolution from all parts of the Sales. Environment: Saleforce.com platform,Apex,Visualforce account hierarchy, Workflow rules, Reports, Custom Objects, Custom Tabs, Email Services ,Security Controls, Data Loading, Data Management, Documentation, Communities, Portals. Client: Foursoft Technologies Private Ltd, India                                                                                               July 10 – Aug 15    Role: Salesforce Administrator Responsibilities:  Sales Cloud implementation for a mid-range user-base, the project includes but not limited to, creating Customized applications, various Custom objects, Tabs, field & page layout customization for the standard objects like Account, contact, Leads ,managing campaigns, create customized HTML email templates,  Good Knowledge in complete software development life cycle (SDLC) including requirement gathering and analysis, design, implementation and Maintenance. Set-up escalation and assignment rules for case automation, built custom page layouts and record types for support process.  Set-up and configured local sandbox environments to replicate reported issues in-house, before deploying to the production environment.  Managed all requests company-wide (100+ users) for user assistance, troubleshooting and daily maintenance.   Manage reports and dashboards folders for groups, customizing reports using filters and criteria and control visibility, creating reporting snapshots for tracking historical data. Automated Business process using workflow rules, approvals, possess working knowledge in using tools like Process Builder and Visual Flow. Provide day to day support and troubleshoot issues. Gather, document, and analyze data and information. Developed Documentation based on client requirements. Performed detailed analysis of technical and business requirements Closely worked with SalesForce.com consultants while implementing the solutions for the requirements. Designed, Implemented and deployed the Custom objects, Page layouts, Custom tabs, and Components, to suit to the needs of the application. Involved in Salesforce.com application setup activities and customized the apps to match the functional needs of the organization. Used Data Loader for insert, update, and bulk import or export of data from Salesforce.com Objects. Used it to read, extract, and load data from comma separated values (CSV) files. Involved in creating and customizing Email template and configuring them to the email alert within the workflow rule for a standard/custom object. Environment: Saleforce.com platform, Import Wizard, Data Loader Workflow rules, Reports, Custom Objects, Custom Tabs, Email Services, sales cloud, Service cloud, Data Management.   EDUCATION Bachelors in computer science"}