{"text": "Name: daisy daisy E-Mail: daisy.daisy@gmail.com Address: Xi’an, China Github: https://github.com/daisy LinkedIn: https://linkedin.com/daisy Phone No. 393889700811 PROFESSIONAL SUMMARY: More than 7+ years of work experience in Business System Analysis, Software Design, Development, Implementation and Quality Assurance of client business applications with knowledge of the Software Development Life Cycle and Quality Assurance Life Cycle. Strong analytical, problem solving, decision making and project management skills.  Proven success in Business Requirement gathering, Analysis, Business Process flows (As-Is and To-Be), JAD sessions, UAT, Cost Benefit Analysis and Work breakdown structure (WBS), RACI Matrix. Proficient in understanding the business requirements and developing technology specifications accordingly Expertise in Business Modeling and UML Diagrams (Use Case Diagrams, Activity Diagrams, Sequence Diagrams) using MS Visio.  Well experienced of SOA Architecture, Internal and external Web Services (SOAP, WSDL, and UDDI). Experience creating custom objects and integrating existing desktop and web apps with legacy mainframe systems. Worked on cloud computing using Microsoft Azure. Experience in creating Test Plan and Test Cases for Functional and Non-Functional testing. Extensive Knowledge of Financial Analysis, Forecasting, Valuation, Planning and Budgeting. Worked on System Integration projects involving source-to-target mapping. Expertise in databases such as Oracle, MS SQL Server, DB2 and in writing Oracle SQL & PL/SQL queries. Experience with Data Warehouse (DWH) system including OLTP/OLAP concepts, Data warehouse modeling including star and snowflake schemas, concepts around Facts and Dimensional tables and how ETL and reporting tools work in DWH environment.  Strong analysis and communication skills with an ability to transform the needs of stakeholders into Functional/Technical requirements and SME in the functional areas.  Extensive experience in producing documents like Business Requirements Documents (BRD), Functional Requirement Specifications (FRS), Software Requirement Specifications (SRS), Creating Request for Proposals (RFP), creating Requirements Traceability Matrix (RTM).  Expertise in diverse software engineering practices such as System Development Life Cycle (SDLC), Waterfall, Rational Unified Process (RUP) and Agile Method (SCRUM) in delivering artifacts pertaining to requirement analysis.  Experience in documenting the business requirements that are acquired from end users and stakeholders. Experience in Use Case Analysis, creating Key performance indicators (KPI), Enterprise Risk Management, and Change Management. Extensive experience on Excel, Word, PowerPoint, MS Project, MS Visio, Rational Suite and SQL. Guided and mentored inexperienced team members and helped them in meeting the target dates for projects. Extensive experience in coordinating with offshore testing and production support team. Excellent experience working with HPQC/ALM, TFS as Test Management Tools. TECHNICAL SKILL SET: PROFESSIONAL EXPERIENCE: J.M. Smucker, Orrville, OH                  \t\t\t\t\t             June 2018- Feb 2020    Sr. Business System Analyst I was involved in multiple projects e.g. Deduction Management System, EWT- Logistic/Supply chain. The scope of Deduction Management project was to identify and integrate the right tool/system for Trade-Nontrade deduction management in USA and Canada. This tool will be integrated with companies like Walmart, Kroger and Target etc. The new system will play a vital role in optimizing Trade-nontrade business lines for Smucker’s.  Responsibilities:   Study and analyze work flow and procedure including communication and information flows between Clients, consultants and our management.  Assist team to identify project Scope, Objective and specify strategies and action to achieve them.  Document findings of study and prepare recommendation for implementation of new system and procedure through written reports.  Reviewed and gathered requirements from the Subject Matter Experts (SME) and Business Partners using various elicitation techniques  Created Scope Management Documents, Business Requirements Document (BRD) and Functional Requirement Document (FRD), Technical Document (TDD) Created artifacts such as Use Cases, Prototypes, Business Flows and Work Flow diagrams for effective plans  Extensive experience in End to End Design, Development and Implementation of testing methodologies including Cloud Environment (Microsoft Azure) In Waterfall, Spiral and Agile SDLC Environments. Gathered user and business requirements through Elaboration session (EOD) open-ended discussions, brainstorming sessions and JAD Session.  Performed User Acceptance Testing (UAT) for various web based and database related applications. Responsible for delegating and maintaining projects with the daily operations of the Point of sale department. Maintained and managed SharePoint website  Managed the Azure Services. Configured and Host different Application databases and Demo database in SQL Azure. Developed conceptual models and detailed UI design specifications for web-based applications Involved in the creating the User Interface Specification Document and User Training Manual as per project specification with the help of development team. Created standard templates for required security assessment and authorization documents, including risk assessments, security plans, security assessment plans and reports, contingency plans, and security authorization packages Translated stakeholder requirements into various documentation deliverables such as functional specifications, Non-functional specifications, technical API specification, use cases, user stories, and workflow/process diagrams.  Made changes in a few stored procedures that do not compliance with SQL Azure and in some time change the logic of them. Managed changes in requirements using a Change Control process  Documented and analyzed defects using HP Quality Center  Analyzed project goals, broke down what needed to be created and attempted to engage users so that definite requirements could be defined  Worked with SQL queries for data manipulations Documented detailed requirements for System Enhancement and made high-level flow charts. HSBC Bank, Boston, MA\t\t\t                                     \t              Jan 2017- May 2018 Business Systems Analyst HSBC Bank is the one of the Top Ten Financial Services Institutions in the U.S providing a wide range of financial services to its Consumers & Business. Integrated Online Transaction Processing System is struts based application which includes online banking & mortgage loan processing system. It is developed to retrieve existing customers Data from legacy systems; captured new data related to mortgage then connect to credit history agencies & process the loan for approval. The system has 4 modules: Online Banking, Online Bill Pay, and Online Mortgage Loan Processing & Online Brokerage on Mortgage Securities. Responsibilities: Performed requirements gathering from the business users of the system while adhering to SDLC (Software Development Life Cycle) industry best practices.  Developed excel models to derive the amortization schedule for Whole loan products and Mortgage Backed Securities Designed, developed, documented, tested and maintained various web-based project using PHP, MySQL, Javascript, XML, HTML and CSS. Helped gain real-time visibility on business operations and receive continuous feedback loops to improve process performance using Appian BPM suite. Design and implementation of the process in Appian. Implementation of UI, Rules, and CDTs in Appian. Created cash flow models for Mortgage Backed Securities, Whole Loans, Structured Securities using Bloomberg, Intex and ADCO data Provide AGILE project management controls, project plans, timeline schedules, facilitate RAD sessions, and review software defects. Performed GAP analysis to identify problems and performed Business Process Modeling Documented the complete process flow to describe program development, logic, testing, and implementation, application integration, coding. Monitor/maintain the accuracy of data quality business rules deployed into production. Implementation process combines analysis, development, testing, and creation of UAT and production environments for various custom requirements and requests. Worked with project team representatives to ensure that logical and physical data models were developed in line with corporate standards and guidelines. Involved in defining the source to target data mappings, business rules and data definitions. Responsible for defining the key identifiers for each mapping/interface. Responsible for defining the functional requirement documents for each source to target interface. Documented, clarify, and communicate requests for change requests with the requestor and coordinate with the development and testing team. Documented data quality and traceability documents for each source interface. Documented the complete process flow to describe program development, logic, testing, and implementation, application integration, coding. Worked with project team representatives to ensure that logical and physical ER/Studio data models were developed in line with corporate standards and guidelines. Used data analysis techniques to validate business rules and identify low quality missing data in the existing Amgen enterprise data warehouse (EDW). SSGA Financials, Boston, MA\t\t\t\t\t             \t\t\tMar 2015-Dec 2016 Business System Analyst Description: State Street Global Advisors (SSGA) is the division of State Street Corporation. The company services financial clients by creating and managing investment strategies for non-profit foundations, businesses, corporations, associations, governments, educational institutions, and religious organizations. Its services include Asset management, Mutual funds and Exchange-traded funds. Worked on a Trading application for Capital Markets & Asset Management. The system includes Fixed Income, Equities, and Derivatives – Options, Futures & OTC market. The Trading application was used to create client Accounts, Capture Trades, and Execute Trades for the clients by Portfolio Managers and Traders. It also maintained records of the clients’ portfolio.  Responsibilities: Analyzed the Capital Market businesses to understand the architecture of the various processes and participated in a strategic decision making process about what applications needs to be decommissioned to reduce the cost. Elicited and gathered high-level requirements by conducting stakeholder meetings, interviews and discussions. Used Query Analyzer, Execution Plan to optimize SQL Queries. Involved in excellent documentation for the UAT test scripts.  Framed a detailed JAD session agenda and facilitated sessions with the SMEs, process owners & stake holders and collected the meeting minutes from the session and identified various action items. Authored documents for Brokerage Trade Data using the Charles River Trading Tool. Identified usage, opportunities to consolidate/streamline functionality of the Charles River trading and post-trade compliance system, integrated it with a new accounting system. Led client facilitation meetings to gather Interface and Business Process Requirements from Subject Matter Experts in Trading shares, Equities and Fixed Incomes like Bonds, and converted them into functional requirements by implementing the RUP methodology, authored the same in Business Requirement Document (BRD). Created Business Process Diagrams (BPD) and Business Flow Diagrams using MS Visio. Prepared graphical depictions of Textual Use Cases, creating Use Case Diagrams, and Activity Diagrams. Performed Fixed Income Analysis (Pricing, Risk, Yield, Duration, Option Greeks, and Recommended Strategy) in Excel to support trading, and reviewed with portfolio manager and traders. Assisted Risk Management Group in Financial analysis and Risk analysis on calculation of PV, FV, standard deviation and variance, and other key trade metrics (e.g. Breakeven Rate) to test new Risk Analytic Tool. Worked on designing the data structure in SQL Server and implemented to design 3 database based on the requirement for Dashboard Worked with testing team in developing the test plan, test conditions, test cases based on business requirements and technical specifications. Involved in UAT process and coordinated with the UAT team to get the feedback to make change requirements document. Conducted data analysis and data validation by writing complex SQL queries and codes using TOAD for ORACLE database. Performed System and Integration Testing using Quick Test Pro. Directed and managed the Change Control process for the project as a whole by facilitating group meetings, one-on-one interviews and corresponding through emails with work stream owners to discuss the impact of change request on the project. Co-ordinated with the plan owners to update the project plans with any impact due to a change request. Verified if the contingency plan will absorb any delay in project due to change request. Track progress on updates in project plans. Calculated Market Risk of portfolios for Asset Allocation using Excel Financial Modeling in Excel Documented the reports of Capital markets, Asset Management & Wealth Management. Applied Agile/Scrum methodology with its various workflows, artifacts, and activities to manage life cycle from Inception to Transition phase. Citigroup, Warren, NJ\t\t\t\t\t\t              \t\t\tDec 2013-Feb 2015 Business System Analyst  Project: OTC Trading Platform Description: The Project was to implement over-the-counter (OTC) Derivatives trading platform for various products like equities, commodities, Fixed Income Bond Product, Interest rate derivatives and swaps, credit default swap (CDS), Options and forward FX. An OTC derivatives trade involves multiple stages, each of which requires specific activities to be performed. It is much longer and complex than the equity trade. The platformprovides a comprehensive suite of connectivity solutions designed to meet the complex needs of the global trading community. These solutions not only facilitate trading connectivity between global counterparties, but also provide low latency exchange & liquidity venue access. Responsibilities: Interviewed Subject Matter Experts and recorded requirements in a format so that management and stake holder can review and understand easily Involved in designing business requirement collection approach based on the project scope and SDLC Methodology Coordinated and prioritized outstanding risks and enhancement/system requests based on business requirements, allowing sufficient time frame to ensure accuracy and consider deadlines Implemented UML methodologies to design Use Case Diagrams, Data Flow Diagrams, Activity Diagrams, and Sequence Diagrams Used SQL to query the database and performed data analysis. Conducted JAD sessions with Project’s Stakeholders identifying problems and coming up with best alternative to resolve that. Created targeted Questionnaires for SME’s to gather requirements Documented System Requirements and supplementary requirements like complying with Industry regulations of ISDA (International swaps and derivatives association), (Commodity futures trading commission) and NFA (National Futures Association) Demonstrated strong analytical and project management skills, including a thorough understanding of how to interpret customer business needs and translate them into application and operational requirements Gathered all the right requirements to determine key issues and foresee potential show-stoppers that might arise later and in-depth understanding of OTC derivatives operations. In –depth knowledge of Interest Rates, Credit and Fixed Income Bond products, Interest rates swaps along with the trade flow for each of the instruments Interviewed SMEs, stakeholders and asked detailed questions and carefully recorded the requirements in a format that can be reviewed and understood by both business people and technical people Created ensuing use cases, report requirements/templates, scope documents, issue tracking and project plans in an Agile environment Working knowledge of structured products, interest rate swaps, Credit Default swaps, covering Forward Rate agreements (FRA), U.S. Treasury &Agency securities, Futures, Options on futures, Foreign exchange and Forward FX Worked on Implementation of various risk management tools and concepts; valuing Bond / Derivative trading portfolios; accounting guidelines applicable to derivative trading practices Fine-tuned search engines and pulled data from different databases and migrated data back and forth using SQL. Used Query Analyzer, Execution Plan to optimize SQL Queries. Worked on Options & Swaptions (Caps, Floors, Digital and Bermudan options), Exotic products (Range Accruals, Spread Options) designed to hedge risk Achieved product familiarity early in order to efficiently use consulting resources and Propagated project team knowledge to wider user/support community creating self-sufficiency prior to go-live and reduce dependence on support Made sure the client’s project team has a good knowledge of functionality prior to beginning the implementation and trained new staff members: operational support, application support etc. and reduced or eliminated key-man dependencies thus increased self-sufficiency Performed and coordinated the analysis and design of business systems Demonstrated excellent verbal and written communication skills and the ability to interact professionally with a diverse group, executives, managers, and subject matter experts. Communicated with the stakeholders throughout the lifecycle of the project; constantly updating them of the benefits and risks associated with the project Supported project manager while performing User Acceptance Testing to make sure all requirements are developed correctly Resolved issues related to requirements during system testing and User acceptance testing (UAT) Provided estimates of resources required for assigned projects as well as contributing to the development and support of staffing plans and funding requests Client: Best Buy, Richfield, MN\t\t\t\t                     \t\t\tDec 2012- Nov 2013 Business System Analyst  Providing support for new product system development and facilitating BB’s business to consumer (B2C) and business to business (B2B) financial aid and data delivery. Responsibilities: Assignment was to automate to develop applications for Fulfillment Department of Services under Agile Scrum master.  Developed prototype of new information processing application. Helped collect functional requirements and prepared business requirement documents using Rational Requisite  Strategize implementation of RUP effort throughout SDLC.  Aided management in standardizing Web applications by preparing GUI standards and recommending alternatives for incorporation in phased, iterative manner.  Followed UML based methods using Rational Rose to develop use cases and activity diagrams; assisted developers in creating sequence diagrams and collaboration diagrams.  Reviewed business process, URS, and functional requirements.  Assisted in process modeling; conducted and participated in JAD sessions with system users; helped with design walkthroughs with stakeholders for base lining architecture.  Applied a standardized SDLC process methodology within the Software Engineering department by creating department templates for: Software Development Plan, Software Requirements Specification, and Software Design Requirements. Involved in detailing project mission, data process flow diagrams, and timelines.  Worked with SQL queries for data manipulations.  Master the products, user flows & customer need (both B2C and B2B) to understand the impact & reporting needs associated with web changes.  Involved in gathering the Business Requirements. Used Use Cases, UML diagrams,  Documented Business Requirement Documents (BRD) and Software System Requirements (SSR) worked with IT developers.  Created company policies and procedures governing corporate security, email and Internet usage, access control, and incident response. Provided post-implementation support for the new web application used by the clients. Liaised with business and functional owner during risk engineering and high-level review sessions to derive and execute action plans, meeting deadlines and standards.  Interfaced with business users to prepare and update Business Process Requirements (BPR) and Software System Requirements (SSR).  Created test cases and test scripts. Ensured all artifacts complied with corporate SDLC Policies and guidelines. Prioritized outstanding defects and system problems, ensuring accuracy and deadlines were met.  Performed GAP analysis of business rules, business and system process flows, user administration, and requirements. Developed use case with UML for new product functionality.  Traced test cases and functional specifications to SSRs and BPRs using DOORS. "}