{"text": "Name: clara clara E-Mail: clara.clara@gmail.com Address: Baghdad, Iraq Github: https://github.com/clara LinkedIn: https://linkedin.com/clara Phone No. 632852721812 Profile: About 7years experience in Data modeling and Data analysis for Online transactional processing(OLTP) , data warehouse(OLAP) and business Intelligence(BI) applications for healthcare , insurance and banking applications. Summary: Participated in all phases of Software Development Cycle(SDLC). Experience working with Agile and Waterfall data modeling technologies. Proficient in conceptual and logical data modeling skills using ERWIN, Sybase power designer and Embarcadero E-R Studio. Experienced in gathering requirements, creating data mapping documents, queries. Experience with gathering requirements, conducting Joint Application Development(JAD) and Joint Requirement Planning(JRP) sessions, User Acceptance Testing(UAT), Gap Analysis. Well experienced in Forward and Reverse Engineering Principles. Hands on Experience in system analysis, Relational and Dimensional Data modeling, designing the database and implementing the RDBMS specific features. Efficient in analyzing and documenting Business Requirement Documents (BRD) and Functional Requirement Documents (FRD) along with User Case Modeling and UML. Proficient in Normalizing (Using 1NF, 2NF and 3NF) and De Normalizing Techniques for optimum performance in relational and dimensional database environments. Experience in creating and documenting Data marts while designing OLTP and OLAP system Environments. Experience in identifying Facts and Dimensions and strong understanding of principles of data Warehousing , Fact Tables , Dimension Tables, Slow changing Dimension (SCD) Type I and Type II. Experience in Ralph Kimball and Bill Inmon approaches. Involved in Extracting, Transforming and Loading (ETL) data from spreadsheets, database tables and other sources using Microsoft Data Transformation Service (DTS), and Informatica along with ETL team. Experience in performance analysis and created partitions, indexes and Aggregate tables where necessary.  Strong expertise in designing Data Architecture, Data Analysis, Oracle PL/SQL programming. Facilitated data requirement meetings with business and technical stakeholders and resolved conflicts to drive decisions. Strong experience in SQL queries and functions and also in creating Database Objects like Procedures, Triggers, Packages and User defined functions. Exported huge volumes of data from Teradata tables and views for processing and reporting, using Teradata Export Load utility. Experience in SQL Server DTS and SSIS (Integration Service) package design, constructing, and deployment. Experience in Data Migration, Data conversation, Data extraction, Transforming and loading (ETL) data from spreadsheets, database tables and other sources using Microsoft SSIS. Building reports using SQL SERVER Reporting Services (SSRS 2005/2008), Crystal Reports and Business Objects. Good working knowledge on cloud services like HD insights AZURE, AMBARI and AMAZON EC2 and S3 bucket web services. Good understanding on data governance and master data management. Excellent communication skills, analytical and inter-personal skills, self-starter with ability to work with minimal guidance and interact with individuals at all levels in SDLC. Technical Skills: Professional Experience: Client Name: Guardian Life Insurance, NY                                                                              May 2016- Present Role: Sr Data Modeler Responsibilities:  Gathered requirements and created use case diagrams as part of requirements analysis. Created a high-level industry standard, generalized data model to convert it into logical and physical model. Defined and Identified attributes, entities and relationships in the data model as per new specifications in Visio after analyzing the database systems currently in use.  Used forward engineering to create a Physical Data Model with DDL, based on the requirements from the Logical Data Model. Used ERWIN to create logical and physical data models for enterprise wide OLAP system. Handled and maintained model versioning using ERWIN. Designed an industry based model, specific to the company with group insurance offerings, translated the business requirements into detailed production level using Sequence Diagrams, Workflow Diagrams, Activity Diagrams and Use Case Modeling.  Generated various presentable reports using report designer and pinned reports in ERWIN.  Designed a STAR schema for sales data involving shared dimensions (Conformed) for other subject areas using Erwin Data Modeler. Created and maintained Logical Data Model (LDM) for the project. Includes documentation of all entities, attributes, data relationships, primary and foreign key structures, allowed values, codes, business rules, glossary terms, etc. Validated and updated the appropriate LDM's to process mappings, screen designs, use cases, business object model, and system object model as they evolve and change. Worked on Snow-flaking the Dimensions to remove redundancy.  Enforced OLTP data model referential integrity for consistent relationship between tables and efficient database design.  Identified and tracked the slowly changing dimensions (SCD I and II) and determined the hierarchies in Time and Branch Dimensions. Generated comprehensive analytical reports by running SQL queries against current databases to conduct data analysis. Worked pro-actively with Data Stewards and Subject Matter Experts and other specialist to help resolve data conflicts and data quality issues. Performed Data Mapping activities for the Data Warehouse. Review high level architecture and design database components. collaborate with senior system architects to pin down detailed solutions for specified requirements. Experience with Relational Modeling, Entity relationship modeling principles and techniques. Also created 3NF business area data modelling with de-normalized physical implementation data and information requirement analysis using ERWIN tool. Creation of ETL process for the new subject areas, Develop Data Extraction, Transformation and Loading program using Data Integrator. Knowledge on architecting the application for AWS by using AWS services and resources and compare the different modernization options.  Designing and deploying scalable, highly available, and fault tolerant systems on AWS. Developed complex Multi load and Fast Load scripts for loading data into Teradata tables from legacy systems. Involved in creating dashboards and reports in Tableau 8.1. Created report schedules on Tableau server. Preparing Dashboards using calculations, parameters in Tableau. Employed naming standard editor for defining new naming standards for the entities, attributes, domains, columns and tables that applied consistently all over the enterprise. Worked on Metadata exchange among various proprietary systems using XML. Handled performance requirements for databases in OLTP and OLAP models. Worked with ad-hoc reporting using Crystal Reports 9 and T-SQL. Modify and refine architecture based on findings. Participate in data modeling and database design. Created Data Model Using Erwin for DQM. Gathered requirements for Reporting needs of the end user SSRS. Generated comprehensive analytical reports by running SQL queries against current databases to conduct data analysis. Implemented slowly changing dimensions Type2 and Type3 for accessing history of reference data changes. Provided source to target mappings to the ETL team to perform initial, full, and Incremental loads into the target data mart. Environment: MS Visio, ERWIN, Teradata, SQL Server, Oracle SQL developer, Crystal Reports, Tableau. Client Name:  Fidelitrade Inc, Wilmington, Delaware                                                       Feb 2015- April 2016 Role: Sr Data Modeler Responsibilities:  Involved in all stages of Software Development Cycle (SDLC), gathered and translated business requirements into detailed, production-level technical specifications and made enhancements to the existing technical business functionality. Responsible for analyzing Design Implementation from the business solution and business requirements. Conducted live JAR & JAD sessions with SMEs, and all the placeholders to develop High Level Requirement and then formalized those requirements into Detail Level Requirements. collaborate with business analysts to define high level and detailed requirements. Worked in close co-ordination with Business People, Architects, Developers, Testers and Project Managers and also at times reported to the higher leadership. Created Conceptual, Logical, and Physical data models using ER studio for new system. Developed normalized logical and physical database models to design OLTP system for applications. Worked to cleanse and organize various tables in a presentable manner to help with better understanding of already existing models. Enforced referential integrity in the OLTP data model for consistent relationship between tables and efficient database design. work with development and test team to ensure all bugs are removed before code is deployed in UAT. Used ER studio tool for effective model management for dividing, sharing and reusing model information. Created action filters, parameters and calculated sets for preparing dashboards and worksheets in Tableau. Created Tableau scorecards, dashboards using stack bars, bar graphs, scattered plots, geographical maps, Gantt charts using show me functionality.  Used reverse engineering to create Graphical Representation (E-R diagram) and to connect to existing database. Responsible for leading the team for doing application assessments, risk assessments in identifying right candidates for migration & preparing the migration plan to the AWS cloud. Created Data flow diagrams for current system. Development of ETL Processes using SSIS Packages. Migration of DTS Packages to SSIS Packages. Conducted sessions with designers, business and advancement groups to comprehend the Change Requests (CR's), and impacts brought on the framework by the change demands. Created entity / process association matrices, entity-relationship diagrams, functional decomposition diagrams and data flow diagrams. Created Technical Mapping documents for the development team to develop mapping workflows. Checked for all the modeling standards including naming standards, entity relationships on model and for comments and history in the model. Generated customized report solutions for metadata reports. Developed Data Mapping, Data Governance, and Transformation and cleansing rules for the Master Data Management Architecture involving OLTP, ODS. Modify and refine architecture based on findings. Generated the ad-hoc SQL queries using joins, database connections and transformation rules to get the data from databases. Hands-on experience with ad-hoc reports using Crystal Reports. Improved data integrity by adding foreign keys and normalizing the underline data structure. Performed Performance tuning. Worked extensively on Forward and Reverse engineering processes. Created DDL Scripts for implementing Data Modeling changes. Created documentation and test cases, worked with users for new module enhancements and testing. Environment: ER studio, Erwin, Informatica, Teradata, Windows 7, MS Excel, MS Visio, DB2, Microsoft Transaction Server, Tableau, Crystal Reports. Client Name:  Cigna LLC, Bloomberg, CT                                                                                July 2014- Feb 2015 Role: Data Modeler Responsibilities: Interacted with business users to identify and understand business requirements and identified the scope of the projects. Participated in team meetings upon Joint Application Development (JAD) sessions to clarify the naming conventions followed with the Business Analysts. Created a physical data model by identifying business attributes and relationships between the Entities. Responsible for incorporating the business requirements into the data model and the OLAP tool. Developed Star Schema based dimensional model for the development of Data warehouse. Responsible for converting business requirements into logical model containing Tables and Columns. Created and maintained Logical and Physical models for the data mart which supports the Risk reporting for renal and immune diseases which included creating partitions, indexes for the tables. Performed Gap Analysis. Generated tableau dashboards for sales with forecast and reference lines. Redefined many attributes and relationships in the reverse engineered model and cleansed unwanted tables/columns as part of data analysis responsibilities. Conducted sessions with architects, business and development teams to understand the Change Requests (CR’s), and effects caused on the system by the change requests. Worked closely with the ETL SSIS Developers to explain the complex Data Transformation using Logic. Responsible to collect, analyze and summarize data and for Data Mapping. Wrote SQL scripts for creating tables, Sequences, Triggers, views and materialized views. Wrote SQL scripts for loading data from staging area to target tables. Created summary tables using de-normalization technique to improve Join operations. Performed Data Migration to a new database. Experienced in generating and documenting Metadata while designing application. Worked on Metadata Management. Involved in extracting the data using SSIS from OLTP to OLAP. Used various kinds of Data sets with SSRS. Export and Import of Metadata into Logical Data Models. Extensively worked on Performance Tuning and understanding Joins and Data distribution. Performed data analysis on the target tables to make sure the data as per the business expectations.  Maintained security and data integrity of the database. Designed and implemented a physical data model to handle marketing strategies and to satisfy reporting needs dynamically. Environment: ERWIN, Teradata, Crystal Reports, Toad, Tableau, Windows OS, DB2, SSRS, SQL Server, Business Objects. Client Name: AIG, Dallas, TX                                                                                                  April 2013-June 2014 Role:   Data Modeler Responsibilities: Gathered requirements and created ER (entity-relationship) diagrams as part of requirements analysis using ERWIN. Mapped the business requirements and new databases to the logical data model which defines the project delivery needs. Redefined many attributes and relationships in the reverse engineered model and cleansed unwanted tables/columns as part of data analysis responsibilities. Worked with analysts to create reporting universes in Business Objects.  Responsible to collect, analyze and summarize data and for Data Mapping. Worked at conceptual/logical/physical data model level using Erwin according to requirements. Designed the data marts using the Ralph Kimball’s Dimensional Data Mart modelling techniques.  Identified the measures and dimensions and organizing these into facts in creating the Dimensional Model within the business requirements. Designed Fact tables, Dimension and aggregate tables for Data warehouse. Implemented naming standards, and warehouse metadata for fact and dimension of Logical and Physical Data Model. Developed Star Schema and Snowflake Schema in designing the Logical Model into Dimensional Model.  Translated the Logical Data Model into Physical Data Model with Forward Engineering in Erwin tool. De-normalized the database to put them into the star schema of the data warehouse. Extensively used star schema methodologies in building and designing the logical data model into dimensional models. Worked on slowly changing dimension tables and hierarchies in dimensions. Worked on data mapping process from source system to target system. Extracted the Metadata from the Metadata repositories to generate the Mapping Documents. Establish and maintain processes to support and grow data modeling practices, conceptual, intermediate logical/ canonical and physical data models per company direction, Solution designs, options and recommendations relating to data models and databases.  Create and deploy reports using SSRS.  Maintaining requirements documents, creating reports and spread sheets readable by the users and developers. Environment: SQL Server, SQL Server Analysis Services, SSIS, SSRS, Crystal Reports, Windows 2000, Micro strategy, Crystal Enterprise, Erwin, CSV files, XML files, Business Objects. Client Name:  Hanes Brand, Winston Salem, NC                                                              Oct 2012-March 2013                         Role:  Data Modeler Responsibilities: Gather the various requirements from the business analysts. Gather all the Sales analysis reports prototypes from the business analysts belonging to different Business units; Participated in JAD sessions involving the discussion of various reporting needs.  Created logical, physical and dimension models. Optimize and update logical and physical data models to support new and existing data models. Developed Star and Snowflake schemas based dimensional model to develop the data warehouse. Modeled the dimensions and facts using ER Studio for centralized data warehouse. Identified and tracked slowly changing dimensions and determined the hierarchies in dimensions  Actively participated in data mapping activities for the data warehouse. Done SQL Server configuration database size estimation, database creation logins & user’s creation, granting object level permission, estimation of Indexes on tables. Wrote Stored Procedures and Triggers. Performed extensive requirement analysis and developed use cases and Workflow Diagrams. Analyzed existing logical data model (LDM) and made appropriate changes to make it compatible with business requirements.  Ensured the feasibility of the logical and physical design models. Worked on the Snow-flaking the Dimensions to remove redundancy.  Employed naming standard editor for defining new naming standards for the entities, attributes, domains, columns and tables that applied consistently all over the enterprise. Implemented slowly changing dimensions Type2 and Type3 for accessing history of reference data changes. Generated ad-hoc reports using Crystal Reports. Participated in the tasks of data migration from legacy to new database system.   Environment: ER Studio, SQL/MS SQL Server, MS OLAP Manager, MS Analysis Services, Windows XP, UML, Informatica Power Center, Crystal Reports. Client Name: Oriental insurance Group, India                                                                      Feb 2011- Sep 2012               Role: Data Modeler/ Data Analyst Responsibilities: Interacted with users and business analysts for requirement gathering. Involved in creating entity relational and dimensional relational data models using Sybase Power Designer tool.  Worked on Bill Inmon methodologies for modelling. Created tables, views, procedures and SQL scripts and mapping documents. Create logical and physical models using best practices to ensure high quality and reduced redundancy Developed Cleansing and data migration rules for the Integration Architecture (OLTP, ODS, DW) Analyzed conceptual into logical data and had JAD sessions and also communicated data related issues and standards. Expertise in the forward engineering of the logical models to generate the physical tables using Sybase Power Designer. Created tables, views, triggers, stored procedures and indexes.  Created integrity rules and defaults.  Created ftp connections, database connections for the sources and targets. Developed several forms & reports using Crystal Reports. Analyzed existing logical data model (LDM) and made appropriate changes to make it compatible with business requirements.  Resolved the data type inconsistencies between the source systems and the target system using the mapping documents and analyzing the database using SQL queries.  Maintained security and data integrity of the database. Environment: Sybase Power Designer, Visio, Excel, Word, Power Point, Microsoft Project and MS Excel, SQL Server, SQL PLUS, Windows XP, Crystal Reports. Client Name: Integrated Wireless Systems, India                                                                June 2010-Jan 2011 Role: Data Modeler/ Data Analyst Responsibilities: Involved in all the Functional requirements gathering sessions with the Business Analysts.  Design and Development of Requirements Specification document, business process modelling using UML.  Used SQL*Loader to load the database from flat files. Created a logical design of the central relational database using Erwin. Expertise in the forward engineering of the logical models to generate the physical tables using Erwin. Done SQL Server configuration database size estimation, database creation logins & user’s creation, granting object level permission, estimation of indexes on tables. Configured the DTS packages to run in periodic intervals. Extensively worked with DTS for Data Migration from source systems. Involved in writing Triggers which internally called procedures and functions. Maintained Data Security and Data Integrity of the Database. Environment: SQL server, Erwin, UML, Windows NT, Crystal Reports Education: Bachelor’s in Electronics and Communication Engineering, India."}