{"text": "Name: sarah sarah E-Mail: sarah.sarah@gmail.com Address: Guadalajara, Mexico Github: https://github.com/sarah LinkedIn: https://linkedin.com/sarah Phone No. 25798672826 Professional Summary Sr. Business Analyst with 8+ years of experience with an understanding of Business Process Flows, Case Tools, and Business Analysis with strong knowledge on Supply chain management. A proactive high performer with proven ability to work with multi-discipline, cross-cultural teams and end users. Proven success as a business analyst through the years, providing a well-balanced understanding of business relationships, business requirements, and technical solutions. Expertise in creating Functional and Non-Functional Requirements, UI Interface function, Historical data integrity, Data flow diagrams, ER diagrams, Use cases, (Scope, Objectives), Reverse engineering, UAT. Created and maintained report documentation, including Project Scope, Business Requirements, Project Status reports, Regular progress reports and training and reference materials for a variety of audience. Strong proficiency in all phases of SDLC (Software Development Life Cycle) including requirements gathering, analysis, design, implementation, testing and deployment. Proven skills in creating Business Requirement Document (BRD) and Functional Requirement Document (FRD). Experienced in conducting Joint Application Development (JAD) and Rapid Application Development (RAD) sessions. Conducted Requirement Gathering Sessions and interviewed Subject Matter Experts, gathered detailed functionality aspects of business process and updated the information to the requirements in an easily comprehensible format. Hands on experience on Mainframes (DB2), Oracle, SQL and Microsoft Tools (Word, Excel, Access, PowerPoint and MS Project) Extensively worked on creation of Narrative Use Cases, Data Flow Diagrams, Activity Diagrams, Work Flow Diagrams and Sequence Diagrams to define the business Process Model and Data Process Model using UML Rational tools/ MS Visio. Experience in extracting data from raw data files, Excel spreadsheets and external RDBMS tables (databases like SQL and MS Access). Good experience in MS Excel using Pivot tables, V Look up, H look up, aggregate functions etc. Worked on software testing like System Testing, Integration Testing, User Acceptance Testing (UAT), Performance Testing etc. Creative and aggressive self-starter with integrative thinking skills, capable of communicating creative ideas through graphical analysis charts and statistical data display. Hands on experience on Mainframes (DB2), Oracle, SQL and Microsoft Tools (Word, Excel, Access, PowerPoint and MS Project) Versatile team player with excellent communication, coordination, technical, Interpersonal and strong Client Interfacing skills to work independently with ability to handle diverse tasks simultaneously and adapt to tight deadline. Analyzing and understanding As-Is processes for Problem handling for Retail Business. Good understanding of Store Warehouse Inventory Movement (SWIM),Store returns (RTI ),check in, check out, Adjust in, Adjust Out, Transfer IN and Transfer OUT. Experienced in MFP for both front-end and backend. Extensively used tools Manhattan WMS, Oracle Retail Assortment Planning. Worked closely with marketing team for creating strategy for B2B and B2C market. Extensive experience with Business-to-consumer (B2C) sales of tangible goods/online services and Business-to-business (B2B) scenarios, such as e-procurement. Have good working experience on Oracle Retail Point of Service (ORPOS), Oracle Retail Store Inventory Management (ORSIM) and RMS applications. Broad knowledge of multi-channel retail business and systems, POS Systems, Supply Chain optimization concepts, Warehouse Management/Distribution Systems, and Inventory Systems (stores and warehouses). Creative and aggressive self-starter with integrative thinking skills, capable of communicating creative ideas through graphical analysis charts and statistical data display. Versatile team player with excellent communication, coordination, technical, Interpersonal and strong Client Interfacing skills to work independently with ability to handle diverse tasks simultaneously and adapt to tight deadline. Work experience Sr. Business Analyst\t\t\t\t\t\t\tJune 2018 to Present DSC Logistics - Des Plaines, IL Responsibilities Analyzed User Requirement Document, Business Requirement Document (BRD), Technical Requirement Specification and Functional Requirement Specification (FRS). Prepared and analyzed AS IS and TO BE in the existing architecture and performed Gap Analysis. Worked with the Sales & Operations team in the monthly planning activities. Created workflow scenarios, designed new process flows and documented the Business Process and various Business Scenarios and activities of the Business from the conceptual to procedural level. Helped IT developers design the Service Oriented Architecture (SOA) for the application based on the available resources, and the business requirements. Worked as an Interface between the Users and the different teams involved in the application development for the better understanding of the Business and IT Processes. Followed a structured approach to organize Requirements into logical groupings of essential Business Processes, Business Rules, and Information needs that ensures any Critical Requirements are not missed. Monitor and review procurement business practices and look for ways that we can streamline the process. I recommend new strategies to the management group. Involved in various brainstorming sessions to investigate, identify, analyze and solidify business rules. Develop and maintain key performance metrics on the procurement team. These metrics include aging requisitions, aging invoices, buyer spend, supplier spend, contract spend vs non- contract spend, etc. Centralize supply chain group by categorizing materials based on purchase order history, evaluated potential contract suppliers, submit request for quotations, Interview plant buyers for supplier feedback and submitted recommended material contracts. Managing a newly launch demand plan tool to help leverage spend Managing Inter-Organizational Systems (IOS) supply chain system implementation. Participate in supply chain management system implementation. Develop and execute SQL queries to investigate and analyze supply chain opportunities. Performed GAP analysis of business rules, business and system process flows, user administration, and requirements. Facilitated business users with hands on training for various existing and upcoming functionality with its scope and limitations in various stage of development and enhancement. Determined the root cause of an error, what controls are in place to prevent future errors or gaps and provide the line of business with feedback. Developing DDL scripts and DML operations using PL/SQL blocks, procedures and functions as per the requirements. Review and analyze the effectiveness and efficiency of existing systems and develop strategies for improving and enhancing the systems functionality. Negotiated annual cost reductions with regional storage facility. Develop creative solutions to complex problems, validate requirements with stakeholders and provide the optimal IT solutions using JIRA. Created Access database to manage entries, developed company import compliance program and trained employees on import compliance requirements. Utilized Agile/ Scrum methodologies to monitor steer and develop project objectives. Managed and traced requirements using Rational Requisite pro. Followed the UML based methods using Microsoft Visio and Star UML to create: Use Cases Diagrams, Activity Diagrams, State Chart Diagrams, Sequence Diagrams and Collaboration Diagrams. Create functional requirements, use cases, and user sign-off documentations for the data warehousing project. Utilized corporation developed Agile SDLC methodology. Verified the Business Scenarios on new builds to allow extended testing by the QA team. Sr. Business Analyst\t\t\t\t\t\t\tNovember 2015 to May 2018 UPS Supply Chain Solutions - Alpharetta, GA Responsibilities Prepared Business Requirement Documents (BRD's) after the collection of Functional Requirements from System Users that provided appropriate scope of work for technical team to develop prototype and overall system. Extensively involved in every phase of the RUP process starting from Inception to Transition. Worked closely with the Enterprise Data Warehouse team and Business Intelligence Architecture team to understand repository objects that support the business requirement and process. The Supply Chain scope includes the entire supply chain from production order to shipping & delivery and order management. Collaborated with product managers and a development team to identify and resolve issues, coordinate system requirements, and create project timelines. Presented and Detailed Product Backlog Items to the Scrum Team in the Sprint Planning Sessions and assisted them in arriving at the Story Points for the User Stories. Responsible for producing process flow diagrams for TO-BE process flows and AS-IS process flows using Microsoft Visio. Support for a major effort to improve the Warehouse Management System (WMS) capabilities of Supply Chain. Reviewed user Stories and Acceptance Criteria with the team also coordinated activities with project manager and various other teams using TFS. Interacted with users for verifying User Requirements, managing Change Control Process, updating existing Documentation Meticulously assessed data from various sources and generated conceptual and logical database designs using ERwin data modeling tool. Expertise with supply chain strategies/vendor manufacturing process methods to determine level of procurement and strategic sourcing strategies/plans and worked with vendors/peers to determine lead times, schedules and cycle counts, established requirements needs. Designed and integrated a business system requirements definition and management tool using MS SharePoint Involved in Inception Phase and prepared vision statement and initial data models that contain Business Requirement Documents and supporting documents that contain the essential business elements and detailed definitions. Participated in the development of the data modeling methodology to be used in the project. Conducted Joint Application Development (JAD) sessions with IT groups. Identified the Key Changes and participated in Stakeholder Management to communicate effectively. Assisted the technical team in writing high-level design document. Prepared graphical depictions of Use Cases, Use Case Diagrams, State Diagrams, Activity Diagrams, Sequence Diagrams, Component Based Diagrams, and Collateral Diagrams and creation of technical design (UI screen) using Microsoft Visio. Created PowerPoint presentations incorporating MS Office Suite (Excel, Word and Access) Responsible for validating pricing and BID charge summary reports whether they are pulling correct data in SQL generated report. Collaborated with the QA team to develop the test strategy, test conditions and test case scripts to be used in testing based on business requirements, technical specifications and/or product knowledge. Determined a testing strategy in conjunction with the QA team. Assisted in writing detailed Test Plan, Test Cases and Test Case Scenarios for system testing, integration testing and functional testing. Assisted to develop the Test Plan, Test Cases and Test Scenarios to be used in testing based on Business Requirements, technical specifications and/or product knowledge. Conducted User Acceptance Testing, gathered and documented User Manuals and Business Rules. Maintained and kept track of stakeholders’ requests for enhancements. Business Analyst\t\t\t\t\t\tJune 2013 to October 2015 STAPLES - Framingham, MA Responsibilities Worked with the core team to design business requirement collection approach based on the project scope and SDLC Methodology. Worked closely with SMEs and business users in understanding and documenting their current process, gaps and requirements around various aspects of hedge fund management: asset classes, corporate actions, performance reports, client reports, general ledger, P&L and reconciliation. Responsible for implementing supply chain and operations solutions in the exploration & production lines. Lead, develop and implement the planning system improvements to maintain optimal inventories throughout the global supply chain. Analyzed the source and find out an end to end order flow and mapped into the Integrated Sales. Worked with DBA team and have created a report for the Data warehouse performance management. Worked on creating high level design document, Detail Design document, Source to target mapping document. Preparing Test case and Test results. Worked on Freight Forwarding Application which gives customers details about the freight options without spending a day on the phone. It gives instant quotes and dispatches the freights without anyone picking up the phone. Assisted production support team in identifying failure points and performing root cause analysis. Prepared Deployment document and deployment artifacts. Gather requirements by conducting meetings and brainstorming sessions with end users and SME and document them. Extensively involved in data modeling, Data mapping, logical data modeling, created class diagrams and ER diagrams and used SQL queries to filter data. Perform Gap Analysis of the processes to identify and validate requirements. Identified/documented data sources and transformation rules required populating and maintaining data warehouse content. Converted Business requirements to technical requirements by creating Business process flow diagram using MS Visio. Provided the development team and QA team Walkthrough sessions to understand the business requirement clearly. Coordinated with EDI team which deals with Away tool where it generates the EDI file. Prepared Test plan document, test case creation and test case execution for all provider types in the flat file and EDI file format. Actively facilitated complete User Acceptance Testing (UAT) - creating UAT schedules, testing guidelines, managing feedback, follow-up, and resolving open issues. Experienced in SQL queries to retrieve and validate data, preparing for data mapping document. Created Use Cases / Activity Diagrams / State Chart Diagrams, Sequence Diagrams, and Collaboration Diagrams thus defining the Data Process Model and Business Process Model. Involved with all the phases of Software Development Life Cycle (SDLC) methodologies throughout the project life cycle developing models that accurately represent the business process and workflows and clearly communicate them to the stakeholders. Facilitate JAD sessions involving the management, development and user teams for clarifying requirements and facilitating better communication. Coordinate and prioritized outstanding defects and enhancement/system requests based on business requirements, allowing enough time frame to ensure accuracy and consider deadlines. Done several Automation testing using Stored procedure. Maintained and kept track of stakeholders’ requests for enhancements. Business Analyst\t\t\t\t\tNovember 2011 to May 2013 GAP Inc - Rockville, MD Responsibilities Documented and analyzed the business process for receiving and processing customer sales based on \"Opportunity to Order\" and covers business-to-business (B2B) and business-to-consumer (B2C) sales. Support in implementation (POS) point of sale system aligns with the objective of the company. Providing ecommerce business analysis for a large multi-national implementation of ecommerce websites on including Endeca MDEX search engine integration and playing a key role during requirements gathering, analysis and testing. Analyzed and interpreted trends in customer perception, preferences, and behaviors across the e-Commerce/website channel through full shopping cart life cycle and conversion funnels using Google Analytics. Extensive use of Adobe Web Analyst/Omniture Site-Catalyst for web-site analysis. Responsible for analysis of overall SEO efforts including keywords, page ranking, technical SEO, and content optimization. Creation of business and functional requirement documents and use cases supporting them with wireframes and other visual documentation as required. Worked with swim lane diagram and helping design team to see visual element used in process flow diagrams, or flowcharts, that visually distinguish job sharing and other responsibilities for business process. Rebuild customer review system and integrate the payment methods to improve customers' experience by shorten the payment process. Involved in development and testing of POS Point of sale systems and applications for Payment Card Industry (PCI) Compliance initiative. Developed task flows and wireframes for an upgrade to a system used by underwriters to manage excess policies. Used Invasion in enhancing the user experience; worked closely with the technical and programming team to prepare Screen Mockups, User Interface designs using wireframe prototype for this Ecommerce mobile/web redesign. Identified As-is and To-be process maps as part of Gap Analysis for new functionality requirements, and thereafter prioritized them in order to align them with the project roadmap. supported in conducting JAD sessions with supply chain management and development team to brainstorm Point of Sale (POS) and Inventory and Order Management System (IOMS). Participated in Daily Standup Scrum meetings and worked with the team in resolving issues that could potentially cause delays in the sprint completion. Served as a Scrum master and conducted sprint planning, review and retrospective meeting. Provided analytical support and recommendations on stocking strategies and inventory placement. Developed process flows and procedures for purchasing and forecasting functions. Collaborated with the inventory manager in Forecasting and Replenishment process for Rockville region. Worked with B2B ecommerce with advance online selling, merchandizing, personalization and targeting capabilities. Collaborated with Product Owners to write up and prioritize customer centric documents like User Stories for Product Backlogs. Accountable for creating, maintaining and ensuring User stories to have coverage on business values, story points and acceptance criteria. Decompose high level concepts and requests into Epics and User Stories that are consumed by agile teams across multiple parts of organization that directly lead to on-time deployments through agile release planning efforts. Prepared and documented Sprint Backlogs to identify and monitor the activities performed in the time boxes. Developed digital strategy plans for B2B clients following the Digital Analytics skills. Analyzed and managed Supply Chain reports, dashboards and performance metrics. Created Burn-down Charts to monitor the completion of work within the time-boxes. Supported in Optimizing content for mobile devices for B2B and B2C models. Participated in the testing of B2B and B2C websites, including creating test plan and test cases, executing test cases (including regression and ad-hoc testing) and defect management. Create and review test plans and test case for UAT sessions. As well as conducting UAT sessions."}