{"text": "Name: helen helen E-Mail: helen.helen@gmail.com Address: Hong Kong, Hong Kong Github: https://github.com/helen LinkedIn: https://linkedin.com/helen Phone No. 717783133190 OVERVIEW: Seeking a fast paced dynamic environment to align my professional skills on the IT and business fronts in the Mortgage industry, and thereby apply my technical, business and interpersonal skills in the development of the company PROFESSIONAL SUMMARY: 7 years of experience as Business / System Analyst with expertise in analysis, design, development and implementation of software applications. Expert knowledge and experience of SDLC processes like Waterfall, Agile (Scrum), and RUP for software enterprise initiatives. Experience in gathering business requirements, evaluating data sources, translating requirements into specifications, application design, technical and business writing and testing various methodologies. Knowledge of Rational Requisite Pro and DOORS for requirement management and created traceability metrices among requirements.  Experience in testing of systems and applications for Payment Card Industry (PCI) Compliance initiative. Understanding of concepts related to Consumer Lending, Consumer/Business Credit Cards and Consumer loans.   Analytics experience includes: asset liability management, asset strategies (acquisition/disposition/land development), bankruptcy, cash-flow modeling, contract bidding, contract negotiation, credit analysis, fixed income, due diligence, investment/feasibility analytics, interest-rate hedging, operational expense/cash-flow modeling (yield management), portfolio management, portfolio run-off/liquidation, project finance analytics and modeling, restructuring, risk management, technical analysis, underwriting, valuations, and work-out  Good Knowledge about banking domain, including mortgage, deposit and investment. Experience with facilitating workshops and meetings to define and document business training requirements for new product releases. Worked in cross-functional environments and acted as a point-of-contact between the management and technology team; made presentations to them regarding the requirements and project updates. Coordinated and conducted JAD sessions to review the progress of the project. Expertise in UML like class diagrams, object diagrams, use case diagrams, state diagrams, sequence diagrams, activity diagrams, and collaboration diagrams, as a business analysis methodology for application functionality designs using MS Visio and Rational Rose. Experience working with Quality Center, Quick Test Professional and Load Runner, and knowledge of HP ALM and JIRA. Working closely with the analysts to provide consistency in the definition, methodology and interpretation of performance attribution analysis to the investment divisions Experience in performing and conducting UAT and coordinating the overall test effort. Experience with tools such SQL and Toad for writing and running queries and perform data analysis.  Knowledge of GAP analysis and data mapping documents  Experience in assisting with implementing change management and establishing traceability. Experience in Quality Assurance Life Cycle (QALC) aspects such as establishing project standards, writing test strategies, test plans, test cases, defect reports and developing test scripts, traceability matrices and test environments.  Defining test cases, analyzing bugs, interaction with team members in fixing errors and User Acceptance Testing (UAT)  Strong leadership skills Understanding of concepts related to Consumer Lending, Consumer/Business Debit/Credit Cards and Consumer loans.  Extensive experience in General Ledger, A/P, A/R, Primary Mortgage, Commercial Loan and Data Migration Applications.  Extensive experience in development of loan processing system and mortgage using Empower system TECHNICAL SKILLS: WORK EXPERIENCE: Zions Bank Corporation, Salt Lake City, Utah\t\t\t\t\t\t Sep 2015 – Present Sr. Business System Analyst Zions Bank corporation is one of the nation’s premier financial services companies.  Zions operates under local management teams and unique brands in 11 western and southwestern states: Arizona, California, Colorado, Idaho, Nevada, New Mexico, Oregon, Texas, Utah, Washington, and Wyoming. The company is a national leader in Small Business Administration lending and public finance advisory services, and is a consistent top recipient of numerous Greenwich Excellence awards in banking. In addition, Zions is included in the S&P 500 and NASDAQ Financial 100 indices. Responsibilities: Worked extensively on compliance related project under Vice President, Business Analysis. Business requirement gathering, system change tracking and maintenance on documents related to Compliance. Assisted in gathering the business requirements, and functional requirements for State and Federal Regulatory documents. Interacted with users for verifying User Requirements, managing Change Control Process, updating existing Documentation  Used JIRA for bug tracking. Worked to make sure requirements are built, and implemented properly to comply with US regulations for lending and deposits and tax reporting. Managed group meetings to support the ongoing completion of requirements gathering, and review, and signing off of functional specifications related to compliance documents. Traced test cases and functional specifications using DOORS Managed the editing, and signing off of compliance related documents from upper management, under strict deadline. Supported the gathering of requirements for Beneficial Ownership (BO) from a compliance standpoint. Reviewed, maintained, and signed off on documents related to US Banking Compliance Laws. Identified and analyzed the requirements for various site teams and made sure that the required data is compliant with US regulations. Wrote SQL Statements in database to make sure whether the data is populated in Data Mart/Data warehouse According to Business Rules.  Uploaded, updated, and maintained Rational database with all US regulatory documents that would affect the company. Involved in the preparation of weekly and bi-weekly reports on the status of test cases related to compliance. Created, and maintained Excel spreadsheet to track, and identify the test cases that would have an impact from a compliance point of view. Environment: MS Office Suite, MS Visio, MS Windows, Rational DOORS, MS Project, Scrum, JIRA. Wells Fargo, Falls church, VA                       \t\t\t\t\t\t Oct 2014 – Jul 2015 Sr. Business Analyst The project at Wells Fargo and Company was to redesign, alter, and update their banking platform, ATM Systems and Data Origination System (DOS), which was designed to book loans in commercial banking and monitor data integration. I was responsible for creating the necessary documents, liaising with the different groups concerned with the project as well as testing the updated platform using various automated and manual tests. Responsibilities: As a key member of the project team, I was responsible for conducting meetings with the internal management to assist with enhancement requirements clarification, data gathering and feasibility studies. Involved in creating the test planning, high level test case documentation & complete end to end testing. Interacted with developers, business analysts, and discussed technical problems. Involved in the formulation and implementation of a structured credit policy and related processes to manage credit risk.  Modeled multi-asset flexible Security Performance attribution system to allow asset managers to compute attribution/contribution for various investment styles. Prepared Business & System Use Cases and supporting all the documents with UML Diagrams such as Use Case Diagrams, Class Diagrams, Activity Diagrams, Data Flow Diagrams, Sequence Diagrams, Collaboration Diagram, Process Flows (Business and System) using UML modeling tools such as UML, Visio. Performed some back end testing using SQL Queries by connecting to the database server. Trained in preparation of business components and their mapping using Quality Center. Performed daily operations of Quantitative Risk Management (QRM) on mortgage banking system which includes analysis of market data inputs, validations, trade and pool maintenance and settlement processing, servicing multiples update, and other necessary parameter updates.  Manage the Requirements (Business as well as System requirements), performed requirements analysis along with the creation of Use Case Scenarios.  Consulted on upgrading an enterprise wide Risk Management system used by 3 lines of business at the bank – Funds Transfer Pricing (FTP), ALM (Asset Liability Management) and Forecasting.  Conducted interface testing to validate proper interface of transactions via Bank Tellers and ATMS. Worked on ATM transaction processing application that provides access to all leading ATM and debit networks. Involved in validation of the logs to confirm that application is meeting PCI compliances. Worked on ATM transaction processing/options ranging from personalized Fast Cash withdrawals to deposit automation.  Prepared documents such as Project Scope, Project Vision, Project Success, Business Requirements, Functional Specification, Data Warehouse Process Flow (SQL queries & Crystal Reports) using MS Office (Word, Excel, Visio) and dashboards Involved in designing and developing Data Models and Data Marts that support Business Intelligence Data Warehouse Performed extensive data analysis and data extraction by executing SQL Queries via SSMS/SQL Developer/TOAD/Rapid SQL/ MS Access etc. Used JIRA and Quality Center for tracking defects and reporting bugs. Environment: Agile, Rational Unified Process (RUP), UML, Windows, Oracle, SQL, Microsoft Office suite, Rational Enterprise suite, HTML, XML, Visual Basic, MS ACCESS, MS EXCEL, JIRA. JPMC, Wilmington, DE                                     \t\t\t\t\t\t May 2013 – Sep 2014 Business Analyst / System Analyst JPMC had to develop innovative system to monitor business including individual and commercial/business credit card business. The system also had to determine revenue business on interchange fee, interest on outstanding balance, fees charged to cardholder or customers.  I also worked on the project that involved migration of existing legacy consumer system to a new enhanced web based system known as loan solutions for new mortgage applications. The system automates the entire mortgage lending process from origination through closing, driving down various loan originating costs and cycle time for decision making, funding and delivering loans. Responsibilities: Analyzed clients systems and business processes, addressed all aspects of credit card business and as a team member established a Business Analysis methodology around the Rational Unified Process Provided key input in working with users in defining project and system requirements Responsible for participate in JRP and JAD sessions for communicating with stakeholders and Project Directors Prepared Business & System Use Cases and supporting all the documents with UML Diagrams such as Use Case Diagrams, Class Diagrams, Activity Diagrams, Data Flow Diagrams, Sequence Diagrams, Collaboration Diagram, Process Flows (Business and System) using UML modeling tools such as UML Facilitated and managed meeting sessions with committee of SMEs from various business areas including Mortgage Servicing, Loan Monitoring and Asset Management. Calculated, evaluated and reported individual and composite returns and performance attribution for investment strategies Created Requirement Traceability Matrix (DOORS) to ensure all requirements were being met.  Researched various steps in the lifecycle and constructed new system in a way that high risk customers would be easily identified monitored and streamlined clerical work and mapped them into new system. Involved heavily in creating and running UAT test cases and test scripts. Also, MS-Access database and generated reports for UAT test cases. Participated in discussion for a global Treasury operation to centralize FX payments, to further eliminate foreign currency risk, to optimize lending/borrowing, to streamline inter-company sales/purchase transaction settlements, and to define Accounts Receivable processes for applying cash against customer invoices. Planned and defined system requirements to Wire Frames with Use Case, Use Case Scenario and Use Case Narrative using the UML (Unified Modeling Language) methodologies.  Gathered security requirements for the credit card transactions, and followed PCI standards. Extracted data by running SQL queries, and analyzed securities, financial and customer metadata that gets populated on the web application Wrote use cases and managed use cases that could be traced back to the functional requirements as specified in the Requirement document. Responsible for preparing use cases, swim-lanes, and workflow (process flow) diagrams and using these artifacts to inform and educate the business and the stakeholders on the project impact and the solution delivering methodology Developed business requirement specification documents as well as high-level project plan Documented and delivered Functional Specification Document to the project team Assisted in building a Business Analysis Process Model using Rational Rose and MS Visio Environment: JIRA, Agile, SharePoint, SOA, Windows 2000, Enterprise architect, Rally, Requisite Pro, Agile, MS Visio, MS Project Professional, MS Office, DOORS. Bank of San Francisco, San Francisco, CA\t\t\t\t\t\t Feb 2012 – Apr 2013 Business Analyst I was worked as a Business Analyst for Internet Sales Group /Web Channel Management Department. Responsibilities: Involved in requirements gathering and analysis process required to develop, document and implement new processes Traded foreign currency bonds and managed fixed income portfolio.  Monitored and analyzed treasury's investments and exposures to various fixed income securities Involved with Risk Analysis & Risk Management for creating and implementing documentation for technical team by supporting and also Designs systems and programs to meet complex business needs. Updated Doors templates to reflect the current state of all project deliverables  Created a use case repository structure aligned with the business analysis framework  Established workflows and processes to lessen the effort of merging project requirements into the platform baseline Worked with asset classes such as Stocks, Exchange Traded Funds (ETF), Fixed Income Securities, Credit Derivatives and Mortgage Back Securities Gathered and documented requirements using tools including but not limited to Process Flow Diagrams for both  the Commercial Loans and Consumer loans from application to settlement to aid the Loan Tracking Application Project Responsible for re-writing poorly written use cases, business rules and supplemental requirements Documented and executed system, performance, and user-acceptance test plans to ensure that the system changes are error-free and meet the approved requirements and designs Worked with Project Managers and other Maintenance team member to develop a documentation process of all project artifacts; formalized support for these teams in order to allow better alignment of requirements management practices Environment: Rational Requisite Pro, Rally, UML, MS Office (MS Word, MS Excel, MS PowerPoint, MS Visio), Agile Methodology Midfirst Bank, Oklahoma City, OK \t\t\t\t\t\t\t\t Oct 2010 – Jan 2012 Business System Analyst MidFirst is a financial service company offering a variety of banking products and financial solutions like personal banking, small Business, retail banking, home financing, Commercial lending and equity loans, asset management, wealth management, corporate and investment banking and Debit card services to its customers. Personal Banking involves opening and maintenance of checking, savings, recurring deposit accounts and personal loans. It has an online banking application that enables customers to access their checking and savings accounts, and Debit card account using the Internet. Also responsible for developing asset custody and securities lending reports using. Responsibilities:  Extensively involved in every phase of the RUP process starting from Inception to Transition Interviewed Business Users to gather Requirements and analyzed the feasibility of their needs by coordinating with the project manager and technical lead. Assigned tasks among development team monitored and tracked progress of project following agile methodology.  Interacted with users for verifying User Requirements, managing Change Control Process, updating existing Documentation  Designed systems diagram, workflow, activity diagrams, use cases (UML) and business rules using MS Visio, data-integration, data mapping and dashboards Prepare monthly, quarterly and annual reports using Excel spreadsheet for delivery to the Automotive Lending group Monitored macroeconomic fundamentals, movement of fixed income securities market and policy changes, and identified fixed income market investment opportunity.  Created relationships in Requirement Traceability Matrix linking Business Requirements to Functional requirements and Functional Requirements to Systems Requirements.  Followed the UML based methods using Rational Rose/MS Visio to create use cases. Conducted Joint Application Development (JAD) sessions with IT groups. Identified the Key Changes, and participated in Stakeholder Management to communicate effectively with them  Developed and Documented timelines for Project Delivery, and managed Projects and Resources to successful completion.  Utilized technical tools DOORS to develop business, financial and system requirements analysis with supporting variance reports, current and target business process flows and traceability matrices Functional requirements gathering, report tracking, systems change maintenance, security level tracking for an automotive lending software package for the Consumer Lending group. Prepared graphical depictions of Use Cases, Use Case Diagrams, State Diagrams, Activity Diagrams, Sequence Diagrams, Component Based Diagrams, and Collateral Diagrams and creation of technical design (UI screen) using Microsoft Visio.  Assisted to develop the Test Plan, Test Cases and Test Scenarios to be used in testing based on Business Requirements, technical specifications and/or product knowledge.  Conducted User Acceptance Testing, gathered and documented User Manuals and Business Rules  Environment: Microsoft Project 2000, HTML, MS Visio, Rally, Oracle, MS PowerPoint, Quality Center, DOORS. Premier West Bank, Merford, OR                                                     \t\t\t\t Jan 2010 – Aug 2010 Business Analyst Premier West Bank is a community bank in Oregon and California with mortgage, finance and investment services. Premier West diversified its services with two subsidiaries Premier Finance Company and Premier West Investments. Worked one enhancing their online banking service allows customers to carry out banking operations such as accessing account information, transferring funds and downloading transaction history.  Responsibilities: Created the Conceptual Design document and reviewed and signed off on the Detail Design Document. Communicated Project Requirements, Business Issues, Solution and made recommendation. Responsible for defining the scope of the project, gathering business and system requirements, and documenting them textually or within models.  Implemented a new accounting solution across equity and fixed income investment strategies. Supported IT unit creating functional specification documents for the design, development and implementation of strategic projects. Defined requirements through the Use Case and detailed supplementary specifications. Assisted various members of the project team including development, technical and business team members to resolve issues, retesting the defects, validating results and communicating status and issues. Participated in conference calls with offshore and onshore team. Identified opportunities for business process improvement and initiate efforts to make improvements. Supported Unit testing and User Acceptance testing and performed Assembly, System Integration and User Acceptance testing. Dedicated a good portion of time with QA team in front-end and back-end performing Regression testing. Designed and developed use cases, activity diagrams, and sequence diagrams using UML.  Responsible for creating Business Requirement Document (BRD), Functional Specifications Document (FRD) and involved extensively in use case analysis using the UML tool MS-Visio. Gathered and documented requirements, functional specifications and use cases  Created Test Plans that contains test scripts, test cases, test data and expected results for the User Acceptance testing.  Conducted JAD sessions to allow different stakeholders to communicate their perspectives with each other, resolve any issues and come to an agreement quickly.  Environment: iRise Studio, Quality Center, Rally, MS Office Suite, MS Visio, MS Project, Agile, MS Windows  EDUCATION: Bachelors of Business Studies (Tribhuwan University, Nepal)"}