{"text": "Name: florence florence E-Mail: florence.florence@gmail.com Address: Luoyang, China Github: https://github.com/florence LinkedIn: https://linkedin.com/florence Phone No. 911282350177 Accomplished professional specialized in health information management with experience in range of activities on complete software development life cycle to increase the efficiency and success of the projects. Professional Summary Experienced Scrum Master in Agile Methodology, Scrum processes, Sprint Planning, Story based Development and Project Management working in Health care domain. Extensively on projects from Initiation to Closing through progressively elaborating project management principles through best practices and processes as depicted in the Scrum Guide.  Experienced in agile methodologies like Scrum, hybrid methodologies like Water-scrum-fall methodology. Knowledge of Scaled Agile Framework (SAFe), Extreme programming (XP), Spiral, lean- agile, Kanban, Scrum ban and Rational unified process methodologies. Experienced in Identification, categorization, defining and analyzing stakeholders and their involvement in the project using b RACI Matrix. Expertise in Claims Processing in HMO, PPO, POS, Medicaid and Medicare. Well versed with current healthcare industry standards such as CMS, MMA, HL-7, ICD9, ICD10, HIPAA 4010/ 5010 EDI X12 standard Transaction sets (835, 837,270/271 and 276/277) HHS, SOX and FDA. Experience in working with Clinical, EMR and EHR project environments and closely worked in company's re-engineering method of core claims adjudication processing  Acquired and compared the Healthcare Benefits plans with the HEDIS information which is in turn useful for the subscribers and consumers. Implemented Healthcare Enterprise Core Administration Platforms such as FACETS and Electronic Health Record & Practice Management applications. Experienced in Medicare and Medicaid domains of the healthcare systems and industry for inpatients, outpatients, Reimbursement Methodology and Medicaid Management Information System (MMIS). Possess excellent analytical, and interpersonal skills with the ability to communicate with Developers, Architects, Subject Matter Experts (SMEs), Business Stakeholders, Testing team and Senior Executives whenever needed. Worked with the product owner in requirement gathering and product backlog grooming. Involved with scrum teams in retrospective meetings and assisted the team in improving their ways. Specialized in conducting Agile events (Sprint Planning, Daily Scrum, Sprint Review / Retrospective); Groom the product/sprint backlog; refining user stories; mitigating blockers /impediments, Coaching Scrum team in their Agile maturity journey. Experienced in using Jira to manage user stories, contributing in scrum ceremonies also assisted in choosing prioritizing techniques like MOSCOW, KANO and estimation techniques like T-shirt sizing, Agile Poker and RMV. Used confluence and integrated it with JIRA to drive better agile development environments. Worked with the team in decision-making process for the business by providing SWOT analysis, Feasibility study, Root Cause Analysis, Cost Benefit Analysis, As-IS To-Be business analysis and regression analysis Worked along with the product owner in defining the Minimum viable product (MVP), in defining the Acceptance criteria, Definition of ready (DoR) and definition of done (DoD) and effectively communicated it to the team members. Proficient in authoring Business Requirement Documents (BRD), Functional Specifications Documents (FSD), Software Requirement Specification (SRS), Use case Document, and Software Design Specification (SDS). Involved with the project manager in designing the Work breakdown structure, Project scope & Project charter document. Possess knowledge using web services for transfer of data in XML format and validation of the data. Assisted the testing members in eliminating impediments during API testing. Exposure to Salesforce service and health clouds with good knowledge and understanding of Customer relationship management processes like Sales, Marketing and Customer services.  Extensive experience in retrieving data and data validation using SQL queries like Joins, Views, Sub queries and Aggregate functions like max, min, sum and average with good understanding of Stored Procedures, Functions and Triggers. Experience and understanding on reporting tools like Tableau and other BI software/Qlik view, MS Excel.  Created reports from variety of data sources (EMR, billing files, claim file) using SQL to inform decision making relative to clinical &business opportunities.  Profound knowledge on TDD, ATDD, BDD techniques and understanding of Continuous Integration and Continuous Deployment (CICD) using Jenkins and Bamboo. Liaised with Quality Analysis team to design and implement Test plans, Test cases for User acceptance Testing, System Testing, Integration Testing, Regression Testing. Load/Stress Testing & Performance Testing. Technical Skills: Professional Experience:  Geisinger (Danville, PA)\t\t\t                                                                      \t\t\tJan 2019 – Till Date Sr. Scrum Master\t\t\t\t\t\t\t\t The scope of the project was to upgrade the health care application and implement Salesforce CRM to manage the immunization records of the patients along with other health records. Through this implementation patients were given online access to their immunization records and they also received notifications based on their data. Responsibilities: Developed detailed documentation of client needs including both functional and non-functional requirements. Translated the requirements to the team with documentation, diagrams, technical clarification, and wireframes.  Evaluated the scrum maturity levels and motivated the team to achieve the higher levels by conducting the effective GAP analysis and making rooms for continuous improvements. Created the requirement traceability matrix and kept track of the product backlog, sprint backlog.  Helped team to understand both organizational and technical dependencies while avoiding chokepoints creating accountability enabling team to meet deadlines. Provided support to the team using a servant leadership style whenever possible and managed dependencies between scrum team and others. Identified, developed and supported business process changes. Assisted the product owner in elaborating the requirements and in writing the detailed user stories and acceptance criteria for them.  Provided guidance to the scrum team in requirement understanding and solution designing along with product owner. Involved in the Prioritization of the user stories and estimation using the Relative mass valuation and T-shirt sizing technique. Lead daily Scrum stand-ups, Grooming, Sprint planning, retrospectives. Calculated the velocity for the team during the release planning meeting. Helped the team in reaching consensus during daily standup. Conveyed the product priorities and the release priorities to the team during the sprint planning meeting.  Created Technical specifications and data mapping documents by analyzing the data connect xml files in absence of the development team to kick start the initiative.  Organized and facilitated meetings with business, stakeholders and technology teams and ensured that the organizational impediments were eliminated. Facilitated collaboration meetings between ETL developers and data scientists for a better understanding on complex transformation logics.  Facilitated the retrospective meeting and used Silent writing and Happiness Histogram technique for the safety check. Created the burn down charts and used them as metrics to coach the team into higher performance. Environment: Agile- Scrum, JAVA, My SQL Server, JIRA (v7.0), MS VISIO (v.16), HP ALM (v.11.5), TABLEAU (v.10.1), Salesforce service cloud, Informatica Power Center (v.9.6.1). HCSC (Chicago, IL)\t                                                                                                                             March 2018 - Dec 2018\t Scrum Master\t\t\t\t\t\t\t      \t                  The project was initiated to develop a claim management system where the bill for the service is verified for the fast pass token process if it fails it then it passes through insurance verification, code verification and claim scribing. Salesforce health cloud has been used and claim data has been integrated to it. Responsibilities: Coached teams on the rules of Scrum, guided teams to self-organization, continuous improvement, and cross-functionality. Influenced the teams on the project in achieving the milestones and deliverables. Diligently facilitated the scrum ceremonies including Planning, Daily scrum and retrospective meetings. Prioritized the product backlog with the product owner using MOSCOW technique and the 100-point method. Established Sprint goals and Sprint Backlog during the Sprint Planning Phase.  Responsible for gap analysis in changing old MMIS to new MMIS and analyzed the workflow towards the adjudication system. Nurtured the team and collaborated between the team and the Product owner. Facilitated communication and information exchange between external groups and the project team. Developed user stories and to be process flows to support design and development of salesforce solutions for the users. Worked cross functionally and assisted in traced the requirements and managed changing requirements, there effects and prioritized them. Tracked and Managed sprints, requirements, translated functional requirements to user stories and estimated them assisted in verifying the velocity and re-prioritized issues using the JIRA (v7.0). Protected team from overcommitting and scope creep. Aided in estimation and sub task creation. Identified the lack of good documentation in the organization and leveraged confluence to create spaces for initiatives for research, design, and architecture documentation thus greatly reducing the team members effort in understanding requirements, requesting access, documenting their findings.  Tracked and communicated team status and progress via burnup and burndown charts, as well as other information radiators, to the team, management, and stakeholders ensuring it accurately reflects current state.  Functioned proactively to prevent potential problems and resolved issues. Assisted the testing team in preparing the test data for positive and negative scenarios as per the requirements. Created and tested scripts for the premium calculations and Claims limits and deductibles. Environment: Agile- Scrum, Python 3.5, MS SQL Server, JIRA (V7.0), Confluence, Lucid Chart, Salesforce health cloud.     Connective Rx (Fairfield, NJ)                                                                                     \t\t\tSep 2017-March 2018 Scrum Master/Business System Analyst\t\t\t\t             \t\t\t\t                The scope of the project was to optimize health care/dental revenue cycle management through dynamic information analysis. Data from the transactional processes was migrated to a Datawarehouse and analytics was performed. Python was used to store, access and manipulate data Responsibilities: Worked with the Product Owner, Project Management, and Delivery Team on the Product Roadmap (User Story Mapping) and Release Planning. Coached development team and product owner in agile way of delivering. Assisted the Product Owner in breakdown of Epics to user stories, defining the acceptance criteria, definition of ready and the definition of done. Managed requirements traceability information and track requirements status throughout the project. Managed changes to requirements through effective use of change control processes and tools. Created Use Case diagrams, Use Case Templates and process flow diagrams using MS Visio. Created Data Mapping documentation and performed data profiling and analyzed the source data by writing SQL queries. Implemented the ICD-9 & ICD-10 mapping and crosswalk analysis and monitored the revenue cycle process. Helped in their efforts to manage the product backlog and guided the team while facilitating healthy team dynamic with respect to priorities and scope. Hosted daily Standup meetings and taken updates to measure Sprint progress. Addressed road blocks and ensured project is on track. Re-prioritized Sprint Backlogs as required.  Shared the sprint backlog with the other stakeholders increasing the transparency of the progress. Based on the requirements created upgraded strategy and stored procedure transformations to populate the targets. Tracked and Managed sprints, estimated the user stories, adjusted the sprint scope, assisted in verifying the velocity and re-prioritized issues using the JIRA (v.6.3). Created reports in the presentation layer of the Datawarehouse using Power BI for useful insights. Reviewed project risks and identified the key risk elements from a technology perspective and proposed mitigation plans. Facilitated Sprint Retrospectives applying different techniques based on the outcome of the Sprint. Environment: Agile-Scrum, Python (3.5), MS SQL Server, Informatica Power Center (v.9.6.1), JIRA (v 6.3), MS VISIO (v.16), BALSAMIQ, PowerBI  Beckman Coulter (Indianapolis, IN)                                                                                                 Feb 2016 - July2017 Scrum Master/Business Analyst\t\t\t\t\t\t       \t\t      The scope of the project was to develop hand-held medical data capture- device having a digital infrared sensor and interoperate it with electronic medical record systems. The estimated measurement is also transmitted to the external database. Conducted JAD sessions with business units and stakeholders to define project scope, to identify the business flows and determine whether any current or proposed systems are impacted by the new development efforts. Prepared Business Requirement Documents after the collection of Functional Requirements from System Users that provided appropriate scope of work for technical team to develop prototype of system. Interacted with clients to understand and document new requirements for the benefits configuration application. Used knowledge of Health Care Information Systems EMR model to develop proposed workflow in MS Visio (v.16). Managed the clinical team members and assisted in clinical configuration of the device, documented the configurations; device end-to-end workflow demonstrations and deployment. Escalated issues related to sprint planning/ resources/ budget/ project scope proactively to the PMO and worked on resolving the issues.  Assisted the technical team in managing the integration of device with Electronic Medical Records. Assisted the development team in effectively communicating the requirements. Collaborated and communicated using tools such as SharePoint and Microsoft teams.  Conducted complex documentation and user needs analysis.  Interface with team and staff to develop HL7 integration. Responsible for Change Management Processes and efficiently managed changes and analyzed the impact on the project. Worked along with testing team and assisted them by providing requirements to be tested. Environment: Waterfall -Scrum Hybrid methodology, JIRA (v7.0), MS Visio (v.16), SharePoint, MS Office2013 Global Hospitals (India)                                                                                                   March2014-Jan 2016 Business Analyst\t\t\t\t\t\t                                    The scope of the project was to introduce a system to manage the unstructured data in the hospital and to improve the institutional health care delivery through efficient use of medical devices and health care data pools. Responsibilities: Worked with the project manager and analyzed the Project Scope. Designed Business requirements documents. Conducted multiple interviews with the Stakeholders to understand the as-is process & to be processes and gathered business requirements and communicated them to team. Set up brain storming sessions with functional and technical teams. Facilitated JAD sessions for assessing needs and thereby quantify objectives for requirements. Primary responsibilities included analyzing, validating various processes.  Worked with the technical team in development and testing of the system. Managed the team and tasks as well as schedules using MS Project. Environment: Agile- Scrum, MS SQL, MS Office (MS Word, MS-Project, MS Excel). EDUCATION: Bachelor’s in dental surgery: NTR University of Health Sciences."}