{"text": "Name: frances frances E-Mail: frances.frances@gmail.com Address: Maoming, China Github: https://github.com/frances LinkedIn: https://linkedin.com/frances Phone No. 302999137238 Professional Summary: Over 8 years of professional experience in all stages of Software Development involving Planning, Analysis, Design, Implementation, Integration and Testing, Deployment, Documentation and Maintenance of various stand-alone, client-server and web-based projects with exposure to diverse business domains including Financial, Healthcare, Telecommunications and Banking. Extensive experience with Agile, SCRUM, Waterfall and Test Driven Development environments Expertise in web application development using Visual Studio.NETtechnologies like C#, ASP.NET, ASP.NET MVC, ADO.NET, XML, Web Services, WCF, and WPF. Expertise in developing Client/Server Applications using .Net Framework (2.0/3.0/3.5/4.0) with Three Tier Architecture, N-Tier Architecture, SOA (Service-Oriented Architecture) Experience in developing Web Applications using AJAX controls, Telerik Controls, Web Services and Cross Browser functionalities. Proficient in UI development using HTML, CSS, jQuery, JavaScript, Angular JS, JSON, AJAX, and Bootstrap. Experience in Silverlight and WPF (Windows Presentation Foundation) including frontend designing with Microsoft Expression Blend and backend programming with Microsoft Visual Studio.  Excellent working knowledge of ASP.NET controls like Grid View, Detail View, and Data Source controls like Object Data Source, SQL Data Source,Master Pages for consistent layout of pages within application Extensive knowledge of object oriented programming techniques and Microsoft design patterns like MVC, Service Oriented Architecture (SOA), WCF and Web Services.  Experience using LINQ, N Hibernate and Entity Framework mappers to interact with other layers Experience with AWS and Azure services with workload requirements Proficient in database programming to create Joins, Stored Procedures, Functions, Views and Triggers using T-SQL in SQL Server 2005/2008/2012, Oracle SQL developer, IBM DB2 Familiar with MongoDB database concepts such as locking, indexes, Sharding, transactions, replication, and schema design Extensive experience with reporting tools like SSRS and Crystal reports for designing and modifying reports and creating shared and embedded data sources to pull data into reports from the database  Experience in configuring Internet Information Server (IIS), creating virtual directories, mapping them to physical folders and configuring applications for domain authentication Experience in XML, XSLT, User Controls, Custom Controls, SOAP, WSDL, Web Services, Validation Controls, Authentications like windows authentication and forms authentication. Experience with Subversion, Team-Foundation Server, Visual Source Safe for version control Experience with JIRA and HP ALM for Bug tracking and work flow consistency Experience in documenting a Technical Specification Document (TSD) with respect to business requirements and Functional Specification Document (FSD) for that particular project release  Excellent analytical and programming abilities to create elegant, flexible and maintainable solutions for complex development problems and willingness to work in a highly dynamic environment Enthusiastic, self-starter, eager to meet challenges and quickly assimilate latest technologies, skills, concepts and ideas Technical Skills: Education: Bachelors of Technology in Computer Science Professional Experience: Wells Fargo Bank, Charlotte, NC\t\t\t\t\t\t\tAug 15 – Present Sr.Net Developer Responsibilities: Worked with Visual Studio 2013/ .Net Framework 3.5/4.0/4.5 for developing internal application where users can pull over 150 reports from the UI Worked in an Agile environment using Scrum methodology to produce high quality front-end application Involved in design and development of UI application using ASP.NET,C#,MVC,JavaScript, jQuery, HTML, CSS and XML Extensively worked with SSRS to create and design reports according to business requirements and modify them periodically when users required enhancements within those reports Write code to create Shared and EmbeddedData Sources in SSRS to retrieve data from Oracle/SQL Server databases into a variety of reports Involved inDB2 to Oracle migration project and worked extensively on converting, modifying existing SQL queries from DB2 to Oracle Azure Supports Portable Class Library (PCL), which targets apps that are built for .NET Framework 4.5, Windows Phone 8, Windows Store. Used Aqua Data Studio to create/modify SQL queries and retrieve data from IBM DB2 database while SQL Developer for Oracle Database Used Subversion to checkout, commit the code and manage the source code repository Created and consumed WCF services which are based on Service Oriented Architecture (SOA) architecture. Deployed code to various DEV, SIT, UAT environments using AnthillPro Created batch jobs in Autosys to automate the report generation process on a daily basis Used HP ALM tool for application development and application testing  Worked with JIRA to login defects and fix them accordingly  Involved in debugging the application, analyzing and fixing the code when necessary Implemented MS-Unit Testing, Integration Testing and Regression Testing Analyzed user requirements and Functional Specification Document (FSD) to prepare Technical Specification Document (TSD), unit test plans and test cases Work with Subject Matter Experts (SMEs), Offshore resources and other team members in understanding, documenting, developing and testing business and user requirements Create data load programs and application interfaces according to business requirements Adhere to department, organization and industry guidelines, standards, policies and procedures while meeting deadlines in a rapid release cycle Part of two successful quarterly releases to push the developed code into production environment  Environment:.NET 3.5/4.0, ASP.NET, C#, Visual Studio, HTML, SOA,Web Form/Win Form, XML, MVC 3.0, SSRS, BIDS, Silverlight, JavaScript, JQuery, T-SQL, SQL Server 2008 R2 / 2012, Oracle 11g, IBM DB2, CSS, PowerShell scripts, Share Point, MS Visio, IIS , PostgreSQL American Family Insurance, Madison, WI\t\t\t\t\t\t\tOct 14 –Aug 15 Sr.Net Developer Responsibilities: Involved in Requirement Analysis, Design and finalizing the architecture of application Worked with Visual Studio 2012/ .Net Framework 3.5/4.0/4.5 for developing Software Applications Involved in Design and Development of Web Forms using ASP.NET, MVC, Razor (CSHTML), Angular JS and ORM Entity Framework. Developed Views, Controllers, Model and Business logic in C# Extensively usedJavaScript, jQuery, HTML, CSS, AJAX and JSON in UI layer Used Nuget Packages for jQuery, jQuery Validation  Extensively used third-party HTML Helpers for creating MVC views Created Web servicesusing WCF (Windows Communication Foundation) and ASP.NET Web API Consumed REST Web services, Web API and WCF Web services through client scripts (Ajax, jQuery and Angular.js) and server side code Involved in implementing AJAX and SOA application. Created custom directives, services in angular and integrated with Kendo UI to show large amount of data using grid Deployed applications on Windows Azure Cloud base and active Directory configuration Extensively used ADO.NET for connecting the database by calling store procedures and functions.  Extensive use of ADO.NET objects like Data Sets, Data Tables, Data Reader, Command and Connection objects, Data Grid, Data list and Repeater objects. Used strongly typed dataset for Data Access and Data manipulation to SQL Data Source and Oracle Database. Deploy development code using Octopus Deploy to QA environments WroteStored Procedures, Joins and Triggers for Database connections using SQL Server 2008 & 2012 Worked on extracting, transforming and loading data using SSIS. Created SSIS Packages to integrate data coming from Text files and Excel files.  Provided Full Reporting Life Cycle support using SSRS Used Windows Team Foundation Server (TFS) for version control Implemented MS-Unit Testing, Integration Testing and Regression Testing Monitor the results in real-time production scenario, analyze, and fix the code Responsible for creating and implementing user workflows and use cases Environment:.NET 4.0/4.5, ASP.NET, C#, VB.Net, Visual Studio, SOA, HTML 4/5, XML, MVC 5.0, ADO.NET, Entity Framework, WCF Services, Silverlight, Nuget, JavaScript, VSTO, Angular.js, Windows Azure, JQuery, RWD, T-SQL, SQL Server 2008 & 2012, SSIS, SSRS, SiteCore 7.0, Oracle10g, CSS, Team City, Ajax, MS Visio, PostgreSQL, TFS, IIS Ecolab, St. Paul, MNMay 12 – Oct 14 Sr.Net Developer Responsibilities: Worked with the business client for gathering and analyzing requirements of the application using Agile and Scrum methodology. Worked on .NET application development with ASP Web Forms, Win Forms,ADO.Net and C #.Net as code behind and SQL Server 2008/2012 as database. Designed & developed web user interface using ASP.net, VB.net, HTML, CSS, JavaScript, server controls, and developed customized Web controls. Involved in maintenance and ongoing enhancements of the application developed in .net Framework 4.0/3.5, ASP.net MVC, Web services, WCF Service, JavaScript, XML, HTML, T-SQL.  Worked With ASP.net Web Parts, Navigation Control, User Controls, and Master Pages and developed Cascading style sheets (CSS) for consistent look and feel of the website Developed UI using HTML5, CSS 3, jQuery, JavaScript, Angular JS and Knockout Js. Applicationwasdeveloped in C# and UI was created using WPF following the MVVM pattern. Supported MVVM implementation by delegating data binding to the front-end using TELERIK controls Worked with LINQ for .Net and Entity Framework, also wrote stored procedures using Microsoft SQL Server 2008 for new applications. Implemented Service Oriented Architecture (SOA) and used WCF to expose business logic as services and consumed those services from client applications.  Migrated Active Directory and Team Foundation Server from Windows Azure to onsite hosted environment.  Involved in creating WCF REST services for various policies and benefits, and consumed them into the web application. Developed web services to prepare reports using XML web services. Defined service contracts, implemented service contracts and hosted in IIS 6.0 where all service (contracts) are configured with secured bindings  Used ADO.NET for data interaction between web application and database using Data Reader, Dataset, and Data Adapter controls. Designed and Created database objects such as stored procedures, packages, functions, triggers and indexes.  Implemented the Caching Mechanism and set the Expiration Policies in .config files to cache Back End Services Involved in complete SSIS life cycle in creating SSIS packages, building, deploying and executing the packages in the development and production environments. Participated in review of issues related to SSRS reports and worked in troubleshooting those issues, fixing, testing and deploying them. Performed Unit Testing on both SQL Server and Oracle databases from the product perspective. Implemented Integration testing and NUnit testing to test the efficiency of the code developed. Team Foundation Server(TFS) is used for controlling the Source Control Management Collaborated efficiently with testing and Management team for successful release of the project. Environment:ASP.NET 3.5/4.0, C#, VB.NET, Silverlight, MVC Framework, Entity Framework, HTML, Web Form/Win Form, VS.NET, IIS, CSS, AJAX, JavaScript, jQuery, XML, XSLT, Azure, Web Services, WCF, SOAP, SOA, SQL Server 2008/2012, SSRS, SSIS First Bank, Dallas, TX \t\t\t\t\t\t\t\t\t\tOct 10 – May 12 .Net Developer Responsibilities: Communication with customers for requirement gathering and analysis using Agile and Iterative SDLC methodology.  Involved in implementation of the project using C#, ASP.NET Web Forms, WCF, LINQ, HTML, jQuery, JavaScript, CSS and AJAX.  Developed application using ASP.NET, AJAX, jQuery, User Controls, Custom Controls and Web Forms with Visual Studio 2010, .NET 4.0with C# as code behind.  Involved in creating and consuming WCF services.  Extensively used LINQ to SQL & Entity Framework while designing Data Access Layer Followed the N-Tier Pattern, separating the business, presentation and data models. Used WCF services by introducing new operations in Interface and implemented them in service layer. Modified Web services using C# to interact with other applications and exposed them using SOAP and HTTP. Developed rich front-end UI using AJAX Controls, Silverlight, Expression Blend and XAML.  Extensive experience in WPF/Silverlight with all the programming and technologies integrated into C# Asp.Net 3.5 framework.  Involved in design and development of User and Custom controls for application using C# and ASP.NET.  Created new model classes in Web API to hold data.  Grid view and Custom paging were used to display huge amount of data. Used the Entity Framework 4.0 for the use of LINQ-based Data Access. Used editable Data Grid controls to display and edit the requested information. Created DLLs to implement business logic and to integrate the application. Ease of maintenance was assured with consistent use of web.config file. Created Indexes, Stored Procedures, Triggers and Views using SQL server 2012 and in Oracle 10g to execute various database routines. Implemented NUnit testing, Integration testing and Regression testing. Worked with Clients and end users for new functionalities as well as any application related enhancements.   Involved in code reviews, standard performance and functional reviews.  Experience working in UAT, SIT, Pilot and Production environment in different stages of the project Environment:ASP.NET 3.5, C#, VB.Net,  Web Forms, ADO.NET, XML, Web Services, SQL Server , VS.NET 2005, OOP, OOAD, CSS. SQL Server Reporting Services (SSRS), Java Script, Share Point  Mphasis, Hyderabad, India\t\t\t\t\t\t\t\t\tAug 08– Sep 10 .Net Developer Responsibilities: Involved in all phases of the Project Life Cycle with a focus on n-tier architecture. Followed Agile methodology to produce high quality software. Designed Graphical User Interface (GUI) using ASP.Net MVC 3, CSS, HTML and JavaScript. Used WCF for interoperability with other platforms and technologies to build custom solutions. Implemented entire backend of the application using C#.NET and object oriented concepts like classes, interfaces, inheritance, polymorphism and Multi-threading. Updates to a SharePoint PWA Site updating the Project Server SSRS reports.  Designed Business components and Data Access Layer using C#.Net  Implemented Caching, Client and Server side State ManagementTechniques such as View state, Cookies, Application and Session throughout the projects using ASP.NET. Created an ASP.Net MVC3 UI that communicates with Windows Communication Foundation (WCF) while interacting with the database. Used the AJAX control kit and provided extender AJAX control properties to the existing ASP.NET controls. Extensively used JavaScript and ASP.NET AJAX for front end and Ajax web methods.  Maintaining the version control of the project in Team Foundation Server (TFS) by merging the module developed with latest version in TFS. Extensively worked with LINQ provider and designed user level application that would build and execute a query expression for the Server Side. Used ADO.NET objects such as Data Reader, Dataset and Data Adapter for consistent access to SQL data sources. Extensively used ASP.NET Data Grid and Data List controls for displaying the data. Wrote SQL Queries, Stored procedures, Joins, Triggers to process large collection of products and used Data Reader, Data Adapter, SQL Command and Dataset for retrieving data from database using SQL 2012. Used Crystal Reports for generating monthly and quarterly reports for management. Worked closely with Business, Technical and QA teams to meet project requirements and deadlines.  Responsible for process improvements and providing tools for task automation to generate reports.  Environment:.NET Framework 4.0, ASP .NET 4.0, ASP.NET MVC3, Microsoft Visual Studio 2010, C# 4.0, HTML4, XML, CSS, JavaScript, LINQ, Entity Framework, IIS 7.0, TFS, Win Forms, SQL Server 2008, ADO .NET."}