{"text": "Name: ruth ruth E-Mail: ruth.ruth@gmail.com Address: Philadelphia, United States Github: https://github.com/ruth LinkedIn: https://linkedin.com/ruth Phone No. 598363080399    \t \t\t\t\t PROFESSIONAL SUMMARY IT professional with over 8 years of working experience in different technologies including Business Intelligence, BW, HANA  Strong working experience in all of Business Objects Analytical tools using different versions of Business Objects Enterprise (6.5/XIR2/R3.x/4.x), Crystal Reports XI/2008/11 Worked with different databases including SQL Server, Oracle, Teradata, BMC Remedy 7.5/8.1 Experience in working with BI project development agile methodology including Analyze, Specify, Design, Plan, Develop, Test and Deploy projects.   Created parameterized, Cross-tab, Drill down and Summary reports in Crystal Reports.  Streamlined client reporting requirements and successfully developed and delivered Business Objects Universes and Webi reports based on Business requirements. Business Objects Migration experience migrating contents from older versions to newer versions of Business Objects Enterprise. Expertise in gathering business requirement by interacting with client directly and creating business requirement specification document, design and functional documents.  Expert in handling SAP BW Front end tool Bex Analyzer, Query Designer, Report Designer and Web Application Designer (WAD). Expert in generating reports on the Multi Providers, Info Providers and Info Cubes using Restricted/Calculated Key Figures, Structures, Characteristic/Text/Formula Variables, Exceptions, Conditions. Designed and developed flexible Bex queries, utilizing variables, conditions, exceptions, and hierarchies in Query Designer and Bex Web Application Designer. Conducted performance tuning of Queries by maintaining Aggregates, Compression. Involved in Full development life cycle while developing contents (building Universes and creating Reports) for different projects and different clients. Expertise in creating Universes using database tables, Stored Procedures, free hand SQL, Bex Queries, HANA Tables/views and developed complex ad-hoc and canned Reports using Web Intelligence/Crystal Reports/Analysis Edition for OLAP/SAP Lumira/Design Studio Expertise in building/enhancing/migrating Business Objects universes and moving contents from one environment to another (i.e. Dev, QA, UAT, Prod) using Promotion Management Tool or Import Wizard/Upgrade Management Tool Business Objects Administration experience working with CMC to support existing BOE Environment. Created complex Dashboards by using different data sources like Live Office, Qaaws, BI web services Involved in POC of Xcelsius/Live Office to the client, also trained users on Business Objects functionality and tool set. Mentored and helped developers to enhance their skills in using BI tools and utilize them following best practices. Used Tableau desktop for blending databases and creating different interactive views and dashboards A self-motivated and self-directed person with Excellent Communication, interpersonal skills and ability to work under Tight Schedules. TECHNICAL SKILLS PROFESSIONAL EXPERIENCE  Client: Cargill Inc, Hopkins, MN Role: Sr.SAP Business Intelligence/Business Objects Consultant                     \t\t\t        Apr 2015–(Till Date) Interacted with Business users/Project Managers to better understand reporting requirement and to purpose solutions. Involved in development of existing Universes and reports in Business Objects 4.1 environment by adding Dimension/Characteristics, Measures/Key Figures, Contexts and Custom Objects. Developed additional new Universes such as ITSM Cargill Incident Mgmt/Change Mgmt/Problem Mgmt/Task etc in UDT/Information Design Tool(IDT) using Relational/Multidimensional/HANA Views as a source Design and Developed flexible BEx queries, utilizing variables, conditions, exceptions, and hierarchies using Query Designer. And, request newly developed objects to Transport them to QA and Production System. Design and developed complex adhoc and canned reports in BI Launchpad 4.1 for Incidents, Service request, Change/Problem request raised by Organizations globally. Used multiple data providers, Union, cross tab, Pie/Line/Column Charts. Developed reports on the Multi Providers, Info Providers and Info Cubes using Restricted,  Calculated Key Figures, Structures, Characteristic Variables, Formula Variables, Exceptions, and Conditions define in BEx queries. Created Content groups in CMC for different Universes to provide respective access (Supervisor and Consumer) to the end users based upon Job role to access the reports in BI Launchpad 4.1 Used Central Management Console (CMC) in setting up security in BO 4.1 and also manages security configuration for various reports and universes in development, test and production environment. Monitoring of jobs in CMC and resolving them as need. Published universes and reports documents to the repository as part of the production deployment and made them available to the users using Promotion Management tool Involved in production support during and/or after office hours on Incidents/Service Requests report tickets with Critical/High/Medium/Low priorities on daily basis running against remedy 7.5/8.1/SAP BW/Oracle databases and data analysis on data related issues to team members and end users. Design and developed Production Assurance dashboard in Dashboard using BI Web services which Provides executive summary information on Incidents/Service request/Change/Problem tickets, and monitoring accuracy of data reflecting on the dashboard on a daily basis for Global IT Infrastructure Scheduled business reports on a Monthly/Weekly/Daily basis and distributed reports in multiple formats such as Excel/PDF/Webi URL to business users and file share location. Design and developed adhoc reports(Raw Data) for Incidents/Change/Problem request using Remedy 7.5/8.1 Reporting tool Created reports using Crystal Reports with Standard, Summary, and Cross Tabs and Grouping. Maintained and Supported existing Crystal Reports for enhancements, modifications Responsible for improving the query performance of the reports by tuning the Queries and creating business views. Design adhoc reports for business users using Analysis Edition for OLAP for data analysis Developed interactive dashboards in SAP Lumira/Design Studio/Tableau for data visualizations as per business needs Worked with DBA to tune the report queries for improving performance of the reports  Coordinated with Off-shore team on the project development, validation and deployment of the Universes and reports. Presented the advanced features of Business Objects to Customers/Users and developers in developing various adhoc reports in BI Launchpad 4.1  Environment:  SAP BW 7.3, SAP BI/Business Objects 4.1, SAP HANA, Crystal Reports 2011, Dashboard, Oracle 11g, and BMC Remedy 7.5/8.1, Oracle-SQL Developer, and SAP Lumira1.27, Tableau 9.0, Analysis Edition for OLAP, Design Studio 1.5 Client: UAB, Birmingham,AL\t   Role: Business Objects Developer\t\t\t\t\t\t\t\t         Jan 2013 –Mar 2015 Interacted with Business user community to gather and analyze the business requirements in developing and modifying Universes and building the reports.  Created Single & Multi Source Universes based on Relational and OLAP connections from scratch using Information Design Tool (IDT) and also modified existing Universes based on reporting requirements. Improved the performance and reduced the coding with the use of @functions like @Prompt(for user defined queries), @Where (for creating conditional filters), and @Select (to create duplicate objects) in the process of building the Universes(UDT & IDT). Provided recommendations in Analyzing, Design, Implementation and administration of  security models with row level data security, role based security etc in Universes and Central Management Console (CMC) Design and developed various ad-hoc and canned reports using BI Launchpad 4.1 and Webi Rich Client on Market and Regions for marketing team to do trend Analysis, using new features as well such as Element Linking, Stacked Bar/Column Chart, Heat Map, Tree Map, Bubble Chart etc. Used Crystal Report 2008 Enterprise to design the front end reports. Migrated the Crystal Reports, Universes, Webi Reports, Users and User Groups  from BO XI to BO 3.1 using Import Wizard and from BO 3.1 to BO 4.1 using Upgrade Management Tool Extensively used Central Management Console (CMC) in setting up security in BO 4.1 and also manages security configuration for various reports and universes in development, test and production environment Migrated the Universes, reports, Users, User Groups in BO 4.1 from Development to Quality environment and Quality to Production environment using Promotion Management Tool and made them available to business users Interacted with DBA/ETL team to implement report logics at Database/ETL Level to improve performance of the reports. Developed Operation Dashboards for summary level data analysis in Dashboard(Xcelsius) using Qaaws for Higher level Management to Monitor Project/Budget allocation Assisted Business Objects user community with day to day Business Objects guidance/issues  Developed interactive dashboards in Design Studio to show summary level data based on business requirements. Create the simple reports/Dashboards in SAP Lumira and Business Objects Explorer to show the user experience plus the layouts which met the business requirements. Environment: Business Objects 4.1/3.1/XI, Crystal Reports 2008, Dashboard 4.0, Windows R2008, Oracle 11g, SQL Server 2008, SAP Lumira (Data Visualization)1.18, Design Studio1.2, Business Objects Explorer, asp.Net, Tableau 8.1 Client: Fidelity Investments, Durham, NC\t   Role: Business Objects Consultant\t\t                             Aug 2011-Dec 2012 Actively worked with Business Users/Managers in gathering reporting requirements and Converting business requirements into functional requirements Modified the existing Universes by adding Dimensions, Measures, Custom Objects and Contexts, using star schemas and snowflakes as source for these universes. Used @functions (@select, @aggregate aware, @where, and @prompt) to create predefined conditions, and prompts to filter the data in the universes. Design additional new Universes for eDelivery, National Financial, Service Center, StreetScape etc for ad-hoc reporting.  Develop, Test and enhance existing Business Objects 3.1/4.0 Universes & Reports, including modifying, testing and exporting to the Repository. Created Content groups in CMC for different Universes to provide respective access (Owner, Power User, and Consumer) to the end users based upon Job role to access the reports. Worked extensively with the major functionality of Business Objects like Breaks, Sections, Alerter, Filters, Sorts, Query Prompt, User response function etc Created reports using Crystal Reports with Summary and Cross Tabs, and also modified the existing Crystal Reports as per business needs. Used Toad/Aginity  to verify data pulled by the report is correct compared to the database data and also to verify the joins used in designing the Universe are correct Presented the advanced features of Business Objects 4.0 to users and developers to enable them to develop queries and reports easily.  Involved in conversions of Brio reports into Webi reports Worked with DBA to tune the report queries for improving performance of the reports. Involved in developing FI Release Management dashboard using Xcelsius/Dashboard for Quality Center department Involved in user training on Xcelsius/Dashboard and live office, Qaaws, BI Web services  Design and developed FIT Management Dashboard for higher level management to view IM/PM/CM Tickets, project allocation using Qaaws. Involved in Production Support during and/or after office hours on technical Business Objects related issues and/or data analysis on data related issues to team members/business users.  Resolved Incident Management tickets to support production environment on a daily basis. Scheduled business reports on a daily/Weekly/Monthly basis and distributed reports in multiple formats such as Excel/PDF/Webi URL to users and SharePoint location. Coordinated with Off-shore team on the project development, validation and deployment of the Universes and reports. Involved in Migration process from Business Objects XI 3.1 to 4.0 Provided complete documentation(Hard cards) to help users in developing various reports using different functionalities and methods used in creation of reports in BI Launchpad 4.0  Environment: Windows XP/7, Business Objects 4.0/3.1 tools (Designer and Business Object-Report), Unix/Linux, Hyperion Brio, Dashboards4.0, Crystal Reports XI/2008, Oracle 10g/11g, SQL Server 2008,Netezza 6/7, DB2    Client: Fifth Third Bank, Cincinnati, OH\t    Role: Business Objects Developer                                                                           Nov 2009 - July 2011 Involved in gathering reporting requirements and analyzing existing legacy system. Modify the existing marts by adding dimensions or measures as needed. Created classes, subclasses and objects including complex measure objects according to the business requirements from the Universe schemas and database tables Created Custom Hierarchies for several groups in Universe and also provided row level security for the end users. Worked extensively with (@select, @aggregate aware, @where, and @prompt) to overcome the problems with database when integrating with Business Objects. Coordinated with the ETL team to discuss the business rule/logic used to develop mapping and processes to populate the marts/tables. Create standard reports in Business Objects as per the specs finalized. Most of these reports are complex reports having multiple data providers and use advance formatting like Sections, Master Detail and Cross-tab. Developed complex Crystal Reports like sub-reports, Drill-down, Dynamic Grouping, Cross-Tab, Graphical, On-Demand, Ad-Hoc Reports, Frequency Reports, Summary reports, Linked reports, Mailing labels, Aging reports Responsible for Business Objects Universe development, support and enhancement for major business units Used AQT (Advanced Query Tool) to verify data pulled by the report is correct compared to the database data and also to verify the joins used in designing the universe are correct Interact with the users to get approval of the developed reports, Promote reports in the production environment through Change Management. Modified the existing Universes by merging different Classes, resolved the Loops and Chasm Traps by context. Design and developed flexible BEx queries based on business reporting requirements Depending on the business requirements created Universes against SAP BW (BEx Queries) and Oracle data bases. Developed BO webi reports against Universes build on top of BEx queries. Provided production support during and/or after office hours on technical Business Objects related issues and/or data analysis on data related issues to end users.  Created interactive dashboards in Xcelsius with summary level data for higher management Designed and developed dashboards/Scorecards using Query as a Web Service (Qaaws) in Xcelsius Environment: SAP BI 7.0, SAP ECC 6.0, Windows 2000 x, Business Objects 3.1,Crystal Reports 2008, Xcelsius, Oracle 9i/10g, Teradata, DB2 Database, Hyperion Essbase 11.1  Client: Hibbert Group, Trenton, NJ Role: Business Objects/Crystal Report Developer                                            July 2007- Oct 2009 Involved in user training, trained users on InfoView and Xcelsius Applications, and provided technical guidance to users. Wrote functional specification documents for the project scope to be created in security to be implemented in Business Objects XI R 3.1   Created universes with Classes and Objects for Investment management system.  Created universe on top of views build in composite coming from multiple data sources. Worked extensively with @functions (@select, @prompt, @where) in designer, created optional prompts, also created objects using complex case functions. Addressed chasm trap and Fan Trap using Multi Parse SQL. Resolved Loops using Aliases and Context. Created Multiple Custom Hierarchies for several groups to provide drill across functionality. Responsible for maintenance existing universes, Webi reports and Crystal reports. Extensively involved in developing Web Intelligence reports, publications, scheduling and monitor publications. Implemented Row level restriction for managers profiles using designer. Resolved tickets to support production environment, Modified and tweaked report content and distributed reports in multiple formats such as Excel/PDF/Webi  Used @aggregate aware () function and Aggregate tables for optimized query performance.  Developed reports using Crystal Reports with Standard, Summary, and Cross Tabs and Grouping. Used conditional formatting as per business user reporting requirement in Crystal reports. Created Webi Reports with multiple variables (Context) at report level to meet complex business requirements. Provided user training documents for basic implementation. Design and create User guide and Training Guides. Environment:  Business Objects XI R 3.1, Crystal Reports XI, ITSM Software, Hyperion Essbase, SQL Server 2000, Oracle 9i, and UNIX."}