{"text": "Name: agnes agnes E-Mail: agnes.agnes@gmail.com Address: Nanning, China Github: https://github.com/agnes LinkedIn: https://linkedin.com/agnes Phone No. 225966642597 7+ years of hands-on experience in identifying business needs and determining solutions to businessproblems for complex software projects, including system development component, business process improvement, strategic planning and policy development.  Extensive knowledge working through the Software Development Life Cycle (SDLC) including Enterprise Analysis, Requirements Planning and Management, Requirements Elicitation, Requirements Analysis and Communication, Solution Assessment and Validation of Projects.  Excellent analytical and problem solving skills in designing, developing and implementing innovativebusiness processes using new approaches and technology.  Elicit, Analyze, Create and Review of Business Requirement Documents (BRDs), Functional Specification Documents (FSDs), Use Case Documents, and Business Rules Spreadsheets (BRS), Standard Operating Procedures (SOPs).  Excellent knowledge of Health Insurance Portability & Accountability Act (HIPAA) standards, Electronic Data Interchange (EDI), and Implementation and knowledge of HIPAA code sets, ICD-9, ICD-10 coding and HL7.  Worked with ANSI X12 5010 and ANSI X12 4010 including the standards for medical transactions like 837 (medical claims), 835 (medical claim payments), 270 (eligibility inquiry), 271 (eligibility response), 276 (claim status), 277 (claim status response), 820 (enrollment), and 834 (premium payments).  Experience with the working of Medicare (Part A, B, C and D) and Medicaid Health Insurance Policies, Personal Injury Protection (PIP) insurance, billing experience with life and disability in healthplans with thorough understanding of CPT coding, HCFA-1500 and CMS-1500 claim forms and reimbursement forms.  Excellent Business writing skills in developing Business Requirements Document (BRD), Use Case Specifications, Functional Specifications Document (FSD), Systems Design Specification (SDS), Systems Requirements Specification (SRS), Workflows and Project Plan.  Participate and contribute to lessons learned sessions and prepare the documents Logged and reviewed Defects, documented the whole Bug life cycle using Quality Centre.  Systematized Claims Processing and Claims Scrubbing in HMO, PPO, Medicaid and Medicare and proficient in CPT and HCPCS revised coding convention.  Understanding of Data validation and warehouse concept. Developed, maintained test plans and executed test Script from Quality Center.  Worked on pharmacy benefit management systems to make use of our existing web applications that provide pharmacy/Rx related member functionality.  Strong communicator and creative problem-solver skilled at analyzing business needs and transforming them into technical designs, applying technical skills and business knowledge to achieve sound results. Technical Qualifications Sr. Business Analyst\t\t\t\t\t\t\tApr 14 – Present    Excellus BlueCross BlueShield Rochester,NY UnitedHealth Group is a leading insurance organization that caters to the health insurance needs in the US. Worked on claims, membership and provider related projects for various Communities and State health plans. FACETS is being widely used across their network for the claim adjudication, claim processing, Membership and Provider Management. Duties included working with State partners for regulatory deadlines and carrying project from Vision to Deployment as part of a FASTTRACK approach.  Responsibilities:  Delivered project artifacts such as \"As-Is\" and \"To-Be\" business process maps, BusinessRequirements documentation, and provided input to and review of other project deliverables impacting the Billing & Payment Operations team (Charter, Scope, UAT, Use Cases, BRDs, etc).  Acted as a liaison between Blue Shield and its trading partner in requirement elicitation, process mapping, system integration, file transmission, and work plan development.  Conducted meetings with cross-functional stakeholders to address business issues and developed resolutions.  Work with Business SME's and IT staff to identify and translate business requirements into system requirements.  Gathered system requirements and specifications, project planning and identifying the resources and implementation of the projects.  Actively participated in weekly status meeting with Team members, Project Manager& Technical team and also generated Weekly Status Reports to the Team manager.  Collaborated with Quality Assurance Lead and business SMEs to develop test cases to verify the deliverable.  Conducted numerous JAD sessions with business users, developer and SMEs.  Used AGILE methodologies to configure and develop process, standards and procedure.  Attended daily SCRUM meeting and guided QA and Developer regarding the defects, Technical Specification Documents and Mapping Documents.  Analysis of inbound and outbound interfaces and extensions to FACETS claim processing system.  Involved in projects for Enrollment, Provider and Claims processing within FACETS Systems for Medicare and Medicaid State Health plans.  Worked with FACETS Team for HIPAA Claims Validation and Verification Process.  Extensively involved to plan, implement and test all Third Party Applications that have an impact on United Health Care's 5010 readiness.  Involved with Data Mapping between various source systems and staging area and data marts  Business Analyst\t\t\t\t\t\t\tNov 12 – Mar 14 Texas Health Harris Methodist Hospital Fort Worth, TX I was involved in working on updating standards for Electronic Health Care and Pharmacy Transactions. The first rule adopts an updated X12 standard, Version 5010 for certain electronic health care transactions, under the authority of HIPAA rule. The second rule adopts two medical code sets for use in reporting diagnoses and inpatient hospital procedures in health care transactions (ICD-10). The standards adopted under this final rule will replace the ICD-9 code sets, developed nearly 30 years ago, with greatly expanded ICD-10 code sets. \n  Responsibilities:  Interacted with stakeholders to get a better understanding of client business processes and gathered requirements.  Incorporated HIPAA standards, EDI (Electronic data interchange), Implementation and Knowledge of HIPAA code sets, ICD-9, ICD-10 coding.  Developed (UAT) User Acceptance Testing plan to guide a select group of key end-users in testing the user interface and functionality of the application.  Also developed Requirements Traceability Matrix (RTM) mapping UAT plan and BRD.  Conducted Fields Mapping by explaining each column name in the backend database tables.  Developed Functional Testing Approach for ICD-10 Remediation and included in UATP Plan.  Conducted Smoke Testing of the new ICD-10 UAT region and recorded all the testing results in RTM.  Coordinated with Project Managers to resolve risk issues and ensure compliance of Security System related to the HIPAA.  Developed custom Project Request Form on Infopath Designer and integrated it to the SharePoint site.  Compared and validated 5010 system test results with 4010 results for the same test scenarios.  Conducted requirement-gathering sessions with the purpose of creating and defining the Business Requirement Document (BRD) and the Functional Requirement Document (FRD) using Rational Requisite Pro.  Conducted functional requirement reviews and walkthroughs with the designers, developers, and stakeholders.  Conducted sign-off meetings with IT teams to lock down the requirements. Conducted JAD sessions to allow different stakeholders to communicate their perspectives with each other, resolve any issues and come to an agreement quickly.  Documented the Use Cases and prepared the Use Case, Activity, Sequence diagrams and Logical views using MS Visio, MS Office and Rational Rose for a clear understanding of the requirements by the development team.  Clarified QA team issues and reviewed test plans and test scripts developed by development team and QA team to make sure all requirements have been covered in scripts and tested properly.  Sr. Business Analyst The Department of Healthcare and Family Services            \t\t\tJul 11 – Sep 12 Springfield, IL The project is to enhance the Medicaid Management Information System (MMIS) for State of Illinois. The Illinois Michigan Program Alliance for Core Technology (IMPACT) project, which they touted as the first collaboration where one Medicaid management information system (MMIS) will carry out all Medicaid administrative operations for two states using cloud-based technology.Also, tracking and addressing the problems on timely manner encountered by the providers, billers as well as vendor companies, health plan groups while generating 837 Professional, Institutional, and Dental claims, Acknowledgement 997, Claim Status Inquiry/Response 276/277, Remittance Advice 835, Eligibility Inquiry/Response 270/271, Prior Authorization 278, Drug/Pharmacy rebates and reimbursements, etc. The team is also actively involved to verify the data while it is converting from MMIS web portal to mainframe layout as well as in returning from mainframe to MMIS web portal. Responsibilities: Coordinated with the stakeholders and project key personnel to gather functional and non-functional requirements during JAD sessions. Studied the existing business process and created AS-IS workflow to illustrate the existing system. Tracked requirements in the Requirement Traceability Matrix (RTM) defining each technical requirement in detail from areas like: main hardware, application software, networks, servers, internet and desktop configuration. Propose strategies to implement HIPAA 5010 in the new MMIS system. Responsible for the full HIPAA compliance lifecycle from gap analysis, mapping, implementation and testing for Medicaid Claims. Responsible for gap analysis in changing old MMIS and Involved in testing new MMIS. Also, accountable for Medicaid Claims Resolution/Reimbursement for peach state health plan using MMIS. Assisting the project manager in creating the business case and project plan. Served as a liaison between the internal and external business community (Claims, Billing, Membership, Capitation, Customer service, membership management, provider management, advanced Healthcare management, provider agreement management) and the project team. Actively analyzed current business processes (Claims, Recipient eligibility and enrollment etc.) and worked with management to improve and implement enterprise solutions to ensure compliance Responsible for creating business work flows and processes and creating management reports based on the analysis. Followed the UML based methods using Rational rose to create Use Cases, Activity Diagram, Sequence Diagram, Collaboration Diagram that include Functional and Non-Functional specifications to hand off to development teams. Actively involved in updating internal processes (submit claims, check eligibility), updating data collection and data reporting Defects and bug testing by using Rational Clear-Quest, Configuration management and Version control with Clear-Case. Business Analyst\t\t\t\t\t\t\t\tJul 09 – Jun 11 First Union Bank - Basking Ridge, NJ  First union Bank is a leading retail and corporate bank offering traditional banking, insurance, and wealth and asset management. The application project involved online banking system. The customers can access and manage their accounts, transfer funds between accounts, credit card access, pay bills, view and manage portfolios as well as trade stocks-options/mutual funds and bonds. The application also provides detailed Financial Analysis and Research for securities and fixed income, Cash Management products to investors.  Responsibilities: Used agile methodology for managing the SDLC for project. Strong experience on Basel ii and iii Financial Compliance. Excellent understanding of Basel II/ III models, methodologies and implementation aspects. Strong understanding of trading instruments including equity derivatives, interest rate derivatives\u2028FX, options, money market, fixed income, credit derivatives, and commodities trading products.\u2028 Provided new business & technological ideas related to Six Sigma Change Processes / business process improvements (SDLC based) / process re-engineering.  As involved in multiple projects, worked on both Agile as well as traditional waterfall methodology for the project implementation cycle. Experience in creating QA Metrics (Test summary and progress report). Defined problem domain by gathering requirements from business user and stakeholders and transformed functional requirements into system requirement specifications. Created Use Case model and Process flow diagrams.  Developed and managed project plans and schedules. Conducted functional walkthroughs, User Acceptance Testing (UAT) sessions, and supervising the development of User Manuals for customers. Interacted with Users, Developers, Project Manager to write business requirement. Performed Requirements Analysis and Documentation using Requisite Pro. Coordinated monthly meetings and got user feedback at every step of the development process. Used JIRA to track bugs and system enhancements.  Facilitated JAD sessions to discuss requirements and resolve conflicts between stakeholders. Involved with the QA team to review Testing Strategies and Test Plans. Actively involved in walkthroughs and meetings with development team to discuss related issues.  Business Analyst\t\t\t\t\t\t\t\tApr 08 – Jun 09 FIS - Woodbury, MN FIS has a suite of account opening products that can help reduce the risk associated with opening online accounts, increase the number of accounts successfully opened, generate additional revenue and ease the workload of your current resources. We developed product which streamlines online services and processes. With FIS eAccount Opening service, new and existing customers can apply for an account, be approved and fund the account in a single online session. The system automatically screens, authenticates and verifies the applicant in real time, comparing personal information against identity data, credit and fraud data, and Office of Foreign Assets Control (OFAC) data. The applicant receives fast service and instant online response to the application.  Responsibilities: Responsible for gathering requirements by interviewing and facilitating JAD session with Internal and external Client reporting, testing and quality assurance for Prime Brokerage applications for trading fixed income products\u2028  Conducted project planning meetings and listed the client wish list, time line, resources, GAP analysis and ROI\u2028 Comprehensive knowledge of the principles of accounting, business and finance\u2028 Steered Release planning meeting to develop feature list, prioritize stories based on business value, estimated story points and develop a release plan. Involved in a team, which implemented the DB2 and 3rd party utility schedule to facilitate backup, recovery, reorganization, and statistics collection. Helped the business users in portfolio management by giving additional information like beta value, target price and performance charts. Performed depth analyzing of coding, assessment and reporting of adverse event data\u2028 Conducted iteration kick-off meetings with Business Users, Project Manager, Development and QA teams to document Product Backlog Items (PBI), high level business process models and high level architectural models\u2028 Managed the assignment of user story / use case development work using JIRA and Confluence. Created Documentation for Analysis reporting, architectural presentations, infrastructure specifications, strategy planning, risk analysis, contingency plans for company executives. Worked closely with business users to prioritize and scope out the Product Backlog Items. Reviewed user stories with stakeholders to get approval and gain agreement on direction of the technical solution Interacted with developers and implemented the coding of Informatica Mapping for the different stages of ETL Involved in Prime Brokerage Technology quality assurance analysis and testing and supported UAT. Worked with IT to identify and remediate any technical challenges\u2028 Represented business in taking about the technical changes in line with the business requirements Education: Masters in Business Administration majoring in Management Information Systems"}