{"text": "Name: virginia virginia E-Mail: virginia.virginia@gmail.com Address: Yichun, China Github: https://github.com/virginia LinkedIn: https://linkedin.com/virginia Phone No. 284510692340 PROFESSIONAL SUMMARY: Business Analyst with 7 plusyears of financial and healthcare domain experience; expertise in Business System Analysis, Data Analysis, Business Rules, GAP Analysis and developing/creating business process documents. SDLC: In depth strong working knowledge of the Software Development Life Cycle (SDLC) phases such as Planning, Analysis/Design, Development, and Testing for the software/system development process. Strong experience in preparing Business Requirements Document (BRD), Use Case Specifications, Functional Specifications. Well acquainted with Workflows and (UML) (Unified Modeling Language) diagrams such as, Use case diagrams, activity diagrams and Sequence diagrams. Actively used Joint Requirement Planning (JRP), Joint Application Development (JAD) and Rapid Application Development (RAD) sessions for requirements gathering and brainstorming ideas. Multi-Tasking and Organizational Aptitudes, with proven experience in Development and Implementation of Strategies. Excellent communication and interpersonal skills, capable of communicating with highly technical engineering teams. Exceptional mediator between external and internal customers, capable of interpreting their needs and positions to ensure the success of the projects. Very well versed in technical writing, documentation, presentation and delivery. Experienced in vendor management, training users / peers, building consensus.  TECHNICAL EXPERTISE: PROFESSIONAL EXPERIENCE: Client: United Health Care, Boston MA\t\t\t\t                                    April 2015 - Present Domain: Health Care Position: Sr. Business System Analyst Cardinal Health is one of the Fortune 500 companies that is focused on high – growth health care market. Cardinal Health has built the industry’s broadest suite of products and services that help improve quality, safety and efficiency all along the chain of care. It implemented a new web enabled Client server system that was in use. I rendered functional, analytical and technical acumen via vast functional, research and testing capabilities in the areas of object creation, quality assurance and project development. \t Responsibilities:  Involved in gathering and analyzing business requirements from existing and proposed models. Conducted User Interviews, gathered requirements using Requisite Pro.  Utilize Rational Unified Process (RUP) to configure and develop process, standards and procedures and created a Business Requirement Document. Use prototyping as part of Business Elicitation to build the final product by gaining productive feedback from the client throughout the project.  Conducted JAD sessions with all Project Directors and Stakeholders.  During the Design phase, worked with the development team to ensure testability, reliability, usability, maintainability and performance of a web-enable client/server application. Interacted with the User Experience teams, Testing teams, Development teams, Business and Project Management team in understanding, clarifying, articulating and delivering requirements. Converted business requirements into functional & technical specifications by writing Use Cases& Design Functional Specifications, drawing Activity Diagrams & Screen mockups using Office products. Utilized Use Cases in UML Diagrams and textual descriptions, documenting requirements in a requirements database to track development. Environment: Rational Requisite Pro,Rational Rose, MS Office Suite, MS Visio, MS Projects, Quality Center, MS SharePoint, Waterfall, Agile, UML  Client: Capital One, Richmond VA                   \t\t\t                      January 2014 - March 2015 Domain: Finance Position: Business Analyst  Responsibilities:  Implemented Traceability Matrix and User Requirement Specification Document (URS) to verify the functionality coverage.  Extensive use of MS Project, MS SharePoint (used as the library for Project documentation and thecommunication of Project information). Created Mortgage Service Platform (MSP) diagram in MS Visio to understand the big picture of the project. Facilitated and managed meeting sessions with committee of SME from various business areas including Mortgage Servicing, Loan Monitoring and Asset Management. Responsible for working with product management to translate business objectives into functional requirements, and great user experiences for our customers. Coordinate with all project team members to ensure project needs are clearly understood and supportable. Identify and remove or mitigate obstacles and risks to projects. Conducted peer review meetings periodically to keep track of the project’s milestones. Assisted the Project Manager with creating detailed project plans and also in developing, scheduling and tracking project timelines. Conducted GAP Analysis of current state (As-Is) and proposed state (To-Be) situations and represented in MS Visio.  Developed a database design with the help of relational data model. Developed a design class diagram and subsystems to interact with external systems. Facilitated JAD sessions with the business team and technology team. Responsible for leading all aspects of projects from start to finish, including project team definition, resource allocation decisions. Developed high level design of new processes and graphically presented along with text based requirements. Experience in working with HTML. Produce different levels of prototypes to aid the design and usability testing process: interactive HTML prototypes, and wireframes. Prepared database models using Visio. Used Rational Requisite Pro for managing the requirements and designed and developed Business process models, Use Cases, Activity Diagrams, and Sequence Diagrams using UML and BPMN in MS Visio. Conducted Previews and User Acceptance Test (UAT) sessions. Environment: MS Word, MS Excel, MS Excel, MS Project, Blueprint, MS Power Point  Client: CVS Pharmacy, Chicago-IL                                                                             June 2012 - December 2013 Domain: Pharmacy Position: Business Analyst  CVS Pharmacy is the second largest pharmacy chain in the US after Walgreens. CVS has over 7,000 stores in 41 states and Puerto Rico. As the retail pharmacy division of CVS Caremark, it sells prescription drugs and a wide assortment of general merchandise, including over-the-counter drugs, beauty products and cosmetics, film and photo finishing services, greeting cards and convenience foods through their CVS Pharmacy and retail stores and online through CVS.com. The project consisted of improving customer’s online ordering experience within CVS website. The internal process was reviewed in order to automate some manual intervention. Responsibilities:  Created targeted questionnaires for SME to gather requirements and understand the business process goal from them. Actively participated in Pre-Testing that included review of the requirement documents, studying the use cases for developing test plans and collection of test data.   Collaborated with the stakeholders in defining the scope of the project in context to the MMIS (Medicaid Management Information Systems) regulations. Monitored day-day activities responsibilities include leading a team of analysts and MMIS specialists in the development of a requirements analysis, advanced planning document and request for proposal.  Provided primary liaison between client and development team, providing adequate information to project team for development of application. Created business requirements and helped system analysts in converting them into System Requirement Specification (SRS) document. Used Rational Requisite Pro to document stakeholders’ requests, software requirements specifications and traced it to use cases. Designed and Documented Test Procedures and Test Cases for user acceptance, functional and integration testing. Discussed defects with analysts and then made decisions about modifications and changes. Studied and analyzed competitor’s applications and brainstormed to gather effective requirements for a better quality in the product. Gave access to end-users for Acceptance Testing and sent defect reports to developers. Used Rational Clear Quest to track defects, while prioritizing them for enhancements after base lining the requirements. Documented Manual Testing and also kept track of defects found during this testing. Used Rational Rose and MS Visio to carry out business modeling of the business process. Environment: SQL, Windows 2000, Rational Suite, Visio and MS Project, MS Office Suite (PowerPoint) General Electronics, Mumbai, India\t\t\t                                            May 2009 to May 2012\t Role: Business Analyst Intern. Responsibilities: Estimate time required to deliver project artifacts and reports progress towards delivery goals throughout the project; Lead key stakeholder analysis process Interact with project stakeholders to elicit and document project requirements by translating business needs into testable, developer-ready requirements Produce professional quality project artifacts including but not limited to business requirement documents, requirement plans, models (e.g. data, event, context and process), traceability matrices, use cases, issue logs and other documents as needed Identify and communicate risks as well as possible solutions; Assist the business in determining if and how new systems or system enhancements may improve process flow and business function Serve as a critical resource and liaison between subject matter experts and technologists throughout the project lifecycle; Work with the business to recommend appropriate training, communication and scheduling as systems are deployed Works with the project team to determine appropriate test plans, deployment plans and supports the product launch; Participate in the Quality Inspection process for all requirements and secure Business Requirement Document approvals from project stakeholders Environment: MS Visio, MS Word, MS Excel & MS Power Point, Bloomberg and Mercury Test Director. EDUCATION:  Masters In Engineering Management, New Jersey Institute of technology . Bachelors of Instrumentation Engineering, University of Mumbai ."}