{"text": "Name: edna edna E-Mail: edna.edna@gmail.com Address: Santiago, Chile Github: https://github.com/edna LinkedIn: https://linkedin.com/edna Phone No. 289186805786 PROFESSIONAL SUMMARY 7 + Extensive experience in creating Context Diagrams and Unified Modeling Language (UML) diagrams such as Use Case diagrams, Activity diagrams, Class diagrams and Sequence diagrams using MS Visio.  Experience in facilitating JAD sessions to draft a Business Requirement Document. Proficient in Tableau Desktop (9.x, 10.x). Prior experience as Java/J2EE developer implementing enterprise applications.  Experience in developing various kinds of Views, Workbooks as per business requirements by utilizing Charts (Bar Graphs, Dual Axis, Pie-Charts, Bubble Charts, Scatter Plots, Heat Maps, Tree Maps, Funnel Charts), Filters, Pages, Calculated Fields, Groups, Parameters, Sets, Dynamic Sorting, Table calculations, Trend lines, Forecasting etc. Experience in using burn down charts to prioritize product backlog and track the progress of each sprint. Hands on experience in working with Microsoft Project. Expertise in Software Development Life Cycle (SDLC) including Waterfall, Agile, RAD, SCRUM, RUP methodology. Extensive knowledge in working with Java/J2EE technologies such as Servlets, JSP, JSF, EJB, JDBC, JPA, JMS, My Faces, JNDI, JAX-WS, JAX-RS. Experience in developing web applications using Spring MVC and AOP. Extensive experience in using various design patterns such as MVC, Singleton, Session Facade, DAO, DTO, and Business Delegate in the development of Multi-Tier distributed Enterprise Applications. Implemented SOA architecture with web services using SOAP, WSDL, UDDI and XML. Facilitated as Scrum Master mostly in the absence of Project Manager  Adapt with scripting Business Requirement Documents (BRDs), Functional Specifications Documents (FSDs) Assisted QA’s in various types of testing including Smoke Testing, Functionality Testing, Performance Testing, Volume Testing, Unit Testing, Integrated Testing, System Testing, Positive and Negative Testing, Security Testing, Stress Testing, Load Testing etc. Knowledge of SQL, XML, HTML Understanding of IT auditing, and able to perform according to industry standards. Proficient in requirements collection, from clients and processing information to the project team Proficient in Tableau Desktop (9.x, 8.x, 7.x). Good Understanding of Full Software Development Life Cycle (SDLC) experience including Analysis, Design and Review of Business and Software Requirement Specifications and Agile software development methodology Knowledge on Connected Car technology. A self-starter, motivated team player with Leadership abilities with excellent communication and interpersonal skills TECHNICAL SKILLS Business Modeling Tools:\t   Rational Rose, MS Visio, Visual Paradigm. Operating Systems: \t\t   UNIX, Windows  RDBMS:\t\t\t               SQL Server, Oracle Business Applications:  \t                MS Office Suite–MS Word, Excel, PowerPoint, Outlook. SDLC:\t\t\t                Waterfall, Agile, RUP. Project Management Tool:\t    MS Project, Rally, SharePoint BI Tool:                                       Tableau Professional Experience Toyota Motor Corporation, York, MI                                                          Jan 2015 to Sep 2017 Technical Business Analyst   The intent is to conduct 240 barrier crash tests a year at the TEMA-York facility. Due to frequent build-book changes and lack of real-time data exchange leads to non-optimal scheduling and this causes roadblocks in meeting the goal of 240 in-house barrier crash tests. The current scheduling tool is semi-automated. Inputs required for scheduling are gathered manually and is not available real time in the scheduling tool. The existing scheduling tool does not have auto-manpower assignment and auto-calculated scheduling parameters. There are too many face-to-face interactions to exchange data (schedule, resource availability, build book updates, pre-build meeting invites, notification for build-book due date) between stakeholders. Due to frequent build book changes and reschedules, the target of 5 crashes a week is not met. Currently the number of crashes conducted in a week is 3-4 and remaining crashes are outsourced. Outsourcing of barrier crash tests results in increased costs.       This specification outlines requirements for a Fully automated real-time scheduling tool to provide real-time resource availability data as much as possible during scheduling. Management reports from scheduling tool Delayed crash-test report, online build book and pre/post-crash-test checklist inside the scheduling tool, auto upload/assign pictures based on the items in the crash test checklist/test-result reports Responsibilities:  Analyzed source systems’ data, and validate system outputs, processes and reporting data. Worked with the user groups to elicit, analyze and document data and reporting requirements Held meetings sessions with business process owners Vendors, customer service team and the marketing team for requirements gathering during the definition stage. Gathered, analyzed and documented requirements and translated business requirements to technical requirements for the developers. Participated in Daily Agile Scrum “Stand-up”, Biweekly Sprint Planning and Retrospective Sessions and update the team on status of upcoming User Stories. Initiated and crafted project charter by collaborating with senior business executives and technical architects; facilitated document through the global enterprise dispatch process resulting in an expedited approval of project time lines, resources and scope. Use Agile systems and strategies to provide quick and feasible solutions, based on Agile system, to the organization. Work in Agile, scrum, and sprint environment in order to change the requirements and features set. Maintained requirements in Confluence JIRA for tracking and testing purposes. Was involved in entering the bugs in Confluence JIRA. Assisted the project manager in preparation of project charter and project scoping. Prepared the project Milestones with the help of MS Project. Validated internal processes to ensure data accuracy and integrity. Performed extensive business requirement analysis including Data Analysis and Gap Analysis.  Used Microsoft Visio extensively to flow out the business requirements and Microsoft PowerPoint for presentations. Performed Data mining of the application to determine data properties and structure. Created SQL scripts to extract the data from the operational database into simple flat text files. Validated XML files using SOAP UI. Performed the Back-End Testing to ensure data consistency and accuracy by writing and executing SQL statements on Oracle Database. Created HTML and Visio screen mockups to use in prototype review sessions. Extensively used SQL statements to query the Oracle Database for Data Validation and Data Integrity. Extensively wrote standard and complex SQL queries to perform data validation to make sure test results matched. Experience with XML for data presentation and communication. Responsible for continuous process improvement and for identifying and maintaining a clear and measurable Development Process that is deployable throughout the enterprise using Agile Methodology. Utilized use case diagrams during analysis to capture the requirements. Helped creating a common outlook module to auto generate the meeting invitations in Microsoft Outlook. Used MS SQL Server Database query for analysis. Acted as a liaison between management and development team for requirements and testing. Participated in the planning and execution of the User Acceptance Testing (UAT) effort. Ensured application forms and reports (UI) followed client’s development standards and guidelines in terms of usage, naming conventions etc. Conducted workshops training for internal users. TD  Bank, Cherry hill, NJ                                                                           July 2012 to Nov 2014  Technical Business Analyst Their mortgage system is a web based software package that is designed to be a complete mortgage lending solution. The system allows for processing, closing and underwriting of all loan types for both wholesale and retail production. The system also provides a centralized repository for underwriting and monitoring process. I gathered requirements for loan origination and identified the processes to convert the time-consuming loan lifecycle process into an automated and integrated system that provide a real-time status of loan applications, risk management, and monitoring capabilities.  Responsibilities: Analyzed product types for commercial, retail loans, deposits and securities.  Understanding of various regulatory and financial requirements. Gathered requirements using SharePoint and created Document Libraries/Lists Created and Maintained Project Plans in MS Project 2007/10 and SharePoint Gantt Task List. Maintained and created SharePoint 2007 repository for BA group requirement documents for IT auditing standards. Extensively used JIRA as a project management tool.   Liaison between business, Development and QA.  Convert business requirements into technical requirements, write test plans and UAT. Conducting requirement gathering sessions, feasibility studies and organizing the software requirements in a structured way.  Walk through of the mapping documents and BRD's to Dev, QA and UAT teams.  Worked in Agile Testing and participated meetings every day in iterative environment Created and maintained detailed test cases to perform various types of testing. Using Agile methodology and engage in an iterative workflow and incremental delivery of working. Prepared, scheduled and lead meetings between enterprise business and technical resources and multiple vendors in preparation for demonstrations and site visits resulting in more efficient and productive meetings with fewer follow up questions and communications. Assisted in closing gaps for associated Stories in each individual Sprint. Assisted in entering and updating Issues (Epics, Stories, and Tasks) onto JIRA Agile application. Created HTML and Visio screen mockups to use in prototype review sessions. Acted a project manager/business analyst for the Buy-In project and build a new application using service oriented architecture (SOA) and XML to assist the Stock-Borrow Loan team in sending Buy-In requests to DTC for post settlement date clearings. Used SOAP UI to test Web Services and validate XML files.  Validate data quality by implementing data quality rules: Completeness, Accuracy and Validity  Conducting meetings with business to review mapping documents.  Created test cases for the application under different releases and wrote SQL Queries to check the data Created Traceability Matrix to trace each Test Case and associated them with the registered requirement Understanding the SQL code to get the mappings from source to target.  Clarify the questions from Dev, QA and UAT teams.  Used data source filters for high volume of data to improve performance of the reports. Understanding and mapping product and customer information data.  Unifying data across the systems by understanding and mapping conformed values from business. Gap, Inc. San Francisco, CA                 \t\t                     Aug 2011 – May 2012                                                    Technical Business Analyst As a BA I worked on the customer facing e-commerce website www.gapinc.com. It focused on inventory tracking and also optimal stock maintenance for all the orders made on the web portal. This website was built using Sitecore CMS. As a Business Analyst I interacted with the client and the technical team for gathering requirements and translated business requirements to technical requirements. Responsibilities:  Extracted the Business Requirements from the Business Users and documented it for the developers conducting JAD sessions and Interviews. Interacted with client and the Technical Team for requirement gathering and translation of Business Requirement to Technical specifications. Conducted Web Meetings with Off-Shore team members to ensure that everybody is on the same page. Responsible for the newly enhanced web application with Sitecore Web Content Management System in Graphic User Interface (GUI). Interface with product stakeholders groups to define clear user stories, assisting Product owner prioritize user stories in Product backlog Coordinating agile based planning/review activities and meetings, followed Iterative Software Development Life Cycle Process, Agile using Scrum Understood and articulated business requirements from user interviews, weekly requirement gathering sessions and then converted requirements into technical specifications Collected weekly status reports to ensure that all deliverables are met on time and on schedule. Created Use Cases from the list of requirements and prepared use case diagrams Involved in integration testing with added features like color and size. Created and maintained an Excel database.  Worked with Sitecore Platform specialist for the platform’s core capabilities. Consulted on information architecture, content reusability and strategies for extending the platform through custom development and integration of third-party systems. Experience on defining XML schemas for web services. Implemented SDLC for the development life cycle and followed the standard process in the application development through agile methodology.   Attended in daily standup status meeting for outlining goals for the day and discussion of current or potential blockers, enhancement and modification.  Worked on requirements for various modules covered under Retail and Global E-Commerce and POS apps. Handled testing activities for implementing and rollback procedures while deploying enhancements into production. Worked closely with the User Acceptance Test Coordinator, Project Manager and Business System Analysts to understand business processes and develop concrete UAT cases. Performed Data mining of the application to determine data properties and structure. Created SQL scripts to extract the data from the operational database into simple flat text files. Performed regression tests on each module and collectively to check for functionality. Pizza Hut, Plano, TX                                                                       Apr 2010 - June 2011 Java/J2EE Developer The project was based on implementing new E-commerce application for www.pizzahut.com that focused on integrating the Web based POS system to assist Pizza Hut streamline process, integrate channels and maximize profitability. Its main functionality included integrating the E-commerce & POS system to promote cashier activities, operations management, and assortment planning and customer relationship management.  Responsibilities: Responsible for continuous process improvement and for identifying and maintaining a clear and measurable Development Process that is deployable throughout the enterprise using Agile Methodology. Used use case diagrams during analysis to capture the requirements. Developed the flow diagrams for business process of the company using Microsoft Visio and analyzed and documented the requirement in Microsoft Word. Helped creating a Common Outlook Module to auto generate the Meeting Invitation in Microsoft Outlook. Acted as a liaison between management & development team for requirements & QA. Participated in the planning and execution of the User Acceptance Testing effort. Analysis and Design of various modules using J2EE Architecture. Involved in complete projects Life Cycle, i.e. Design, Implementation, unit testing and UAT Testing support and Production Maintenance. Extensively used agile development methodology and project planning. Implemented Spring framework for application transaction management. Developed Web Services to integrate with the External System. Worked on RESTful Web services Extensively worked with XML using DOM and SAX parsers for transferring the data between different components. Developed various SQL queries and PL/SQL Procedures in Oracle for the Application. Involved in Application/data base query performance Tuning. Automated the build process by using ANT build tool. Actively involved in getting the production issues resolved. Worked with SCRUM Project Management and Agile Methodologies for Software development Life Cycle. Performed the Back-End Testing to ensure data consistency and accuracy by writing and executing SQL statements on Oracle Database Extensively used SQL statements to query the Oracle Database for Data Validation and Data Integrity. Conducted GAP analysis of the different reports that are being presented to clients to accommodate their requirements for the new enhancements. Facilitated JAD sessions with model diagrams to elicit future state business requirements and to document Business Use Case To-Be artifacts. Created SQL scripts to validate the inputs. Worked with QA team to develop performance test cases based on projected user load. Involved in all stages of testing process–Development of Test scripts and Test cases based upon requirements for Functional Testing, Integration Testing and support for User Acceptance Testing. Used Rational tools to document and manage requirements, enhancement requests, and other documentation issues for the application. Worked with management to create and communicate critical information to the user community via email and discussion boards. Bachelors "}