{"text": "Name: helen helen E-Mail: helen.helen@gmail.com Address: Ōsaka, Japan Github: https://github.com/helen LinkedIn: https://linkedin.com/helen Phone No. 60268528438 Objectives To pursue a challenging position (Contract or FTE) in a dynamic, growing organization that can utilize my experience of cutting-edge analytics data platforms, Datawarehouse applications and related services.  Teradata Database Development & Administration (TD 12, 13.0, 13.10,14.0,14.10,15.0,15.10) ETL/BI Development, Operations & Application Support (Informatica Power Center, Control-M, GCFR, SLJM) Teradata DEV/QA/PROD environments Development, Maintenance & Planning Teradata System Performance Tuning & Database Security Management  SQL/BTEQ/TPT Development/Optimization, SQL EXPLAIN plan analysis, Query Optimization, Query Banding Teradata Active System Monitoring (TASM) Workload design & analysis Teradata Utilities (Teradata Parallel Transport (TPT), BTEQ, Fastload, Multiload, Fastexport, TPUMP) Development Stored Procedures/Macro’s Teradata Tools (SQL Assistant, TD Administrator, TSET, TD Index Wizard, Workload Analyzer) Teradata Viewpoint Management & Monitoring DBC Objects / Data Dictionary Maintenance, Analysis & Reporting System Health Analysis/Reporting using PDCR, DBQL & Resusage data  Multi value compression (MVC), Block Level compression (BLC), Teradata virtual storage (TVS) Physical Database Modeling/Design, Understanding of OLAP/OLTP  DBScontrol & CNS Utilities  Capacity Planning & Forecasting, Support in Upgrades Unity, Dual active systems, Teradata multi-system management Informatica Power Center Support & Development  System Administration & Shell scripting (UNIX/LINUX) Teradata Applications Support (CIM/ARM/TRM) Backups & Restore – BAR activities & strategies using DSA, Netbackup, NetVaulT, ARCMAIN  Disaster Recovery Planning & Management SLAs and OLAs management ITIL Processes & Framework (Incident/Problem/Change/Release Management) IT Service Management Tools & Methodology (ITSM Remedy, Service Now) TARDIS / JIRA / STASH / Jenkins / Source Tree / Perforce Certifications & Trainings Teradata 12 Certified Database Administrator Teradata 12 Certified Technical Specialist Teradata 12 Certified Professional ITIL v3 Foundation Certified in IT Service Management Teradata System Performance -  Larry Higa   (2012-Prague) Teradata Performance Optimization through Physical Design (2014-Manila) Teradata Performance Optimization through Workload Management (2014-Manila) Customer Service Skills & Mindset Program (2013-Islamabad) Employment History Optimum IT Solutions Inc.| Plano, TX  Teradata Datawarehouse Consultant – (June, 2015 – Present) Being a Teradata Datawarehouse Consultant, I am responsible for delivering service components as per client’s defined contractual scope and SLAs. Below is brief overview of Client engagements. Teradata Corporation | Project - DSW | Columbus, OH    Teradata Consultant | Onsite (Sep, 2016 – May 2017) I was working as Teradata DBA (Contract) at DSW with major focused on implementing Teradata best practices and educating Client staff around Database Development & Performance Optimization techniques. Stored Procedures Development to Automate DBA level 1 tasks Database Development and Administration for 5 Teradata Systems Re-engineering Security & Implement new Teradata 15.0 features Performance Optimization through physical design and workload management (TASM) Productive Partnership  with EDW/BI Architects & Data Modelers Co-ordinate with GSC and TD CS for ongoing issues and plan future upgrade roadmap Teradata Corporation | Project - Expedia | Bellevue, WA    Teradata Consultant | Onsite (Jul, 2015 – Aug 2016) I worked as MS team Lead - Teradata DBA for last 5 months prior to which I was working in capacity of Teradata Developer as a Contractor for DB2 – Teradata Migration project of Expedia.  Strategic Teradata Database Development, DWH Engineering & Performance Tuning activities Advance DBA tasks/BAR-(DSA)/TASM/Viewpoint Set-up/Performance Tuning management ETL Development/Migration using TPT, Informatica Power Center & other Teradata Tools & Utilities   Stored Procedures/ SQL/BTEQ Development, Testing & Optimization, SQL EXPLAIN plan analysis Design/Development/Testing/Deployment of migration sprints and performance analysis (Dev/QA/Pre-Prod/Prod) Teradata Corporation Teradata Professional Services Consultant – (Oct 2010 – June, 2015) My role over the last 5 years as a Teradata Consultant (FTE) has been to deal with operational elements of the Teradata DWH platforms both onsite & offsite with some reputable clients of Teradata across Europe & Middle East.  Teradata Managed Services - CoE | EMEA Region (Jan 2015 – May 2015) In this role, my key focus was to conduct performance optimization assessments and introduce Teradata DBA/ETL best practices across MS accounts in Europe, Middle East, Africa & Asia Pacific region.  System performance tuning exercise on key MS accounts Identification of performance issues & provide/recommend optimized solutions Assist in implementation of Teradata DBA/ETL Development standard best practices and process automation User/Developers guides & training on DBA/ETL best practices & performance optimization techniques Unilever   Teradata System Performance Tuning Engineer | Offsite (Sep 2014 – Dec 2014)  In the large DWH environment of Unilever, I was assigned as a Performance tuning expert and successfully identified/fix performance issues system wide and optimize semantic jobs to ensure SLA compliance Semantic layer performance tuning & optimization Tuning/Re-writing of complex ETL/Business queries(SQL, BTEQ, Stored Procedures), SQL EXPLAIN plan Analysis Performance reporting for Capabilities using PDCR, TASM & Workload design & analysis  Unity, Dual active systems, Teradata multi-system management Root Cause Analysis for system degradation & provide optimized Solution Recommendations/Fix Telenor Teradata DBA/ETL Tech Lead | Onsite – Islamabad (Jan 2014 – Sep 2014) I was assigned in a leading Telecom company of Pakistan as a Lead Teradata DBA/ETL where I accomplished to optimize Teradata DWH system & stream line EDW operations/development/deployments by Introducing Teradata best practices. Teradata Parallel Transport (TPT) Support & development, DBA/ETL Process automation, SLA’s/OLA’s maintenance Advanced DBA support, TASM workload analysis & implementation for Prod/QA/Dev environments,  ETL big-batches Hot-fixes, Query optimization, SQL/BTEQ Writing , SQL EXPLAIN plan analysis Capacity Planning (Saved 46-TB space), Multi Valued Compression, Block level Compression Auto Stats Collection Process Implementation/Maintenance, Stats Optimization Qatar Telecom (Ooredoo) Lead Teradata DBA / Developer | Onsite – Qatar (Apr 2013 – Dec 2013) As a Teradata Consultant in leading Telecom Company of Qatar, I introduced Teradata DBA/ETL best practices to optimize Teradata DWH Production/Development system & stream line EDW operations. DBA activities for Development/Production environment, Teradata Viewpoint setup Database Objects development & maintenance, Table/View/Macros/Stored Procedures, Index selection & Stats  Informatica power center ETL batch development & Support, Incident/Problem resolution & Hotfixes ETL batch performance analysis and optimization, Automation of DBA/ETL reports Offshore Team Management, Project documentation (Operational Manuals/Run-book) Nokia Onsite – Finland | (Apr 2011 – Apr 2013) I worked in the challenging DWH environment of world's largest manufacturer of mobile handsets, where I served in multiple roles, as a Performance DBA as well as Informatica ETL lead. Teradata System Performance Tuning Engineer  Teradata System Performance tuning/optimization for Production/Dev/QA & XLDB systems Query Optimization (SQL Review/Re-write/Test/Deploy), SQL EXPLAIN plan analysis Root Cause Analysis for system degradation & provide optimized Solution Recommendations/Fix Physical Data Modeling/Design, Semantic layer aggregation tuning / recommendations Performance Testing of new releases in QA/XLDB systems before PROD deployments Teradata Developer & Application Support Development and Operational support  for Demand & Delivery (DND) applications to adhere agreed SLA Teradata Database Development, ETL/BI Development using Informatica Power Center & Teradata Utilities  ETL Reporting, Data Validations, Source Data Reconciliations, Troubleshoot & Apply Hotfixes QA Testing and Prod Deployments Statoil Teradata DBA / Developer | Offsite (Oct 2010 – Mar 2011) As Teradata Consultant in the leading energy company of oil & gas production in Nordics, my duties were to perform DBA and Development support activities in rotating shift model, some of which are as below.  Database Administration & Development as per TD Best Practices for Dev/QA/Prod Environment ETL Development & Support (Teradata Utilities) Data Backups & Restore Gjensidige Teradata DBA & TRM Support | Offsite (Oct 2010 – Mar 2011) I was assigned on Norway's largest financial services Datawarehouse platform to provide Teradata Relationship Manager (TRM) support and Database Administration Tasks Teradata Relationship Manager (TRM)  support / Batch Troubleshooting Application monitoring & Batch reporting Basic DBA tasks including Data Backups & Restore using Netvault Education Forman Christian College 2010 - Bachelors of Sciences - Computer Sciences (Honors) - Valedictory Award Winner 2010 References Refer to Linked-in or can be furnished on request."}