{"text": "Name: anna anna E-Mail: anna.anna@gmail.com Address: Buenos Aires, Argentina Github: https://github.com/anna LinkedIn: https://linkedin.com/anna Phone No. 683334615449 PROFESSIONAL SUMMARY: 5+ years of professional experience in single page UI application design and development. Experienced in all the technical phases of Software Development Life Cycle (SDLC). Expert in Agile methodologies like Scrum. Strong development experience creating rich frontend UI in AJAX, JSF / JavaScript technologies using JavaScript libraries like jQuery, Angular 4+, NodeJS, ReactJS. Experience in designing User Interface (UI) applications and professional web applications using HTML 4.0/5, CSS2/CSS3, Angular JS/4/6, JavaScript, jQuery, AJAX, JSON and XML Expertise in developing various JavaScript frameworks like Angular.js Backbone.js, Require.js, Node.js, Knockout.js, Express.js, Underscore.js, React.js/ Redux, Ext.JS, Responsive web design (RWD). Experience in designing the interface UI/UX strategy, UI requirements and converting findings into UI designs. Wrote various Angular4 custom directives and developed many reusable components and templates. Familiar with popular browsers development and debugging tools/plugins for IE tester, Chrome Inspector, Firebug, Protractor, Jasmine, Grunt and Karma testing framework. Experienced in developing web services with XML based protocols such as SOAP and WSDL. Implemented React-Redux life cycle boilerplate scripts to decrease the project duration. Maintaining Parent and child elements by using State and Props in React JS. Utilized React-Redux Action Creators, create Store from redux library to connect reducers and containers, to update the state and virtual DOM. Modularized Front-End CSS and Node JS code with SASS. Expertise in XML technologies such as XSL, XSLT, XML schemas, XPath, X Forms and parsers like SAX, DOM. Proficient in Object Oriented Design/Development (OOD), Object Oriented Analysis and Design (OOAD), Model View Control (MVC) design pattern and Test-Driven Development (TDD).  Experienced implementing Web Services using SOAP API, WSDL, JAX-RPC, JAX-WS, RESTful and UDDI.  Experience in using various tools and IDEs for development and design like Net Beans, XAMPP, Notepad+ +, and Adobe Photo shop and Experience in NoSQL Database like Apache and MongoDB.  Expert in designing web applications and web contents utilizing various SEO techniques.  Involved in API Integration using Node JS and Mongo DB as a data base connection. Good knowledge of various design patterns like singleton, Strategy pattern and factory pattern. Extensive experience using SQL and PL/SQL to write Stored Procedures and Functions. Highly proficient in developing and deploying Java/J2EE applications on Application Servers – WebLogic, IBM WebSphere, JBOSS and Apache Tomcat. Proficient with build automation tools like Gradle, Maven, Apache and Ant for builds and deployments to different environments. Experience in using different version control systems like GIT, ClearCase, CVS, subversion. Excellent problem solving, analytical and interpersonal skills. Ability to work in-groups as well as independently without supervision. TECHNICAL SKILLS: PROFESSIONAL EXPERIENCE: Client: UPS, Parsippany, NJ \t\t\t\t\t\t\t\tDuration: Dec 18 - Till Date Role: Sr. UI Developer Description: UPS is one of the world’s largest multinational package delivery company headquartered in New Jersey. The company operates through U.S Domestic Package operations, International Package operations, and supply chain& Freight operations. Responsibilities: Analyzed business requirements, participated in technical design, development & testing of modules assigned.  Involved in web designing using HTML5, XHTML, CSS3, JavaScript, jQuery, AJAX and used Table-less Design in CSS for positioning.  Written code on Typescript and ES6 to implement Angular4 Components. Good amount of work done on Reactive forms in Angular4 and their Validations.  Created Angular 4 components, implemented interpolation, input variables, Bootstrapping, NgFor, Ngif, Router Outlet, binding the events, decorators. Worked with Bootstrap components of Angular-UI like carousel, collapse, dropdown, and tabs to develop dynamic responsive Web Application. Created a Simple REST application using Drop Wizard which pulls the data from Couch base in JSON format. Developed cross browser and multi browser compatible web pages. Used ESLint as JavaScript linting and style checking tool. Used browser Cookie, local storage and session storages to store and access the data right in the browser. Developed responsive single page web application using Angular4 and custom directives. Used UI Components like Date-picker, modals and related components of Angular material design. Using spring boot and Couch base starter for retrieving and storing data to couch base. Worked on prototypes for Responsive Web design.  Designed dynamic and browser compatible pages using HTML5, CSS3 Pre-processor’s (SASS/LESS), JavaScript, Bootstrap, JDK 1.8, Ajax, Web Services XML, schemas. Achieved Angular 4 Authentication for the application and stored generated token so that token can be sent with each request to secure resources in Web API. Worked on RESTFUL services and made AJAX calls to server end and passed HTTP requests. Worked on JavaScript and HTML5 Browser Cache mechanism for storing and retrieving data for the website. Used Gulp as the build task runner to build and package the application. Experience in working with Jenkins tool, as it is a build tool used for triggering builds to deploy in environments. Worked on creating responsive website for smart devices using Responsive Web design and media queries. Worked with making calls to APIs to fetch the data from the backend as JSON response and parse it on the UI for DOM/CSS manipulation. Designed and documented REST/HTTP APIs, including JSON data formats. Developed Web Services for data transfer from client to server and vice versa using Apache Axis, SOAP, WSDL, and UDDI. Coordinate with QA for testing, releases, Application deployment and integration. Implemented code coverage by writing Unit Test cases using Karma and Jasmine for Angular 4. Used GitHubUI, Git bash to commit, changes to the repository for maintaining various versions of the agile process. Ensured site design integrity and quality control consistency throughout the project’s lifecycle. Designed and development of many PL/SQL batches using JAVA with connectivity to Oracle for data maintenance and handling. Used CSS Blueprint to create grids and adopt cross browser interactive features. Implemented logging mechanism for complex strategy for security and reliability of application used LOG4j to audit, detect suspicious activity, regular debug, test perform and Exception statements. Involved in Agile process, attended daily standup meetings, backlogs, release planning. Debugged the application using Firebug to traverse the documents and manipulated the Nodes using DOM and DOM Functions using Firefox and IE Developer Toolbar for IE. Environment:HTML5, CSS3, jQuery, AJAX, SASS, JavaScript, TypeScript, Angular4, Node.js, RESTFUL services, Ext.js, Responsive Web Design, Jasmine, W3C, MVC, Dreamweaver, DOM, XML, SOA, PL/SQL, DHTML, Git. Client: American Institutes for Research, Washington, DC                                                        Duration: Jan 18 – Nov 18 Role: Sr. UI Developer Description: American Institutes for Research is an independent, not -for -profit organization that conducts behavioral and social science research and delivers technical assistance both domestically and internationally.  Responsibilities: Involved in Requirements and Analysis. Understanding the requirements of the client and the flow of the application as well as the application Framework. Involved in web designing using HTML5, CSS3, JavaScript and extensively used Table-less design in CSS for positioning and in designing Responsive Web pages using media queries and Twitter Bootstrap. Participated in day-to-day meeting, status meeting, strong reporting and effective communication with project manager and developers. Have used AJAX to retrieve data from server synchronously in the background without interfering with the display and existing page in an interactive way.  Created an internal browser-based text editor using HTML, CSS, JavaScript, backbone.js.   Used AngularJS UI-route to manage URL route.  Worked on Creating an AngularJS Application using MVC framework. Utilized AngularJS framework to bind AngularJS template (views) to JavaScript object (models). Created features like dropdown list, search function and card model by using AngularJS material. Used HTML5 and AngularJS to format the input forms and handled the input validations. Implemented ReactJS Controllers to maintain each view data. Maintaining Parent and child elements by using State and Props in ReactJS. Used multiple state managements such as Cache, Cookies, View State, Hidden Field, Query string, session to provide/keep information associated with the page. Responsible for React UI and architecture.  Built components library, including Tree, Slide-View, Table Grid. Worked on tools like Eclipse and GIT repositories and Installed and configured GIT and synced with multiple GIT-Hub repositories.  Used Bootstrap and AngularJS in effective web design. Designed and developed ReactJS component required for the project and Used Custom AngularJS Filters to provide better search experience. React Hot Loader is a plugin for Webpack that allows instant live refresh without losing state while editing React components.  Solid understanding of React Virtual Dom Algorithm, for React performance optimization  Implemented and design the application to interact with server for getting the Ajax response of jqGrid Data. Built real time mouse/click user analytics web services with Node JS. Ran Bower and grunt components and wrote the scripting using Node JS implemented a NodeJS server to manage authentication. Implemented modules into NodeJS to integrate with the design and requirements. Good experience in developing Ext.js applications with extensive server calls using AJAX and strong hold in handling the server data and exceptions to provide interactive user experience.  Created reusable components like Menu Navigation, Session Monitor which was very useful in the application using Ext.js. Used Ext.js with Web API retrieve data from database and Joi for validation. Extensive experience in developing web applications with User Experience Design (UX) like Visual Design, Interactive Design and extensive Human Computer Interaction Concepts. Used Wire Frame Tools like Adobe illustrator CS3 for basic Visual design and followed User Experience Design (UX) properties and used pair programming model for the development. Developed Web Services for data transfer from client to server and vice versa using Apache Axis, SOAP, WSDL, and UDDI. Version control through GIT. Followed Agile/Scrum methodology of software development thereby satisfying the customer through early and continuous delivery of valuable software. Good experience in unit testing by using Karma and Protractor. Having a decent work experience on Jasmine, YUI to test JavaScript code very quick. Knowledge in CSS preprocessors SASS and LESS and in executing test cases in DEV/QC/UAT environments. Experience in using tools like Jira, AccuRev, Site Refresh and multiple browser testing. Environment: HTML5, CSS3, JavaScript, jQuery, DHTML, MVC, DOM, JSON, Angular.js, Node.js, D3.js, Backbone.js, React.js, AJAX, SOAP, XML, XPATH, Adobe Flash, Jira, AccuRev, Karma, Protractor, Sinon, Stash, GWT. Client: Broadridge, Mt laurel, NJ\t\t\t\t\t\t\tDuration: Feb 17 – Dec 17  Role: UI Developer Description: Broadridge is a multinational banking company and financial services company headquartered in New   Jersey. It is universal bank with operations in retail wholesale and investment banking as well as wealth management. Responsibilities: Developed Responsive Html web pages using HTML5, CSS3, JavaScript, Type Script. Developed code for Responsive web design in TypeScript using framework like Angular 2. Developed customized Organizational Chart displaying in tree format using third-party jQuery library. Used Jasmine to perform unit testing of custom filters, custom directives and various parts of AngularJS application. Used Gulp, as web tool for task/build runner for development. Responsible for field validations using Angular JS and created custom components in Angular 2. Worked with Protractor testing framework for end to end testing of Angular application. Worked with Jasmine to write the unit tests and used Karma to run them. Worked with Single page applications to load the single HTML page and dynamically update the page whenever the user interacts with the application. Proficiency in developing dynamic web applications based on REST API’s, Responsive web design, Single page Architecture. Worked with Node. JS, NPM packages to run the Angular application. Worked on JavaScript tools like Grunt, Gulp, NPM and Bower. Worked on GitHub to maintain the repository. Worked with Angular 2.0 framework to run the Bootstrap method against Typescript files which are related to application module. Created rich and dynamic Angular 2.0 form using index, Ngif, NgHide, NgFor etc. Worked on creating Angular 2.0 based form and popups modal using Html, bootstrap and TypeScript. Used Node.JS to compile the code of JavaScript into the browser-based code. Coordination with team in the daily routine works as a part of agile methodology, which includes code reviewing, validations and demos. Used AJAX for server communication and seamless user experience. Responsible to assign stories to my track and get progress report from the team by using JIRA. Duties also include basic trouble shooting, attending to priority client calls, contacting client with ETA. Environment: Angular 2.0, Typescript, JavaScript, Karma, Jasmine, Protractor, Jenkins, Augury, Redux, SASS, bootstrap, HTML5, CSS3, NPM, Swagger, Single page application, Responsive web design, AJAX, GIT. Client: Sum Total Systems, India\t\t\t\t\t\t\tDuration: Oct 13 – Aug 16 Role: Web Developer Description: Sum Total Systems Inc. is a software company that provides human resource management software and services to private and public-sector organizations. This project was involved in system study, development and implementation of the project. Responsibilities: Involved in the requirement analysis and design phase to aid in all technical assessments Fixed the browser compatibility issues in IE, Firefox and Chrome browsers. Code on Cascading Style Sheet (CSS) in web pages to separate presentation from structure. Defined text alignment, size, borders and many other typographic characteristics. Used HTML, CSS and JavaScript to render the dynamic web pages (presentation layer) for the application. Used jQuery in controlling access to different pages of the applications. Developed jQuery custom widgets to make easy the enhancement of the web pages. Extensively used jQuery selectors in accessing various parts of the DOM. Used Ajax and jQuery to update the parts of the Policy review web pages.  Implemented JavaScript promises functions as an alternative for callbacks. Implemented and maintained AJAX based rich client for improved customer experience.  Worked on creating and consuming SOAP Web services for accessing data from other external services. Used jQuery event handling in UI pages handle validations.  Created jQuery custom widgets like date picker etc. and other custom widgets. Involved in code review and deployment of the application on development, testing of production servers Environment: Java, HTML, CSS, JavaScript, jQuery, SQL, Web services using REST and SOAP, JSON, AJAX."}