{"text": "Name: elizabeth elizabeth E-Mail: elizabeth.elizabeth@gmail.com Address: New York, United States Github: https://github.com/elizabeth LinkedIn: https://linkedin.com/elizabeth Phone No. 693738112585 __________________________________________________________________________________ PROFESSIONAL SUMMARY: Over 6+ years of experience in software development as a UI Developer and UI/UX Designer in various environments.  Experience in web development with a strong background working on open source technologies, including HTML/HTML5, CSS3 etc.  Experience in UX design with a strong background working in Wireframes (low fidelity and high fidelity) Prototypes, Mock-ups, Storyboard and User Flows.  Translate business requirements into wireframes, screen mock-up and prototype.  Experienced in breaking up layered PSD into HTML using CSS.  Experienced in designing, developing, delivering and implementing data-driven desktop and Web applications for clients and assisting in the development and maintenance of company Web applications (Internet and Intranet)  Strong problem solving ability and analytical skills and able to integrate quickly into team and work independently toward team goals.  Strong exposure to Adobe tools - Photoshop, Dreamweaver, Illustrator and Flash. Extensive experience in visualization, creating visual designs, Product Logos, developing high quality of work, maintaining team, and design reviews, handling whole project through its life cycle.  Strong experience in SEO (Search Engine Optimization) and Progressive Enhancement.  Exposure in Responsive Web Designing, Strong experience in Unit Testing, Integration Testing. Expertise in effective interactive design solutions that meet business, project, and design goals, based on standards and guidelines.  Skilled in conceptual development of Web-based Projects, including Project Strategy, Functionality, Information Architecture, Navigation Systems.  Extensive experience in attending client calls, Provide the estimate of effort required to complete a unit of design task to ensure the completion of job within given timeframe.  Worked with BA to develop and iterate design mock-ups, user stories and other design doc.  Handled multiple projects and had a review with whole project at the end of the course.  Very quick learner and keen to adopt new technologies. Strong team playing skills coupled with the ability to build excellent customer relations. Technical Skills: CLIENT: Fidelity Investments, Cary, NC                                                                        Oct'2014-to Present Role: UX Designer Project Description: Fidelity Investments manages a large family of mutual funds, provides fund distribution and investment advice services, as well as providing discount brokerage services, retirement services, wealth management, securities execution and clearance, life insurance and a number of other services. Roles and Responsibilities Established UX design as the first stage of all Web and mobile application developments, instituting a user-centered design (UCD) approach. Created concept models, heuristic reviews, sitemaps, process flows, sketches, wireframes, prototypes, and detailed specifications for mobile/tablet. Conducted stakeholder interviews and both remote & in-person user interviews and usability tests. Created click-throughs and prototypes for web and mobile/tablet for use during tests. Synthesized and compiled findings to inform UX strategy. Designing and developing dynamic web pages using HTML5, Bootstrap, LESS CSS. Performed all tasks from UI design and implementation to writing code for various features. Front-end validations are done using JavaScript. We have followed with Agile and Scrum development methodologies. Interacted with java controllers (jQuery, Ajax, and JSON to write/read data from back end systems). Designed mockups and wireframes using Balsamiq and Adobe Photoshop according to Fidelity standards. Environment: HTML, CSS, Agile methodology, Balsamiq mockups, Adobe Photoshop and Adobe Illustrator. CLIENT: Farmers Insurance, Los Angeles, CA                                                         Jun'2013-to Sep' 2014 Role:UX Designer Project Description:The Farmers Insurance Company which started off as a simple car insurance company for the farmers is now a multi-company insurer and financial services group with a solid reputation. It has approximately 50,000 sales agents in offices across the U.S. Roles and Responsibilities Designed and implemented the whole web site using HTML, CSS and JavaScript. Performed all tasks from UI design and implementation to writing code for various features Overhauled Farmer’s Web site to optimize the user experience. Newly launched site catapulted visit-to-lead and visit-to-order ratios, while shrinking page-abandonment rate by 17%. Involved in Design UI Screen, Created several mock up Using Microsoft visio, balsamiq and Adobe Photoshop. Created web page layouts using HTML/HTML5 and CSS/CSS3. We have followed with Agile and Scrum development methodologies Debug the application using Firebug to traverse the documents and manipulated the Nodes using DOM and DOM Functions using Firefox and IE Developer Tool bar for IE. Designed and developed various Web forms using HTML, CSS, and JavaScript. Participated in analyzing the requirements and depicted them through use cases and scenarios. Participated in unit testing, integration testing and installation of the system. Extensive experience using HandleBars and Moustache. Involved in Web design and development for the UI interface design, graphic design for printed materials and presentations, illustration, logo design. Used HTML, CSS, and JavaScript. Contributed in decision making of the software and hardware requirements and tool evaluations. Environment: HTML, CSS, JavaScript, JQuery, AJAX, Agile methodology, Angular JS framework,Eclipse, \tClient:Ariba (An SAP Company), Sunnyvale, CA                            May'2011-Apr’2013 Role:UX Designer Roles and Responsibilities Designed and implemented the whole web site using HTML, XML, CSS, Flash, PHP/MySQL and JavaScript. Performed all tasks from UI design and implementation to writing code for various features Designed high-impact, user-centered Web sites with strong emotional appeal, sophisticated production values and intuitive navigation to maximize user engagement and cement powerful brand identities. Involved in Design UI Screen, Created several mock up Using HTML, CSS and JavaScript. Front-end validations are done using JavaScript. Designed and implemented new module for Inventory division. Used UI Development using HTML, and coded Java components which Retrieves data using SQL from Oracle database. Designed and developed various Web forms using HTML, CSS, and JavaScript. Participated in analyzing the requirements and depicted them through use cases and scenarios. Participated in unit testing, integration testing and installation of the system. Involved in Web design and development for the UI interface design, graphic design for printed materials and presentations, illustration, logo design. Used HTML, CSS, and JavaScript. Contributed in decision making of the software and hardware requirements and tool evaluations. Environment: HTML, CSS, JavaScript, JQuery, AJAX, Usability Testing, Agile methodology, Eclipse. Client:ICICI Bank Ltd, INDIAMay'2009-Mar'2011 Role:Web/UI Developer Description: ICICI Bank is India’s second largest bank with total assets of about US $38.5 billion. It provides all kinds of finance needs from securities to auto finance, banking, corporate and retail. CMD Issue Collection Application was developed for Collection of Application money in respect of IPO/Bonds/Debt instruments by Capital Market Division (CMD) branch and other identified branches of ICICI Bank Ltd. The software application facilitated data entry for generating various Reports. Roles and Responsibilities Design the UI layer for the application used for Legacy Migration. Analyzed, Designed and developed the system to meet the requirements of users. Participated in daily pulse of the application to come up with UI and provide best possible recommendations for the application from UI standpoint. Developed screen functionality using HTML, CSS, JavaScript and JQUERY. Used AJAX for implementing part of the functionality for Customer Registration, View Customer information modules. Developed UI using JavaScript, HTML,CSS, JavaScript validations and XML. Implemented interaction between frontend and backend using the JSON object. Wrote Cross Browser code of CSS and JavaScript, Angular.jsfor Internet Explorer and Firefox. Written CSS to provide table free layout to user interface screen."}