{"text": "Name: louise louise E-Mail: louise.louise@gmail.com Address: Shangrao, China Github: https://github.com/louise LinkedIn: https://linkedin.com/louise Phone No. 463336402334 Highlights MS in Computer Science, University of Texas at Dallas, 10+ years of experience in web technology, mobile application, and database programming, award winning performance, MVC, AngularJS, ASP.NET, WCF, PHP EDUCATION MS in Computer Science\t\t\t     The University of Texas at Dallas, TX, US\t              May 2015 Master of Computer Applications\t\t     West Bengal University Of Technology, India \tApril 2007 Bachelor of Computer Applications\t    \t     West Bengal University Of Technology, India\tApril 2004 TECHNICAL SKILLS Programming Languages:\tASP.NET, VB.NET, C#, WCF, LINQ, PHP Web Technologies:\t\tAngularJS, Apache Cordova, HTML, CSS, jQuery, jQuery Mobile, AJAX, XML Database Technologies:\t\tMS SQL, MySQL  WORK EXPERIENCE JSOM Web Services at The University of Texas at Dallas\tWeb Developer                  (Oct 2017 – Present) Collecting analyzing and documenting requirements from all the departments and academic areas for new web and mobile applications and suggested best possible solutions.  Designed and developed web-based applications using HTML, CSS, Bootstrap, jQuery, PHP, MySQL for automating various processes (name few specific) for the management school.  Premier Designs\t\t\t\t\t\tSoftware Developer             (Jul 2015 – Sep 2017) Developed web application to automate order and billing process for their retail business using MVC, ASP.NET, C#, Entity framework, LINQ, AngularJS, jQuery, Bootstrap and Telerik web controls. Created Web API, WCF services for data exchange between clients and server. Created Store Procedures, Functions, Triggers, and Views using T-SQL in Development environment for SQL Server 2012. Used Team Foundation Server (TFS) for version control. Implemented SOLID design pattern, Dependency injection, Unit Testing.   Information Processing Corporation\t\t\t\tProgrammer Intern             (Jun 2014 – Dec 2014) Developed application for Mobile and Tablets for an equipment rental and maintenance service customer using Apache Cordova, HTML, CSS and jQuery. Created Store Procedures, Functions, Triggers, and Views using T-SQL in Development environment for SQL Server 2008. Used Visual Source Safe for version control. Information Technology Consultants\t\t\tProgrammer & Analyst        (Nov 2009 – Jul 2013) Developed web-based application for after school childcare management and federal grant reporting program. Used responsive technologies (ASP.NET MVC framework, Bootstrap, Telerik controls) to provide seamless interfaces in desktop, tablet or mobile interfaces. Developed store procedure & function in Microsoft SQL Server. Used SQL Reporting services & Crystal Developed modules in C# import files from CSV files. Used SVN for version control. Received Star Employee of the year award for mobile application development. Zensar Technologies Ltd\t\t\t\t\tSr. Software Engineer\t         (Jan 2007 – Oct 2009) Developed web application for Zensar’s internal quality team to track the project risks and automate Zensar’s quality management process. Developed Employee Performance Management tool for Zensar’s internal use. Was responsible for scoping, developing and deploying the application. Technology used PHP, MySQL, HTML, CSS, JavaScript, Ajax. Used Visual Source Safe for version control. Received SPOT award for extraordinary performance at Zensar Technologies LTD and promoted to Senior Software Engineer (within 6 month) on a fast track.   RELEVANT COURSEWORK Design and Analysis of Computer Algorithms, Big Data, Database Design, Web Programming Languages, Object Oriented Analysis and Design, Software Testing, Validation and Verification, Statistics, Machine Learning RECOMMENDATION Available upon request."}