{"text": "Name: elizabeth elizabeth E-Mail: elizabeth.elizabeth@gmail.com Address: Huai’an, China Github: https://github.com/elizabeth LinkedIn: https://linkedin.com/elizabeth Phone No. 291409159814 SUMMARY 8 years of experience as middleware Administrator in IBM WebSphere Application Server and IBM WebSphere Portal Server. Extensive and diverse experience in installation, support, configuration and administration of Weblogic, Jboss and Apache tomcat Application Servers. Experience in configuring IHS Web Server V6.0/7.x/8.x. Expertise in WebSphere cluster management including horizontal and vertical scaling and creation of nodes. Expertise in deployment of portal resources such as portlets and portlet applications, pages/labels, access permissions for authorization, credential vaults, Url Mappings using Portal Admin GUI and XMLAccess. Experience in configuring SSL security for the HTTP servers and the plugin. Expertise in Deployment of enterprise applications and administration of resources in all the environments including development, Integration, QA, DR and Production Experience in setting up WebSphere resources, Virtual Hosts, JVM parameters, variables, shared libraries etc. Involved in tuning, security, backup, recovery and upgrades of WAS on IBM AIX, Linux (RedHat&SuSE) and windows. Experience in providing 24/7 on call production support for the production systems. Used Tivoli Performance Viewer (TPV) and Wily Introscope to identify performance bottlenecks including application memory leaks, server process degradation, database connections, http threads, etc. Expertise in installation and configuration of IBM WebSphere MQ 5.3/6.0/7.0. Experienced in tuning of application servers by Tivoli Performance Viewer like monitoring the dynamic cache size and JVM heap size using collected Performance Monitoring Infrastructure (PMI) data.  Strong experience in securing applications by installing SSL (Secure Socket Layers) using ikey man and key tool, LDAP, (Lightweight Directory Access Protocol) which does encryption of data and Web Sphere plug-in configuration. Expertise in Performance Monitoring for HP BAC, Diagnostics, Site scope, Open View, SAP Sol man. Extensive Knowledge in HP Diagnostics Profiler, Willy Intra scope.  Experience creating Problem Management Record (PMR) with IBM, updating and fixing the unresolved issues. Expertise in installing and configuring IBM WebSphere portal server (WPS) 6.1/6.1.5/7.0. Experienced in analyzing Java cores, Heap dumps and Memory Leak. Expertise in migration of configuration settings and applications from WAS v5.1/6.0 to v6.1, v7.0,v8.0 and v8.5 using both command line tools and using the GUI migration wizard provided with the WebSphere.  Experience in working with automated application deployment, startup, shutdown and enhancements using JACL/ Jython scripts.  Experience in configuring JMS resources with Queue Connections Factories, Queue Cengage, Inc, Boston, MA\t\t\t\t\t\t\tMay’14 - Present Sr. Middleware Consultant, duration Independent Health, Buffalo, NY\t\t\t\t\tMar’12 – May’14 Sr. Middleware Consultant, duration First Republic Bank, San Francisco, CA  \t\t\t\t\tJan’10 – Feb’12 Sr. Middleware Consultant, duration Progressive Insurance, Colorado Springs, CO, \t\t\tFeb’08 – Dec’09\t Sr. Middleware Consultant, duration Education Master of Science Bachelor of Science,\tUniversity of Calcutta."}